{
  "id": "12831013",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nI'm Brad Roth, episode 1.\nTommy Mancuso of the Bad Investment Company.\nYes, you've heard that correctly.\nHe runs the ETF with Ticker BAD, Betting, Alcohol, and Drugs.\nTommy and I have a great conversation.\nWe talked for about 40 minutes about his company.\nHow we got it started, how he thinks about marketing.\nWe talked about the ETF in depth in the ETF strategy.\nAnd so I really think you are going to enjoy this conversation with Tommy.\nCEO of the Bad Investment Company.\nHey, Tommy, welcome to the show.\nThanks for joining me here on Behind the Ticker.\nHey, Brad.\nThanks. I appreciate you having me on here. I'm looking forward to the conversation.\nWell, you're actually going to, you're the inaugural episode.\nSo the first episode out, and you are, you're fortunate enough, I guess, to be first.\nThere we go.\nHey, we won't wonder any other ways, especially with the bad mentality here.\nI know I'm super excited for this conversation.\nI think when we first talked, I was really excited to hear about your story, your background,\nand kind of how you came up with the idea.\nSo why don't we do that, Tommy?\nWhy don't you tell me about your background and how you got into this position that you're in today?\nYeah, absolutely.\nSo I guess we'll start from the beginning, which was in college.\nI started working at a mutual fund shop out in San Diego, and then progressed and got\non my securities license, started working at a Merrill Lynch on the wealth management side, realized\nthe wire house world was maybe not necessarily for me.\nSo I joined a firm, private capital investment advisors in about 2016.\nAnd, you know, me, I've got, I'm a little bit younger for to be an advisor in that world.\nYou know, I'm 31 right now, so I started doing this when I was 22.\nBut it allowed me to kind of think differently when we look at the advisor world\nand see this whole world of technology and innovation, right?\nAnd I'm out trying to get friends, do investment and personal account and have me manage it.\nBut I'll just go on my Robinhood account.\nI'll go on my Schwab, you know, I'll kind of put it in some default factors.\nKind of skip that.\nNow, there's a big red flag that happens, right?\nPeople can't do everything on their own.\nA lot of people work in different industries.\nAs you and I both know, you got to live and breathe the financial world.\nSo, let's fast forward to 2020, pandemic hits.\nYou know, a lot of stocks, crazy things are happening in that world.\nWe saw the evolution of the meme stocks kind of happen.\nAnd I started thinking I go, wow, people are definitely going to struggle a little bit here.\nThey're going to get beat at some point as fun and exciting as it is.\nYou know, this isn't good for the long run.\nOn top of that, right?\nWe also had this world of ESG kind of colliding with us to some extent.\nSo, I kind of thought for, you know, how can I make an investment product that is unique?\nIt's going to appeal, it's going to hopefully protect investors or at least have a,\nI'd say, a long term sustainable investment outlook or sustainable growth.\nAnd so, I kind of came up with the acronym originally bad, BAD and I rattled off betting,\nalcohol and drugs. And I go, okay, there is, there's something here, actually.\nI go, so I went on to morning started Bloomberg and I kind of made a quick sample portfolio,\nback tested it a little bit. And I go, wow, this actually isn't that bad.\nNo pun intended. So, then I went down the rabbit hole, right?\nI would thought, okay, this has brand appeal, right?\nThere is a counterculture and people have been putting pushed in this ESG box.\nThey're getting beat up by mean stocks. I go, I want to create a fun product that may sound\ngimmicky, but actually has true value in there. So, you know, let's fast forward, went down,\nyou know, the rabbit hole talked to a lot of service providers, spoke to a lot of investors,\nsaid, do you see a spot for this, you know, with this succeeded, it got really good feedback,\nyou know, not too many people, you know, turned it down, you know, they said, yeah, you know,\nbut you're going to cut off half of the population, I go, that's right. We're not for everyone,\nand we intend to keep it that way. So, you know, kind of got it all launched,\nto a lot of hard work I would say in the early innings, and we got our initial launch in December\n2021. What a time to launch, yeah. You know, we're happy to be behind you. So, you know,\nwhat happened there was just a slow, you know, kind of slowly, leave here, but that's when also\nI think a lot of retail investors, some extent, got exposed in their portfolio. And, you know,\nas bad was down last year, but we did, you know, at least beat the S&P 500, by a couple of percentage,\nand destroyed the NASDAQ, right? So, those are decent benchmarks to, you know, have something\nin a challenging year, have a little bit of success there. So, right now, you know, we're in\nstarted year one, beginning of 2023 still, you know, a lot of headwinds in here, you know,\nthe betting alcohol and drug ETF is essentially made up of, you know, your largest gaming and\ncasino stocks, your largest alcohol companies, you know, every, you're drinking some booze at a baseball\ngame. It's probably in our portfolio. And then the drug side, which is interesting, is actually\nbiotech pharmaceuticals and a little bit of cannabis. So, you know, that's just a little bit\nof a different portfolio we like to think. It's got a lot of different, I'd say,\nfeatures to it where, you know, it's a value play, right? People shine away from some of the gambling\nalcohol and cannabis side. There's a growth play in there with legalization and expansion across\na lot of those industries, and then, you know, defensive as well, right? A lot of these things\nare consumer staples by nature. So, right now, you know, we're in the early innings,\nthe Washington's Fund, we hope to, you know, continue to grow assets, but that is the cliff note\nversion I'd say of how we got to where we're at. Yeah, and you answered, you answered a lot of\nmy questions, Aaron, it's funny, you and I have a similar path, I actually, I started my career\nin family office, and then I went to Merrill. And I said, okay, I'm saying, I was like this,\nno offense to anybody listening from Merrill Lynch, but it was just wasn't, it just wasn't\nfor me, and I went into pennant as fast as possible and got here. So, I can definitely, you know,\nassimilate with your story and your path. So, what do you like to do outside of the office? Like,\nwhat is Tommy doing when he's not, you know, investing in alcohol and drugs? You know,\nI'm doing a lot of market research. No, I'm kidding. A lot of times, I'm a very social guy as you\nprobably imagine, right, to kind of have the fullness of this. So, big concert guy, big, big sports\nguy, you know, hometowns Kansas City was, had the, had the opportunity to go to the Super Bowl,\nso I'm sorry to anyone from Philly on that one. But yeah, you know, I like to, I kind of have a\nwork hard and you know, honestly play hard to mentality at the end of the day, but obviously,\nthere's a fine line of professionalism in, you know, being too much of a screwball by the name.\nThat's awesome. Yeah, I, you guys have had some, some walking, some good years here for Kansas City.\nSo, I, I don't think, I don't think too many bad years are coming, and as long as you have\nPatrick Momves. I agree. I agree. Maybe we can keep his brother out of the news. Yeah, probably a good\nidea or a TikTok. Yeah. So, you kind of answered, like, I really want to know what made you\nstart the bad company. You hit that perfectly and, you know, we'll talk a little bit about the\nESG and anti ESG kind of landscape. But does the firm, does your firm do anything other than,\nyou know, manages single issue ETF at this time? Yeah. Right now, we obviously do have some growth plans\nout there. You know, right now, bad is our Markier staple ETF. We're bouncing around a couple of\ndifferent ideas right now. Not all of them are necessarily in the bad category. But what we do\nlike to focus on is, you know, hard assets, core businesses that have cash flow, things that\nare going to be around the next 100 years, just like betting alcohol and drugs have been around\nthe past, how you could go back to the Roman Empire when people were partaking in a lot of these\nthings. So, we like to focus on things that have cash flow people are going to utilize. There's a\nplace in this world for, you know, a lot of companies, you know, why'd say, have come up and go away,\nright? We've seen, you know, companies tech companies spark up and disappear, right? Because they\nlose that bad or the new technology comes up. So, when we think about sustainability, you know,\nI'm thinking, what are people going to need 20 years from now? Five years from now, 100 years from\nhow are they going to entertain themselves? How are they going to get, you know, next door, right?\nSo, it's just some of those ideas I think are where we want to focus on and, you know, ultimately,\nyou know, I think that where we want to be is kind of the go to safe, defensive type of portfolio,\nbut also bring a little bit of excitement in there and creativity. Well, you're going to have\na, you're going to have a hard time picking the next ticker after, you know, having maybe one of\nif not the best ticker on the street at the point. So, you're going to have to put a lot of thought\ninto that. All right. I am shocked that it was available when, when we went to submit that\ngo, no one took that. I think it's like bad boy motors. I was like, you know, the bad, whatever,\nmaybe, because it's got appeal to it, right? The name sticks out. It jumps at you. You obviously\nwant to know what the hell is that right away. So, it's definitely a great ticker. And we\nreserved a couple of other ones that we haven't mind here. So, we'll see what happens. Yeah.\nI'm going to make sure we can get away with them. So, it will begin. That's great. I should start,\nI should get my, at any future plans. I have, I should get out there and start reserving tickers. Like,\nyou know, people did back in the, you know, early 2000s with buying domain names and then flipping\non my, you know, the reserve. Yeah. It's, it's real bizarre. Actually, I thought that too. You can't\nactually sell a ticker. Oh, you don't even know. No, no. It's bizarre. I thought you could, too,\nyou know, but you've got to, you've got to have some kind of deal because I did ask that. Yeah,\ntrue entrepreneur taught me. That's exactly how we think is, can I make a business out of,\nout of buying tickers? Yes. Yeah. So, you touched on it a little bit. Let's dive a little bit\ndeeper into the investment strategy at bad. Get it from a high level. So, how are you screening?\nHow are you running kind of the portfolio in terms of waiting? Let's talk about the\nbalance structure. Like, let's really dive into the underlying strategy. Yeah. So, we'll start off\nat the bad in category to be in bad. So, it's primarily, we built an index, essentially,\nwith the good partner of ours, the human indexes. And it was kind of based off of that sample\nportfolio that originally created. And where we focused on what's going to give us the biggest\nand best companies in that area. So, it's primarily based off of market cap. Now,\nI wouldn't say we have discretion, but if a certain company and certain things don't seem right,\nwe do have a flexibility to kind of remove them, make a couple of minor adjustments. So,\nmarket cap's going to be above at least $1 billion. You know, they got to have a certain PE,\nand all the stuff of that nature on the on the gaming side. So, again, betting is going to be\nyour win, mgm, draft kinks, pen gaming. A lot of those names you see on the side of buildings in\nLas Vegas, and on your mobile devices, if you're a game one a little bit on the side. The alcohol.\nSo, that is going to be, you know, your Diagios, your Inbev constellation. Again, those big names\nthat you're seeing at every ballpark and concert venue that you potentially go to. And then,\nagain, and I'll kind of talk about here the allocation of everything. The drugs is going to be,\nyou know, pharmaceuticals and biotechs, and those are going to be your modernus, your J&Js,\nyour Pfizer's, let us, Eli Lilly, who's been on hell over run here lately. And then, you know,\nthe cannabis side just got three holdings in there right now. And that is, again, you know,\nyour canopy, tail-ray, all Canadian base that trade as 80 yards in the exchange. So, the breakdown\nof that, though, is a 33.3% waiting in each of the betting alcohol and drugs. Now, the one caveat\nis that the alcohol side of things is only 23.3, because we peeled back the 10% and gave that\nallocation to cannabis. Okay. And that's because when we evaluate the portfolio there and look\nsome of the positions, there's not that many great alcohol companies, right? There's about 10\nthat everyone knows of on that side of things. On the flip side, there's a lot of great pharmaceutical\nand biotech companies, which we didn't want to pull back from those or take away. So, that essentially\ncreated, you know, 33.3 in betting, 23.3% in alcohol, 33.3% in pharmaceuticals and biotechs,\nand then 10% in cannabis. Got it. So, the way it works, then, is we have a quarterly rebound,\nwe're not trying to get too cute. We think investors get very cute when they try and get too\ncreative or they try and chase, you know, companies or anything like that. So, we have a quarterly\nrebounds where we evaluate the market caps to just a deep dive, see, kind of, let the outlook\nof them all are, and then we make a couple of replacements. So, there's not 54 positions in it right now.\nThat's fluctuated. We've been as high as 57. We've been as low as maybe 52 or so and are,\nyou know, in the first 56 quarters that we've been running this and, you know, you may be see\nof a change of one or two funds or companies in there on a stand regular index rebounds that we have.\nGot it. So, if I, if I'm understanding, in those, in those buckets, right, let's just take\nbetting gets 33% allocation. So, are you, your market cap waiting within that 33% is that how you're\nbuilding and designing the index? Yeah. Yeah. Yeah. So, you know, if there's 10 companies or so\nin their 3.3% in the betting, in each one of those companies. Okay. So, you're going to equal weight\ninside. Yeah. So, you're running inside of each sleeve, whether it be betting alcohol drug or\ncannabis, each one of those companies are then running equal weight. Yeah. Okay. Correct.\nMakes a ton of sense. Makes a ton of sense. And so, when you were designing this index,\nit sounds like it from the beginning of our conversation. It sounded to me as if you had the idea for\nthe ETF before you actually ran the index. And so, when you ran the index, you were trying to build,\ncan we call it anti-ESG? Is that fair? It is fair. It is by the roots of the idea. Now,\nI'm not going to say we're anti-We hate ESG by any means. There's a place for it. But at the end of\nwe don't think social stigma should be a factor when it comes to investing. At the end of\nthe day, we are investing to make money. And I think some people when they put these ESG scores\nare misleading investors to some extent. Right? They maybe if people are trying to go green,\nwhich is perfectly fine, I think people should focus on that. But when you're trying to green\nwash some stuff, when you're trying to manipulate the scoring criteria so you can attract a certain\nside and kind of put a little bit of a mask on, that's the issue I see with ESG. It's the lack\nof transparency to some extent. And I think ESG had its, ESG had its run. I believe in 2021 and\neven in 2000, I believe in 2020, like the latter part of 2020, like it was consistently outperforming\nS&P. And it was really to me, and again, it seemed like the flows were coming just because\npeople wanted to do the right thing. And they did get a lot of flows. And I think some of\nthose biases or things that you had mentioned, people were starting to look into a little bit\nand you're starting to see some outflows in the year. Exactly. Yeah. You know, in a lot of that\noutperformance was because ESG, a lot of the social and governance stuff is in the tech world.\nWe know what happened in 2020, right? Tech boom, right? As you know, that was the first round of\ncutoffs where people that had some of those. I will say the woke department, you know, let's just\ncall it what it was. But again, I'm all, I'm all good with that. And, you know, the prior years\nbefore that, they did struggle and underperform major indexes. And then you see all these companies\nstarting to pop up and they're right. You see exons popping up and showing in their right. And\nif people really knew what behind the curtain, what they're investing in, right, where they're like,\nI don't want to invest in gas, oil and gas. But I like this ESG fun. Well, look at the whole things\nbecause there is oil and gas in there because, okay, there may be not from the environmental side\nchecking the box, but on the social and governance side, they are checking the box there. So that's\nagain, manipulate the system, the stomach stuff. So when I think about a side from it having kind of an\nanti-ESG undertone, it seems as though this portfolio is building more of a recession proof type\nportfolio and could be valuable for an investor to, you know, have in their portfolio. Currently,\nit times like this, right. And just as, I don't want to call it a hedge, it's not a hedge, but\nto be able to have that kind of anti-recessionary basket inside of their portfolio. Yeah, 100%. Right.\nAt the end of the day, people are going to gamble, right, in some cases in recessions more.\nWhether that's good for them or bad, I hope they win. Right. Oftentimes we don't.\nYes, I know that too well. On the alcohol side, people are going to continue to drink, right?\nYou know, that's, that's been a standard situation in case, again, sometimes in recessions,\nmore often than not, they do. Yep. You know, some of the disruptions we've had since we launched,\nright, there's a couple supply chain issues, but, you know, we've seen a couple of earnings here lately\nin alcohol companies, and they're starting to get that figured out. And a lot of these smaller\ncompanies that they lost a lot of market share to, they're being able to acquire them at a discounted\nprice because these micro breweries or micro, uh, ready to drinks don't have the scalability to\nwithstand this type of environment. So again, that's in a benefit, the bigger players, which is why\nwe wanted to focus on that. And in, you know, the case of drugs, again, people are going to\ncontinue to get sick in some cases. Again, more often and during top periods of financial stress.\nSo it is a little bit, you know, nothing is recession-proof, but we do have some recession-resistant\ncharacteristics in the portfolio. And, you know, as much as we've seen tech kind of run up here\nin the first half of the year, entering a recession, we think we will, uh, you know, have a little\nbit of a catch-up here. You know, we've lagged early off, started this year because primarily\ndo do biotech and cannabis has been brought down drastically with a lot of the mid-regional\nbanks, right? Because they can't bank with the big boys or anything like that. So that's impacted\nthem pretty drastically. And, you know, again, we think they're going to be around and, uh, you know,\ncontinue to, they'll, they'll will be a turnaround. So it's a little bit of a hedge, right? We're kind of\nhedging both sides at pointy because we do want to give investors growth. Yeah. And then I think\napart about that is our growth is due to legalization, not innovation, which can take time, right?\nLook at the gambling space where we're seeing, you know, there's a 26 states now where there's\nsome form of gambling, I believe legal, and then cannabis, falling a similar path there, going\nthrough growing pains, it's perfectly fine. But in the long run, right, these are things that\nare going to benefit these industries for the years to come, and it's only going to get them\nbetter to get better, right? They're, they're, they're just market spaces growing. And that's the\nareas we want to be. Yeah. Super interesting. Um, yeah, I can see this being, I want to ask you this\nlater, but really as, as a place, as a placeholder in Portfolio, almost peeling from, would you\npeeling from kind of maybe large cap value exposure if someone's kind of sitting in large\ncap that's kind of fit that tilt? Definitely. I would say large cap value is definitely one of\nour where we would fit in in Portfolio at the end of the day, right? You know, I went say we would,\nyou know, we do have some growth characteristics, I think, too, which makes us a little bit unique.\nBut yeah, large cap value is essentially our portfolio, right? Yeah. So let's talk about\nthe mechanics of getting bad to market, right? How long did it take you start to finish to\nget, to get listed and have your, you know, your first trade? Yeah. You know, the idea came,\nI would say the idea, as I kind of mentioned earlier, started a little bit before 2020 when I saw\nthe ESG stuff. I don't think. And then when I saw this craze of investing world and the power of the\nretail investor, that's when I went down the rabbit hole of how can I launch any, you know, a fun\nwith that has this, you know, I actually went to my wealth management firm and asked them,\nI go, okay, do we, I know we have some ESG portfolios, I go, but how many people are utilizing those\nat this time? I'll just say it wasn't very many. I go, we should do the opposite. Yeah. And\nand you know, that was, that was great, but they're like, hey, we like your, your creativity,\nbut there's some reputation risk, right? Not everyone is thinking like you, not everyone's\nthinking like your clients either. So, yeah, that's okay, great idea, but, you know,\nlook somewhere else. So, I go, okay, how can you launch this? As I can be usual fun with that be\nan idea to do it. And then, you know, as I got, no one's really using mutual funds,\nETFs have taken over. So, I put out some feelers to some people, you know, white,\nwhat do they call? White label ETF company. Yep. There was a guy out in San Diego,\nbut I met with who'd been in this space for a while. I kind of ran him through the idea,\nand he kind of gave me a playbook. And his name's Ryan, Ryan, I don't give this whole name.\nAnd he and him still keep in touch. And he goes, this, this who you should talk to, this who you should\ntalk to. And I kind of bootstrapped that approach and kept going down that rabbit hole, you know,\ntalk to a couple different white label ETF providers. Talk to a couple different broker-dealer\nproviders that kind of play in that space. Talk to our index. How do I create this index so we can\nuse some of the back testing and back dating so that we were not trying to reinvent the wheel.\nSo we're kind of following a rules-based approach, which I think the long run is the better strategy.\nAnd so, then it came down to, okay, I've got this built. How do I raise the assets for it?\nI would say I put in a large chunk of my, my net worth in this steel as well. And then I found about\nfour or five different partners at, like the idea, where able to kind of give me some ports\nfor strategic in terms of making, being able to make introductions, things of that nature.\nSo that would have been all through 2020 when I kind of had the concepts, tried to do some,\nyou know, capital raise 2021. I would say it was when, okay, this is becoming real.\nSo then, you know, we work with US Bank and there's a lift series trust. So we had to get\nboard approval. So that to, you know, three, four, that took about six months to get where we\nwanted to be to have everything in line. You know, where you're shooting for, I'd say a little bit\nmore of a summer launch. I thought being around the fourth of July would be kind of entertaining.\nBut there's a lot of moving pieces, right? Nothing goes as smooth as you thought would think. So\ndelayed it a little bit. We wanted to get out before 2022. And we thought we were in a good position,\ngot board approval from US Bank, had, you know, our seed investors kind of ready to roll\nwhen we hit the market and got the fund launched on December 22nd right before Christmas. It was a\nbad Santa. Yeah, that's all. And that was good. You know, the couple of the challenges, you know,\nwith, I pushed the envelope with marketing to some extent. And, you know, that's one of those\nunforeseen things I didn't anticipate, right? Because let's just say regulators don't like sarcasm\nand or some alternative marketing strategies. But I mean, which is fine. I totally respect that.\nYou live and learn on those. And, you know, as funny they would always be like,\ntell you, you can't do that. They're going to tell you, no, I was like, okay, I get it.\nThat was going to be one of my questions is, you know, not only did you have to get through your\nyour compliance department to tell you, okay, you can do this, which is a challenge enough. Now,\nyou have, you know, out you have a board on a, on a, on a, on a trusted, a, a trust you don't\nown that, so you don't have too much control of the boards. So, you know, and then you have to\ndeal with the distributor. So, I'm sure you have, how many submissions you have to put an\nad in before they approve it? I guess is the question. I've learned now where I can definitely\nget it without any kind of correction. Yeah. Well, there, I would say the biggest one that we\nkept going back was, man, I'm going to be surprised if it was around 10 or 15. So, you know, I, I,\nI somehow got this, people are looking this, this dare thing passed with this bad and\nthere investment betting, investing and betting alcohol and drugs. That's right. The, the\ninvesting is important. People won't, you know, people don't realize that. So, yeah. But we haven't\nhad too much, too many issues with distribution because we, I mean, our messaging is, is different.\nBut I, that to me was one of the biggest surprises of launch was how high, I knew it was going\nto be scrutinized, but really highly scrutinized. I mean, in, down to, like, font size. And I think a lot\nof people don't realize that. Yeah, crazy, right? They're like, okay, well, that's that size.\nI go, you want the disclosure to be as big as that. I go, that's going to take a path to cage.\nYou know, we're just going to need a bigger page, I suppose. So, staying kind of on track of how we\ngot, how you got to market. So, you launched a member, you decided to launch on the NYSE.\nYou have other, you have other options, you have other alternatives. So, it kind of what drove\nthat decision when you were picking exchange? Yeah, I would say the people at the NYSE.\nI've got great relationships with them whenever I'm in town and I give my main contact over there,\nI have a him a call. And we, they're just realistic and they support the grant, the grant.\nYou know, on that side, too, the pricing is fair, as well. And that's obviously a factor. And I think\na lot of the support that they're able to offer you is, I'm not going to say superior to the\nNASDAQ, but I like just their overall brand a little bit more. Not to say whenever do business with\nthe NASDAQ by any means, you know, I'm sure there are quality people as well, but I do really respect\npeople at the NYSE. That was one thing that surprised me when, actually, when we launched with the NYSE\nis, I went in there like nervous, almost like I don't belong at the NYSE, the NYSE,\nthey ended up being like the nicest, most down to earth, fun people on the planet and that was a\npleasant surprise. So, I agree. I need them to give me the opportunity to ring that bell and I want to\nbring it. It would be a party. I was going to say the party after that might be, can I come to that,\nby the way, I would love to come to the party. Yeah, I would love to come to the party. Yeah, I would love to\nhear that. So, you're, you're not on your own trust, you're on UBS's trust. I'm sorry, U.S. Bank,\nI'm sorry, U.S. Bank's trust. So, when deciding whether you wanted to launch your own trust or\njoin somebody else's, like, did you, was that in your decision making process, did you go back and\nforth on that? Yeah, absolutely. It became, I think it ultimately came down to scalability, right,\nwith you working with U.S. Bank. There's a lot of things that go on behind the scenes in terms\nof accounting and filings and all the metrics that make an ETF work, the emails and the paper\nnotifications that investors receive. You know, that was, I needed to offload that work because at\nthe end of the day, I want to focus on distribution. Not to say, I still spend my opinion too much\ntime on some of that stuff, but it's a part of the job. And so, yeah, going through the U.S.\nseries trust, it also allowed us to kind of leverage some of the relationships that they currently\nhad, like, authorize participants and the lead market makers, right, it gave us some credibility\nat the end of the day because, okay, we were able to pass the gauntlet of U.S. Bank's board and\neverything like that. So, yeah, you guys are, are able to now, you know, here's an introduction to\nthis team. They would be a good fit for you. They're okay with the bad mentality. And in fact,\nthey embrace it. So, you know, it's, it came down to scalability and being able to kind of plug\nand play into their already fine-tuned processes, I would say. Yeah, so, now that you mentioned it,\nwho are you using for, as your LOM, your lead market maker is GTS? They're great too. We use them as\nwell, so. Yes. I couldn't have a better relationship with the contact over there, great guy.\nYeah. And you enjoy talking about that too. So, are you, and before I lead in the next question,\nis it just you or are you a one-man show behind the CDF or do you have a team? Mostly,\nhave some team members as well that assist with a couple of things behind the scenes, but yes,\nI am basically one-man show. I would love help. There you went out there. So, good to get a little\nbad. Well, we'll figure a way to get you compensated as we grow, but yeah, we would love a little bit\nof help for me to offload stuff. So, I can kind of get the creative marketing ideas flow and then\nfocus on distribution, which is ultimately important. Well, perfect. That was my next question.\nThat's a heavy lift by yourself. So, congratulations. I know, you know, I have, I have some\nhelp, which it makes things a little bit easier, but it doesn't matter. It's still a heavy lift. So,\nhow are you approaching distribution? Is it purely just kind of social marketing or what's\nthe idea behind distribution? Yeah. So, we did focus on, you know, I think timing is everything.\nWhen we first launched, we were like, oh, wow, we're going to capture a lot of this retail crowd.\nWell, you know, it happened in 2022. And unfortunately, retail investors,\nfirst ones get out, last ones to come back in. So, you know, we tried that social media digital marketing\nis pretty expensive. It becomes expensive. And it's hard to really capture your, I would say,\nit's hard to capture your leads and how successful some of those digital advertisement campaigns\nare because as you and I both know, I don't know who bought the ticker bad. I can't track that.\nThis person, you know, went onto our website saw and then went and bought it, right? We're not\nlinked. No one's linked up like that. And then, you know, kind of pivoting as like, how do we get to\nour break even, you know, where we get to that level? I would say in the fall, kind of pivoted to\nthe immor institutional advisor approach and getting our story out there. And I realize that we\ndon't have the track record yet still to necessarily be given a shot in an acid allocation model.\nBut I want to get our story out there and at least advisors will be able to explain that to someone\nelse and their investors. And I always tell them, I know we need a little bit of a track record,\nyou know, where one year is coming up, we're having decent performance right now. But to keep\nan eye on us, I'm sure you have some investors that this appeals to. And so, you know, whether it's\naround $10, $25, $30,000 on it, just put us on our radar, you know, have this story, right?\nStory sell, you know, working with a lot of advisors at a prime capital and whatnot. I give them,\nyou know, here that people like this, you know, we're in the Midwest, you know, we're a little bit\nmore, I would say, of a red state fund to say the least, you know, so we've got to embrace that.\nSo, focus on some of those areas, I would say to, and trying to get out there. So, you know,\nright now, I'm doing a lot of just bootstrapped approach, cold calling advisors, messaging them\non LinkedIn, just trying to get our name out there in any capacity. You know, you never know what's\ngoing to work, but it's rewarding when all of a sudden you see a big volume day come in periodically,\nbecause it came from somewhere, right? And it's getting the name out there.\nYeah, I, well, I have an advisor I talked to last week in Vegas, who I actually told him about\nyour fund and he, he was on the website. So, maybe he'll throw you some some volume here next\ncouple of weeks. Yeah, I sure hope so. So, is you kind of touched on it there a little bit as far\nas marketing goes. What do you think is working? What do you think is not working? Like, how are you\nplaying with that right now? Yeah, I would say it is passive marketing is not effective. It is\nhaving conversations is effective. Giving them a story of why they should invest, right? You know,\non the flip side, no one, there's not too many asset managers that have us. Well, why not be the\nfirst, right? If, if you believe in embedding alcohol and drugs as as as as investment solutions\nfor your appliance, why not be ahead of there until you wait for someone else to jump in there?\nSo, I think giving people a story and, you know, having been candid with it. Like, yeah,\nwe're not for everyone. I understand that, but we are for a lot of people as well. And, you know,\nthere's no reason to hide behind the curtain if it's the best interest of your client by\nall means, give us an opportunity because I know these industries will be here 300, 400,\n500 years from now. Yeah. I've found the same thing, right? We tried to get a little cute in the\nbeginning with, you know, marketing. And the old fashion way has really been the only way that\nwe have seen success, which is just talking to advisors and and, uh, town on the story and building\nrelationships. And it's, it's really, you know, it's a long game. And so, I think you're on the right\npath there for sure. So, um, I've seen you do some media. Uh, I saw you in tech TV. Um, thank you.\nHow are you? Is that something new for you? And, and how are you handling the camera?\nYeah. You know, it's, I, we started it early on the, when we first launched, uh, TD Ameritrade\nasked me to come on on our launch date. You know, I had a little bit of media trading. We were working\nwith PR firm. And I'll be honest, I was nervous. I was excited, um, you know, and then as time goes\non, we scaled up. And I, I have, I have, I'm comfortable doing it. It makes me, I'd say,\neven better public speaker when I'm out there. You know, I was able to go on Bloomberg one day. And\nwhat an experience that was, um, to kind of go in there. If you ever seen the, the movie, the\nshow Westworld when you walk in there, you have, like, a host that just walks up to you. They're like,\nhey, Mr. Mink, who's there to go through this. And then they're like, they sit you down and\nshare, they're like, you want some makeup. And then, like, I don't know, do I need it? Right? Yeah.\nYour hair, I'm just going to do one thing, too. And I was like, okay, that's fine. It would\neveryone. Yeah. Yeah. And so I think it's, when I realize over time, I, I think I've become less\nscripted. You know, I'll go in there and like, hey, what do I need to do? You know, I even emailed\nyou like, hey, is there any outline to this or we're going off the cuff? I'm totally good with that.\nWhich I think is best because it's such a more candid conversation to have and being natural.\nRight? At first I was like, oh, I got a dance around us being the, you know, the bad investment\ncompany. It's like, oh, no. We are who we are. We believe in the strategy at the end of the day.\nSo, you know, I, I like media now. It's, I mean, I'm not just like them. Well, certain certain\nfactors of it. But it's good. I, I'm comfortable with it. It's a good, it's a good thing.\nAnd I think it's good to get your name out there, too. Yeah. I think media is, I mean, it gives you,\nI think a media credibility. One thing that's hard for, uh, hard for me with media is everything we do.\nAnd even in your case, right? Like, everything you're doing is passive in a role space,\neverything we do is passive in a role space. And I, and one of the reasons why we started the show\nis to be able to have candy conversations that might fit our story a little bit more. And\nthey'll be like, so what do you think about Apple's earnings? I, I don't, I have no, I have no idea.\nSo I, yeah. I've, I've, I've, I've just had to sort of like, I can't answer that question. I don't,\nI don't, I don't know. Um, yeah. It doesn't affect my investment strategy. I can't, I can't answer it.\nYeah. We, we'd like Apple in the form of, I mean, it's, it's works for past 20 years. Right?\nSo, uh, last couple of questions here, what, being a single issuer, what is one thing that kind of,\nhas been a frustration for you? Yeah. I wish where someone says that, okay, you only have this\none box. I wish we had another product we could offer them. You know, with, with having, okay,\nI've got a roll of decks, right? That's something that, you know, talking to other wholesalers in the\nETF world. They've got a solution for everything, right? Because their companies are massive. And\nthey have that's thematic. They have that one. If that's not a good fit for you, what are you looking for?\nRight now, I'm, I'm trying to fit bad into some squares, right? If it's a circle, I'm trying to fit it into\nsome squares. So finding those circles that we fit into is a challenge. I would say being a single\nETF issuer, right? You know, that said, say the biggest challenges with just one fun. Well,\neven, even with that being said, if, you know, you're going through relative under performance\nfor whatever reason, you can't pull something else out of your bag and do the, hey, look over here\nand kind of keep the assets on firm and, yeah, that can be frustrating. And so,\nwho are, if you have any, who are your competitors in the space? So there are any competitors\nto the bad ETF? You know, I would say, our competitors, maybe, would be like the Bet's ETF\nby the Round Hill guys. They've got a lot. Some of the cannabis companies we get looped into the\ncannabis conversation quite a bit. And you know, if you look at that, we have destroyed the\ncannabis industry in, when, why talk about that? I go, well, if you're looking for cannabis exposure,\nwhere you're best proxy for that? Because not only do we have a direct investment in there,\nwe have indirect investment through the alcohol companies who are helping, you know,\nconstellationize investment when those, and the drug companies too have investment. Because\nthey're losing market shares with sleep medications and things of that nature to the cannabis.\nAnd so they're going to be able to kind of win cannabis because legal's still actually\ncapture some of that too. So if people are waiting and they want to win, you know, in their cannabis\nplay, I would say, look at us on that side of things because we're a great proxy for that area.\nSo, you know, other competitors, right? We're not going to be able to just keep up with a peer\nplay pharmaceutical type of play. That's not us. You know, I like to call us the three-headed\ndragon, where you need, right? There's very few investments out there, ETFs that are just limited\nto three different sectors and that it alone. So, you know, it's unique because, well,\nmaybe I want direct exposure. Maybe I want this. Well, if you're going direct exposure with\neither vetting, vetting or cannabis or some of that stuff last year, you would have mold,\nyou would have underperformed significantly. On the other side, right? Pharmaceuticals did great\nlast year. So, again, we're kind of a blend of a lot of ETFs combined, where take out the\nguesswork to some extent. You want to be in these industries. We're going to give you hopefully a\nlittle bit better of a risk adjusted return at the end of the day. Yeah. Let's talk about our.\nSo, a final question here, Tommy, and I really, this is a great conversation. I'm so happy\nyou have to have you on here. I'm so warm. Yeah. So, where can people and how can people learn more\nabout you and the bad ETF and your product and your offerings? Yeah. Yeah. So, go to our website.\nIt's going to be the number one spot. You can type in, invest bad.com or badinvestment code.com.\nThey'll direct you to both of those. There's an info email out there info at invest bad.com.\nThat will get sent to us and we'll get to you at some point. I'm available on LinkedIn. I'm active\non there. Encourage people to reach out if they want to hear the story or have more questions\nabout the fund itself. I'm happy to provide that insight on there. So, yeah. Invest bad.com or\ngo find me on LinkedIn. All right. Well, that's how I found you. Yeah. That's how I found you.\nI get so frustrated with LinkedIn with all of the messages. And when we decide to do this,\nI'm like the best way for me to get these people on LinkedIn. And now I'm going to have to\nmessage them. The one thing I hate more than anything in the world is getting a random LinkedIn\nmessage. So, oh yeah. Yeah. Well, the worst are the ones that are not even related to your business.\nYou're like, I, if I'm trying to find someone, I'm like, I know they're in the investment world.\nI know they're an advisor. When I get some kind of email about, hey, you need new health insurance\nfor your, I'm like, no, I don't need that. Yeah. There's so many of those LinkedIn\nautomations out there. People just, and then you'll get the follow-ups where it's, you know,\ndid a, you know, can I, uh, wins a good time? And wouldn't they just keep hitting you at over and\nover and over again in spamming you? But I like less than get them sometimes. That's a good way to\nkind of counter that. I have, after a few cocktails call, or Tommy, I do, uh, I'm supporting your\nfund indirectly. I work. I'm known to send a snappy one back at time or two, but I do get a laugh out of it.\nI shouldn't, but it, it is fun. I love it. I love it. It's great. Tommy, again, thank you. Thank you so\nmuch for joining us. And I look forward to hopefully one day run into you in person and don't\nforget to invite me to the after party of your bell ring, okay? Absolutely, Brad. No, thank you so much\nfor having me on here. This is been a fun conversation. So, I appreciate it. Thank you.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}