{
  "id": "12880061",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they can\nto grow their company.\nMany of these individuals are entrepreneurs and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nPatricia Lizaraga CEO of High Payship Capital is our guest today.\nShe's also the portfolio manager for WCEO, the only ETF out there that invests solely\nin women-led companies.\nWe talk about how she decided to start the business, the extra alpha that women can generate,\nand why she's investing in those companies, and also the great work that she's doing on empowering\nwomen to get them to invest in plant early.\nI think you're really going to enjoy this conversation with Patricia.\nPatricia, good morning.\nWelcome to Behind the Ticker.\nThanks for joining me.\nThanks for having me, Brad.\nI'm excited to be here.\nYeah, I'm really excited to have this conversation.\nI think you have a really cool product in WCEO, and I want to learn about all the things\nbehind it and how you got there.\nSo I think why don't we start there?\nWhy don't we tell me Patricia about your background and how you got\nto where you are today?\nSure.\nSo my background actually is in investment banking and private equity.\nI started my career at DLJ, and therefore as in a banker, a lot of my clients were primarily\nCEOs and CFOs, and by definition they were primarily meant.\nAnd once in a while I would have a woman client, and I would be extremely impressed\nby her results and by her business acumen in general, and kept on thinking, well, I would\nlike to have more female clients.\nSo I went out and started my own firm, but I also thought they were top performers among\nmy clients.\nSo that idea over time turned into, how do I measure that female performance and how\ndo I isolate it and invest in it?\nAnd that's what ultimately led to the WCEO ETF.\nThat's great.\nSo when you're not working at high patient capital, and you're not outselling in distributing\nWCEO, what do you like to do for fun?\nWhat is your weekends look like?\nWhat is life outside of the office look like for you?\nSure.\nSo there's, I would say, of two main hobbies and their polar opposites.\nI love a sailboat racing, so I usually during the summer, I spent some time on sonars\nin Oyster Bay, so I'm going to go ahead and I love that, and then on my non-less competitive\nside, I love a botanical illustration.\nSo I take a lot of classes at the New York Botanical Garden online, that allows me to\ndo that from anywhere in the world.\nI've taken also online botanical classes from Edinburgh.\nSo those are those two things in my family, keep me pretty busy.\nThat is, that's such a cool hobby.\nI tried sailboating once, I was on vacation, they gave us a little dinghy sailboat, and it took\nme, I don't know, 45 minutes to roll the thing over, so that is such a neat and neat\nhobby.\nThe great thing about the kill boats is they can't roll over.\nI started in a dinghy two, and it was a very wet day, and then somehow I found a place\nat taught J-24s, so I tried again, tried again in a small kill boat, and told me how\nit goes.\nWell, that's fun.\nThat would make for fun summers, and that's really, really neat, so I'm glad you shared\nthat.\nSo what made you launch a high-patient capital, is it strictly to launch the ETF, do you\nguys do other things?\nSo again, we started 15 years ago, and we really started as an advisory shop, and building\nour network of senior women executives in order to sort of send from a more advanced\nadvisory investment-baking point perspective, and that grew into a very large network,\nand we would hold events about private equity, about M&A, but then we started looking\nat all asset classes.\nSo it was an evolution into how do we make investing in women in leadership, a mass\nproduct, right, because by definition, alternatives are a product that is appropriate for\npeople who are credited investors, but we really think that investing in women in leadership\nis something that is appropriate for all individuals who believe in equality.\nYeah, and that's great, and so what does high-patient mean?\nIt's got to have a secondary meaning.\nSure, so when I was researching a name for a firm, I researched first woman mathematician\nand first woman astronomer, and the name that comes up is Hypatia.\nShe's the first published female mathematician known, and about 5th century AD, she was the\nlot when it was last to the new play tennis in Alexandria, which at that time now is\nnow is Egypt, and then it was Greece.\nYeah, that's cool, that's fun, it's always, I love talking to entrepreneurs and how they\ncome up with the names and how they came up with their branding and everything, so that's\nvery cool.\nI'm glad you share that, so let's dive into a little bit about WCEO, the ETF.\nSo tell me about the strategy, how is it work, what's it investing in, the index, all\nthe things?\nAbsolutely, so high-patia investment thesis is that women CEOs will outperform.\nRight, so first, what is WCEO do?\nWCEO invests in all American public companies that have a female CEO small to make a cap.\nOkay, why do we invest in those companies that have women CEOs because our investment thesis\nis that women CEOs outperform?\nAnd the question is, why do they outperform?\nAnd our investment thesis...\nWell, that was my next question.\nYeah, it's because it's harder for women to get to the CEO.\nSo the ones that do make it by definition are extraordinary in that CEO cohort, right?\nThey have a, they have a harder time getting there, so they have to jump through extra\nhoops or do something that makes them extraordinary.\nSo the question is, okay, if you believe that women outperform and you're going to invest\nin women's CEOs, how do you isolate that female thought?\nAnd that's where the construction...\nOh, go ahead.\nSo when you screen and source these opportunities and find these companies, how are you waiting\nthe index?\nAre you, are you, are you market-weighting it?\nAre you equal-weighting all of these companies?\nHow is the index constructed?\nSure, that's a great question, and what we did is we tried to isolate the female factor.\nSo we thought, what are two factors that we think are making the selection or the waiting\nprocess not be about women?\nAnd there's two primary ones.\nIt's both size and industry.\nSo we have companies that range from $200 billion plus market cap to right around $500\nmillion.\nAnd so unless we equally weight them, it would be more about size as some other, you know,\nlarge ETFs would be rather about size than about the actual female factor.\nSo we thought equal-weighting would eliminate that factor.\nAnd the second factor that we think is important is the industry factor, right?\nBecause there are many more women in consumer discretionary than there are in energy.\nSo because energy, but because we are equally weighted, we correlate most closely to a small\ncap stock index.\nSo the WCO ETF is supposed to fit in that small cap allocation.\nSo we took our benchmark, which is the FTWILser small cap index, because we correlate\nto small cap index.\nAnd we matched their industry weightings.\nAnd therefore, when we did the, so for example, if the FTWILser small cap index has 6%\nof energy, our fund will also have 6% of energy.\nBut we don't have 6% female CEOs in the energy sector.\nSo we have to overweight them.\nSo we made it industry-neutral vis-a-vis its benchmark and that gives us our weightings.\nSo how often are you running a new screen and how often are you rebalancing the index?\nSure.\nSo we're permanently looking at what's going on in our portfolio, because we have the discretion\nto, to, to, to, to, to, to, to, to the, from, we don't have, we're not benchmarked to the\nWCO index.\nThe WCO index is calculated after the ETF decides what it's due, right?\nSo, so because of that, we're constantly monitoring what's going on, but we rebalancing\nevery month.\nSo every month, we, so, so anytime a company no longer has a female CEO or, on the reverse,\nif a company, a, a points of female CEO, we will buy or sell that stock that same month.\nAnd then we wait the index accordingly.\nIt's very active.\nSo over time, yet, so over time, are you finding, you're adding more names to the portfolio\nbecause more, more, more females are taking on leadership roles, is that something that you're\nseeing in, in your, in your, in your data and your index?\nSo, so, so, in, in our ETF, the ETF itself only has three months.\nSo I think that, it's, we can't, say, there's a specific trend, but in the index, which\nobviously is different than, than, than the, than the ETF, we have seen an increase of\nwomen's CEOs over the five years that we have created the data for.\nIt's slow, but steady.\nIt's great.\nWe're going in the right direction.\nWe would like it to go faster in the right direction, but it's going in the right direction.\nYeah, your index just ends up being the S&P 500 and 20 years.\nThat would be great, right?\nYeah.\nOr half of it.\nSo half of it.\nSo, yeah, half of it, half of it.\nSo, um, what, before we kind of move in a different direction and you touched on this briefly,\nbut what do you think personally drives that female alpha factor, right?\nLike, what, what is it that women are, are better at than men that are allowing them to\ndrive alpha in these companies?\nSure.\nSo, we believe what's driving women's performance is how difficult it is to get there, right?\nHow they, each, we have 1204 companies in our portfolio in all 11 years.\nAnd so, of which there are many more.\nSome of these are big companies, some of these are small companies, some of these are in industries\nlike consumer products, we have two defense stocks, right?\nWe have, we, we own both general dynamics in North America, North America, and we own\noxidant oil.\nAnd so, the competencies that one would expect in one industry might be quite different,\nbut what the, what the competencies one might expect in a different industry, we have\nquite a bit of bio-tech in our, in our, in our fund as well.\nSo, we think it was really hard to say, looking at all 124 of these individuals to\ndescribe one leadership trait or one personality trait, because it really is dependent\non the company and the only thing that we find in common is that their female and that creates\nout performance.\nSo, again, we ask ourselves why, and that, and our, and our conclusion is that it's the\ndifficulty in overcome the obstacles, therefore, logically, there has to be a better\nperformer to, to, to be able to overcome those obstacles, you know, think of it as like\nhernal jumpers.\nYeah.\nYeah.\nThat makes sense.\nYeah.\nThat makes sense.\nYeah.\nYeah.\nNo.\nAnd, and even in the short duration of the ETF has been out, we, you know, I've noticed the\nout performance.\nAnd, so, I think what you're doing is, is wonderful, and I agree with you, you know, there\nhave been hurdles in place, and in order to get there, they have to be exceptional performers.\nAnd so, I look forward to continue to, to track it and track the performance over time.\nSo, let's pivot just a little bit.\nI want to talk about kind of how long it took you to get this product to market, kind\nof start to finish.\nWhat did that look like from, you know, the ideation of, of the idea, and to, you know, having\nthat first trade take place.\nAnd so, tell me about that timeline a little bit.\nSure.\nSo, so, so, if we take the timeline all the way back to the founding of high-peach\nof capital, and I started realizing, wow, I want more female clients, and they're so\ngood at what they do, and they're the top performers of my clients.\nAnd we can go back 15 years.\nBut I think it was seven or eight years ago, I saw a clip of a, of a, of a, it was a head of a\nmarketing of a company called Quintopien.\nAnd Quintopien was a trading algorithm, company where traders could set up their own\nalgorithm, and, and, and, you know, prove that their investment thesis performed and the,\nthe head of marketing actually, she tried doing it with women CEOs.\nAnd so, our methodology today may be a little bit different, but I, that was like this plan\nto the seed.\nWell, what if, what if I could, you know, turn this into a real product.\nAnd that must have been seven or eight years ago.\nAnd then we have thought of other products we wanted to do, and also were a small\nindependent firm.\nSo, so it's really the idea, trying to figure out the product, also going through\nthe different partnership possibilities, right?\nSo, this WCO ETF, I believe, has the most amazing service providers, right?\nWe are on the ultimate platform.\nWe use violent as a seven advisory.\nWillcer is our calculation agent.\nBrown Brothers, here men is our custodian.\nIf you look at our service providers, they are all,\nand blank, are, is it, is it, is it trust legal counsel?\nWe have top of the line service providers.\nAnd so, trying out different partnerships, also took some time.\nRight?\nReally figuring out what's the best way for us to partner to put together this product\nwhere we can concentrate on our investment thesis and on, on, on, on building that out.\nSo, that took quite a while.\nAnd then the database just didn't exist.\nSo, we tried to buy it.\nYou know, we went to different data providers to just try to get the historical list of\ndates when women were CEOs.\nAnd when they left.\nAnd we had to recreate it from scratch.\nSo, that also, you know, that is all to took some time because we had to try out different\nservice providers.\nAnd ultimately, we ended up doing it ourselves.\nSo, do, we also have, do a lot of it ourselves.\nWe have a lot of the same service providers.\nYou know, you would mention ultimus.\nAnd they do a great job for us.\nSo, do you, it sounds like you had launched your own, your own trust.\nYou're not on a, on a weight label platform.\nWe, we are on a, we are on a shared trust on two roads.\nOkay.\nAre you, are you on ultimus' trust?\nOr?\nSo, what made, what drove that decision from either creating your own trust?\nBecause you had mentioned, you know, you have some other products in mind to kind of\nweight labeling.\nI know that this is a major decision for a new issue or, or for even an existing issue\nor if they want to make a, make a change.\nSo, what drove that decision for you to, you know, kind of,\nget on some, you know, get on an already pre-established trust to, or starting your own,\nkind of what, what drove that?\nSo, what drove it is, we want to focus on the creation of opportunities for investors\nto invest in women in leadership.\nAnd that's what we've been studying for 15 years.\nAnd that's where we have so many context, so many data points that we want to focus on that.\nAnd what we didn't want to focus on is understanding and having to,\nhaving to, and having to become experts at the creation of an ETF,\nat the creation of indices.\nWe wanted to focus on what we know, which is isolating the female factor.\nAnd second of all, getting the world to understand what the female factor is and why it outperforms.\nAnd because today, the only place where you are, you have more money right now,\ngoing into early stage female focused funds, then you have money going into gender lens products.\nAnd that is upside down, right, because in, in your portfolio allocation,\nyour publics should, your public investments should be a much larger piece of your portfolio.\nThen your alternatives.\nSo ask, when we looked at that, we said, wait a second, that doesn't make sense.\nThe public side should be much larger.\nAnd that's also a part of your portfolio where you can taught where it's appropriate for everybody, right?\nSo the WCL ETF is appropriate for somebody who has a $1,000 investment portfolio.\nAnd it's appropriate for somebody who has a multi-billion-dollar investment portfolio.\nAnd we believe that we want to talk to everybody, and as the ETF becomes, as it grows,\nand as it has more assets under management, one of the things we want to do is have an educational component,\nwhere we go out to the universities and engage more women in the financial services industry.\nBecause we all know, it's been documented.\nI'm sure you've seen Julia Burstings book, How Women Lead, or Ruth Schavers book,\nand Patience's book, the Wellex Factor.\nAnd these books really document the lack of the lack of women in the entry points and the financial services system.\nSo we're trying to, we're trying to be part of the solution.\nHow do we get more young women to be interested in finance, to have more financial literacy,\nand to be more confident investors?\nSo that's our medium-term plan.\nWow, I mean, yeah, I mean, you've got a lot of going on outside of just being an investment manager,\nportfolio manager really sounds like you're taking a lot of time to get involved in kind of push\nmovement and an idea and, you know, Kudos to you, that's a lot of hard work.\nAnd so just stemming off of that, in terms of educational series,\nare you currently working on that, or is that something that you're going to be doing in the future?\nSo we're currently in conversations with a association that really brings together a lot of young women.\nAnd they are asking us to figure out what the right educational platform to get.\nThose young women financial literacy education, so that they can at a young age start investing.\nI'm going to listen to what Sally Crotchx asks, who, you know, really says it so well.\nAnd I, you know, I urge everybody to really consider her platform because it's very specialized in this way,\nbut she says, you know, invest early.\nThe earlier you get started, the more likely you are to have that nest egg that everybody wants every target.\nSo our thoughts in listening to Sally saying, is how do we, how do we be a creative to that?\nAnd our answer is, let's give young women something that they think it's interesting to invest in, right?\nSo as a young woman, if you're, if you're, if you're, if you're it's a mediums bombarding you with the lack of women of leadership and we say, but hey, you know,\nyou can put your first $1,000 to investing in all women CEOs.\nWe're hoping that that will be something that will engage them.\nYeah.\nAnd if that's wonderful.\nAnd I think you get to know their portfolio.\nYeah.\nAnd I've been following Sally for a very long time.\nI've not had the opportunity to meet her.\nAnd I watched her.\nI believe she was it.\nShe had Merrill.\nYeah.\nAnd then she launched her own firm.\nLike, yeah.\nYeah.\nAnd so and she's does a great job marketing.\nAnd I've been following her for a while.\nSo the two of you together should be able to, to do some damage out there in terms of, of helping this movement, but.\nAmazing job.\nSo let's go back to product creation.\nI have a couple more questions there.\nYou launched on the New York Stock Exchange.\nSo what drove that decision?\nYou had other, there's other options out there.\nSo what drove that decision to kind of launch on the NYSE?\nSo, you know, we, we, we, we were torn.\nWe think NASDAQ is a great option.\nAnd has a female CEO.\nBut guess what?\nSo does a New York Stock Exchange.\nSo we thought that was really interesting.\nSo they were too finalists.\nAnd ultimately the New York Stock Exchange.\nYou, oh, I think two thirds of our portfolio companies are New York Stock Exchange listed.\nAnd therefore we thought that that was probably more synergies from that point of view.\nAnd that ultimately we could potentially create more content, more events as we got to know our portfolio better.\nBecause there were, you know, the ratio of our, our, our, our actual,\nin, you know, of our actual companies in our portfolio was much larger.\nNo, it's interesting.\nSo going back to kind of distribution, you mentioned that.\nSo how, how are you approaching at this point distribution and getting WCEO out there?\nYeah, distribution is the hardest part, right?\nHow do you get people to know about your product?\nHow do you get them to trust your product and how do you get them to pull the trigger?\nAnd so the good news is that the, I would say that the, the financial press has taken a liking to the ETF.\nBecause the, they love the fact that it's a peer play.\nAnd that we are about investing in women and that's all we're saying.\nAnd so it's, and it's, and if you say, what does a WCEO do?\nAnd you look at the pictures, you know, we, we are as far as I know, the only ETF that has the pictures of their CEOs and their top holdings.\nAnd there's a reason for that, right?\nBecause if you see the pictures WCEO, then you see 10 women's pictures, that makes the point.\nThis is what we're doing.\nAnd it's different than perhaps anything else that we've seen out there in the market.\nSo, so we have that and, and it's also available to, to all individuals, because it's an ETF.\nSo we are definitely trying to work the social media environment and we do a lot on different platforms.\nWe are getting better, we knew certain platforms better than others and we're getting more experience on the different platforms.\nWe, and we're also, you know, continuing to talk to the media.\nI think that that is a really important part of distribution.\nSo far it's been primarily financial media, but we're also part of our plan is to go to mainstream media.\nYou know, some of the, some of the shows, most of the morning shows have at least one female anchor.\nThat might be of interest to them.\nAnd, and so that's really how we're getting started.\nWe also have a partner that we've part, who hired to, to do, to do our wholesale to independent registered investment advisors.\nAs you know, you have to get to a certain size before you can be on the major distribution platforms like Morgan Stanley and our Lynch.\nYeah, it's definitely a challenge, especially for firms like yours and mine that are kind of smaller and new and boutique.\nYeah, if you look at the list of top women, wealth managers, best in state, whichever of those lists you look at.\nThe vast majority of the best advisors are more in Stanley and Merrill Lynch.\nBut Merrill Lynch and Morgan Stanley won't put this on their platform until we're at a certain size.\nSo that's a real challenge for us because those are by definition, people who would be interested in hearing what we have to say.\nAnd I think likely to give it some consideration.\nYeah, I agree. And it's definitely makes things a little bit more difficult.\nAnd I wish it was different. I wish everybody got to crack as soon as we were listed to be able to be in these platforms.\nIt definitely makes it a challenge for us who are, you know, starting really from scratch.\nSo I look forward to the day where you reach those hurdles because I think you're going to have tremendous success in that distribution channel.\nAnd so, you know, again, I hope you one day get there and and seize that opportunity.\nBut I think the other thing I wanted to say is I think you're doing a wonderful job at on LinkedIn.\nI see you almost every time I log in.\nSo what do you think is working on that channel? What do you think you need to do more of?\nWhat's not working in terms of overall distribution?\nWhat's working? What's not?\nSo I think on LinkedIn, the people that are in your network, if you post regularly and if you, we have 1204 stocks.\nAnd probably what you see, one of the things we love to do is every time one of our company posts say how proud we are to be shareholders.\nAnd put that in there and put in how great the CEO is.\nAnd so I think that's broadening our network quite a bit because we're reaching out to people that, you know, I don't know that I had crossover with a, with a leadership team of ADP.\nI don't know that I'd cross over with a leadership of general dynamics.\nAnd so by really promoting and highlighting who's in our, in our, in our fund, what are who are holding is our, I think that's really working,\nand amplifying our voice.\nBecause we're not just talking about us and what our thesis is, we're saying, and look, this is who's in our, this is who's in our portfolio and proud of that.\nSo that's what I think gives us a lot of opportunity to post in LinkedIn.\nAnd we, you know, we, if you look at Twitter, Twitter is a little bit different because you're engaging with people, not really with companies.\nTwitter, I think, our strategy, which I'm not, I don't know if these strategies, as you know, you don't know who's invested in your ETF.\nSo you don't know exactly what's working.\nYeah, I find that to be, I shouldn't use the word frustration, but it's, until you get to 13 F time if somebody's a larger advisor, you can see who's in there.\nIt would be nice to know because in any other industry, right, if I sell you a product, I know that I can continue to build a relation.\nI can continue to build a relationship with you. I can try to increase my retention, but in this industry, you know, a lot of the vast majority of holders of even our products, I have no idea who they are.\nSo, so Twitter, there's so many celebrities and so many high, you know, high visibility individuals.\nThey love to tweet, and they love to talk, and they're talking to their followers, but there's not a lot of response.\nSo, actually, if you go in and look at a very, I mean, not, maybe not Kim Kardashian, but different, kind of a different social media engageer, the person probably only, you know, 20 people may have seen their tweet, but only two comment on it.\nSo, you're really commenting to that person in particular, as we believe that many of those people would love to know about the WCO, but there's no way to reach them, other than by answering their Twitter.\nSo, I don't, honestly, I'm just giving you what I, what we're trying, this is, this is our first 40 F product, this is our first ETF, so we have never been in the business of marketing to consumers and not knowing if they're actually heating our caller dot.\nSo, we're trying a lot of different things, but it's fine.\nYeah, that's what I was just going to say, that's the best part I think about being an entrepreneur is that you try things and sometimes they work, sometimes they don't, it's this, it's this large puzzle that we're constantly trying to solve.\nAnd again, I think you're, you're doing a great job, I'm getting the word out there and, and highlighting, highlighting what you're doing.\nSo, are you focusing primarily when you're out there selling the CTF, the target market being women and being women financial advisors, is that really the primary sales target for you for the CTF?\nSo, we think there's definitely a natural affinity of women wanting to understand what we're saying, right?\nAnd we think in the financial services sector, the men are also very interested in what we're saying, because men advisors have female clients.\nAnd they want to know, is this something that perhaps would be of interest to my female client? Another part of our client base is not women are girl deaths.\nI'm one of them. Right. Quite a few men say, I want my daughter thinks this is amazing. And so, you know, is that is that an appropriate gift to your young daughter?\nHas that inspiring her? Because that girl deaths want their daughters to grow up and be CEOs.\nAnd we think that's a real fact. Absolutely.\nI just convinced my six-year-old daughter to take the money out of her piggy bank and put it in the bank. So, now I'll have to go home and convince her to buy WCO with a little bit of birthday and Christmas money she has.\nExactly. She even if she has $25, she could do it.\nAnd so we think that that we think that there is, you know, the WCOs for anybody that believes in equality because you can actually balance your portfolio from a CO perspective 50-50 fairly easily, right?\nAnd have it be appropriate. You could have half of it in a large cap stock allocation and have it in a small cap.\nWe track to the small cap, but we actually have large minimum and small and almost equal proportions.\nBut because it's equal weighted, it's why it's a small cap allocation stock.\nSo we think that we think there should be interested to everybody who believes in equality, but we think that it might grab the attention of women first,\nbecause there are a lot of women who are more interested in gender equality and very curious about it.\nBut we don't exclude, we certainly don't exclude the men and certainly not the dads.\nWell, that's great. I was trying to do some research.\nAnd do you have any competitors? Are there any competitors to the WCO or the Pioneer here?\nAs far as we know, we are the first, the first strategy that invests in women CEOs and the public markets.\nThere are strategies in the private markets.\nEarly stage, there are early stage investors that are focused on investing in women founders.\nAnd there's a number of firms that do that. And I love each and every one of them.\nAnd I try to invest in as many of them as I can.\nBut again, those are only appropriate for wealthy women.\nWhat about the person who has 20,000 dollars in their IRA right now?\nShouldn't they be able to invest in women as well?\nAbsolutely. I couldn't agree more.\nAnd good for you being first, there's always that push for being first in a space.\nSo I think you're going to have a lot of success.\nAnd where do you think we talked about this a little bit?\nBut when you're sitting down with advisors and you're talking to them,\nwhere are you kind of advising that they put this in their overall allocation\nin terms of model portfolio construction?\nThis fits in the small cap allocation.\nThat is our benchmark. Our benchmark is the FT wheelchair small cap index.\nAnd again, it's a small cap allocation because it's equally weighted.\nAnd has more small cap, has medium and large cap,\nbut because it's equally weighted, it's going to correlate most closely in that small cap.\nHowever, one could say, I want more than just a small cap allocation in this\nbecause I want more gender balance. And also, we have the portfolio as 124 names.\nAnd it's fairly well balanced between small medium and large.\nWhat it's not going to do is replace your S&T 500 because it does not have any mega cap.\nWhat has to do with their borderline market?\nAnd the mega cap, as we know, is what drives the S&T.\nI want to take the time to thank you for being here.\nAnd I really learned a lot. And I think people are going to learn a lot about this from you.\nAnd I just want to say thank you for taking some time out of the day.\nSo how can people learn more about your product?\nAnd where should they go to figure out if this is something that they want to implement in their portfolio?\nSure. So on our website,\nwww.wceoetf.com is the first place to start.\nAnd there's some basic information that's in video and written format.\nAnd the pictures of our top 10 holdings are fact sheet is downloadable straight from there.\nAnd there's even a link to send to your advisor.\nAnd we're happy to get on the phone with any advisor who wants to understand a little bit more than mechanics.\nAnd the biggest, I don't know if you're getting this.\nI guess push back, we get from from advisors is that we have so few AUM that they think there might be a liquidity risk.\nBut so what advisors need to be understand is the ETF is as liquid as it's smallest stock.\nSo we are no less risky than a than a 500 million dollar market count company.\nAnd for the kind of trades that are happening on your stock, it's in a relevant point.\nWe ran into that issue as well. And then it's just really an educational thing that, you know, size is not indicative of liquidity.\nAnd so I, you know, that just really comes down to an education point.\nSo Patricia, again, thank you so much for doing this.\nI had, I learned a lot and I think what you're doing is wonderful.\nI'm going to peel 25 dollars out of my daughter's account and buy WCO.\nAnd I just got to, I got to open up her a little brokerage account.\nBut again, thank you for being here and I appreciate your time.\nAnd thank you for the opportunity.\nAnd I love, I love this new initiative by New York Stock Exchange James.\nCongratulations.\nThank you.\nThank you.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}