{
  "id": "12927779",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker episode 3.\nToday we have Daniel Snover.\nHe is the founder of PMV Capital as well as the portfolio manager of the ARP ETF, which stands\nfor adaptive risk parity.\nIf you don't know what risk parity is, today you're going to get a lesson on it.\nIf you don't have it in your portfolio, you're going to get reasons why you absolutely\nshould.\nI think Daniel and his team do a wonderful job with their systematic approach.\nThey take towards risk parity.\nSo I hope you enjoy this episode with Daniel Snover.\nHey Daniel, welcome to Behind the Ticker.\nThanks for joining the show.\nNice to see you, Brett. Thanks for having me on.\nSo before we get started, we're going to talk about your adaptive risk parity ETF today.\nWe're going to talk about your firm.\nBut why don't you tell a little bit, tell the people a little bit about who you are,\nyour background, and how you got to where you are today.\nYeah sure. So I started in portfolio management and that's allocation right during the\nfinancial crisis in the 09 period. So I think a lot of people's early experiences determined\ntheir outlook on investing and how they think about things and that's certainly true for me.\nSo I've always been concerned with figuring out how we manage this market risk systematic risk\nand my approach to that has been through asset allocation and mixing in stocks, bonds,\ncommodities in a way that really manages that risk.\nAnd so that's what we're doing at PMV and that's kind of the origin of my story.\nSo at PMV, we'll talk about the ETF.\nBut what else do you get? Do you guys do anything else for clients?\nDo you do sub advisory work or anything else at the firm?\nWe do. We have some separate accounts that we manage.\nBut our primary focus is really on the ETF and but we do we have a series of risk-based\nallocation models that are in this risk-perity style and we'll use our ETF as active component\nand then we'll mix in other static positions to kind of get people to where they need to be.\nBut we do we have a series of those SMA portfolios.\nYeah that's great. So I guess I'm curious to what made you\nreally start the firm. I mean you you started your career like you said in 2008.\nBut what made you take that entrepreneurial leap and say I'm going to go out and do this myself?\nYeah so the firm I was working with at that school, I became an owner in and actually sold\nthat business in 2019 and I worked with the firm that bought us for about nine months and\nwasn't really doing the portfolio management side that I wanted and so I thought you know I need\nto go off and do my own thing. So the two partners I found at P&V with that worked on\nin a previous capacity for about 10 years that were good friends of mine and so I brought\nthem the idea of starting our own thing and so in 2020 the firm actually found it and then\nwe kind of quickly realized that the industry was moving you know towards we needed an ETF to really\nget our strategy out. You know advisors don't really want to pay 3040 basis points for an SMA\nand even our current SMAs we offer without additional charge to the advisors because we've\nmixed in our ETF product. So I think really to compete and given the act of nature of the strategy\nwith the tax consequences you know we needed the ETF structure so we spent all last year\ngetting that set up and our goal was to have launched before year end and the ETF was launched\nin December. Yeah so we launched it about the same time so yeah great fairly new to the\nwhole space but so you manage like you said the ARP ETF which is the adaptive\nrisk parity ETF but you know what does risk parity really what is it designed to achieve?\nWhat is the goal of risk parity from a high kind of theoretical level? Yeah the highest level of\ngoal is to remove as much as possible what's called this systematic risk or the market risk\nfrom the portfolio. So the idea is to just capture the return with the risk premium of the underlying\nassets and to combine those assets in a way to where the systematic risk of each one of them\noffsets and so it's really about maximizing the diversification benefits of the you know stocks\nbonds commodities. So in everything you do at the firm is 100% systematic correct so you guys aren't\nbehind the scenes really trying to pull strings or making market calls. Right so yeah it's systematic\nbecause you know really it's just a process and even if you're another manager let's say you're\nmanaging a you know a value strategy you know if you have a process whereby you screen stocks for a\ncertain metric and you have a rebalancing time frame and you know you can eventually just get it\nto a process and so we think that's important because if you have an idea about how something might\nwork and you want to try it out well then you might want to put that into a system and run it\nthrough different scenarios to see you know how that might play out. So yeah we we are big\nproponents of a systematic process whether that's actually you know including technical data\nand market data or however it's structured but yeah we think a defined process has very beneficial.\nSo are you continually working on and enhancing your systems or is it something that you know you\nbuilt to be robust and doesn't really need to change over time? Yeah it's built to be robust and so\nwe don't imagine it changing at all I'm going forward you know we of course have a discussion to\nupdate it but the system that we have put in place now is something I've been developing for a\nlittle bit more than 10 years now and so in the beginning it started off with an Excel spreadsheet\nand kind of three set portfolios that we would rotate in between and that advanced you know\nso on and so forth until the point where we are now where any changes we make are really on the\nmargin they're not really you know the underlying asset classes that we trade or the way we think\nabout markets or the way we determine the position sizes you know all those things have really been\nsorted out through through the time and so many changes we would make I think are going to be\npretty marginal. So if you so you started building this 10 years ago along the way I mean you\nstarted an Excel did you have to learn how to code I mean are you are you self taught in that\narea as well to build this thing out? I wish I could tell you I knew how to code but I don't\nyeah it's not my previous firm there was someone who worked there that had coding experience\nand we also used a portfolio management software where people at that software company\nknew how to code and build strategies and so we hired them to develop some of the initial ones\nand then PMV or Chief Operating Officer Mark the John Antonio knows how to code and so he's built\nthe current iteration and but yet now I kind of just direct direct the process.\nI was the same I mean I've been doing this for probably 10 years as well in the systematic space\nexactly 10 years would be 2013 and I start looking into back into the code and I'm so afraid\nto touch anything because if I if I I could break the whole thing yeah really quickly and so I\nI have to rely on others for that but you learn a lot I never thought I would I'd be in the space\nwhere I was having to to at least familiarize myself with it. Yeah that's a definitely.\nSo tell me tell me about the strategy behind ARP right we know it's risk parity but like\nwhat's really dive deep into what you're trying to accomplish how you know the composition\nand the portfolio tends to look and change so you know let's really dive into to what this\nwhat investors are going to see when they invest in ARP. Yeah great so I think what's exciting\nabout the strategy is that it's really integrated the macroeconomic environment and not look\nwith the systematic process and so what I mean by that is when I said risk parity is trying\nto minimize the effects of the market cycle on the portfolio. I think we need to start there\nand kind of talk about and define what I mean by systematic risk and what goes into that because\nonce you get to the asset class level there's not individual stock risk right so the risk that\nis and here it in and the overall stock market for example is the risks that are driven by the\nunderlying economy and the cycles that we're experiencing and we're going through a very interesting\none right now which we can talk about if you like but what we're going through right now in the\neconomy is the same tradeoff that we always get which is this tradeoff between economic growth\non the one hand and inflation on the other. So if you don't think about investing at all you just\nthink about the economy and the market cycles the what's what's driving those cycles through time is\neconomic growth and inflation and that mechanism is is really a debt cycle because when when inflation\nis low and and economic growth is low you know the fed the central bank whatever country you're in\nwill step in to spur growth and they can do that up until a point when inflation becomes a concern\nright and then obviously reverse course so that that tradeoff is the tradeoff of the market cycle\nwhich then translates into the systematic risk that we see inherent in each asset class so what's\ninteresting too is that there's not a different market risk or systematic risk for stocks or\nbonds or commodities because it's people often think well there's the risk of stocks and then there's\nthe risk of bonds and then there's the risk of commodities right but in reality it's one systematic\nrisk it's it's they're all driven by the same underlying economy they're just influenced differently\nby those tradeoffs so if we start with stocks for example when do stocks go down when when do stocks\nhit a bad environment and that's when economic growth is slowing or when inflation is high right but\nif you think about commodities when do commodities you know we're talking broad commodities here\ntend to perform best and that's when economic growth is high and inflation is high\nright so what risk parity is trying to do is to identify which broad asset gives the most direct\nexposure to the changes in those underlying variables that you can such that you can mix them together\nin a way that offsets that systematic risk and so if you think in your mind about a four quadrant\nwhere and you need five hundred this but I was just going to bring it up because I was on your site and\nyou've made a very complicated idea very easy to understand when you go on your website you have a\nquad it and then you you show over time when we are in these different environments and what would\nbe the best investment during that particular year at month? Yep exactly and that research is\nreally from Ray Dalio and Bridgewater to familiar with them and risk parity is really an offshoot\nof the all weather strategies so if you hear all weather and risk parity they're referencing the\nsame thing and so you know the macro research is really driven by them and so on a on a static\nbasis the the classic or static risk parity portfolio will try to balance the risk between the\nfour environments that are created by increases and decreases in growth and inflation right because\nthis this portfolio construction idea so if you think about building a portfolio and you want to\nmaximize the certification which is the same the same you want to minimize risk right then\nthe way you do that is is by having positions that have different correlations when one goes up\nthe other goes down right and you need to have the same risk allocated each one because\ntake the sixty forty portfolio you know if the stocks enough portfolio or five times or four times\nthe risk here then the bonds then when you do the allocation on the risk stocks are counting\nfor more than 90% of the risk of that sixty forty portfolio right so if you look at the correlation\nthe correlation of a sixty forty portfolio to let's say the S&P 500 is around 0.95 which is telling\nyou you're not getting any diversification benefits so the risk parity concept is about balancing\nrisk between the correlated positions. Well I think the average investor learned that last year right\nyou had both fixed income and equities you got the full brunt of the downside and the lack of\nthe diversification benefits of that portfolio last year right. Yep that's exactly right. So what\nprimary factors help drive better risk adjusted return in your model right so\nit's let me ask that a different way I should say and what environments you should always\nown risk parity in my opinion right I think it always deserves a spotting report for you but when\nare you going to produce the most alpha in this portfolio is that in recessionary environments\nor and market wall and when I speak when I say market wall equity wall. Yeah so times\nthat question I think it would be helpful to explain what we're doing as compared to a static\nor traditional risk parity because we have an adaptive process whereby we identify the momentum\ntrends that are created by these economic environments so the name of our company PMV is the equation\nfor momentum and so what we're doing our thesis essentially is that the broad momentum trends that you see\nif you just pull up a graph of let's say commodities right the the broad trends that you see\nin these underlying asset classes are created by the underlying economic environment and so instead\nof passively allocating risk between the four scenarios we identify where we are in the\nmacro cycle from the relationships of the assets and then we use that to determine our underlying\nallocation so you know if you take the past couple of years as a great example\nobviously broad commodities were up a lot from 2020 through June of last year and at the same time\ntreasuries long duration treasuries were down close to a similar amount and so if you look at the\nspread the difference of those that's telling you you're in a high growth high inflation environment\nand that's been coming down those trends have been coming down to where right now we we see the\nmarket pricing and slowing growth and slowing inflation which you know whether that persists\nor whether the market's correct you know that's kind of what we're seeing is getting priced in\nand so you know when our strategy will perform best is when we are in an environment when those trends\nare persisting right and when more than one asset class is performing well so if we're in an\nenvironment when the only you know asset class that's going up is what's like commodities then\nit's going to be hard for us to diversify because without giving up return because any\nrisk that we allocate to outside of that is going to be a drag on the performance right\nand risk parity portfolios you know will tend to have a hard time in a rising rate in\nenvironment because if you think about any asset whether it's stocks bonds commodities you can\ndetermine the value of those assets by the present value of their future cash flows right\nso as you raise the interest rates or discount rates that in theory brings down the value of all\nassets and so and that environment it's hard to find possibly trending things in a diversify\nwhen you know the correlations a lot of those assets are are coming together and and their\nand their returns are going down together so when you're starting to build these portfolios out\nand from a holdings and holding construction perspective can you guys go anywhere or you just\nbuying broad broad equities broad commodities broad fixed income I mean can you kind of go anywhere\nor is it just kind of broad ETFs yeah so our investment universe is set we have a different asset\nclasses that we trade and I'll mention what those are but I also want to mention that it's a fun\nto fund structure so our ETF trades other ETFs and the reason we set it up that way is that we could\ntrade a futures contract on each one of the underlying indexes or assets that we trade but then\nour investors would be subject to the 6040 tax treatment of the futures contract so by taking out\na little bit extra expense from the underlying internal expenses of the Vanguard I shares\nother ETFs that we trade you know we can through the custom you know basket creation process\nminimize to the extent possible the capcapes so that's why we you know even that's a little bit\nmore expensive shows that fund of unstructured and then you know I mentioned the four different\nmarket environments so when equities are performing well we can go US international or\nso no sectors no individual stocks just broad assets US international and you\nthought and then our merging site and on the bond side we have short duration\ndebils and long term 20 plus year treasuries because no other bond is a diversifier to stock\nright if you go down the credit scale you're just getting correlation stocks right so we just want\ntreasuries on the fixed income side for commodities we just trade the broad commodities basket\nbut then we also separate physical gold out separately because in a stack-plationary environment\nwhich you know I anticipate us being and then you know you don't want broad commodities you know\nbroad commodities peak last June right as economic growth started slowing and you saw a\ngold you know rallying much more over this recent period so those are the assets so we're\nusing inside of the basket let's just stick with equities right so you have three different places to\nchoose from inside that equity universe you're then applying momentum calculations to figure out\nthe waiting of those asset classes on top of the you know the quad decision if we can call it that\nyeah great question so we have a monthly rebalance and we start with the clean slate right so\nno set targets to any of the assets that I mentioned then what we do is we measure the momentum of\nour various look back periods because the momentum that I'm talking about is persistent we think\nsomewhere between three months and 12 months but if you just picked one window then you're you know\ngoing to get a different response or right so we take multiple readings between a three to 12 month\nperiod and then we essentially just develop risk-perity portfolios over each of those periods and\nblend them together so the first thing that you want to do is invest in assets going up so the\nfirst thing we screen for over each of our windows are positively trending asset classes then what you\nwant to do is of those assets that are going up of those positively trending assets to the extent\npossible you want to minimize the risk and that's where you look at correlations and you know\nstandard deviations all that and so within each of those periods of assets going up you try to\nbalance the risk the best you can so are there guardrails on waiting inside of a quad so\nyou know could theoretically you invest just 100% US and not in international emerging markets\nor are there certain guardrails where you can go yeah great question so there's a 40% max\nto each of those assets that I mentioned so if US international and emerging we're all\npositively trending over each of the lookback windows which I don't know if that's ever happened\nyou couldn't theory go on a percent equity but it would not be all US it would be some\ninternational or emerging in reality what you get is different readings so for example right now\nour shorter term window is giving us a different signal than our longer term the shorter term\nhas been you know kind of loosening of conditions more equity waiting so we're getting a lot of\nequity allocation from our shorter term window but as you go further back we're still getting you know\nsome some risk off trades some US dollar currency and T-bills physical gold right and so what you\nend up with is when you're getting different signals a very balanced or non concentrated portfolio\nbut then when you get same reading over all of those different windows a pretty highly concentrated\nportfolio with still that 40% max to any asset or that makes a ton of sense and so when you\nbuilt the end I the index I would assume is passive correct yeah and you read but you said you\nrebalance on a monthly basis monthly right okay so let's pivot a little bit that was that was a\nmaster class in explaining disparity I think people are going to learn a lot from even though brief\ndiscussion but let's talk about the business side right how long did it take you to get this ETF\nto market you said it took you most to last year but you know talk about that process of actually\nfrom decision to do it to you know first trade yeah so we decided to do it sometime in my life just\nwent off we decided to do it sometime in April or May and so from yeah around April it's\nthen to the year that was the timeframe a good friend of mine went to SCI and so we were in talks\nwith some other providers and you know doing diligence on who we might partner with but ended up\ngoing with SCI and they were really integral in helping us find partners and you know going through\nthe whole process and my other partner I mentioned mark on Operation SCI but my other partners Andrew\nNall and he was a enforcement examiner at Finra and so he is very familiar with the regulatory\nenvironment and when he's not familiar he can read these regulations and integrate them\nway quicker than than I'd be able to so he helped us you know navigate all of the legal and\ncompliant side but yeah it was a it was a learning process because you can trade ETFs\nbut until you actually understand the underlying workings of the Operation SCI and all that goes into\nit it's pretty remarkable how efficient you know the trading system is and the structures that are\nout of there yeah and it's definitely a learning curve and you are you're extremely lucky\nlucky to have a former SEC examiner I think for us the biggest thing that kept us up at night\nwhen we were deciding to launch this thing is to making sure we were doing everything correctly\nright we didn't want to accidentally getting get ourselves in trouble for something that we didn't\nknow and so you you don't have that worry so that should allow you to sleep a little bit\nbetter at night so as far as service providers if you don't mind sharing sure no what service\nproviders or you guys currently using I know that that was a long you know dating process as we went\nthrough it so right who are you guys working with currently yeah so for our lead mark maker we\nwent with GTS and they've been fantastic so far I think they're the largest on the New York\nCycle Exchange floor from up mistaken and great great team there a lot of experience so we've\nnot had any any real trouble on liquidity side of all and for our sub advisor we decided to go\nwith sub advisor and help us trade you know even though what we're not doing is really\nanything out of the box but just to have that experience team on our side is important for us so\nwe went with the fight end yeah a lot of advisors may not know that name but you know they\nthey've sub advising quite a few funds ETF so good team there and other than that SCI does most of\nour you know other other work and then we list on the New York Stock Exchange and so I'm curious\nwhich road that decision to launch on the New York Stock Exchange we obviously all had other options\nto look at but what made you guys decide to go with the NYSE yeah so I think the name brand\nwas important for us I mean we're in relatively new company and fund and so you know being able\nto launch on the New York Stock Exchange I think was pretty cool but you know we also interviewed\nas you mentioned the other exchanges and got references and referrals and it seems like you know\nthat the New York Stock Exchange then NASDAQ or the two kind of primary players and I think for\nwhat we're doing on the active ETF side you know we see most of those style funds also being\nlisted on the NYSE so you know with the referrals and references we got that was kind of the\ndirection that we we went down yeah they're very similar you know thought process to are so\nbeing a relatively new fund when you're thinking about distribution right because at the end of the\nday you know yes we have to be really good at what we do on the investment side but in order to\nstay alive we got to think about distribution and marketing so I would assume I I hate to assume\nbut I would assume you're you're marketing more towards investment advisors and that space rather\nthan trying to go directly to retail maybe just because of the complexity of the strategy\nyeah exactly so we don't plan to go direct to retail working with independent advisors and family\noffices for the independent advisors I'm there familiar with that space as I mentioned that's where\nI started out and working with them and you know what I was missing when I was building portfolio\nwas the the basic diversifiers right so you know we mentioned before most portfolios don't\nhave any risk allocated anything else besides stock but the the reason why advisors don't do that is\nbecause over the long term stocks do have a higher risk premium we're expected to return then\nlong duration treasuries are brought commodities over gold right so if you're going to sit down\nand build a portfolio with a client even if you risk matched those you know over time what advisors\nthink is well we'll invest for the long term and not allocate risk anywhere else so\nwhat we're saying is we can provide you the broad exposure that you need to these other diversifying assets\nin those environments when you might need them without you having to spend 10% of your portfolio\non gold or 20% of your portfolio at long duration treasuries right to get that diversification\nand you know the alternative discussion has been going on a lot in an independent advisor space\nand some of these other products that are out there you don't really understand the exposures\nthat you get if you think about some of the managed futures positions they'll go long and short\n40 to 60 different markets you know there's leverage and shorting right and so they tend to be\nmore complicated and kind of scared advisors when they go through periods they don't understand\nthe performance and so what we try to do is provide a very clear understanding and story about\nwhy we're allocated to where we are the advisors know exactly what the positions are there's no\nleverage or shorting right and so it becomes a situation where they can build confidence and trust\nin the process by understanding what they're holding so how are you approaching you know getting\nin front of advisors right what is what is marketing plan look like for you guys going forward\nand what do things work so far yeah so we have James on our team who joined us recently and he's\nahead of our distribution and so we've just been networking with independent advisors we've been\nhosting some events here in our office in Dallas we've started a email outreach campaign\nand honestly LinkedIn has been a great recently I've been trying to post more and kind of bring\nawareness to some of these different issues on there and been connecting with some advisors so\nnothing nothing out of the ordinary it's really you know emails conferences you know meetings\npodcasts LinkedIn yeah let's have stuff yeah it's the I was actually talking about this with a\nprevious guess one of the things it's odd in our businesses you know oftentimes you don't know who\nyour customers are right you can do a 13F filing but if they're not SEC registered or a 13F\nsearch but if they're not SEC registered you know you don't know your your customers are and\nsomebody could have just bought it and you can't touch base with them and say how you're doing\nand you know unless they reach out to you but it's just it's definitely makes\nconsistent marketing to those people a little bit more difficult yeah now it's true and you know it's\nchanged a lot and in terms of we know where you find advisors but you know we've tried some calling\nand that doesn't work at all I mean when people call me I don't really pick up either so for some\npeople that might work but we've kind of steered away from from just cold calling people and\ntrying to find more organic ways of connecting yeah that's great so you you answered this already\nbut maybe in a little bit more defined allocation style if you're sitting down with an\ninvestment advisor and you're saying you know please put ARP in in your model portfolios where\nwould you how would you suggest they build that asset allocation or where does this fit inside\nof a kind of an overall portfolio yeah so we recommend that advisors leave their stock allocation\nwhere it is right because for the advisors you don't want to go through a prolonged period and\nhave an invite in a client expecting to capture that upside right what we're saying really is that\nif you're spending 20 to 40 to even 80 percent of your clients portfolio on Agbond or Corbond\nthat is not a good diversifier to the stock position right and so we try to get them to\nthink about replacing that Agbond exposure with with what we're doing yeah so and we've\nrun some some numbers on it so if you were to do that even though our ETF is expected to have a\nhigher standard deviation or risk profile than Agbond because it's a better diversifier to the stock\nside we don't expect it to add any additional risk to the portfolio through that replacement\nbut it does come in the form of higher return because you know when we can manage the risk\nbetter than you know Agbond and some of these environments like we've seen then then that can\nnot add a risk overall while still improving the return profile yeah and I agree with that 100\npercent so hopefully investment advisors are listening and especially the way that you've built\nthe product and and all honesty is and you alluded to this earlier is you didn't make it\nextremely complicated for the underlying investor to understand what they're actually investing in\nI mean an advisor can't necessarily go at the level you're going to explain risk parity per\nsay but they can pull up your quads and say you know in these environments this is what we\nthink's going to perform well and this quad this is what we think's going to perform well and they\nknow what they're going to be invested in and I think that that's very powerful for you guys and\nalso for the advisor and kind of storytelling to the client what they're actually achieving here\nyeah that's actually maybe one of the one of the biggest selling points that we tried to touch on\nis that you know advisors are looking for a way of communicating with their clients about\nwhere we are in the markets and how they are adjusting the portfolios to that environment right\nand so every month when we do the imbalance we send out an update that says based on the trends\nand the underlying assets here's where we think we are in the economy and here's how we position\nthe portfolios and the advisors can use that information for the client so you know over the past year\nif the you know communication to the clients were in this high inflation environment we're going to\ndiversify your account with commodities which are you know 16% last year but these trends are changing\nand if we hit a recession you don't necessarily have to worry because there's one of these assets\nlikely to be performing well regardless of the environment so you know if we can tell clients\nwe might hit a strong recession but in that environment if the Fed starts cutting rates that's good\nfor these long duration bonds which were up 33% and 08 right so there's opportunity somewhere\ndepending on the environment and you don't necessarily have to be concerned about which\nenvironment we had in two as long as you have the flexibility to adapt to that and find opportunity\nyeah that that's great and a great story to tell and so a couple of last questions do you\nguys have any plans for future product or you're going to stick with flagship ARP and run it that way\nor what do you got in the table or what do you got in the bag if anything yeah so kind of my vision\nis really to keep it simple and just stick with this one ETF product you know we'd like to\nput all of our effort into that make it as great as we can at some point if there's a lot of interest\nthen we might launch more aggressive version of the strategy because the risk profile of the\none we came out with is relatively low but no outside of that we don't really plan to you know any\nother future product launches so where can people learn more about you the company the fond\nwhere should they be looking yeah great so our website is pmvcapital.com and on the site we have a\nstrategy tab that goes more into depth about the underlying process there's an article that\non kind of the theory behind it and just a general presentation I mentioned that every month we\nsent out an update about where we are and how we're allocated so if you'd like to receive that it's\non the strategy tab you can sign up for the newsletter and then also on the site is a page for the\nETF where you can find you know fact sheets and returns and all that okay well great Daniel thank you\nso much for spending some time with me today I think not only was this informative about the\nfun but it was also educational so again thanks for spending some time with me. Appreciate pride thank you",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}