{
  "id": "12968557",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for educational\nand entertainment purposes only.\nWelcome to episode 4 of Behind the Ticker.\nToday we have Garrett Stevens, he is the founder of Exchange Traded Concepts.\nIf you are in the industry and are thinking about launching an ETF, or you are already in\nthe ETF business, and want to get some tidbits from Garrett, this is a wonderful episode.\nGarrett does a great job walking us through some of the best practices when it comes to\nstarting and actually running an ETF.\nWe talked about some of the things an ETF provider an issue or should be doing along the way,\nin order to maximize their success.\nSo I highly recommend you listen to this entire episode with Garrett Stevens, the founder\nof Exchange Traded Concepts.\nGarrett, welcome to Behind the Ticker.\nMorning, right over here.\nSo you run Exchange Traded Concepts.\nWe have mostly had on other ETF managers up to this point, so this will be a very interesting\nconversation.\nI think it will be for portfolio managers out there that are maybe thinking about getting\nin the space, and I think there can be some value for existing managers to learn from some\nof your expertise.\nBut before we get into it, tell me about your professional background and how you decided\nto launch Exchange Traded Concepts.\nYou bet, so I started out right out of school really as a retail investment advisor.\nIt worked with an independent firm here in Oklahoma City, where I'm born and raised.\nReally through that experience, it was exposed to working with various types of\nproducts, working with various types of clients, and we've got exposed to specific subset of\nhundred institutional investors that we worked with.\nMy partner at that firm at the time, we launched our own family of ETFs.\nWe filed for that family back in 2008, back in those days, you know, you had to get\nexemplively from the SEC, and it took us about a year just to get permission to launch the funds\nfrom the SEC, and it took nearly a million dollars, just in legal fees alone, to get those products\nto market, you know, I think back then we were 32 or 33 in line, you know, actually had permission\nto launch, so it was painful. Like any good, you know, business, it took twice as long and caused\ntwice as much as it was supposed to to get the paying off the ground. So, you know, once we\nfinally got it launched, you know, frankly we had spent more capital to do it, and then we really\nthought it was going to. We had those products out for about 18 months or so, really just not\nvery successful in gathering assets, because we had spent a lot of our plan to be marketing\ndollars on getting the thing up and going. So, at that time, we started getting some\ninbound calls from other people looking to get into the market, basically just say, look,\nwe'd like to buy you just for your infrastructure, just for your exemptive relief.\nWe don't want to wait the year with the SEC. That's really where I got the idea for ETC to\nbecome a widely believed tech issuer to say, man, if we had had this opportunity to get to market\nfaster and let you somebody else's infrastructure, we could have saved a ton of money and a ton\nof money. Because once you have the infrastructure in place, you can launch funds in 75\ndates with the SEC. You don't have to wait the year and you don't have to spend a million dollars.\nSo, that's where the idea came from, and so now we can get people to market and, you know,\nour record is from the first conversation we had with somebody. We had their fun trading 100 days later,\nwhich is lightning fast. That's lightning fast. Yeah, and the cost is about 90 grand,\nyou know, or less, kind of depending on the product. So, you know, cost us a million bucks.\nNow, it costs somebody 90 grand, and you know, it took the year is now 100 days to get to market.\nSo, really, really a big improvement in, you know, big times safer for folks.\nRight. Well, we're going to jump into, you know, exchange rate of concepts and a little bit\ndeeper. But before we do, I want to learn a little bit about you. I read your bio.\nYou, you're a pilot. Now, I've always wanted to be a pilot, but, and what I'm going to teach\nmy son is that if you want to do dangerous things, you should probably do them before you get\nmarried, because I'm not allowed to go get my pilot's license at this point.\nBut, are you still flying? Yeah. Oh, yeah. So, I actually started flying when I was 13.\nI started flying gliders. So, you know, sail planes that with no engine, which my parents love,\nyou get pulled up into the air by another plane. So, I started doing that when I was 13.\nSo, let on my 14th birthday, which is the day you're legally old enough to fly solo.\nDid that until I was old enough to start training in single engine planes, which I was 15.\nSo, let on my 16th birthday, which was again the day you're legally old enough to fly solo,\nhave been flying ever since. So, yeah, I fly somewhat regularly these days,\na little bit for business here and there, but, yeah, been flying all kinds of aircraft\never ever since. That's really, really fun. Have you gotten into jets at all, or are you mostly\nflying prop planes? Mostly prop planes single and twin engine. I have had the opportunity to fly\nfly jets before, you know, some business jets that family or friends own. I do not own my own jet\nunfortunately, not yet. Maybe maybe someday. But, you know, I've flown everything,\nso it's a kind of an aerobatics. I've had some friends who flight competition aerobatics\nor an aerobatics plane. So, the opportunity to go out and do some of that fun stuff before,\nsome friends own everything from different warbirds, military, actual, you know,\nworld of two military type aircraft to, you know, singles, twins, sea planes, all kinds of fun stuff.\nYeah, that's great. And I also read your courses as well. So,\nyeah. I mean, man of many talents. Yeah, grew up riding horses and showing horses. My life\nand I ride and show quarter horses we competed in a raining discipline. So, if anybody watches yellow\nstone, that's what they do on yellow stone is the raining. So, actually a lot of the people on\nthere are a real, you know, raining competitors. So, we know a lot of the folks on the show. So,\nwe actually compete with them. Here in Oklahoma City, we're fortunate that this is where all the\nworld championships for a raining are actually held here in Oklahoma City. So, we do that and\nand show all over the country. So, pretty fortunate to be able to do that as well. So, are we\ncan there spend with horses and airplanes? Yeah. My in-laws have horses and there are a lot of\nwork. They're beautiful and they're fun, but they sure are a lot of work. So, I'm sure that you have\nsome early mornings and late nights. I do, in fact, yeah, and now I spend my mornings in the barn\nbefore I head to the office and again in the evening. So, it's alright. It's a good way to start the\nday and a good way to wind down. That's right. So, let's jump into exchange treaty concept. You've\nanswered a handful of questions that I had and already about it. And, you know, I think let's jump\ninto if I wanted to start a fun today. You know, what should I know ahead of time about the business,\nabout the ETF business, it really isn't apparent to somebody? You know, there's lots of things, right?\nSo, one of the things to think about is, you know, from the, everything for the product design\nstandpoint through how you plan to market it and raise assets in it. You know, the ETF business\nis not, if you build it, they will come much to the, the shagrant of many people. They think they,\nyou know, they have this product and frankly, a lot of people think they're not going to need to market it.\nIt's the best thing ever, right? Is, is what they think and we're going to beat the S&P by 200 basis points.\nAnd why would everybody not automatically buy this product? And while it makes sense empirically,\nit's just not the way it works out there. So, you really have to have a solid plan to let people know\nabout the product. You have to have the capital to wait. There are, you know, we have had funds in\nthe past, you know, that one of the best stories we have is one of the funds we launched, you know,\nwe brought it to market. It did well, gathering, gathering to mass that's in the first, you know,\nsix months or so, it probably picked up $89,000,000, got to maybe $100,000,000, you know, shortly after,\nbut it set there for about four years. And then the fourth year it picked up $2,000, right?\nBut you got to wait and you got to be prepared to pay the bills and spend the marketing dollars,\nyou know, and be ready when your time comes. You know, when that theme comes into\nwhen that strategy finally pays off. When the market sentiment really hits and it buys or suddenly\nrealize they need what it ever, it is you have just because you've launched it doesn't mean everyone\nknows they need it right now. And so you got to be prepared to wait for that. And that's why\na lot of people underestimate. Yeah, that's something that I've talked to many different\nmanagers about because distributions very hard and maybe we'll talk about distribution right now\nis that, you know, unless your product is extremely niche and there's so many products out there\nnow that it's very hard to find, be a first mover somewhere, right? You got to, you got to do distribution\nright. So what are what are managers get wrong about distribution, right? What, what do they need to be\ndoing regularly in order to have success in scaling their product other than patients?\nWell, I think that a lot of people focus on it maybe too much as a sales campaign when really\nit's in awareness campaign, right? It's one of the things that we try and focus on is there's a\ntendency to try and get out there and, you know, try and get people to buy the fund right now,\nwhich is expensive. It's a different expense to try and send wholesalers out or try and get a sales\nforce out there to try and get people to buy tickets and drop tickets and fund when that's a\nmuch harder thing to do than to just slowly and then a less expensive manner build awareness about\nthe fund so that it's top of mind for advisors or retail at some point in the future, right? You can\ndo that any much less expensive manner and have a higher success rate I think over time doing that.\nIt takes more patience, but I think you're going to have a longer term success rate with that\nthan if you spend a whole lot of money trying to get people to buy it. It's a difference as well\nbetween active and passive and this is something we talk about with new clients as well.\nWith passive, you know, thematic funds, it's a little easier for an advisor to go talk to their\nclient and say, you know, here's this, you know, new thematic product will use, you know, robotics or\nsomething as an example or AI, right? We say AI and all over the news right now. It's in everything you\nsee and everything you talk about. That's easy for an advisor to go talk to their client about,\nright? This is a hot sector. These stocks are running away. I don't know which one's best,\nso we should buy an index on that has all of them, right? That's done's the best way to get\ninvolved in this right now. With an active fund, it's a lot harder for them to talk to their client,\nand say, you know, this hot manager, we're going to miss this. It's a lot easier for them to say,\nthis guy might be really good. Let's keep an eye on it, right? And watch that performance. So from\na sales perspective, you don't want to spend a ton of money trying to sell that fund when the\nadvisor's going to say, let's just watch it. So let's have a drip campaign to just keep it in front\nof them. Keep it top of mind and let it build a track record and then hopefully your track record\nand your thesis pans out and then you're going to have saved some of your powder to ask for this\nhell later when you actually have something to sell. You have track record. That's going to be a\nlittle bit more sellable. Yeah, I think I've been doing this for 10 years new in the ETF business,\nbut I think I've learned early, early, early on and made the mistake of, you know, paying for third\nparty distribution, which I think that there is some value in it, but it is very expensive and you\nhave really high expectations going in, but it can drain a marketing budget, you know, pretty fast.\nSo that's that's very good advice. Let's talk about new issuers. What I already asked,\ndo you kind of already answered this, but what do you think somebody should expect when they're\ngoing through a launch process such as timing and cost? You said you could do it for 90 grand\nand 120 days, that's a record, but if what should the expectation be going in when we're looking\nto launch a fund? Well, from timing and cost, you know, what I would say is typical that the\n90 grand to get to market is typical, right? That's what it costs to our platform to get a fund\nto market. And that's, that is, and that's all inclusive through our platform as well. So that's\neverything that's a custom website for your fund and everything that's required on the legal fund.\nThat's the perspectives that start up fees with various service providers, you know, everything\nfrom registering your to-sip, you know, everything. Well, that will get you to market.\nThe more typical time frame, so let's talk about the regulatory time frame, as it is 75 days\nwith the SEC. From the time you file a prospectus, the SEC has 75 days to declare that fund that\neffective. You're going to get comments from them at the 45, and they're going to come back and\nsay, you know, why are you saying this? How do you back up this? You know, bold this? Please re-arrange\nor disclose your risk closures? They're going to ask you to make them alphabetical or they're\ngoing to ask you to ring them in terms of importance or, you know, various things and you're\ngoing to say yes to some, you're going to say notice them, and that happens at day 45.\nBefore that, it will take a couple weeks to draft a prospectus and get it ready from the time\nyou're, you know, you're ready to go. So, you know, all in, it's probably closer to 120 days,\nsomething like that from the time you tell us, you know, let's go and you sign in the green\nwith us, but the actual process is 75 days with the SEC staff. One of the things to consider\nis that during that 75 days, you're actually in a quiet period with the SEC, so you're not allowed\nto market in promote your fund publicly. It is an unregistered security. And if you talk about it\nduring that time period, the SEC considers it done jumping and they can actually delay your launch\nby six months if they find out that you're publicly promoting it. So, what many\nissuers and clients tend to do is let it go effective at day 75, but maybe we don't actually\nlist it for another couple of weeks or a month, right, so that we can get the website live. We\ncan start talking about it. They can talk to their clients, you know, existing relationships\nthat they have and let them know that it's fair and it's going to launch here in a couple of weeks.\nAnd, you know, use that time to, you know, to build some momentum for the product.\nSo, we give a lot of guidance on that. Maybe they have some assets that they're going to be\nable to move into the fund from existing clients. We'll give them some guidance on how to do that,\nright, work it in as, as if all you know, and, you know, don't pop it all in, you know,\nday one necessarily, right? We can talk right through kind of some strategies, how best to do that,\nand make it advantageous for their clients and everything. So, we'll put a lot of strategy\nabout, you know, behind what that looks like and the, you know, the best way to bring a product,\nyou know, to market in general. We spend a lot of time helping them, you know, potentially create\na custom index. And maybe there's strategy that they're running right now is an active strategy,\nbut maybe it works better as an index. And there's reasons you might want to make it an index\nversus active. You know, it's a very blurry line between what's active and passive.\nActive or passive has nothing to do with the frequency of changes in a portfolio.\nIt really has to do with how you arrive at your security selection. You know, we have an index\nbased product right now that turned over 80% a week. So, you know, that's still considered a passive\nproduct, right? And it does the fund just tracks an index. So, we talk through it with them and\ntrying to decide is, you know, right now you're running this and you're considering it active,\nbut can we help you make this an index follow some rules? And then you have an index you can\ntalk about in market and it gives you different marketing opportunities and things. So, lots of\nconsultation we do before we ever, you know, file a perspective or anything. So, let's, let's talk\nabout that a little bit more in terms of active and passive because we run in an active strategy.\nThe guidance we got was to run it as passive. So, and I know why, but from your point of view,\ncan you give everybody the advantages of having a passive rules based index rather than running it\npurely active because we're seeing a massive growth and active right now. And which is great,\nbut there are a lot of active strategies as you said that are indexed passive. So, what are the\nadvantages of having that index be passive? Well, it can be a couple of things. One is from a\nmarketing standpoint, right indexes, at least currently are not regulated. And so, you can talk about\nthe index in different ways that you can talk about the fund. And so, we may have clients who come\nto us to launch who are not a registered investment advisor currently and by launching an index,\nthey don't have to register with the SEC. And so, we can help them create a custom index,\nthey can talk about the index, they can focus their comments and everything and just marketing the\nindex itself. But us be the registered entity and we'll talk about the fund and handle the\nregulated aspects of things. And it, you know, keeps them from having to enter that regulated sphere of\nthings. And so, it saves them time and money and a lot of work and of having to become registered.\nSo, there's a big, you know, big component to it there. The index, you know, also allows to have\nback-tested performance and, you know, those kind of things that the fund can't do, right? The fund\ndoes not allow to show back-tested performance, but an index came. And so, there's different\nregulatory reasons why someone might want to have, have an index out there that you can talk about\nand utilize from a marketing perspective. And also, the tax benefit.\nYes, the tax benefit is, you know, there's active funds now do, of course, have the ability to use\ncustom baskets that previously they didn't, which is, was one of the big hangups, right?\nOriginally, why index-based funds were so much more in demand. But so, that has helped the level\nof the planning field. Previously, active funds couldn't use custom baskets on the way index funds\ncould. So, I think a lot of the tax benefits are a much more level playing field now than, then they\nused to be at this point. But, you know, four or five years ago, that was not the case in\nindex funds. We're certainly superior in that regard. So, you mentioned service providers.\nOr, do you guys do anything in-house or is that all outsourced to third parties in terms of\nadmin and things like that? So, you know, we certainly use outsourced for fund admin,\nfund accounting, custody, and distributor. But, the rest of the services, you know, we have\nbrought in-house over the years. So, we have full in-house portfolio management. So, you know,\npreviously, when we launched, we outsourced various sub-advisors, but that's something we brought\nin-house quite a few years ago. So, we have four full-time portfolio managers at our firm now\nat handle all of the, the teamwork and the trading functions for clients. We brought marketing\nservices in-house over the years. All of the legal and compliance. We brought in-house to\nhave a full legal and compliance team now in our offices, accounting and finance. We brought in-house\nas well. But, we still utilize outsize out-time firms. We, we actually are the only white-labeled\nETF issue where that has multiple firms. So, we actually have three different multiple series\ntrusts that have been all-chones on, all-chones under. We work with US Bank Corp. We work with\nSEI and we work with being my melon for our three separate trusts. The reason we do that is just\nchoice for our clients. It doesn't matter to us, you know, which service provider somebody might\nwant to work with. It's really about cost and choice and finding the right fit with the right\nset of service providers for our clients funds. You know, depending on what somebody might\nwant to launch, we might recommend one set of service providers or the other, depending on\nthe complexity of the product or the nature of what they're wanting to do. But, if they have a specific\ntype of, you know, a specific relationship with one of them already, they're happy to leverage that\nand going to work with, you know, one whichever one they might want to work with. Interesting. Do\nyou guys do index calculation internally or is that outsourced as well? That's out-sourced as well.\nWe'll help them create the index and, you know, we can do back testing with them. We can, you know,\nhelp them, you know, do all of the make sure it works with all the various rules with all the\nright compliance and all those kind of things. But we outsourced the calculation. We work with\nall the major index providers at this point and have for quite a few years. But we don't do any\nof the calculation in the house. Got it. So you've helped launch over 80 funds. Do you guys do any\nsort of due diligence on the front end before launching a fund for a client? Meaning, are you looking\nat strategy or the person coming to you and maybe offering frank advice that this is probably\nnot a good idea? Yeah. Oh, yeah. For sure. We turned down quite a few products.\nFrom all shapes and sizes. In fact, you know, we have gotten a little bit more picky. I would\nsay over the years as to who we're willing to work with, what kind of products we're willing to launch.\nCertainly have changed, you know, over the years as to what kind of clients we want to work with.\nSo we do certainly diligence on the people and the companies or the individuals behind it\nin these specific product to make sure that, you know, again, with somebody we want to be in business\nwith. But we look at the product itself is this a product that, you know, we want to be involved\nwith how complex is it? Do we think it's kind of gather assets? I mean, I think it's something\nthat, you know, that the world needs, honestly, is it the fifth, you know, one of these types of\nfunds, right? Are there four of these already and this one is just slightly different and is\na different enough that, you know, we think anybody's going to buy it or is it, is it meaningfully\ndifferent, you know, where we think it's got a shot. So we absolutely spend a lot of time with that\nand kind of decide if, you know, if it's somebody we want to work with and it's a product have\nlegs. Sure. So I want to talk a little bit about the ETF landscape and one of the things that we\ndid recently is we transition our product from our NYC Arcade NYC floor. Do you see more funds\nspecifically, you know, maybe smaller boutique funds starting to look at a direct market maker\nrather than, because we had issues with with auction. I'm sure some of your funds do as well.\nDo you see that being something that is going to be more prevalent here in the future or something\nthat you're advising on? Yeah, I think that we did one as well. So we just transitioned one of\nours from our kit to the floor as well the first one. So we're using that as a test case here\nfor a little bit for see how that goes to decide if we, if we want to do more or have any\nstart that way. I think it's, you know, everything went so electronics so quickly that certain\nproducts just need that hand holding, right? Some of them are just a little bit more high touch and\nthey need that closing option to be watched a little closer than others and have a tendency to get\na little wide at the end of the day. The computer just don't watch him as closely based on\nunderlying or for whatever reason and they just need somebody there to keep him tied at the end of\nthe day. And so I'm glad that the New York has done that. It's great to see them kind of respond to\nthat. We've been talking to them about it for quite a few years. The issues we've had with some\nof the market makers and some of the automated systems blowing out at the end of the day and\nthings get in the way from them. So we're excited to see it and we've got one doing it right,\nyou know, they just switched on other two of those so we're watching it closely and excited to see that.\nYeah, we transitioned in February and it's been a world of difference. That was one of the only things\nthat kept me up at night was I didn't know where we were going to close and, you know, if you've\ngotten big deviations and nav, you know, it's not something that advisors want to see. Especially if\nthey have a lot of their clients in the fund and, you know, so far we've had a very positive experience.\nIt's good to hear that your client is having a good experience as well. So the ETF landscape is\njust exploded. You've seen it, you've participated in it. How do you see it evolving over time here in\nthe future? You know, one of the most interesting trends that we're seeing right now and I really\nthink is going to be the next explosion for the industry is we're seeing advisors and money managers\nlaunching ETFs just to use as a tool, right? It's not so much that they say this is the theme\nthat's missing or whatever. It's that they're saying we need to be using this wrapper for our existing\nstrategies. You know, we're launching funds for people right now who they don't care if anybody\nelse ever buys the fund, right? They're using it for their clients. It's just a much more tax efficient\nvehicle. They're going to where we're running this in these SMA strategies and our clients are\ngetting hit with cap gains just because the way we trade, why would we not launch an ETF for our\nclients just move the money in the taxable accounts? Put it in ETF wrapper and not let them get\nhit these cap gains. If anyone else buys the fund, great. But we're basically able to just make a\nmuch more tax efficient vehicle for our clients and just do what we're doing. Interesting. So it's\nreally, I think that's the next leg up for asset gathering in the ETF industry is advisors just\nmoney managers just using it. Of course mutual funds are converting. We're working on a mutual\nfund conversion. We're going to be filing for shortly as well. We're going to continue to see that.\nI think mutual funds will continue to bleed assets over into the ETFs. That's not news to anybody.\nI think in the industry at this point. But the ETF being launched, not necessarily as a way\ntogether, new assets, but just as a tool and a wrapper for existing assets for an SMA manager,\nI think is really going to be a big leg for the industry next. Yeah. That was one of the main\nreason we launched. So it's interesting to hear you say that. Of course we want to we do care\nof other people by it. We're out there actively trying to market, but it was we had a flagship\nstrategy, one of our SMA strategies and needed to make it more tax-efficient. The ETF was the answer.\nSo that's interesting and definitely part of our story. Do you think that ETFs are going to\nbecome more available here in the short term or in the future? I should say, in retirement plans,\nit's still heavily mutual fund. How do you see that working out over time or do you see a path for\nthat? I think they will. I think now that 12B1 fee has just dominated retirement plans\nthat mutual funds have. Until either 12B1s find a way to get paid in ETFs or 12B1s go away from\nmutual funds and advisors are forced to get shifted over to fee-based models and quit getting 12B1s.\nI think that that's the biggest hold-up and I think at some point that's going to happen.\nBut I honestly, you show me how someone gets paid and I'll show you what kind of activity that\ngets put in place. So I think that ETFs will certainly move that direction the daily liquidity or\nthe intradaliquidity of ETF then becomes a bigger benefit. If you're going to retirement plan,\nthe taxes don't matter. So the intradaliquidity becomes a bigger selling point right at that point\nand ETFs still win there. I think that in the lower cost structure of ETFs versus mutual funds\nare still better and so once you get that compensation structure of how advisors get paid\nand take that away from a 12B1 type plan, I think ETFs will work their way in there.\nYeah, it's always been especially in this industry, it's followed the money and you'll fall\nthe activities. So which kind of leads into this with ETFs? What do you see as a threat to the\nETF industry as a whole? Is it direct indexing or is there something else out there?\nYou know, the direct indexing thing is interesting, right? I think for a certain slice of\nwhat I would consider active investors, there's some appeal there. On the other side though, frankly,\nI think it's just more work for people, right? And I think a lot of people just don't want to do\nthat work. That's why they like ETFs, right? They don't want to step up and do that. They want to just\nbe able to buy it and forget it or they want to be able to get these exposures. They want to be\nable to pick a fund by it. But when they change their mind on a theme, just swap the ETF. They don't\nwant to have to do the work and set up the direct indexing and all of that. So I don't see it as\nsome big existential threat to the ETFs. I just don't. I think it has a use case, but I don't see\nit as a threat to the ETF industry. Honestly, it's just more work and a lot of people just don't\ndon't have the time for that. Regulation is always the biggest threat I see out there. Every year\nthere are new regulations imposed on the financial industry at large. Some of them are warranted.\nThis industry has a tendency to take a good idea and beat it to death. And so I think there are\nreasons for some regulation, but we get new stuff imposed on us all the time that add cost\nto what we do that ended up having to be passed along in some former fashion. I'm always concerned\nabout regulations impacting the industry and the benefits of certain products. But I really don't see\nanything dramatic on the horizon that are going to have a huge impact on us right now.\nGot it. Do you see, so with the explosion of ETFs and the number of products out there,\nso there's a mind field of small issues. Do you see a world where you're going to see consolidation\nand roll up much as we've seen in the RIA space? Do you see a world where private equity starts to\ntake notice and starts trying to roll up some of these smaller issues, issues in the bigger\nfirm structures that they can maybe have a better ability to scale? I think there will be for sure.\nI think the hardest part about this and what's prevented that honestly from happening. And we see\nthis all the time. We have small funds, we have large funds and we have a lot of people who reach out\nand say, look, can we buy this fund? We'd love to merge these funds. But we do all sorts of creative\nthings. The problem you run into is the proxy that's required. And the proxies are so hard in the ETF world,\nright? We don't know who our shareholders are. We have no way of knowing that. The proxy that's\nrequired of an ETF is what's called a 40-act majority. Anytime you do a change in control of an\nadvisor or a reorganization of one fund to another fund complex, it means you have to get a majority of\nthe shareholders, 51% have to vote and of those in majority have to vote in favor. And while that\ndoesn't sound crazy, the proxies people just throw proxies away. And it's not that people tend to vote\nagainst these things. It's that they don't vote at all. And we've been a part of several proxy\ncampaigns over the years. Most of them have been successful. But sometimes you just can't get it done,\nbecause people just don't return the proxies. They're not voting against it. They just don't\ngo at all. And you're calling them at dinner time. You're sending them letters. You don't\neverything you can to get them to just please vote. Even if you vote to abstain, even if you\nsay, leave me alone. You know, I'm abstaining. That's fine. That's, that goes towards\nquorum towards that 51%. But that's just expensive and time consuming. And for a fund that has\nten or twenty million dollars in it, you're going to spend hundreds of thousands of dollars\nto do that proxy. And that's what's preventing the consolidation in this industry and preventing\nsome of that deal making, which frankly is good for shareholders. And that's why you see funds have\nto liquidate, which is bad for shareholders, right? They're getting cashed out and getting forced\ninto taxable events. And I really think this is something the industry and the SEC should look\nat as this proxy requirements. It's not good for shareholders. It's really not that proxy,\nthat forget majority requirement. You know, people are not willing to vote. They should not be\nrequired to have that to return. It's just really not good for shareholders. They're being forced\ninto liquidations that otherwise could go on and do other things. And it's, it's not the\nright answer. It's very interesting. So this has been very helpful and also very educational. And\nI hope anybody thinking about launching an ETF, you know, listens to this because there's a lot\nof great nuggets in here. So I want to pivot to final two questions here. What do you guys do post launch\nfor funds? So I know you set them up. You get them out there. You get them going. But other than\nsome of the internal admin services that you provide, is there things that you do for funds\nafter launch? There are. Well, certainly, you know, we like to tell everyone that the fund launch\nis the starting line, not the finish line, right? And that's where it really gets going. And certainly\nfor us from an operational standpoint, that's where all the real work begins. So there are a\nmyriad of operational and legal and hurdles and ongoing work that really kicks off for us. So\nyou, you guys are aware of that from running your products. That's where all of the hard work really\ngets going. From marketing standpoint, we do have a full marketing service that we offer for our\nclients as well. So we run email campaigns. We help host webinars. We're running the funds website.\nThere's a PR component that we do work with our clients to try and help keep them out there.\nWe help with digital campaigns. In fact, run social media for several of our clients where\nwe're running their Twitter and they're linked in for them. So there's a whole section of\nadditional ongoing services that we do for our clients where we're going to try and get them\napproved at the various wirehouses. So we teach them pretty much all of the wirehouses and have\nfunds at all of the major wirehouses and certainly all of the LPLs and Raymond James and everybody\nthere with, you know, we've got five and a half, almost six billion dollars and assets\nunder management here coming in the next month or so and we've got close to 60 funds. I guess\nother time this comes out. So, you know, we've got lots of product out there and\nand are continually trying to help get those approved and I'm recommended lists and approved lists\nthat, you know, and all of these firms. So that's a part of our service to our clients is, you know,\nconsistently kind of keep them out there in front of gatekeepers and research firms and things like that.\nWell, Garrett, I think you run a wonderful company. I think being able to provide a new issue\nare all of these different services is invaluable. We did everything ourselves. So it took us\nlonger, costed us much more money and we're learning along the way. So it had been very helpful\nto have a voice like yours. So where can people go to learn more about your company and your\nservices? You bet they can visit us. Our website is exchangetradedconcepts.com. That's the easiest way.\nThey can find us on there. They can just submit a contact us form right through the website.\nWe'll reply back with a full packet of information. All of our intro decks set up a call with\nmyself and our business development team, happy to jump on answer any questions, walk through exactly\nwhat we do and how we do it and be glad to talk to anybody. Garrett, thank you so much for the\ntime today. It's been really insightful and I look forward to having the opportunity to meet you in\nperson at some point in the future. Looking forward to it. Thanks for having me Brad. I appreciate it.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}