{
  "id": "13008475",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to episode 4 of Behind the Ticker.\nToday we have Dave Mazza, he is from Roundhill Investments.\nThey have a very unique lineup of ETFs.\nThey have done a great job raising assets for handful of them.\nBut today we are going to talk about their newest issue, which is their AI-focused ETF\nticker symbol, chat, CHAT, CHAT, this ETF was just released about a week and a half\ntwo weeks ago.\nSo it is brand new, we are going to learn all about how it works and how it operates,\nand I think you are going to get not only an education in the difference between AI and\ngenerative AI, but also some of the companies they are looking at and how they are building this\nindex.\nSo without further ado, here is Dave Mazza.\nDave, welcome to the show.\nHey, nice to have me, Brad.\nSo today we have Dave Mazza from Roundhill.\nHe is here to talk about their newest issue, chat, CHAT, CHAT, Vest solian AI companies, which\nis, as we know, very, very hot right now.\nBut before we do that, Dave, why don't you tell me about your background and how you got\nin the position you are today?\nYeah, thanks.\nSo I started my career at State Street Global Advisors and spent over a decade there for many\nyears, led their ETF research team in the spider ETF business, launched a great number of\nterrific products that I transitioned to Oppenheimer Funds, helped lead their ETF sales\nand marketing effort before the acquisition by Invesco, then transitioned to direction, which\nwas more focused on leverage and inverse products and the Maddox and leading their product\ndevelopment and strategy efforts.\nAnd then now I met Roundhill as the Chief Strategy Officer kind of bringing all the elements\nof my career together and excited to be part of what's a really dynamic team that we have\nat Roundhill.\nYeah, it's funny you said, Drexon, I was sitting, I was in New York earlier this week,\nI was sitting, you know, having a glass of wine and Lombie hold the whole team from Drexon\nwas sitting next to me.\nSo I had a funny conversation with them, asking for refunds for any accounts I blew up as an early\ntrader, but very, so Dave, I'd like to get to learn a little bit about you personally.\nWhat do you like to do outside the office, other than just talking about ETFs, I've talked\nto pilots, I've talked to sailboat racers, what do you like to do?\nSo these days spend a lot of time as I like to joke as a part-time Uber driver,\nreferring them to their various sports and other activities, but in all seriousness, one of the\nthings I love to do is I still get a chance to do a couple ski trips a year, a grip skiing,\nreally, really passionate about it, really being outdoors, in particular, also love to travel.\nSo whether that's domestically or I should have a trip planned to Italy later this summer,\nto me it's a great opportunity to just gain different perspectives and also I think it helps\nme in my life through my career to kind of step outside of your day today and it doesn't\nneed to be a crazy long trip to do that. It could be a hike or something of that nature just\nin somewhere new. Yeah, I just started skiing and for the first time in 10 years and realized\nso much I missed it. My kids are now old enough where they can do it and it's been even though\nmy back is having a hard time holding up and they put the leashes now that you could put them on,\nwhich has been very helpful. So let's transition to the ETF business, let's transition to roundhill,\nroundhill has a number of niche products. I think my favorite ticker is nerd, any RD, which\nis focuses on video game companies, but can you kind of just briefly touch on the line up as a\nwhole and what you guys have out there? Yeah, so the firm was founded on the premise of really\ncreating unique ETFs that are truly differentiated and particularly kind of providing exposure\nto either emerging themes or existing themes but done in a different way. And of course,\na lot of ETF providers, large and small talk about differentiation, talk about precision,\nit's sort of the hallmark of the product, but if you peel back the onion, many, many products may\nnot be that. And so Will Hershey and Tim Maloney founded the firm a few years ago and some\nof the first ETF we're primary in the thematic space. And that is an area where the firm has\nsome great success, whether it's nerd and sports betting is the first sports betting ETF,\nthe first metaverse ETF met V, the sports betting ETF ticker is bats and now most recently\nour gender of AI ETF chat. So we are again focused on offering areas that others may have not seen yet\nand when we do, we look to develop this big products, but it's not all about thematics.\nWe have a handful of products we launched earlier this year called The Biggs. And these provide\nconcentrated exposure to areas like banks and technology. So it's just the six largest money\ncenter banks. That's it. Right, if you look at some existing sector and industry ETFs,\nit's really watered down exposure. That certainly has paid off from a performance standpoint\nby focusing just on the larger banks. But really the theory there is giving people precision.\nThe same can be said about big T, which is our big technology ETF. And that is just focused really\non the family stocks. And again, the idea there is not about trying to be niche or that. It's about\ngiving that precision exposure. So I view those more, more is kind of trading tools, if you\nwell, that folks can, you can certainly can invest in them over the long run. If that's your view\nthat you don't want to have a midcap or small cap exposure. But they give me very powerful\nwithout having the issues that come with daily leverage to be able to provide pinpoint exposure\nto areas, particularly around our earnings season. So I might be making an assumption here,\nbut are you driving a UM grows more from retail investors or are you out there talking to advisors?\nSo our core, I think client segment to date has been direct retail combined with with some\nadvisors. What that being said, what we would love to engage with advisors and it's not in retail\nonly type strategy I would want to be clear. But direct retail, particularly because of our firm's\nfocus on providing content and social media, that's easy to absorb, understand and as fun,\nhas led to really direct retail coming our way, which is something which we love and support.\nAnd we, you know, we pride ourselves on having smiles on our faces and being fun. I love ETFs.\nI'm lucky to have found that as my career and that's a passion that I'm happy to share with\nanyone who's willing to talk about it. So let's pivot back real quick to the bigs.\nDo you think having, because I think that's more interesting with precision exposure within\nlarge areas? Do you see that maybe is more of an avenue to talk to advisors about because I think\nthat that's a very interesting take to be able to get more direct precision exposure in some of these\nbig areas? Yeah, I think you've hit the nail on the head. Those products, I think have a different\ntype of appeal. Whether that's to advisors who are doing trisector rotation strategies,\nwho might, you know, want to compliment what they're doing with existing sector and industry.\nYes, you know, many of which, I know, intimately well from my time at stage street or, again,\nfor someone who has different types of exposure in their portfolio, let's say that they're a long-term\nbuy and hold and their focus simply on low cost passive at the core. There's nothing wrong with that.\nBut if there's an opportunity for them or they have a tactical sleeve, products like this can\nreally work well because of that pinpoint exposure. And the beauty here is, like most ETFs, not all\nof these days, you really know what you own every day. It's just the five largest tax stocks or just\nthe six largest banks. That's it. Right. Right. So staying on the retail marketing piece,\nand you've briefly touched on this through social media, but how retail is finding you,\nis that how you're going out and telling your story mainly through social?\nYeah. So we have a few core channels that we market through. And social media is a great one for us.\nWhether that's Twitter or LinkedIn or other channels that we're looking at,\nand also just being in the press through traditional media as well. I think the opportunity to\nspread your wings, the opportunity to get your message out there as wide as possible,\nis paramount. The ETF market is great because there's so much choice now for whether you're\na retail investor, financial advisor, in any way, shape or form, or a true institution.\nAny ETF could be looked at by you, but with all that choice, does come the requirement,\nI think, to do more homework, so that you really actually know what you own. I think a lot of people,\nparticularly with last year's sell-off, and then some of the wobbles that we've seen this year,\nand select areas, you know, that's become a abundantly clear to me. So, you know, what we do is we\ntry to, again, publish research on our research section, put that in, out there, whether it's\nsocial media or email distribution list, what have you got it. So let's chat about chat.\nYour newest issue. Can you tell me the difference just on the front, and what is the difference between\nAI and gender-generative AI? Yeah, so this is a, I think, a good question, and it's something\nthat we've been hearing. So we're thinking about AI, right? That is, you know, at the highest level,\nartificial intelligence, and that range is from a, you know, Bill, it's become ubiquitous, right?\nSo it's almost, while a few years ago it might have been a hot dog, but it's, it's increasingly\nimportant, and it has been for a few decades. So simply put the earliest ideas about AI, which is\ncrazy to think about, go back to ancient Greece in China, but it really wasn't until, you know,\nthe 20th century, where that term sort of came into the forefront. And the idea is creating\nmachines, or as we would think of them now, computers, to think and perhaps act like humans.\nAnd so over, you know, decades, algorithms and computer programs have done that. And so,\nyou know, we see AI use cases all the time, right? AI is used in health care to help\ndiagnose diseases. It's used in autonomous vehicles. It's actually used in customer service, right,\nwith chat bots and virtual assistants. So folks may be using AI every day,\nwhether it's on their phone or would have you, and you might not realize it. So that's kind of\nAI at the highest level. Generally, AI takes that a step further. It's a type of artificial intelligence\nthat actually uses machines and computers and programming language to create new content.\nAnd so that new content can be, I think, where people are probably experimenting with with chat\nGBT, which is the fastest growing application to 100 million users ever. And that's text,\nright? So it's creating, you're putting it a prompt, and it's responding with text. But,\ngenerally, I think the use cases are much further than it's things like images and videos.\nAnd so because of the computing power and the video is at the forefront of a lot of this,\nthe computing power that has come over recent years and the advances that have come in machine\nlearning and large language models, we can get to this point. And now we're seeing the just like\nthe tip of the spear, if you will, what journey they are I can do. Right? So, you know, there's a\nhandful of areas that we're excited, right? So creative industries. So we know that could be used\nto complement what's happening with people who are writing or designing to create new and original\ncontent. It could be used for everything from music playlists, to news stories, to scanning\nother documents, to doing synopsisies of that. Generally, I can be used in healthcare. Right?\nKind of taking that diagnosis a step further, but it also could be used to create new and distinct\nindividualized treatments for people, which is exciting to produce the potential for time consuming\ntrials. It can be used in education. And we know you're hearing a lot about folks in high school\nor college about who are gravitating toward chat TVD for that, but in all seriousness, maybe could\nmake education a more material is more interactive. It help with that learning side. And then\nlastly, of course, design, right? Think about Chernobyl. I could be designing better and new\nbuildings or airplanes or cars. So I hate to say that it's limitless, but I don't actually think\nwe're at a point to truly understand how much generator I can do because so much is happening\nnow in a short period of time because it's been out there. And like a lot of technologies that we see,\nit's happening very fast. And what I'm excited about AI is in generator. This is not something\nthat you have to make a bet on and say, I hope this happens 10 years. Right? And that can be fun.\nThere's some investments that I have that I know that. There are long-term call options\non something like Gene Therapy or what have you. This is today, right?\nEveryone from a 10-year-old to grandma's and grandpa's can use generator the AI in some\nway, shape or form. Yeah, no. It's crazy actually how fast, as you said, how fast adoption has been,\nI leverage it for the show. Nothing, generator wise. I mean, putting together the transcripts\nor putting together captions. And so I can see and it's made it a lot simpler and it's faster.\nSo, you know, it's a space in which is very exciting. As you mentioned, a video\nobviously very, very good for their business. I see it is definitely a holding in the portfolio.\nSo we're going to talk about how companies get selected. But before we do that, is the index\nfor chat passive or is it an active index? It's actually so, chat is an active ETF.\nFully Transparent Active. There's a to-get got an ETF. We know some are not fully transparent.\nNothing wrong with that. But this is fully transparent like an index ETF if you will.\nGot it. So how do companies get selected then to be in this portfolio? Is there a screen that you're running?\nYeah, so the way I think about it is sort of a, it's a two part,\nkind of a two, a two part screen. And what we're doing is we're looking at two things.\nOne is the transcript score. And so we're going out and we are, we are looking at company transcripts\nfrom publicly available documents, whether they're filings, presentations, press releases,\nto identify our companies talking about various journey of AI and AI related terms. And we give\nthat a score. So the more, the more it's mentioned, the higher it is relatively simple. Now,\nthat's not just it, right, because what we don't want is just companies who are loading up and we\nsaw this with blockchain, right, who are changing their name, right, or just throwing an AI and\nthey have nothing to do with it. So the real research comes with what we call this sector score.\nAnd that's where we are identifying and looking at companies more from a fundamental basis,\ntraditional fundamentals, I should say, this is a quantitative approach. But it's looking at\ncompany revenues, profits, research and development spending on AI. And of course, companies that are\ndoing that work would get a higher rank. So we combine those two things together. The way I\nthink about it is it's a talking, the talk, and walking the walk. I think an either or approach\ncould lead to some quarter of solutions, as I mentioned. So this combination allows us to build\nthe portfolio that's going to be adaptive and dynamic. Generally, folks should expect between\n25 and 50 securities. We may invest in U.S. companies, companies around the globe through\ndirect listings or ADRs would have you. And I think there's a big debate, and there's probably\nwe can have a whole lot of podcasts about this, is how do you build a thematic ETF?\nFor themes that are existing, or have been out there for some time, like cloud computing and cyber,\nindex-based approach, and there's multiple ways of doing that, make a lot of sense to me.\nThe transparency that we know, the revenues that are recurring,\ngender that is so dynamic, we did not believe that an index-based approach would be appropriate\ntoday. That may change a year from that may change in the future. But as of today, the\ndynamicism that we believe by having this combined transcript score and sector score is beneficial\nto build the best portfolio. Yeah, that's really interesting. And I believe you're going out\nthe right direction, which leads me into my next question, which I think you answered it.\nWhat the company would chat and invest in a company that is not only a direct contributor to\ngenerative AI, but a company that is heavily using it in order to gain efficiencies.\nSo we know a company like Nvidia, they're contributing to the adoption of AI,\nbut maybe a company out there that's positioning or pivoting a large portion of their company to\nusing AI rather than a traditional use. Would that be a company you would look at as well?\nI'd say perhaps, but primarily, we're looking at companies that are developing the\ngenerative AI technology or systems or services. Now, as I noted a moment ago,\nall this is rapidly evolving and changing in good ways. So I'm not saying we're changing the\ninvestor process when I say that, but this companies that could lead to be higher in the transcript score\nor the sector score may change. So we're looking, for example, to provide a little bit more detail.\nOur companies involved with machine learning. So that's required for generative AI. There's also\ndeep learning. So that's learning by example. Natural language processing, computer vision,\nexpert systems, which help humans make decisions. And so, because it's so wide ranging,\nwe want to cast a wide net, but what ultimately goes into the portfolio is more focused on your\nsemi-conductors, your software, your network infrastructure, companies, services, companies,\nperhaps some consulting companies for implementation of AI in the like. So it is more about\nwho's powering it as opposed to who's using understood for the time being. Yeah, understood.\nThat was my assumption. I was just curious as the space evolves. And you guys definitely have\nflexibility with being active. So how are the waiting decisions used when you're putting this\nportfolio together? Is everything going equal weight? Is it market weight? Is it active? You guys\nactively making it a decision? How you want to weight this portfolio? Yeah. So the way to think about\nyet, the the weightings are there is has an element of proprietaryness to it, but it really is\nsimple. Let's think of a company in the videos the top holding. I think we can talk about\nvaluation in the video for a minute, but let's simply talk about why it's in generative AI. It's\nyes. Well, it has, if you mentioned AI a significant amount, particularly generative AI. So it's\ntranscript score is through the root. Yeah. And we know through the research, the quantitative\nresearch that we do, looking at fundamentals, their revenue is actually coming and they said it on\ntheir call and so much is going to come from chipset power generative AI. So low in behold,\nit has a high rank on the transcript score, high rank on the sector score, high rank in the\nportfolio. And so on. Yeah. So let's talk about some of the companies that are ranking high\non that score. So who are the key companies that you're currently invested in? I mean,\nNVIDIA's, everybody's talking about NVIDIA. The run it's been on has been unbelievable. I'm sure\nyou know, with the last earnings call, we all saw what it did. And so which would have been\nvery good for your for your ETF. But who are some of the key companies that are ranking high on\nthe score that you guys are heavily invested in? Yeah. So we, we, we chatted a bit about about\nNVIDIA. And I think that is probably obvious to folks. But let's also talk about another large\nholding Microsoft, right? We know that they have, you know, an investment in chat GBT\nthrough through Open AI. They also are now having Bing chat, co-pilot with his AI for Microsoft\nOffice. And in fact, I should Bing search engine, which, you know, had been a bit of a second\nfiddle, of course, to Google. Off of that's Google has surpassed now 100 million Delay active users\nafter it implemented, you know, more AI powered chat feature. And, and so that's, that's a name that's\nin the portfolio. Because directly, they, they, they're involved with it. Another name is, which is\na large cat name is, is BIDU. They actually recently introduced what they call Ernie Bot,\nwhich is, has over 30,000 enterprise users who have applied for access to this. Ernie\nreportedly has 550 billion facts in its knowledge database, which blows my mind to think about.\nAnd Ernie stands for enhanced representation through knowledge integration. And it's a kind of a funny\nflat name, but that thought, and that name tells you a lot of what you need to know about China\nand AI, right? It's sort of giving knowledge and integrating it in unique and better ways. And so\nthat's why, you know, those are some, I'd say, kind of obvious names that your, that an investor\nwould find in the portfolio. Got it. So how often are you rescanning for opportunities and running a\nrebalance, you know, running your transcript scores and your other fundamental look? So how often is\nthis portfolio being reweighted and names added or deleted? So, you know, at a minimum,\nwe would be looking at this on a quarterly basis. But I'd say it's more frequently than that.\nThis is not a portfolio that's going to be turning over daily. We want to have some stability in\nthere, and I think with companies that are more pure pledge or an AI, you can do that, which is\ngreat at this point. But we are, because the space is dynamic, and there's particularly around\nearning season, we will be, you know, we're looking at this on a, on a frequent basis weekly.\nDoes that mean we're turning it over? No. But it's something that we want to be cognizant of\nand aware of as new names perhaps become relevant or, you know, if there are particular names\nsimply because of performance, you know, that may need to be reweighted. Does it mean we don't like\na video or AMD, for example, in the future if that happens. But, you know, we want, we want to be\nable to ensure that one, you know, people are looking for gender-to-act exposure, not just the video\nplus a couple other names, for example, if that were to happen. Yeah, that makes it ton of sense.\nSo, is there anything else on chat that I need to be aware of or that we have been brought up\nso far on the discussion? Because I want to pivot to a couple other final questions.\nNo, I think we touched on a lot of important topics. I think what, what I would recommend folks\ndo is, you know, check out our whole things on our website. Again, there's going to be some\nobvious names in there. Even though some people would say, man, another ETF with, with the\nfan names or the mega cap names. Sure, we are, again, it's not 50% of them. The idea they are that we're\nnot going to have exposure to Nvidia in the journey of the IETF is also hard for me to recognize.\nBut, there's going to be names that folks may not be as familiar with. And I'll just give a couple.\nYou know, sense time is a company. It's a, it's a Chinese company. It's one of Chinese\nleading AI software companies. They have a large language model of their own. You know, they're\nbuilding a suite of products in the space. Adobe is another name. And that's more of a household\nname in the US. But why is Adobe there? Well, they're rolling out generative AI tools across\ntheir products suite, which is really cool. So folks who are using it to build images and things\nthat nature now can have almost an assistant to help improve their workflow. Yeah, I actually,\nI would encourage people as well to go to the website because you put it together a nice presentation\nabout the fund as well as about AI and generative AI that was very easy to consume. And I think\nthere's a lot of good information there. But let's kind of lastly, let's talk about, I saw on\nyour website, there's some things there that say coming soon. So you have a few funds there. What\nare they when do you expect them to launch? So primarily the coming soon funds are related to\nour big ETFs. So what's great about that strategy is you can apply it to a variety of sectors\nand industries. For many years, you know, we've heard from investors today, hey, I'd love some\nprecision in home builders who I'd love some precision in airlines or defense that not that they\ncan't get that exposure, but they don't want anything else. They just want the big cats or the\nreal-pure place there. And so we have a handful that don't necessarily have launch dates, but you\nknow, have a potential come come into the market and the beauty at Round Hill and when I,\nwhat I've loved is the energy that we have and the idea generation comes from everywhere. So\nthere's not a day we don't put our lab cuts on and start thinking about new ideas because we\nhear and we love to hear from our investors or clients, right? Whether that's through\nreaching out on social media or reaching out to us directly, you know, keep the ideas coming.\nYeah, what I see Round Hill is a source for when and again, could be making assumption, but\nwhen something new and innovative comes out or there's a certain theme in the market,\nor even a lifestyle like that's you mentioned, right? Sports betting became very popular\nthat you guys will be a first mover in that area to get something thematic out in that space.\nIs that, yeah, we try to be, so thank you for that. So Dave, I want to just say thank you so much.\nThis was very informative. I think you guys are going to have a lot of success with this.\nAnd so where can people go to learn more about your company and your funds?\nWell, a couple of places. So Round Hill Investments.com, you know, that's our, our home page.\nYou're going to find information about all of our ETFs, whether you're looking, looking at chat or\nbats or nerd or would have you, but then also blog.roundhillinvestments.com, that's our research\nand that's, you know, again, free for everybody, a lot of ETF providers have great research.\nSome of it's, it can range from hard to understand to easy to understand. We try to be on that\nuser instead, but not dumb down, right? So you can go right now and click on our AI section and\nlearn a lot, not just about AI and gender AI, but the companies that are exposed to it are\nforecast for the total addressable market for it. What the impact that it could have on the economy,\nso check that out if you're interested in learning more. Well, again, Dave, thank you so much.\nI really appreciate your time and good luck with the ongoing launch of chat.\nThank you so much.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}