{
  "id": "13051888",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, chief investment officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the ticker uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies in what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nToday we have on Med Faber.\nHe is the CEO of Cambria Investments.\nThey have a large suite of ETFs, but we are specifically focusing on their shareholder\nyield suite today.\nAnd more importantly, we are looking at their largest fund in that shareholder yield category\nS.Y.L.D.\nWe talk about what shareholder yield is, why it is important.\nTalk about the makeup of this fund.\nTalk about how it is performed significantly better than almost all dividend yield ETFs out there\non the market.\nIt was a fun conversation, so I hope you enjoy this episode with Mr. Med Faber.\nHey, Med.\nWelcome to the show.\nGreat to be here.\nSo before we get started, I can tell everybody about your background and how you eventually\ngot your role as CEO and CEO of Cambria.\nWell, that is the nice thing about being a founder is you get to annoy yourself with whatever\ntitle you want.\nI think I have the holes.\nSee, sweet cover to this point.\nI am the chief trash collector and office cleaner in lunch, lunch coffee maker.\nAnyway, yeah, we are a little company base here in Manhattan Beach, California.\nListeners, if you are not familiar, it is a little town kind of part of L.A., but far enough\naway to still show up in the office in surf gear and flip flops if you want to come\nand say hi, we managed about two and a half billion in assets.\nWe have been launched our first ETF over a decade ago.\nWe now have 15 funds and over 150,000 investors all around the world as far as my background.\nI come from a engineering event, a little bit of biotech mixed in, and so very much quantitative,\nrules-based shop, and I am happy to dig in more, any of those alleyways.\nYeah, we are going to get into a lot of that stuff for sure, but before we get into the\nnitty gritty, I always like to ask people what they like to do for fun when you are kind\nof not behind the desk?\nWell, as any entrepreneur can relate, behind the desk is there may not be a physical\ndesk, but there is a mental desk, which I love, you know, I love our world of investment\nresearch, global macro, there is never a dull day, so I can't say it is not always on\nmy mind, one of the nice things about being a rules-based investor, those you don't have\na lot of the discretionary, emotional, psychological trauma, I think that many of my friends\ndo in that world, but so yeah, I grew up as a skier, I like to surf, so it is not\nnative to me, so you will see me out on the phone Costco board if you are in the line\nup, watch out, but any sort of adventure, you can talk me into, I am a map to join, yeah,\nI love going fishing and traveling, we just got back from Japan, so yeah, Japan is on my\nbucket list, I haven't, I haven't bit the bullet yet, but I have heard great things,\nmy brother-in-law was just there and said he had like the best time he has ever had.\nYou know, you come back and it the ends, it like 160 now, so it's a great time as far\nas currencies, beautiful country, beautiful people, wonderful food, all of it together,\nalthough it's summertime, it's like being a Pittsburgh man, it gets a little hot and\nJuly and August, so maybe wait till we turn the page to fall.\nYeah, head over to the fall, so staying on you for kind of one more minute, you push out\na lot of content at the firm and you personally, you know, you do it very consistently\nand you're also an author, how do you think all of those things might have helped scale\ncambria over time?\nWell, I just saw this morning that a fellow registered investment advisor can\nFisher sold part of his business at a $13 billion valuation congrats can.\nThe reason I bring up Ken is, you know, we weren't the first to do content, people have\nbeen doing this for a long time, can certainly did it for many years, publishing magazine\narticles and writing, you had others like Edelman who spent a lot of time on the radio,\nbuilding his business and both of those are $100 billion plus investment advisors, but\nyou have people going back 50-100 years, if you look at Charles Dow, who really started\nthe Dow Jones and then the Wall Street Journal, you know, Dow Theory was writing a long\ntime ago in Graham, so it's always been a content and narrative driven business, the\nmore modern era, you know, we started out with academic papers, so I kind of made my first\nmark with an academic paper, then it became books, then it became blogs and the more modern\nage it's podcasts and YouTube and I'm told TikTok and who knows what's next, maybe some\nholograms in the Internet VR world somewhere, I don't know, but it comes down to, you know,\ndo you have ideas in this Internet age, it gives you a megaphone, it can be good or it can\nbe bad as we've seen, you know, people, your ideas can circle around the globe pretty\nquick, so we'd like to put them all out there, a lot of non-consensus views, as I'm sure\nyou know, on the investing world.\nYeah, no, it's great, it's funny when handful years back, probably six or seven years ago,\nI had a two young kids graduated from the same college I graduated from, they started\nand they listened to your podcast like religiously, they would block off that time, close\ntheir office door and they were like, we got to listen to my kids tell them we're hiring,\nso I want to come join join us in Manhattan Beach, we already know they're intelligent,\nby listening to the show. So let's talk about Cambria as a whole, you do a lot of other things\nother than just the ETFs, so can you talk about what all you do for clients? Sure, you know,\nI'll tell you, I'll start by telling you what we don't do and what we don't do is traditional\nfinancial planning, right? So, you know, I think one of the most future proof jobs of the next 50\nyears is AI comes for all of us, is still that financial planning wedge, the advisor and everyone\ntalks about, oh, you know, they're there fees, compression and everything else, but I'm talking\nabout the really value-ad world of tax planning, of the states and trusts, of behavioral coaching,\nof legacy discussions with, you know, not just the current generation, but future generations\nand multiple, you know, people involved, this sort of outsource family office type of environment.\nI think that's a job that will continue to have very much in demand. We don't do that. We talk a lot\nabout it and we spend a lot of time on the podcast talking about all the things that go into investing,\nthat's not just the arithmetic of investing, but for the most part, our business is largely ETFs,\npublicly available. We do a free research service called the idea farm that goes out to over\n100,000 investors, trying to curate all this investment, what noise we see out there,\ninto really a digestible, weekly email. That's a lot of fun. And so it relates that kind of dual\nmission of launching funds that anyone can buy and then also as ETFs, eat the asset management industry,\nbut also to educate people as well, which is a big passion for us because, as we know,\nit's not taught in schools or it's not taught in most schools. It's getting better,\nit's up to, I think, about a quarter of all high schools. Have a course on money. We'd like to see\nthat close to 100%. Yeah, so sticking on kind of the investment philosophy of Cambria,\neverything about it, like I really like, it's quant-based, it's rules-based, it seems to combine\ntraditional analytics with trend following. So, you kind of talk about the overall philosophy\nof how you look at building portfolios and over time, you know, and theory should yield some\nbetter results. Yeah, so, look, it's the best time in history to be an investor,\narguably it's the most dangerous time, also to be an investor. You know, it's gone or the\nday is of going to the grocery store and having three serial choices. There's now 2000.\nAnd so, the challenge with that is you can get your healthy serial that even exists,\nbut you can also get your fruit loops and frosted flakes and everything else. You know,\nand so, in the, in a world of Robinhood, zero-day trading options, multiple leverage ETFs,\nyou know, a lot of these meme coins, there's a lot of danger, but at the same time, you can buy an\nall-in ETF, global asset allocation, or portfolio of ETFs, or almost zero costs. So, amazing,\ntime to be an investor. The whole key to all of this, starting from the get-go, people are always\nlike, Matt, why are you launching funds? There's 10,000 plus funds out there, isn't everything already covered.\nAnd we actually only try to launch funds that don't exist, meaning the methodology\nis something that either totally doesn't exist, it's a blue ocean opportunity, or we think it\nwe're implementing it sufficiently better, quote, you know, it's different enough or better than\nthe status quo, or it's cheaper. So, all of our funds are cheaper in the category average, a couple,\nare the cheapest funds in the category. But it has to be something I want to put my own money into,\nthe average mutual fund manager has zero dollars invested in their own fund, which is insane to me.\nWe want to have skin in the game, but it has to be something that there's a lot of academic\nand practitioner research, meaning there has to be support. And usually we publish a white paper\na book to go along with these. But as far as the philosophy, you know, we're a bit unique in\nthat we think there's a lot of ways to succeed in investing. But there's maybe 100 times as many\nmore to impail yourselves and ruin your chance success. So, avoiding those equally is important.\nBut, you know, at our basic core, you have to be an investor. And that sounds pretty generic and\nthe concept we use is you got to be the owner. If you look at a lot of the top, not even a lot,\nI think nearly all of the top celebrities, athletes, actors, singer-songwriters, they all made\nsome money from their career, but they made the big money, right? When the ones that got\ntruly wealthy from business, business and investing. So, Michael Jordan, Jay-Z, Dolly Parton,\nRyan Reynolds, on and on, you see, yeah, they made a decent coin from their day job, but where\nthey really got wealthy was investing. So, you have to invest. And what does that mean? It could\nmean, you know, people buying houses, it could mean investing in the stock market, it could mean\nall sorts of different things. So, putting money to work, buy for, and as soon as possible,\nthe decision to save an invest trumps every other decision. Now, we can then spend the rest of\nthe time talking about, you know, what you should invest in and why, but getting started, particularly\nfor the younger cohort, is by far the most impactful decision versus everything else.\nSo, we're here to talk about your shareholder yields ETF and a little bit about the suite, but\ncan you explain to the listeners and to the advisors listening, what exactly is shareholder yield,\nbecause it is more than just traditionally yield, right, and incorporate some other things.\nSo, you can talk about this idea of why looking at entire shareholder yield is important.\nOf course. So, certainly back to the comment I made earlier, which was, we're only launching\nfunds that don't exist. You know, I think it's important. Everyone on TV is always talking about\nthis time is different. This is new, regime, something changed in markets, and often that's not the case.\nIf you look back in the long arc of history, my favorite investing book is trying for the\noptimists. So, look at what's happened in all these various markets. If you realize the\npast has been totally insane already, right, but you get a broad idea of what it means to have\nexpectations for markets and what can happen. That way you have a bit of a guide post to say,\nokay, I actually see that something structurally has changed, and something structurally changed\nin markets in the 1980s. And what it was is companies for forever have distributed a company\nmakes money. It decides to distribute that money to shareholders, right? They want some sort of\nincome from the company, and you go back 100 to 100 years ago. Traditionally, they did it through\nwhat they called cash dividend. They simply just paid you a check, right? Well, when you have\npublicly listed stocks in private too, you have the ability as an owner to they could buy back\nshares of the company, and or issue shares. Say, hey, we need some money. It's all games out\njust do this recently, right? We're going to issue a bunch more shares. And as an owner, you obviously\nget diluted if you issue shares and you own more of the company. It's the company buys them back.\nFirst of all, use the word buyback and automatically shut down people's brains. I don't know why,\nbut it's one of the most misunderstood phrases in all of investing in corporate finance, which is\nnot because it's really a boring top. It's never been illegal. It's been around forever. But in the\n1980s, the government passed some rules that just gave companies a little more safe. I gave them\na little more comfort in buying back shares on the public markets. And so, buybacks. At their\ndefinitional core, this is freshman level finance 101, buybacks. If it's stock trading and\ntransit value is the exact same thing as paying out of cash dividend, full stop. And most people\nalready, you know, that shuts their brain down, but it's true. Now, the difference comes when a\nbuyback is executed if the stock is trading below and transit value. So, it's cheap for\nit's trading above and transit value. It's expensive because then it comes a transfer of wealth\nfrom the seller to the buyer vice versa. Nobody understands this more than Warren Buffett. He's been\nwriting about buybacks and annual letters all the way back. We use a quote of his from the 1980s.\nHe's like, there's no better use of cash if companies trading far below and transit value\nand buybacks shares. So, what happened? 1980s companies started buying back more shares. Now,\nwhy did they do that for two reasons? One, stock buybacks are flexible. You don't have to pay.\nLike, if you put out a dividend, companies are loathed to cut them. It's a signaling mechanism,\nright? They want to make sure they maintain that dividend. It's very important. They cut it,\nall of a sudden, stock tanks because every all the investors say, what's wrong with the company.\nSo, they're flexible. Second, is their tax efficient? If you're an investor in a high tax state,\nlike I am in California, the last thing you want is a company you own, a great stock,\npaying you a ton in dividends because guess what? You have to pay tax on that. So, buybacks are nice\nbecause it gives you the choice. I can sell or not. So, what we looked at is, you started to ramp up\nbuybacks in the 80s and starting in the late 90s, buybacks outpace dividends in any given year,\nalmost every year since the late 90s. Now, why is that significant? Because the vast majority of\nstrategies, if you look at all these income funds that are based on dividends, totally ignored\nbuybacks and that's insane. So, we wrote a book. It's free. We're doing a second edition this summer,\nhopefully, called Shareholder Yield, a better approach to dividend investing. And what that meant was,\nif you looked at the combination, the holistic measure of cash dividends plus net stock buybacks,\nand net is important because of the company's issuing shares. And this is particularly true in this\ncycle with stock-based compensations of the C-suite. You get a much more holistic view of income.\nAnd if you look back in the academic literature for the past, we did it for, I think, 50 years,\nother academics have done it for 100 years on Shareholder Yield. It outperforms any dividend strategy\nyou can come up with. High dividend yield, dividend growth, you name it. And so, we launched a fund.\nNow, we've launched four soon to be five funds by the time this podcast comes out on this Shareholder\nYield concept. And it's one thing to do a back test in the public academic literature. It's\nanother thing to do it with real money. And we're happy with the performance of all these funds.\nWe have a foreign fund and emerging market fund. But basically, it gives you what you're really looking\nfor in Ben Graham-esque security analysis, which is a high quality business that's generating\na ton of cash flow is keeping the C-suite honest by distributing that cash flow to Shareholder's.\nBut it's also trading at a cheap valuation, not doing it with a ton of debt. You end up with a\npretty nice portfolio. Sorry, that was the short winded description of the topic.\nNo, it was perfect. And it walks perfectly into kind of an overview of, you know, your\nlargest Shareholder Buyback fund, which is S.Y.L.D., you know, I think you gave us a very high level\nof what the fund is trying to accomplish. But is there anything in particular at a high level?\nYou'd like to talk about with S.Y.L.D. before we kind of get into the nitty gritty\noutworks. Yeah, so look, it owns a hundred stocks. It is size,\nagnostic, meaning you know, in the small ones, you can own the large ones. It goes wherever\nthe opportunity lies. S.Y.L.D. is U.S. only. It caps the sectors at a third. We don't want\nto be all in on energy or tech or something like that. And then it updates once a quarter.\nSo it has somewhere in between like a traditional index and an active management turnover\nbut in the ETF structure, it tends to be quite tax-efficient and at its core. It's a basic\nlong-only type of strategy that the positions are around 1%. And if they go up too much,\nwe'll trim them and if they go down too much, we'll add to them. But overall, that's a pretty\nis probably one of our most plain vanilla strategies in the lineup. Well, let's dive into it\na little bit deeper then. So you talk about the screening process to get to a hundred names.\nCan you go through the steps you take to kind of dwindle down your universe?\nYeah. So we start with the whole universe. And the first step is what the academics would\ncall net payout yields. Everyone calls it shareholder yield, the vernacular. There's always\nso much jargon in our world but it's basically cash dividend and net stock buybacks. So that\neliminates 75% of the companies. I think it would be a surprise to most investors\nwhere if you look at the average company in the stock market as a net stock issuer. So\nthey're issuing shares in a given year. And I think that would surprise people because you're\ngetting diluted. I'll tell you what else would surprise people. There's a lot of dividend investors\nout there. They say, hey, I bought this great high-yielding dividend stock yields 4%. But if you look\nunderneath the surface, that company is issuing 5% of market cap and shares. That stock actually\nhas a negative yield. So let that sink in. Someone thinks they're buying a 4% yielder,\nbut in reality they're getting diluted. And that's the big risk I think for a lot of investors who\nignore this metric. And part of the challenge is the buyback yield is a lot harder to dig into.\nIf you go to Yahoo Finance, go to Morningstar, they publish dividend yield. Front page of every quote,\nwhere do you find buyback yield? You got a dig around for the shares outstanding. That's changing.\nYou're starting to see more and more people talk about it as the concept becomes more widespread.\nBut so we start with that. That eliminates 75%. The company is on average coming into our portfolio,\nhave a double-digit shareholder yield. So let that sink in. That is a very large number in the\nU.S. That is majority buyback driven. Culture in the United States is much more comfortable with the\nbuybacks than the informed developed and emerging although that's changing. We then next do a\nevaluation composite. So it's screening for very traditional value metrics. Alex, you don't\nthink it matters that much. The whole point is you want to be on this side of the universe versus\nthis side of the universe. Mainly speaking, you want the companies on average companies buying\nback at punch of shares, trade cheap, and on average the companies issuing shares are expensive.\nBut we don't want to take the CEOs word for it. We want to like Warren Buffett says,\nhe'll buy back for one point three times to look. So we want to similar methodology. We want them\nto be cheap on average. Again, we mention qualities. We don't want these companies to be over\nleverage just loading up their book with a ton of debt just to buy back shares. That was less of\na concern when interest rates were zero. Now we're at 5%. I think that's becoming a very real\nconsideration for companies. The last thing we do, which is a bit unique, is you mentioned the\nintro. We're a trend following momentum shop. And on this final buy decision, so let's say we\nhave a portfolio 100 stocks already. There's two reasons companies get kicked out. Either their\nshareholder yield goes down a lot or the valuation goes up too much. Good example, we owned Apple\nfrom 2013 to 2020. And Apple eventually just went up too much and got too expensive. The valuation\nmetrics kicked it out. But let's say there's 10 names coming out of the portfolio. All right,\nwell, we have our list. We've wittled down, and let's say there's 50 names that qualify.\nThere's a final sort. We do on intermediate term momentum to pick the 10 best on momentum,\njust like a classic French FOMO momentum measure. And the goal there is to try to avoid the value\ntraps, meaning companies that are cheap, but just getting cheaper and cheaper on their way to the\ncemetery. And so that's it. That's the basics for the fund, for the foreign ones. You know,\nwe cap the countries too. We don't want a third of the country, a third of the fund in any country.\nRight now in the US, there's very little tech exposures. So I think the biggest sectors are\nenergy, materials, and financials, and industrials. Part of the problem with tech stocks in the\nUS is they tend to be on average expensive, but also they're serial share issuers. So they love\nto make it rain with the C-suite on stock-based compensation. That's actually not true in the foreign\nfunds. The emerging market fund tech is the number one sector, which I think is really interesting.\nMost people think value is an old staggy, fuddy-duddy category, but really it's time dependent\nand market-dependent, where sometimes in part of this is because the emerging markets have\ndone so poorly for the past 15 years. You know, these stocks on average are much cheaper there\nthan they are in the United States. So how often I think you might have mentioned this before,\nhow often are you re-running the screen and kind of looking at that in order to promote them out\naccordingly? And important note on this, on the momentum side, because most of our trend following\nin momentum strategies are much higher frequency than this is it's only on the bite decision.\nIf you run a strategy where momentum is on both sides, the buy and sell, you get way more turnover.\nAnd that's not the point of this fund. The point of this fund is we want to value strategy.\nHowever, adding the momentum filter in historical testing added about a percentage point in return.\nSo it's worth doing. We just don't want to do it on both sides because it introduces\nturnover, which of course has a cost to it as well. But if you do it on the bite decision, it's costless.\nBecause there's already companies coming in. You just kind of optimize the ones that you want.\nAll right. So do you have any industry or sector guardrails to avoid maybe some over\nconcentration? Is that part of the rules-based process? Yeah, and you get to this.\nYou know, a third, a third, 30% that ballpark we don't want. We don't want it to be all-end\nutilities fund at some point. So it ends up with a pretty diversified basket. But it can express\ncertain overweigh. It's at various points in times. And like mentioned, depending on the geography,\ncan be different for the various geographies as well. So I read you kind of start with this\nbase. Everything's equal weight. Kind of a what drove that decision to equal weight everything.\nI know that there's some benefits there. And how often are you bringing things back in line\nafter they drift? Is that a line with that? Yeah, we balance for. We kind of let them float\ninto quarter. It's a tonge-based rebounds. We don't really feel it matters that much to be\ngetting them back to 1% hyperactively. We will trim it if it gets above 5%\nbut for a stock to get above 5%. That means it has to be a five-packer. Right? So that's a lot.\nBut it happens because we've had to do this in the emerging market fund recently. There's a stock\nin there. And I use this in example on TV, not too long ago. And I said, you know, all you guys do is\ntalk about in video all day. And you should. I mean, it's a three trillion-dollar company on its way\nseemingly to four. One of the top stocks in the world is in a monster performer. I go, how many times\ndo you guys mention Hanme? And they said, what do you sneeze? Like what are you talking about? I\ngo, well, it's a stock that's outperformed in video over the past one and two years. It just happens\nto be located in South Korea. But nobody cares about South Korea investing because foreign stocks have\nunder performed the U.S. for so long. But this sort of leads into this huge opportunity right now\nwhere it's just too fold. If you look at market cap waiting in the U.S. So the big stock, everyone's talking\nabout this. You know, the S&P, but really dominated by these giant names, people call them the Mac\nseven or whatever. But the S&P is expensive. Like there's no real way to, you know, men's words here\nthat doesn't mean it can't get more expensive, but on average it's expensive. If you look at the\nshareholder yield basket and you can go to any quote site type in a ETF, we use morning star\nand it'll give you an x-ray of the underlying holdings. And you look at the valuation\nand across the board, it's cheaper. But in most cases it's cheaper by half. And you have an\nenvironment that's setting up very similar to other periods. The two that I would cite would be\nlate 90s and then the nifty fifties where you had this high concentration in a certain amount of\nnames. And then value type of strategies outperformed by a massive amount over the coming years.\nWe did a tweet on Twitter where we said 2024 is shaping up to be one of the worst years ever for both\nan equal weight or small cap weight versus the S&P 500. And last year wasn't good either.\nIt was one of the worst years. You had to go back to the late 90s to have even a competing year.\nAnd the other one was 1929. Not a good sample size right, but in the aftermath of that guess what,\nI think it was like 12 to the next 15 years, small caps outperformed the large caps. So there's a\nmassive opportunity for this kind of overlapping wind diagram circle of both small versus large\nand value versus expensive that's setting up right now. And could last hopefully, not just a year\ntoo, but for many years to come. Yeah. So if you're working with an advisor trying to implement\nS-L-Y-D inside of their portfolio, it's at the area of a diversified portfolio where you kind of\nallocating to a large cap, I wouldn't say large cap growth, would it be in that large cap growth?\nWhat most people do is one of two things. You know, they do the Lego or building blocks approach.\nSo if they have a 60, 40 allocation at 60% S&P, they will replace some and less often they will\nreplace all the stock exposure with this fund. So maybe they'll replace 10 or 20% of their stock\nallocation with this fund. There's people that are a lot more focused on style boxes so they do large\ncap growth, large cap value, mid-trap growth, mid-cap value in which case they'll use this fund\nas the mid-cap value category. We have a small cap version of this, which is M-Y-L-D, L-Y-L-D is our\nlarge cap version and then we have foreign emerging where we're trying to get people as many choices\nthey want, investors were coming to really appreciate, love this specific exposure. So we think that\nwe tried, we're really excited to get the small cap fund out because we said this is an opportunity\nin time that may not last forever so we want to get this fund out and that launched in January\nand that's M-Y-L-D and that focuses on the smaller names in the universe.\nYeah, we'll jump into that because I did want to touch on the other ones in this category.\nYou know, when looking at small and mid-cap companies, I'm making an assumption they probably\nhave less opportunities for finding shareholder yields but potentially more opportunities for that\npop and long-term growth. Is that kind of been your experience when looking at the small caps in\nmid-cap space? Small caps right now, there's a large chunk that are unprofitable and\nyou know, the shareholder yield by definition, the company doesn't have to be profitable\nbut to distribute 10% of your cash flow per year. You either got to be generating\ngobs of cash flow like Apple or you got to have a ton of cash in the first place or both.\nSo almost invariably we're going to screen out the unprofitable companies and on top of that\nthe unprofitable companies by definition are almost always shared issuers. They need\nfunding, it's like a biotech stock, right? So you've got to think about a biotech stock.\nNow on average, unprofitable companies, expensive companies, not good investments, you know,\nbut why are people attracted to them? It's a lottery mentality, right? Because you see the one\nthat eventually makes this. Oh, man, look at that. Ten, a hundred-bagger, but on average it's a\nterrible investing strategy and if you look at things like market cap weight versus equal weight,\non average, you know, the equal weight and then value strategies like shareholder yield\noutperform. There's a great study by Ropeco that looks at what they call conservative investing\nbut it's basically shareholder yield. They take it back to the 1800s. You know, and they find that\nusually these type of strategies don't really keep up in the romping stomping bulls. Now this\nfund has kept up, which is great. But, you know, we've had four times in history where the S&P's\ndone 15% per year for over a decade and we're in one of those periods now and the other three\nwere the internet bubble, the nifty fifties and roaring 20s. So it's not totally unique but it's rare\nfor stocks to have just crushed it for this long. But the good news is this type of strategy\nhistorically speaking has done well during the sideways periods and the bad periods for the\nbroad market because what are people flock to in bear markets? Well, they want quality. They want\nhigh cash flowing type of companies. They don't want the lottery tickets that may pay off and\noften as we've seen in prior bear markets. You know, those can have pretty nasty declines\nfrom top to bottom. Well, in touching on the other two shareholder yield ETFs you guys have,\nwhich is foreign and emerging international markets as you touched on briefly have been really\nrough over the last handful of years in comparison to the U.S. market. Are you starting to see\nany more relative value over there or is it still, we still kind of in a waiting period for\ninternational to maybe have their day again? We put out a reason article called the bear market\nand diversification, which was referencing really since this bottom in O9, U.S. stocks doing 15%\na year compound and astonishing. But the S.P.Y. is just mowed down everything else. Doesn't matter\nwhat it is, bonds real estate, foreign, emerging, everything else is underperform. But on average in\nhistorically speaking, foreign stocks and U.S. stocks, it's a coin flip. You know, what tends to do\nbetter in any given year and over time, there's markets that have been better in the S.M.P. thinking\nof Australia and South Africa historically speaking. The U.S. isn't at number one on the list,\nbut it's up there. It's been great. No question. But it's been particularly great since 2009.\nAnd if you look at a lot of the outperformance, we have an old tweet. We'll get the dates wrong now.\nBut it's at over the past 70 years, U.S. stocks have been foreign by a percent or two, a year\ncreating this much wealth in the end, how much of this outperformance has come since 2009.\nAnd the answer is all of it. So if you look at the valuations, Cliff, our buddy, Cliff,\nthousands, at AQR, did a comment where he said over the past 30 years, it's like 80 percent\nof the performance difference in U.S. versus foreign has been in multiple expansion, meaning\nthe U.S. stocks getting more expensive and foreign stocks, not. So you have this giant\nalligator jaws since 2009 where the U.S. has gone from a long term. We like to use the 10-year\nPE ratio from a PE of 12 to 35 today. Now it's not as high as 41, a couple of years ago.\nAnd it's not as high as 45 in 1999, but it's not cheap. But foreign developed and emerging\non average largely due to the performance have not. So their foreign developed is sort of high\nteams, foreign emerging is sort of mid-teens, but underneath the surface, the cheap high quality\nwe're definitely talking single-digit PE ratios. Now the companies in foreign developed and\nemerging tend to have that history of dividends more, right? So they're paying out closer to\nhalf in dividends. So you'll see these funds yielding five, six, even seven percent at times.\nBut these funds, I think they turn the corner in 2021, really at the peak of that craziness.\nAnd if you look at the foreign and emerging strategies, really having a great year this year.\nNow in the U.S., it's crazy. U.S. market cap weighted is doing awesome. Everything else.\nI think small caps are down, a handful of percent on the year, mid caps aren't doing much.\nBut however, foreign developed and emerging very quietly, I think it's kind of getting hidden\nby the S&P still. That's still creaming everything. They're having a great year.\nAnd I think they're certainly set up for some really exciting returns going forward.\nWell, just kind of like one last question as we close up here, you know, you have a very\ndiversified suite of funds. If you can go back a decade, what kind of drove that decision to launch\nthe first one. And you know, what is kind of driving you to continue to diversify?\nJust so we just had Jerry Parker on. I saw you guys just launched M.F. you together.\nThat was, it was fun to connect with him. So do you continue to see yourself expanding that line up\nand growing the suite? Jerry, one of my favorite people in the world listeners, if you haven't heard\na story, it's really great. So go back and check out that behind the ticker show.\nYou know, the criteria of investing in what do I want to put my own money into is really the number one.\nAnd so if you look at our suite of funds, you know, half of our brain is value related to the other\nhalf as trend, which you just referred to. So we have a handful of trend following funds.\nAnd in value, I think is a lot more accepted as a classic investing style, worn buffed,\nand others have done a great job promoting it. trend following, despite being around just as long,\nis a little more esoteric. And I think we're probably the most non-consensus registered investment\nadvisor in the country, where we run three allocation funds, or default allocation, which we detail\nin the paper called the Trinity portfolio, is half in trend type of strategies. And I don't know\nan RA in the country that does more than like 10 or 20%. And already, if you allocate 10 or 20,\nyou're in the 1% of investors, most people do vinyl, globally diversify the allocation, that's it.\nBut trend following to us is really the premier diversifier to a traditional portfolio, particularly\nduring the bad times. So it shows its stripes done well in 2022, and COVID, and certainly in 2009,\nand then the internet bubble burst. And it's actually having a great year this year.\nYou know, there's an old Peter Bernstein quote, I keep repeating recently that I love. He's like\nasset allocation is a defensive strategy, but it's also an offensive one, because you never know\nwhere the next big gains are coming from. And so go trendflowers this year, you know, they\ngot a big position in Coco, or things like that, but in 2022, they were short bonds. It's really\nthe only thing that helped protect those portfolios, because everyone owns bonds. And everyone owns\nUS stocks. And when both did poorly, there was nowhere to hide. So trend following is certainly a\nbig component. You know, we launch funds that we want to use. And in some cases, like we have a\ntail risk ETF, we look around and we used tons and tons of ETF from other companies. So we look\naround and we say, hey, is there a good inverse fund out there? And the problem was most of them were\neither too complicated or too expensive. And I said, well, let's go build one. We did that with a\nglobal ret ETF. I said, I don't want just a US read. I don't want a forum when I certainly don't\nwant market cap weighted, because these funds don't yield anything. So when they get killed and\n50%, 70%, you know, I want to have the high quality value exposure. And I want it to be global.\nWell, that didn't exist. And so, you know, most of our launches are under this banner. And look,\nman, if you go back, it's now over 11 years for shareholder yield. And you say, this has been one of\nthe best performing. It's I think it's the number one performing fund and it's category since\ninception. One of the best things, all our friends in the ETF world are good at is copying what's\nbeen working. I mean, how many AI funds we've seen in the past year, what's popular? The world is\nyet to embrace shareholder yield. And half the time I'm like, all right, that's a good thing,\nbecause, you know, we're the only people doing it. The other half time I think,\nam I crazy? Why isn't the world coming around to this? And part of that is just, you know,\nonce you have a built-in narrative and you have hundreds of dividend funds, it's hard to shift and\nsay, okay, just kidding, we need to start incorporating buybacks, because it comes a\nshift in narrative. And then people say, well, why didn't you do this 10, 20 years ago? That's right.\nSo we'll see that I'm, I'm sure Vanguard or Black Rock or State Street will launch a shareholder\nyield ETF the next year. So we got our weight around who will be first. Well, it's had a lot of\nsuccess so far. And, and, man, I can't take you enough for the time before I let you walk out of here,\nworking people learn more about you and find a list of all your Cambria ETFs. Not too many\nmebs in the world. So if you Google web favor, you'll, you'll find me in all sorts of places,\nyou know, we put out the content on our podcast. The web favor show, we have the free email service\nthat I'm told goes out to 150,000 investors. Excuse me, 900,000. That's the idea of farm.com.\nYou can watch me pick fights on Twitter. But the day job is Cambria funds.com where you can find\ninformation on all of our current and upcoming ETFs. Well, again, thanks for being here,\nenjoyed it. Awesome. Thank you.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}