{
  "id": "13097117",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for educational\nand entertainment purposes only.\nWelcome to Behind the Ticker.\nToday we have Dan Cupkevic.\nHe is the portfolio manager for SWAN, SWAN, and also some Ancillary Products, Icewan, and Q-Swan.\nHe is also a partner at Serity Partners, who is a massive registered investment advisory firm.\nAnd I think you're going to learn a lot today from Dan.\nWe talk about SWAN, which is a very interesting product.\nWe also talk a little bit towards the end about markets and what's going on, at least\nyour date and what we think is going to happen here in the future.\nSo please enjoy this episode with Dan Cupkevic.\nHey, Dan, welcome to the show.\nBrad, thank you for having me, I appreciate it.\nSo before we get started, why don't you tell everybody a little bit about your background\nand how you got to the position you got in today?\nYeah, no, it's a great question.\nI've been at finance almost 20 years now, so I'm a partner at Serity Partners,\nwhere I think we're the seventh largest in the country around $70 billion on the global market.\nBefore that, I worked for a more mid-sized RA called R.E. Investments Services.\nAnd I work for them as director of investments for almost a decade, as a manager for that,\nand then as a financial planner for that.\nAnd prior to that, I worked at actually Northwestern Mutual as a financial representative,\ndid a bit of general planning but also some life insurance.\nSo how did it come about for me to sort of get in to finance as a kid?\nHonestly, and I hope my parents don't listen to this because I'm in front of us a little bit.\nI don't know if I'm breaking any commandments.\nBut my dad was always a very successful kind of architect.\nHe had a young adult company did well, but they were never particularly good with money.\nSo that was always kind of, I noticed that as a child growing up,\nyou know what, I want to understand this money thing.\nSo that's where I kind of got an interest.\nI remember it in my grandma's when I was maybe 10 or 12.\nShe used to watch me in the summer.\nI watched like CNN right when they first had those ticket tapes coming in.\nAnd that was always fascinating and it was kind of like a different language.\nSo it was always kind of that curiosity on one and other-stand money.\nIt didn't really, you know, have it in or know anyone in the industry just sort of kind of,\nyou know, went to school for it, slowly learned, put out a bunch of resumes,\nand, you know, after 15, 20 years, good things happen, I guess.\nSo when did you pivot from kind of the financial advisory space?\nI know you still work with some clients, but really into the portfolio management.\nIn portfolio management.\nYou know, probably my first four or five years.\nI was primarily financial advice race.\nSince 2011, I've been mostly portfolio management side.\nSo like I'm on the investment committee for the national investment committee.\nIt's there to partners and we managed quite a few portfolios.\nBut as you said, like, I still have, I get energy as a person.\nI think, you know, as a professional or as an individual kind of evaluating what you want to do with your life,\nyou have to figure out what gives you energy, right?\nDo you like doing the analytics? Do you like meeting people?\nDo you want to be sitting at a desk all day and say, leave me alone?\nOr do you like to be kind of in the fray?\nAnd I'm more of a in the fray type of a person.\nSo I like interacting whether that's the clients or other investment professionals or financial professionals.\nSo that's kind of why I'm kind of more engaged in that area.\nBut I also like meeting with, you know, institutions and clients because\nthat's where the rubber hits the road and you can actually feel good about providing really good investment\nadvice because you can see it positive in the effect people.\nSo it's been, you know, I don't know, 12 years where I've been predominantly investment.\nBut I haven't 100% given up sort of that individual client touch that I think is important to sort of\nunderstand whatever it goes through on a day-to-day year-to-year basis and kind of the\neffectiveness of the capital markets, especially recently.\nYeah. Yeah. I think that's important to, I still have a couple of handful of family and friends\nand also some other clients as well. And I think it's important when you're on the money management\nside and the investment side to understand the struggle and how important it is to\nsee both sides of it. But before we get into Swan, we're here to talk about Swan.\nBut before we get into Swan about, what about personally? What kind of hobbies you like? I know\nyou a little bit. I know you're expecting your third child, but you might not have too many hobbies\nanymore, but what does Dan like to do when he's not managing money? Yeah, so I've been super involved\nwith basketball for a long time. I coach JV back in 2005. I've coached YMCA basketball. I've coach\nGoya, which is basically like CIO ball. So I'm in the coaching coach, my kid is a lot. I do think,\nyou know, intermediate term. I'd like to give back and kind of get into that. Maybe I'm\nhigh school level, middle school level. Obviously, watch a lot of that read up on the markets.\nI actually, so kind of a reason, I'll be up picked up. I'm brewing my own Ken Boochah.\nSo I kind of figured out, I'm trying to kind of kick so that I drink too much coke zero.\nSo I started making, you know, Sweetie, Ken Boochah. It's actually, it's pretty good.\nSo I'd recommend to check it out. So kind of some random stuff out there.\nThere you go. I did not expect to hear you say that, but I'll try it next time. Maybe we're,\nmaybe we're together. But let's dive into Swan. When did you decide to launch Swan?\nWas that running as a separate strategy and then you'd convert it into an ETF or has it been an\nETF, you know, forever? Yeah. So the ETF launched in November of 2018. However, we managed it\ninternally at our investment services going back to I think August of 2014. So there was quite\na bit of lead up before we even kind of went the ETF direction. It was kind of a proof of concept\nwith our advisors internally. You know, I came up with the idea sort of in sometime in 2013.\nI was reading options as a strategic investment and kind of was looking at different ways to\nutilize derivatives in a portfolio safely. Because I think a lot of people, when you say options,\nthey get scared and assume everything's super risky. But there's, you know, intelligent,\nmore prudent, safer ways to utilize options as well as more aggressive. So, you know, kind of\ncame up in 2013, launched in 2014 internally, had some heavy, robust academic research going into\nit before we even launched the ETF. So there's two white papers based on kind of the methodology.\nOne's called Leak and Bikes Wands. I think it was out in 2017 or 2018, written by Bill Trainer,\nDr. Induchachee, who are both, you know, involved with CERD partners. And then the second was called\nthe Barbell approach. And I was a co-author in that. So, you know, there was a lot of sort of testing\nand rigor before we even wanted to, you know, open it up to possibly venturing in the ETF market.\nSo, explain the underlying strategy of, of Swan. And I know, I know the basics of it,\nbut I think it would be important to kind of talk about it, kind of mechanically how it works.\nAnd then also, you know, what is it trying to achieve from a higher level?\nYeah. So, high level, kind of, why do you own Swan? Well, I would say you want more equity-like\nreturns than you're going to get in fixed income with less risk. So, I do think that long-term,\nSwan will get you in between six, seven, maybe eight percent annualized. So, sort of the risk return,\nmaybe a moderate portfolio or expected return of a moderate portfolio or even more risky fixed\nincome with sort of higher chart ratios and less risk. So, obviously more in the retiree phase\nwith a more conservative investor support. How does it work? It's actually fairly simple. I\nlike to go by the Einstein analogy of sort of keep everything as simple as possible, but no simpler.\nSo, it has 90 percent of the portfolio at the time of rebelling,\nwhich is an important caveat in a treasury bond letter targeting between five and 10 years of\nduration. So, it's intermediate treasury bonds and it's a bulleted ladder for ocean. That's 90 percent\nof the portfolio. So, like all sort of 90 percent safety help. And then it takes 10 percent of the\nportfolio and invest in those risky call options. And in Swan's case, it buys it on the SAP 500\nor SPY non-reline ETF ticker. So, what, as opposed to having one launch of 10 percent options,\nwe break that up in the two separate call transactions. So, there's a 5 percent allocation\nto June of any particular year and a 5 percent allocation to December. And the strategy works\nlike the clock, on the option component, where when June comes up, like we just had the June rebalance,\nwe sell that June of the current year date and then we roll it to the June of the following year date.\nAnd if there's any access from returns, we put it into the fixed income and vice versa.\nAnd then in December, kind of the same thing. So, it's 10 percent, what I like to say at home,\nrun money with those call options. They give you uncapped upside to the SAP 500, 90 percent safety\nbelt money. And in, so, kind of the long term analysis, as per some of the white papers, is it\ngets you about 90 percent of the 10 year treasury does? And it gets you about 40 to 50 percent\nof the upside of the market. And if you combine it, you know, that's kind of the expected kind of\nrisk return profile that you can get over sort of three and five year horizon.\nSo, that's interesting. And so, when you're talking to, I'm assuming because of the complexity\nof the strategy, it's not complex, it's two pieces, but it's not really a retail-based product.\nSo, I'm assuming most of the discussions you're having and most of the assets you're raising\nare from institutional clients or RRAs.\nYeah, so I would say the vast majority of conversations have been with RRAs. We have had a few\ninstitutional allocators that we've had conversations with. But I mean, there's still\nconversations that we have with brokers on regular basis. In a lot of cases, I mean, the good\nthing about sworn and the bad thing about sworn is you can use it a lot of different ways.\nI think the more kind of the broker tendency is to use it as a shorter term risk off play,\nwhere they own it for a period of time because they're worried about market turbulence\nwith the objective of getting out of it, you know, in three, six, nine, twelve months.\nWhere I think that RRAs, in my opinion, I've seen more sort of capital allocators,\nwhere they're buying it to own, you know, five, ten, fifteen percent for more in-determined\nit like that. Yeah, so that's what I was going to ask next was how advisors are seeing it and\nusing it. With the component with the call option component, though, isn't that a little bit\nbackwards to use it just as RRAscoff? So, like, what environments do you want to be owning sworn?\nYeah, so I mean, the way that I see sworn is most advantageous is in very, very good\npositive environments, meaning if the markets up 50 percent, those call options are going to\nsing beautifully in the up a tremendous amount. And you have to remember the more the market goes\nup, the larger that proportion to portfolio becomes, the call option, until rebalance. So,\ntheoretically, the more the market goes up, the more that call option can drive value for the portfolio.\nWhen, you know, likewise, when the markets do vary poorly in your down 20, 30 percent,\nlike we saw in the COVID crash, you know, the sort of bleeding stop after those call options\ngo to zero, right? After that home running money has gone, you're left with the basket of\ntreasuries. And in every year, rather than last year, which I'm sure we'll talk about at one point,\ntypically those treasuries hold their value very well. In many cases, the treasuries still\nup in value and can offset any losses of that call option. So, really good environments,\nreally bad environments. Swine should do very, very well. Where swans not going to do gray\nis in that sort of positive five to negative five environment, with the markets up a little bit\nor down a little bit, because at the end of the day, there's an opportunity cost to buy those\ncall options. And there's something called faded decay or time value decay. And if the market\ndoesn't move in our favor, right, then those options aren't going to pay off. So, there could be an\nenvironment where the markets fly ahead, right? And we're still down five or seven percent,\nbecause that call option didn't pay off. So, some kind of in that, you know, plus a standard deviation,\nthe minus one standard deviation is not as great. Those, you know, plus or minus two standard\ndeviation environments tend to be very good for this strategy. Makes a lot of sense. So, if you're\nsitting down with an advisor and they have, you know, an existing model portfolio suite,\nhow are you, where are you plugging swan in and what are you recommending in terms of allocation?\nYeah. So, as far as a sort of evergreen holding, we typically see swan in between a five to\n20 percent allocation of a globally asset allocating model. And that's where sort of maximizes\nadditional sharp ratio to a portfolio. I think it also can add rebalancing return because\nin bad years, you can shave off a swan that buy the equities, if I spurs up. And so, as kind of\nan evergreen holding, that's kind of what we've seen to be a good mix, I think, you know,\nI've also seen people use swan in lieu of just owning treasuries outright. So, they're saying,\nhey, I won't risk off fixed income, but I don't like that risk return dynamic on, you know,\nI'm going to get 4 percent or less than 4 percent on a 10-year treasury. I can still get most of\nthat, but still have a little bit of upside. So, I've seen people use it just in lieu of treasuries\noutright. I've seen people use it in lieu of high yield bonds, because it's going to get you a\nsimilar return probe all the high yield bonds without as much sort of left-tail risk or extreme\ndownside risk with spread spreads block for fixed income. But generally speaking, for the long-term\ninvestor is kind of between that 5 and 20 percent allocation. Yeah, no, that's how I would see it as well.\nAnd there's a, I want to, you know, we're focusing on swan, but don't you have another product as\nwell as an acute, is acute swan? So, we have, there's actually two other products that are sister\nstrategies to black swan that we work with Apple Feion and Q swan. So, they're basically the same concept\nof structure. The difference is with swan, it's S&P 500 equity exposure, with Q swan, which is QSWN,\nit's NASDAQ 100 equity exposure. And then there's I swan, which is Europe Asian, the Far East, EFA,\nequity exposures show the mechanics and identical. The only difference is sort of what flavor of\nequity exposure do you want for that product? So, all three of those are, you know, passive and have\nthe June and December rebounds. So, twice a year, the rebounds. So, all of the strategies are indexed\nbased, you can call it passive. We're not kind of making ad hoc adjustments based on marketing\nenvironment. It's designed to get sort of strategic exposures. So, how are you guys thinking about\nkind of on a go-forward basis, marketing and distribution of the strategy? I mean, what are your\nplans going forward? What's worked in the past and, you know, what are you looking at in the future\nas you, you know, are driving AUM to the product? Yeah, so, I mean, obviously, last year was in the\ngreat year for swan, because treasuries, you know, are treasuries later, lost 17%. So, obviously,\nwhen you kind of climb off a bad year at the challenging, you know, we really rely on amplifier\npartners. They have a whole sailing team in a distribution to kind of push the marketing. I know\nI've done sort of quarterly or semi-anially kind of webinars and videos as needed. But really,\na lot of it, too, is just getting in front of advisors and being at conferences like inside ETFs\nand having those conversations. Because, you know, with a strategy like this, it doesn't necessarily\nsell itself, right? You have to kind of have a conversation and educate people what it's about.\nBecause, I think people are kind of like, well, you know, is it a buffer strategy,\nis it a tail risk strategy, like what is it? And it's not even really either of those.\nIt's more of, you know, in my opinion, a more optimal version of, you know, a moderate portfolio\nwith a little bit different dynamic. Yeah, that's interesting. I missed, did you go down to\nInsight ETFs? I missed it to share. But this year, yeah, we worked, we actually signed up,\nbut then we ended up not going. We had too much going on because of this, our recent\nmerger with Serity Partners, we're still doing a lot of online blogging. So, I think that's the\nfirst time I've missed, you know, in 10 years, I've had a COVID, but you know, we still try to\nget out and about. So, let's pivot to markets. I enjoy getting your take when it comes to\nwhat the market's doing, what you think is going to do in the future. This year, honestly, so far,\nit's kind of surprised me. I didn't see the market kind of bleeding upwards as much as it has,\nbut like to get your take on what we've seen so far, and then we'll kind of go into what,\nmaybe we'll see in the future. Yeah, it's interesting because we've had such a narrow market,\nright? We've had the kind of the Fang stocks, research, and video went up a lot. Tesla's gone up,\nI don't know, over a hundred percent. It's kind of an echo trade from a couple years ago,\nwhich interestingly enough, like when we know the math behind it, when interest rates go up,\nlike those longer-dated earnings for those more growth-oriented companies should theoretically\nbe beat up more. And interest rates have continued to go up and we haven't seen that. So, you know,\nI'm almost equating this sort of echo trade as sort of resensivious for investors,\nlike the average investor won with these large growth names, and it's sort of happening again,\nso it's sort of reinforcing that bias. I still think a lot of those companies, and I'm not speaking\non all of them, but they're very, you know, they're priced very expensively. Like I know,\nNvidia's at like 200 times earning. And even if it grows exponentially, like, you know,\nwhat is it a 50, a 4B of 50? It's still pretty expensive. So, you know, I definitely think that there's\na higher probability where we see a more normalization of what we've seen here today.\nI do think areas like small cap are a lot more beaten up and are probably more attractive\nfrom an intermediate time horizon standpoint. But yeah, I mean, it's definitely been a weird\nyear, because the average stock hasn't done much. And we're seeing that narrow, those mega\ncaps are really returned to dominance. Yeah, I think I saw a chart. It was something like seven\nnames or a responsible for about 90% of the return this year. I saw that a couple of weeks ago.\nI don't know if that's still the case, but but I'm starting to see whispers in a narrative growing\nthat maybe the Fed can actually pull off a soft landing. Is that something you think is\npossible? I mean, we're really inverted in the yield curve, which gives me pause. I know we've\nhad a golden cross, which is 250 in moving average, which is a little bit positive. It's still\ndefinitely mixed back though. Like I've seen a lot of yellow flag. Like I don't see a green light.\nI'm not necessarily in a red light. It's more cautious. I also think a lot of people are just\nloading up on one of your treasures. If I'm not on one of your treasures, why would you do that\nwait and see? Yeah, but I think that's where all the access and money is going. I do think that\nshowed interest rates go down, which is basically being priced at the market. If the one year\ngoes down the floor or sub floor, I think the market becomes a lot more attractive. Because right\nnow, the reason I'll turn it. An interesting thing we look at when we're evaluating sort of the\nattractiveness of stocks versus bonds is sort of what the strategy is. Typically, we go further\nthan a year, but we'll just say one year, because that's the sweet spot right now versus the earnings\nyield of the market. So I think that the Ford P.E. is like 16, which is about, you know, a college\nof five-ish percent earnings yield versus a five-ish percent treasury. So it's kind of the same\nas far as what's most attractive when you're comparing stocks versus bonds, which I think a lot of\npeople are just choosing fixed things. So I do think though that if the rates come down between\nwe down the end of the year, more money will flow into equities. So long story short, whenever\nanyone in the market assumes that one thing's going to happen, and I think earlier this year,\neveryone was just saying, we're going to have a recession. It's going to be ugly. It's a\nfor sure thing. It's kind of interesting how often times that doesn't happen. So my phone is,\nit's probably 50-50. There's a 50 percent chance we could actually see a soft landing. Then we\nget a 5% percent correction, but I'm not convinced that we're going to touch the lows from last\nOctober. I'm just not convinced that's going to happen. Yes, I fully, and good thing, I don't trade\nwith my brain. I trade with computers, but I was fully expecting to test October, and I'm now in\nthe camp that you're in. I still think that there's trouble in the horizon. I think that there's\nstill think there's a real possibility that we had into a recession, but I don't necessarily\nknow if we're going to touch those lows. Going forward, I think there's still going to be some\nbumps out there, but do you see anything out there? I got no pun intended of being a black\nswan this year that could really shake things up. Is it possible that the Fed actually decides\nto hike again and break something at some point? I think it all depends on the CPI readings.\nI mean, the latest CPI came to a candidate for nine. That's pretty healthy. I think if we drop another\npercent or sub four, I think there's no reason for that to hike. Right. Like at the end of the\nday, the Fed has two objectives. Control inflation, in which that was the problem. We were at nine\npercent inflation and keep employment level. Interestingly, our key unemployment low. Interestingly,\nnow unemployment has been pretty good this whole time, even through the rate-hiking cycle,\nand theoretically, they're trying to break that a little bit, but if CPI can come down without\nthem having to break it, then I think it's a win-win situation. Of course. So to me, like the\nblack swan event is Ukraine, Russia. I think the black swan event is Taiwan, China. I think it's\nmore macroeconomic shocks that are the risk. I do think that even if we get a recession,\nI think it's decently priced at this point where we could even be in an environment like 2009,\nwhere we were in the midst of like the worst, you know, panic we've ever seen, and in a recession\nput the market bottom. So just because we're in a recession, doesn't mean that the market is not going\nto go up because we all know the market tends to lead at the economy, you know, six to 12 months.\nSo I think it's definitely an interesting environment because of the immersion of the\nyield curve. Stocks aren't super cheap, especially the bank account, and kind of like where you go\nin this type of environment, and I think black swan is actually a pretty good place to be for sort of\na moderate type of investor. Yeah, I would agree. How much does the consumer debt and credit card\ndebt and low savings, as well as kind of the looming, you know, commercial real estate,\nyou know, 2025, a lot of that comes due. How much of that worries you if at all?\nYeah, I mean, I definitely wouldn't be loading up on an office real estate, but I think everyone knows\nthat narrative. I think, you know, I know Reed's last year got beat up pretty bad. They were\ndown about 30%. So like, I think some of that starting to get priced in, like, I do, you know,\nI do think the proliferation of AI will be an interesting dynamic that we've never seen.\nAnd honestly, and I'm going to kind of go against my previous comments, but the one thing about\nlarge tech that you can equate with historical data is the scale that they provide. So if you're\nMicrosoft and you're offering barred an AI system, like you can have a million users, you can have a\nbillion users in the cost difference isn't that much. So I think the efficiencies of scale are\ninteresting that tech provides. And I do think that that very well is going to change the markets\nother than next decade. Yeah, that's interesting. I was actually talking with a friend of mine\nwho works for a pretty decent size family office. And right now, it's like a real estate grab for\nserver farms for AI. I mean, they need to go out and buy real estate and build, you know, the infrastructure\nto be able to handle the scale of AI. But I agree with you. So what do you think is the best way\nsomeone should probably be positioning themselves right now as we're looking at the second half of\nthe year? Yeah, I mean, I think the approach right now is to be to create a portfolio that is\nvery well the first five, even more than the standard sense where you don't want necessarily\ncreate a portfolio that is designed to do well in one environment. I think you want to\ncreate a portfolio that's a very robust that can still get a solid return in many type of\nthe market. Because we don't know if rates are going to stay higher for longer, continue to add\njob, come back. We don't know if we're going to go into a really ugly recession and if it's ugly\nor we get a soft land hit goes up. Is inflation going to need to come down? Or is it\nare we going to see more, you know, higher than historical inflation for the long time turn?\nSo in my opinion, you want to be broad, you want to be flat, you want to have a lot of options.\nYou know, whether that's more than just owning, you know, the style box in the U.S.,\nyou know, you want to have some international, you want to have some real asset. You want to have\nkind of a broad diversification. And I think swan can kind of fit solidly in a lot of people's portfolios,\nbut I'm not really, to me, this is not an environment where it's very clear that there's a\nclear green flag opportunity. I think there's a lot of uncertainty and we're kind of\ninvisible. A is that we've been in the last couple of years and I think it's going to last a little while.\nYeah, I would agree with that. So Dan, I want to say, you know, thank you for taking the time to do this.\nWhere can people learn more about serity, where can people learn more about swan and your\nNQ swan and I swan? Yeah, it's a serity partners, you know, serity partners.com,\nC-E-R-T-Y-P-A-R-T-E-R, you know, as both partners.com, you know, big R-I-A,\nwhere are the, I mean, the Louisville office and then swan, E-T-F, S-W-A-N, E-T-F.com,\nis amplified website with all the information on the product. Again, Dan, thank you. I always\nenjoy talking to you and good luck as you add a member to the team over there. I know you're\ngoing to be low on sleep, but, you know, good luck, man. Yeah, sir, appreciate it. Thank you. All right, thanks.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}