{
  "id": "13180068",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nToday we have Mike Venuto from Title.\nHe is also the portfolio manager of Block BLOK.\nI could have talked to Mike literally for hours, wealth of knowledge.\nIf you want insight on how to get an ETF started, if you want insight on how to get an ETF\nto work and be successful, Mike provides us a ton of knowledge.\nWe also talk a little bit about the Block ETF, the first block chain ETF released, and I think\nyou are going to find this episode really, really compelling and fun.\nWithout further ado, Mike Venuto.\nHey, Mike.\nWelcome to the show.\nThank you for inviting us excited to talk with you today.\nSure.\nI was reading up or trying to follow your bio, your busy man.\nCan you tell me a little bit about your background and how you got into the position\nthat you are today?\nYeah.\nI'd like to say it all happened very quickly and lucky and all that sort of stuff, but that's\nso far from the truth.\nIt's been an enormous amount of work.\nThe basic background is I grew up in North Carolina.\nI studied philosophy and religion.\nI came to New York primarily because my grandmother had passed and my grandfather was\nselling his estate and I'd been here every summer and loved fishing and all that fun stuff.\nIt took an internship on the New York Stock Exchange, which I believe is one of our sponsors\nfor this.\nIt's always strange when I'm there.\nWe're talking to UTS.\nI remember I worked there before most of those people who helped us.\nSo the internship, I thought I was going to use that to write an expose on how greedy\nWall Street is and all of that horrible stuff that people liked to throw out there.\nInstead, I fell in love with it.\nIt was very much a meritocracy.\nFrom there, I bounced around.\nI took my first job as a stock broker at the time, was called Wheat First Union, which became\nWat Koview.\nIt became a bunch of different things.\nI think it's owned by Wells Fargo now.\nI like to say that for that year and a half, I learned everything not to do.\nI learned how not to be a fiduciary.\nI learned how to accept rejection, all of that fun stuff because even though they were\na big firm, it still was like a bucket shop as they like to call it a Wolf of Wall Street\nkind of thing.\nFrom there, I jumped to Verizon Kinetics.\nI was like the third or fourth person there, worked my way up through the ranks there.\nThat's where I fell in love with ETFs because we were known as a company that would\nbuy 15 to 20 concentrated positions, unique stocks, and ETFs are the killer app against\nthat and I got to give credit to the management team there.\nThey recognized that and rather than run from it, they said, hey, young Mike, you go figure\nout how we're going to hedge this.\nOur hedges were great.\nWe became like one of the largest shareholders of wisdom tree in a 220 hedge fund when nobody\neven knew wisdom tree was public and we financed emerging global advisors, which is now\nColumbia Thread Needles ETF family.\nWe partnered with ice ventures.\nWe basically got behind all of these ETF startups back in 2008, 2010, that culminated with\nme leaving in 2012 with them supporting me and that they were the original partners there\nwere the original financiers of my current business.\nIn 2012, I started this company, but I also needed a day job, I'm sure you're going through\nit as well.\nI started getting ETF companies so hard and I don't know why everybody thinks it's easy.\nSo my day job was I was head of investments and a partner at global X for the for about\nthree years while I was kind of incubating title.\nToday, title is about six and a half billion in assets and we've helped about 80 ETFs\ncome to market launch and grow.\nThat certainly wasn't the original plan.\nThe original plan was more of an SMA shop, but what turns out is all the research content,\nmaterial we needed to launch SMAs was actually much better used to grow each year, right?\nThat our first client was global X, the direction and the EMQQ I was mentioning before\nthe show up here to see a friend at EMQQ.\nSo today, that's really what's become our core business is taking all that research IP,\nall the mistakes that were made in the emerging global era, the wisdom tree era, the global\nX era, the direction era, we try and help our clients not repeat the mistakes that our\nteam has made everywhere else, which is a huge leg up.\nWell, I was going to ask you this later, but I think it's better to ask it now.\nI mean, looking at your hearing that and looking at your resume, I mean, you are the true\ndefinition of an entrepreneur.\nSo tell me about some of the things you've had to learn along the way of kind of going\nout on your own and growing title from what was supposed to be an SMA business to what\nit is today.\nI mean, we all go through pivots that's part of entrepreneurship, so I love to hear a little\nbit about that.\nAll right, so I think the number one thing that I can point to is knowing what you don't\nknow or what you're not going to be good at.\nNow, there's a couple of things that come with that.\nI have an amazing partners that are equals to me in this business, right?\nLike, and I watch a lot of people try and do this as the solo per newer, it's hard\nto sell with partners, you need to recognize what you're not good at and find partners\nwho are good at that and then have a set incentives aligned.\nNumber two, everything's going to be so much harder than you think it's going to be.\nAnd it's going to cost twice as much maybe three times as much as you think it's going\nto cost.\nAnd you can't get, you can't give up every time there's a giant, you know, roadblock.\nI mean, we've had so many fits and starts and then, you know, I walk around an ETF\nconference or whatever and I was like, oh, you guys are doing so great.\nYou can graduate.\nYeah, overnight success took 11 years, so it's so much harder than people think.\nAnd that's a big part of what we try and do, like, you know, I listened to the show you\ndid with Garrett and Garrett, I have nothing but respect for him where we're competitors.\nWe actually talked yesterday.\nWe refer to each other as friend of me.\nHe's like, it's, it's, it's funny how small the ETF businesses, you know, I launched\nthe fund on his platform at one point and I had a close, you're going to, like, so, so\nlike, it taught me a ton and I said, okay, this gave me an opportunity to learn something.\nAnd so having good partners, knowing it's really hard and learning from the mistakes,\nI mean, those are some of the things that most entrepreneurs can't get in their head.\nAnd we still see it every day.\nI mean, we get pitched on average, three new ETF ideas a day and the things that people\nthink are important are so much less important and the things that really are important.\nThey don't want to hear, right?\nRight.\nHard stuff.\nI don't care that you got the next great idea.\nGood for you.\nHow are you going to market it?\nWhere's your seed capital?\nWho are your partners?\nWhat's your stick or what's your store, isn't that your, behind the tick or not, what's your\nticker?\nYeah.\nYeah.\nYeah.\nIt's funny.\nI mean, my, my father and I, I went to be, I started my kind of like entrepreneurship journey\nin 2013 and I remember him, look at me in the face, like a month after he's, like,\nyou know, you better be ready to crawl through glass if you're going to make this work.\nAnd literally, that's what it is.\nYou're just every day, things are going to hurt.\nYou're going to get dinged up.\nYou got to just keep moving and, you know, we've pivoted a couple of times.\nI mean, we started this business, our current businesses, we were going to run private\nfunds and I went to SMA research and now all of a sudden we're in the ETF business.\nSo I mean, I didn't think we'd get there, but it's just the path that you take.\nSo before we talk about title, because I have a lot of questions about title.\nPersonally, I always like to ask, what do you like to do when you're not working?\nI, you know, you mentioned Garrett, he flies planes, which I think is really cool.\nI talked to Patricia Lizaraga, who runs the WCO ETF.\nAnd not a lady I thought would be a sailboat racer, but she is.\nSo what do you like to do for fun?\nYeah, I mean, my way of relaxing is being on water in a boat, on a kayak.\nMost of the time with my kids, my latest project is my neighbor and I, my neighbor has kids that\nhave the same age as mine. We just acquired for an extremely low amount of money in 1973,\nmake-o, which is an old boat. And I have my kids painting it last weekend. I took them to the\nwelder and had them learn how to weld it. So I love everything building up to restoring something\nbeautiful and then putting it on the water and going fishing. I love to be out there on the water.\nActually, that's kind of where the title brand came around. The title brand, not only is it the\nnavigating the chaos of water and all that, but it's also the polarity, the bull in the bear market,\nthe ups and the downs, the rising tide lifts all boats. All of those things are kind of connected\nto how we ended up with that branding. That's very cool. My partner has boat and we actually went\nup there this weekend and it is, there's some about being on the water that's peaceful.\nEven though my wife screamed at me because I took our two-year-old on a jet ski and maybe it was\npushing it a little bit, but you know, you live in your learn. But let's talk about title.\nCan you tell me exactly what title does and what made you kind of alluded to how the company\nwas supposed to start as SMA, but how did it get to where it is today in the services it provides?\nYeah, so when I left Horizon Genetics, at some point we had 40 billion there and it was mostly SMAs\nhad all these fun friends that they would come to me saying, hey, can we get you on the platform\nbecause it was the hot dot? So I'm thinking, when I leave, I'm just going to call all these people up and\nsay, put me on the platform. I now have new SMAs and yeah, no, that didn't happen. They also\ncome back and when you have a three-year track record at 200 million or 100 million, we really\nrespect you guys. I'm never understood this. How are you supposed to get to two or 300 million\nif everybody tells you to come back? So, you know, we started a little wealth management practice\njust to incubate our SMAs. And it's funny, that's, at this point, that's like 600 million of\nour AUM, right? But we're actually spinning it out into a new entity to make it so it can go\ngrow with a new leadership because we're solely focused on ETFs. We're, we're spinning it out\nto Joshua Wilson in this entity called United Eatos. But it's funny, the part that, that was the\noriginal, it's still what to be sustainable for the entity we have today. So what do we do?\nThe, we took all that IP and research and we ended up using a lot of it to help a little\nblack scroll. It was a very successful partnership. And then when Guillermo and I left, and Marie\nacquired global X, we said, all right, what other ETF issuers could this work for? So then we pulled\nin Robo Global, which I think is now owned by Vettify and we pulled an EMQQ and then direction\nas clients to use our IP, our content, our research for doing SMAs, to help them sell ETFs.\nHoly shit, it worked. Now, here was the negative. It worked great for them for us to just\nkept the lights on because we didn't own the products, right? We owned, you know, whatever hard dollars\nthey paid us to use our research and content to help them get assets, then they got assets and\nthey got recurring fees. We didn't get recurring fees. So that culminated with us saying, well,\nif we're the thought leaders in the ETF industry and we have all this IP and all that stuff,\nwe came up with this amazing idea, we still run the index of it, it didn't work as an ETF,\nbut we came up with the idea of let's do an ETF that tracks all the companies making money in the\nETF industry. So we all agree that the ETF industry is growing, this is obvious, right? So\nso you know, it was wisdom tree and black rock and state street and the index provide MSCI,\nS&P, the New York Stock Exchange. It still exists. It's on our ETF thing tank website as an index.\nWe launched it with ETC with Garrett J. I have nothing negative to say about the experience.\nIt was awesome. We did everything right, except we never got assets.\nSo that brought us to the next idea, which was Eric Falcice, who was running directions\nbusiness and was a client, said, hey, guys, you just raised a hundred million for us and you're not\ngetting bips. Like what if I come over there and help you guys build a white label business\nand not only do we help people launch, but we helped them grow. Right. And so that was kind of\nthe nexus of what became modern day title today. Right. So we went from helping others grow ETFs\nto helping others launch main team and grow ETFs. And now it's been a beautiful partnership\nwith 80 funds out there. So and I was looking on the website. I was trying to understand\nall the services. We'll get to the starting from scratch launching a fund and getting them to\ngrow. We'll talk about that a little bit later. But you have four subgroups of clients. You have\nadvisory clients, sub advisory research and consulting. So can you define kind of what you do in\neach one of those four silos? Yeah. So the first one is what I would call the traditionally,\nwhat's thought of as white label. Right. It's in our trust. We're souped and not\ndoing 90% of everything. We have this great slide where it shows how complicated the industry is\nand then we show a picture of the client and the investor and we connect them and put it all the\nbit. So those are clients like so-fi. We have 80 ETFs with them. Shorea funds which is our\nindie hit. This is a group in Canada that's got three ETFs in over 500 million across them.\nNobody's ever heard of them. Eris or a vote is now their new name. That's R-par.\nSome new ones that have been surprising to people like the meat Kevin, the P.P.\nor y'all. We have some amazing ESG funds with social justice. All those things, those are kind of\nour core clients. Bob Elliott with HFND, Michael Gaia with the ATAC funds. So these are people that\nwe're doing all the back office stuff and then we're providing sales and marketing support.\nAnd something that does make us different than others is we have this eighth service and we\nhave eight buckets. Eight service is we'll also step in and take economics meaning we'll partner\nwith our clients. So it's a pretty simple math. If an ETF cost X to run, we'll come in and say\nwe'll cover X percent to 20 percent. That means when the ETF becomes profitable, we also like to\nget 20 percent of the profits. So those can be extremely painful deals because you're on the other\nside with the client. And then when they work, they can be spectacular. And we do that for about\na third of our clients. So that's the core business. That's about out of our six and a half billion.\nThat's about four point two-ish. Then we have the next bucket which is sub-advisory. And that's\nwhere we're doing the actual trading execution and basket management for tons, trust, some\nultimate trust stuff for amplifies trust. You know, a number of different places. ATAC does this too.\nSo they got Andrew over there and they do it. And then the third bucket is where we're offering\nlimited. I say limited because we don't offer all of our sales and marketing tools to people who\nare not in our trust. But we offer various accesses to our network. So the ETF think tank is our\nresearch and marketing brand or media brand. Cynthia is our head of research there from Cynthia Murphy.\nAnd essentially, over the last 11 years, we've curated an audience of people who like to learn about\nETFs. And so we help those people with education, we sponsor things like research for them,\nor getting a certificate, the thing with Edelman, we sponsor some of Darya's sales research,\nor we help them with growth hacks like their social media. So we allow companies like stage\nstreet and wisdom, tree and Columbia thread needle and EMQQ that these companies are not in our\ntrust. But they can access that network by subscribing to the ETF think tank research.\nAnd then finally, the consulting are usually clients that are probably going to launch an ETF\nor product someday. But right now they're more like an RIA and we're helping them understand\ntheir ETF strategy. And eventually, once they get past doing it as a wealth management,\nthey're going to want to launch a product someday. So in your advisory business, what you're doing\nkind of everything, are you doing everything as far as, do you are you doing admin internally or\nyou're doing trading or you're helping them with legal, obviously you're helping them with marketing.\nI mean, or you do when someone clicks that button that's on the top right of your website that says\nbuilder needs ETF, right? And they become the core a core client, do you guys do everything or\nis there some outsourcing that goes on? So I would say we 100% oversee everything, the client\nwouldn't even know if something was being outsourced and very little is outsourced at this point.\nNow, we do also make it quite allocart, not every client chooses every service, right? They\nare saying like 30% choose to have us invest alongside of them. I would say 70% choose marketing,\n50% choose sales. It all starts for us with our first bucket, which is what we call a strategic\nassessment. And this is where we sit down with the person we've probably had two or three conversations\nby now. And we say, all right, it's time for the assessment. And think of the assessment like\nlike taking a personality exam or something like that. And so we have 114 questions that we've\nscored against 70, 80 other ETF issuers that we've talked to or been pitched. I say 70, 80,\nnow I'm thinking about it. It's probably way more than that now. I think that's an old number\nbecause we do two or three of these a week, right? So when we go through, it's pretty straightforward.\nWe ask you these questions and we say, okay, we're going to click off a number from one to a hundred\nfor each of those questions compared to everyone else we've asked them to. We come back\ntwo, three days later with a seven page report that says, here's where you score on strategy versus\neveryone else that's pitched us. Here's where you score on product. Here's where you score on sales\nand here's where you score on marketing. Here's your overall score. Here's your pro form of what this\nis going to cost. And here's our suggestions. This is what we think you should think about for the\nprice. This is what we think you should think about for the, this, this is how much seed we would\nrecommend. And then, you know, this is hard, but occasionally we tell people, no, you know,\nright? And so this process is not only about them getting to know us and us, it's also about\nus getting to know them and, you know, really deciding if we're going to get somewhere because\nI don't want any TF on my platform that doesn't succeed. And I always tell my clients,\nI don't want to write you checks. When it's not succeeding, you're writing me checks. I want you\nto be receiving checks for me, not the other way around. And so the strategic\nassessment, I know it's sound simple. And I always feel like I try to oversell how awesome it is.\nBut like, like, preventing mistakes is way, way more important than what you do next. Like,\nlike, you can't, if you get the product wrong or you get the launch date wrong or the ticker\nwrong, like, I mean, I see it all the time. I was talking when somebody yesterday,\nthey have a ticker that sounds cool and it's a funny word, but no advisors are going to want\nto see that on their statement. Yeah. Like, they get lost in the things that we can help them\nprevent. All right. So once we go through the assessment, it's really nice because then they've\ngot everything in front of them. They signed an L.O.I. where, you know, 90 days to launch from there.\n75 days with the SEC 15 days in, like you said, we have legal and house. I heard Garrett say 90\nK a couple times. We charged 70. So it was just, just get full of what's going to teach him about that.\nAnd then, yeah, we've got the admin. We've got the trust compliance. We have the boards. We have\ntwo trust live today. And it'll be it now soon that we're getting a third one. And then once you're\nhere, we have all the in-house portfolio management. We also think of management as a service beyond.\nLike, so we've had clients come to us and say, you know, I want this portfolio to be managed\nactively. So I've got three or four active PMs on this staff, right? So, you know, that's,\nI know we're going to talk about block later. That's what we do a block. But we also have a number\nthat we manage actively for amplify because they wanted active managers in there. And then we have\nour marketing efforts, our sales efforts. And we make those coordinated. We call it smart growth\nprogram. It's amazing to me how many people new to this business think that sales are marketing\nor separate things. Yeah. And if they're not coordinated, they're garbage. And then, like,\nit's like, oh, but I just want to sales guy running around. Yeah. Well, what material is you using?\nWhat story is you using? What is he connecting to? What content is he following up with, like,\na whole sailor with, with a fact sheet is useless. Right. I was going to ask it. I was going\nto ask this in his perfect time to ask it. So like, it seems to me, and I've been talking to,\nyou know, I talked to a lot of advisors who think that, you know, maybe they want to run an ETF\none day. And there's this mentality, like, if I build it, they will come. And the build of dreams.\nThe money you're just going to be there. That's just, that's just not the case. Is it?\nNo. I mean, it almost never was, but it felt that way many years ago. So, like, in the\nhey, day at global X, we would log something that would be immediately approved to Morgan Stanley.\nWell, that makes things a lot easier. Right. Yeah. Like, like, like, oh, Mike, you have this\ngrew idea. Let's log that and see what happens. And then the next day, Morgan Stanley advise you\nputs 40 million into it. Right. That's never going to happen again. Right. Because it can't.\nThey've put up the gates. Right. So it's like, yeah, if you build that they will come and\nthere, there'll be circling around and sniffing, but they're not coming in. Because there's a giant\ngate around the ballpark. Yeah. You know, so look, we just had a nice hit with a round hill we did\nchat. Yep. You know, you still can get a viral concept out there at the right time product at,\nyou know, right product, right time, but everybody thinks, oh, well, that was easy. Round hill is\ndone in enormous amount of work on marketing it, getting in the right spots, getting on the right\nthings like, even something that looks like an indie hit that was just like easy. It was an\neasy. Right. No, they did enormous amount of work. We did an enormous amount of work. You just\npeople don't see that. Yeah. So I mentioned global actually, I love this whole, if they build\nit, it will come concept. I remember at the end of global X Bruno, who was one of the co-founders,\nBruno Delama, him and I were taking a walk through Manhattan and we were talking about the deal\nand getting out. And he says to me, Mike, I never want another person to pitch me their ETF idea.\nAnd I was like, why? He's like, well, you know, I pulled the wax. It's not about the idea. It's about\nthe, you know, multi-million dollar marketing budget, the brand, the website, the people go to\nalready the content that they kick out. It's the, the budgets for all these things that an idea\nthat somebody pitches you versus an idea that that global X launches, it's not the idea that makes\nit successful. It looks like it's the same and first trust, it's the same paceer, right? So like,\nthat's why they don't mind being second or third to market on things. Right. Yeah, they have\nbudget in the, in the marketing know how to keep dripping. And what do you, so what do you think\nsome of the mistakes and pitfalls like an early, somebody who's going to issue or an early\nissue or makes? And I think there's, there's probably a lot of these mistakes out there because there's\na lot of ETFs that just never get it going. And what do you think some of those mistakes are?\nI mean, so the number one thing is the P of product, right? So sometimes people come up with a product\nthat they think solves a problem, but the market doesn't. And understanding that upfront is the\nmost important thing, right? Like when we did TETF, we thought, man, this is an obvious trade.\nYou know what? In hindsight, it's not, right? The entire ETF industry makes like, they think\nI'd have to go look at my chart, but it's like, the revenue for the entire ETF industry is\nunder 20 billion, right? I think it's 13 or something right now. Okay? So who to freak investing in this\n13 billion dollar industry, right? Like, like, like, like, so like, sometimes you got to listen\nto the world, right? And then we also learned with that when everybody thought it was an ETF\nof all the ETFs, right? Like, and then I had Eric Bouchouna's constantly telling me, oh, you should\nchange the ticker to meta. And gosh, I wish I would have listened to him. And Brown Hill got that one\nand really killed it. Whatever they did, I don't know, but there's a good rumors. Like, like,\nthere's so many things that we did wrong in the product, right? We fell in love with the investment\nconcept. Like, I still, I think it said, I still run the index. And the performance is spectacular,\nrelative to the S&P relative. It's uninvestable performance, since I don't have the fund anymore.\nBut it's our biggest mistakes was not understanding the market from product. Now,\nnow let's say you get that part right, right? Like, that's next thing. You get the product right.\nYou get product market fit. You've got product market timing. I put in there also usually\nsome amount of seed, right? Because like, you don't want to be talking to RIAs when you've got\n100 grand in the ETF, because how much are they going to put in, right? So if you get product right,\nthe next thing is the biggest mistake I see with entrepreneurs in this is they get lost talking\nto each other and to their buddies and to the market makers and to this net. And they're only\nperson that should be calling these RIAs, right? Like, like, like, I've seen that lost energy.\nLike, it's fine if you want to do Twitter spaces and some webinars, podcasts like these,\nthese things are all building and credibility and all that. All the things at the NYSE offers,\nor CBO offers, or whatever. Like, there's so much free stuff that supports it, take it all.\nBut if you're not talking to four or five RIAs, allocators a day, you're wasting your time.\nAnd I've seen it over and over again, they're calling people all in there.\nMy spread is too wide. Let me call Reggie. Reggie's not going to fix your spread.\nReggie's not going to fix your spread. And RIA buying your ETF is going to fix your spread.\nSo, so yeah, those would be my two things. That's funny. The product right? And then\ndo the hard work dial the dollars. Yeah, that's funny. It is true. People have asked,\nyou know, we launched our company in 2019, we had some success raising assets. And they're like,\nwell, how did you, you know, how'd you do it? It's like, well, we just called RIAs and did demos for like\ntwo years. And like, that's just what we did during COVID. I did a thousand demos on Zoom.\nIt's hard stuff, you know, that you don't want to want to really do. And it's funny.\nYou mentioned Reggie. Remember, we launched and we were like panicked. And it's like, what is this\nbread blowing out? Why are we off a nav? We call Reggie. That's, it's just really funny. I can relate to it.\nNo, it, it, it, it makes a lot of sense. Look, actually, that's a good one to get across the new\npeople doing this. Call Reggie or, or, or called, coldness or cold, mire, or hamstered.\nWhen, when you've got a trade coming, yeah, don't use your bullets up to, to make your spread\nlook pretty. When nobody's trading, like, go get the trades. And then call Reggie and say,\nI got a trade coming. Please tighten up, right? Like, like, I've seen that wasted so many times.\nThere's only so much will out there. Market making is a loss leading business. It's not like,\nit's not like, that's how they make their money. They, they make their money in many different\nways, brand. I'm sure they do well. But that, that phone call is usually a waste. And it's amazing\nto me how people will, will make five phone calls to a market maker in zero to an RIT. Call the\nRIT. Like, everybody looks at, like, the guy had on our platform and his ATAC ones. Yeah, that\nguy has been having a couple of weeks. Awesome. He does nine to ten RIT calls a day. Yeah. Right.\nYeah. He'll send me his count. I'm like, can we talk today? Well, send me a picture of his calendar.\nIt's got nine RRA calls back to back. Yeah. Right. Like, it's, it's, it's, it's not, not a lot of\nrespect for how much work has to be done to actually succeed. Yeah. That was one of the things I was\ngoing to talk to him about because he absolutely hammers email marketing, social. I'm sure he's doing\nevery, I mean, he is, yep. There's not a, there's not an hour that goes by that I don't see him.\nAnd, you know, that that takes a lot of work. And so I'm in a couple of him in a couple of weeks.\nI'm excited for that. Before we pivot to block, and I want to talk about that for a little bit,\njust how do you see the ETF landscape may be changing? You're very deep in it. You, you know,\nthe industry better than 99% of the people. How do you see this evolving over the next, you know,\nfive, ten years? Yeah. So, look, it's very, very simple that it's just a better rapper, right?\nWice coffee's on my team calls it structure matters. The ETF structure is just in terms of\ncomparing it to LPs, SMAs, mutual funds. It's a better rapper, right? You've got more tax efficiency.\nAnd there's very little guarantees in the world of finance, but for a taxable investor,\nI can guarantee the exact same strategy in an ETF versus an SMA or mutual fund. It's got to be\nbetter in an ETF. Yeah. So, you know, we are going to see this wave of mutual fund conversions.\nIt's funny because I get, I hear all the time. Well, that's going to be great for you and for\nWest and for Garrett. I don't think that's going to be that huge for white laborers. Right.\nAll right. There's, you know, an indie mutual fund is not, you know, we'll get, we'll get those.\nI'll get them. We're doing one right now, but I don't think that's the big wave. The big wave is\nthe giant mutual funds that need to convert. Yeah. And they're not going white label. So it doesn't\nmatter. What I've seen is the most amazing waves right now. Number one active. Yeah. You would\ntell me active would be what it is today three years ago. I'd be like, I don't see it. Even though,\nI have one of the most successful active funds this early afternoon. And then what I did that,\nmy partners were like, are you sure, Mike? And that was back. We did block 2018. And I was like,\nyes, this has to be active. But the wave of active in ETF is amazing to me. And I think part of it is\nthat products have gotten more complex. I think rural 18F4 has done more for the ETF industry than\n611, which was the ETF rule, 18F4 is the derivatives rule. We've seen a massive hit on our platform\nwith the yield max suite where the guys at Zaga are generating yield off of single security. So\nlong, long Tesla, cell calls against it and get a yield. The yields have written anywhere from like\n30 to 80% depending on what the volatility of Tesla is that month. So active is a big thing,\ncomplicated is a big thing. Mutual fund conversions will be a big thing. But I don't think it's going\nto be a big too big of a thing at the indie level. Most of the indie mutual funds either\nwere successful and they're going to stay there or they weren't successful in a closed. Yeah.\nSo those are probably the three big trends that I'm seeing the most right now in the ETF industry.\nYeah, that's great. So let's pivot the block. Yeah. And you said successful launch\ncongratulations. Can you explain to me the strategy behind block? Yeah. So earlier in this conversation\nwe talked about TETF, right? So this is ETF and the ETF industry. And we we ran that I think\nas an ETF like 2013 or 14 to like 17 or 15 to 17. Sometime in early 2017,\nat a market watch interview and the Fox News building and they're interviewing me about the\nwhole industry. And the last question was, what is the greatest threat to the ETF industry?\nAnd I said, blockchain. Some day all this stuff is going to go from our traditional rails\nonto the blockchain and they laughed at me. There's like a video of it somewhere on the internet\nwhere they're like chuckling. But that really was a nexus point for me, right? So we had just tried\nthis ETF of the ETF industry. We realized the revenue was this small. Started researching blockchain\nwas starting to buy in our SMAs, you know, things in the blockchain space. Because I saw it as a\nthreat to ETFs, right? Like just like when I was at horizon kinetics we saw ETFs as a threat to\nconcentrated SMAs and hedge funds. I saw blockchain as a threat to ETFs. So I said, let me get ahead of\nthis. And it was just really lucky timing. We had the ticker. We actually had BLOC and BLOQ\nand Phil Bach had BLOK and Phil was building his trading sub advisory business. That's how we actually\ngot to work with him. And at the exact same time, amplify was going down the path of doing a\npassive version of a blockchain fund with an index from EQM in this gentleman Gabriel Rojo.\nWe all just kind of came together at the same time. And so there needs to be a blockchain fund,\nbut we decided to quit and be passive at the time, which was a huge difference in 2018.\nLike now everything's active. Like 90% of the things that get pitched to me are active.\nSo the reason we said it had to be active was at that time, companies were just changing their\nname to XYZ blockchain. How can an index deal with that? It's ironic because that same argument\nis why the one we just did with Round Hill chat. They would active for the same reasons,\nbecause they're worried that companies are just going to say, I'm an AI wash, right? Yeah,\nblack, black wash. Now you got AI wash, you've had you've had dot com wash, right?\nI've Burton Malky wrote about this in Random Walk 50 years ago, right? So that's a really interesting\nthing in the ETF world is the new form of active. It's not always about, you know,\noverweighting and underweighting or tilting or some sort of factor. Sometimes it's\nactively trying to achieve a theme in an inefficient market. So block is pretty simple.\nEven though we weren't able to say the word blockchain in the name back then, the SEC literally\ncalled us the day before launch and told us to change the name. But we had the ticker and that made\nit so people understood what we were doing. And now there is, I think, 19 funds that do this stuff.\nYeah. And block is larger than the other 18 combined, which is amazing when you include like\nfidelity and Schwab and BlackRock and first trust and stuff. I think the reason is block is an\nactual active fund where we actually meet with the management and know what's going on and it's a\ndiversified fund. So it falls under the rules of diversification. So we're never 80 percent in the\nminers or like I see some of the passive ones. I've seen them where they're, you know, 18 percent\nin a single security that could be Coinbase or, you know, we never have more, we stop adding to a\nposition when it hits 5 percent. So block is a strategy where we're trying to, you know, participate\nin this change over to blockchain. Now we talked about TTF, the ETF industry in 13, 14 billion\ncrypto miners made like 30 to 40 billion. Then you have like boring blockchain, you know, the IBM\nusing this or that or morask using supply chain. That's like another 30, 40 billion. So\nthere's that product market fit, right? Like it's got the revenue where people care.\nWait. I think I understand like the security selection piece. How are you, since it's active,\nare you, how are you waiting inside the index, you know, those those picks? So we set it up very much\nlike thinking like an indexer, right? So a core position one that is, you know, got true revenue\nfrom the blockchain space and has the liquidity and the maturity, that's going to get weighted at\n3 percent and allowed to float up to 5. And a non-core is going to get weighted at 1 percent\nallowed to float up to 3. Now the second level is that we've got eight segments. We used to have\nseven, we just added one about nine months ago. So there's no like gix thing for Bitcoin miners,\nright? So so we had to create our own segments, right? And so we have things like crypto miners,\nwe have conglomerates, we have a semiconductor bucket, you know, and figuring out which semi\ncompanies are actually making chips that are used in this space is not easy. But that's again\nwhy we talk to management. What we learn, talking to management is more about the supply chain and\nthe other companies than we do about those companies themselves. We have exposure to crypto itself.\nSo we own some of the Canadian spot Bitcoin ETFs in block and we have not only do we own micro strategies,\nwe also own his bonds. That's another thing block can do that. No one else has done we own bonds.\nSo you know, we bought micro strategy bonds the last time crypto collapsed and it was just like,\nokay, this is better in the cap structure. We're going to participate and, you know, so um,\nyeah, so the the weighting system is based on core non core and not allowing any segment to\nbecome more than 25 percent of the overall portfolio. Yeah, that's interesting. And so as far as\nadoption of that product, um, I would, I would, I'm making an assumption here. I would assume you have\na good bit of retail in that product. But the way that it's put together, I'm sure that there's some\ninstitutional adoption of that as well. And already. So we've been through the due diligence at\nMorgan Stanley and I think Wells Fargo. So like, but we talk here a lot about the indie and how hard\nis block is actually on the other side now, right? Because it was early and it was done in a way with\nthe institutional mindset. Now it actually has a vote against a lot of the indie. Like, it's going to\nbe very hard for even BlackRock to get their version of a blockchain ETF approved at Morgan Stanley,\nright? Yeah, it doesn't have the assets, doesn't have the liquidity. So it's, it's cross that\nchasm and now is benefiting from some of the the unfairness in the early parts of the ETF\nindustry. So yes, I'm sure we have retail in there. But mostly who I talk to about it are\nlarge RIAs and family offices and Morgan and Wells Fargo kind of advisors. Yeah, that makes a lot of\nsense. But look, Mike, this was, uh, this was great. And I learned some, I learned some things today.\nI'm sure some people will learn some things as well. And look, I really appreciate your time. And\nI hope, uh, I get the opportunity to run into you at some time in the future in an industry event and\nsay hello. But again, I really appreciate your time and enjoy yourself in LA for the short time that\nyou're there. Well, look, good for you, man. I really appreciate you having me. I mean, but I\nappreciate that you're out there doing this every day. And that's what, I mean, to be that's probably\nthe biggest lesson from all the things we talked about today. This is a grind. And if you're not\ndoing what Brad's doing or Guy ads doing or Bob Elliott's doing, you're then just going to be\ncomplaining that it's not working. You're the one not working. Yeah, thanks so much. You got it right\nWell, Mike, thank you very much. And I hope talk to you soon. Thank you.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}