{
  "id": "13223762",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nToday we have Michael Geid, he is a CEO and founder of ATAC Funds.\nHe's a portfolio manager of two ETFs, Roro and Jojo, which is risk on risk off and junk\non junk off.\nHe also has a mutual fund, but a lot of you might have some familiarity with Michael from\nall of his work that he does on social media, whether it be podcasts, videos, articles,\ndoes a lot of market commentary, and he's really out there active in the community providing\ninformation.\nI absolutely loved this conversation with Michael.\nWe talk about entrepreneurship, we talk about strategies, and we talk about the funds as he\nsees them going forward.\nSo I really hope you enjoy this conversation with Michael Geid.\nMichael, welcome to the show.\nIt's great to have you.\nI appreciate the invite as always you.\nSo I have a lot I want to get into with you today, but let's start with your background.\nI'd love to hear about your background.\nI'd love to hear about how you got to where you are today.\nSo you know the, I don't know if you have kids, but it's true that kids are very good at\nreplicating their parents and mimicking what their parents' patterns and behaviors are.\nSo family history here, so my father came from Egypt to the US as an immigrant, one of\nthe stories we had no money, worth it a gas station for a small amount of time, because\nhe had to make some money, and found its way into IBM, got an MBA, loved, and fell in love\nwith the stock market, and then ended up working at Merrill Lynch, where he was on Bob\nFerrell's team in the mid to late 1980s, for those that don't know the name, I encourage\nto look up Bob Ferrell's 10 rules.\nHe was kind of this legendary technician when it came to investing, he came to markets.\nMy father was on his team, I grew up seeing that, he left, started his own investment\nadvisory firm in 1991 as a recall, grew that $2 billion assets, large cap growth was the mandate,\nand then had his own hedge fund, and a lot of my passion for markets really kind of stems\nfrom me mimicking going back to that point, his own passion for markets, and not just passion\nfor markets, but passion for being on his board.\nHe was always a kind of guy that wanted to build and have a better life, never stopped working.\nHe himself was a big believer in cycles, and I think a lot of point of today starts from kind\nof the framework that he kind of approached life with.\nBut I joined the family business in actor college, my father passed an o-8, I was on a\npage to take off the business, had a stage where I was debating whether to get an MBA\nto reset my career because I was just as the GFC was taking place, and I was a nobody, nobody\nknew my name, I just got in the CFA charter in 2008, horrible timing, didn't matter to try\nto get a job, right?\nAnd ended up working for a family office for a year, after that year, so I don't want\nto have more than one client, we're for a small RA, started doing writing, started getting\na lot of content out there, and eventually launching a YouTube fund, traveling across the\ncountry, building a social media following, putting unique research out there, launching\ntwo ETFs, and despite all that, still the entrepreneur, because they haven't quite gotten\nto where I hope that would be at this point.\nYeah, and that's one and awesome story, and I can relate, and you're so right, my passion\nreally came from, and it's funny, my dad had sold a business of his, and he took stock,\nand so he was constantly watching that thing, and he'd come home and turn on, you know,\nCNBC, Jim Cramer, and that's where I got my bug, you know, and it rubbed off on me, so\na little bit of a similar path, I actually started my career in family office as well, so,\nbut I ask everybody, before we jump into the nuts and bolts of the interview, what do you\nlike to do when you're not working?\nYou know, what do you have any hobbies, you have any things that are other than chasing\nyour kids around, what do you like to do?\nWell, you know, I decided that for those that are, I've never worked at a family office,\nyou can appreciate this, when you work for a family office, the 80s and credit aspects\nof the family are really pretty remarkable, very wealthy people tend to be a little bit\nnutty.\nYeah, you know, in a good way, in a bad way, but they tend to be a little bit nutty, especially\nwhen you're interacting with a family dynamics, who's going to take the assets, and\nI guess that.\nOkay, so the truth is, I don't really do very much outside of work, because I've got a\nlot of different things I'm trying to expose myself to in terms of running my funds,\nrunning the research, which is separate from the funds, doing other work related to title\nfinancial group, which is the advisor already, then I'm wondering, you know, music is a\nbig passion of mine, I'm a songwriter, I've got guitar, bass, literally, yeah, I can turn\nin my head right, and I can see it hang on the wall, so I'm a big fan of music just\nfrom a creativity perspective, but yeah, it's like, yeah, that's right, I think when\nyou are passionate about something, there's the element of it that it's also fun,\nright?\nYou know, that's what I think of as work, it's cliche, right?\nIt's like if you enjoy what you do, you're not a work a day in your life, that's not\nalways the case for all that has to do with the business, right?\nRight.\nA lot of my, on my days are canly just focus on building, and this is the thing\nwhich I think underappreciated, a lot of people talk about, well, the market's open from\n930 to 4 Eastern, and then you can call it a day, it's like, no, no, if you're not\nsure, it doesn't matter what domain you're in, you've got to keep pushing, you've got\nto keep building, you've got to devote your time, and it's hard, right, because like,\nI don't necessarily believe in the idea of a work-life balance, but I mean, either\nas basis, that narrative is just not true.\nIf you're going to be an entrepreneur and you want to build, time is the most precious\nresource, the most finite, and it's the one you have to use most effectively, right?\nAnd it takes a lot of time to build a business and to build a name, it's to build a presence.\nSo, you know, it's like, you can't have in the middle, you're either going to be all\nin committed, which means you don't have much time for yourself, and really enjoy things\noutside of your work, or you take the risk, and, you know, yeah, you might fail, but at\nleast you have a chance of really being something bigger.\nYeah, and it's with entrepreneurs, especially that entrepreneur mindset where you want\nto continue to grow, it's, you know, every time we accomplish something, it ends up becoming\nanother starting line, right?\nI mean, you, I think people come in and say, we're going to launch an ETF, and we're\ngoing to launch a product, and this is it, well, you've just got started, you know, that's\nyour new starting line.\nSo, yeah, it really never ends, and you're so right, and I try to pick up guitar and\ncollege, and I am just, I have zero musical talent whatsoever, I have, so good for you\nfor being able to play, I tried, but let's talk about the content for a little bit, and\nI gave you, I feel like I know you a little bit, because I've been seeing you every day,\ntwice a day, three times a day, for years.\nLet's talk about how you're able to do that, or is it, do you have a team, or are you just\nin there every single day, elbows out, and generating all this content, whether it be\nvideo, audio, you know, I see all the clips on Seeking Alpha, you know, there's a lot out\nthere.\nSo, can you talk a little bit about how you manage that?\nYeah, okay.\nSo, let's take a step back.\nSo, first of all, the, let me approach you for the standpoint of why I put the content\nout there as much as I do, because some people seem to think that I'm doing that because\nI'm trying to diversify a way from my world, which is my funds, as the Oscar wrote.\nIn the fund business, there's only really two ways to grow either mutual fund or ETF to\nraise assets.\nRight.\nThat old school traditional way is you have an army of wholesalers, it's very expensive.\nAll right.\nWe're doing boots on the ground, they're out there, they're doing the state dinners, they're\ndoing the golf, they're developing relationships, and they might get an allocation, if you're\nperforming to something, they like the whole set.\nOkay.\nThe other model is to say, view yourself as a publisher, where you're putting a lot of\ncontent out, which is not really into your funds, right, which is related to you as the\nbrand name, right?\nAnd build that audience, and then hopefully there's a halo effect because people see\nyour content, and then they realize, oh, this guy actually manages funds too, yep, let me\ntake a look at the funds, right.\nSo, I've always had kind of more that mindset in terms of my approach to content, publisher\nfirst, and hopefully in monetize it really through the funds, right?\nYep.\nSo, to your question, do I have a team, of course I do, I mean, I'd be insane not to,\neverything goes to me, and I'm the guy that develops the ideas, but you have to do that,\nand you also have to recognize that different frameworks work for different platforms,\nand different ways of communicating work better in some ways, and so on platform with\nanother.\nSo, yeah, when I deal with people on calls, or when I do podcasts like this, obviously it's\nvery professional, right, because that's what I'm obviously going for, and that's kind\nof at the core of who I am.\nWhen I write things for Seeking Alpha, or write pieces on the lead layer for it, much more\nanalytical, much more deeper die showing charts, explaining the reasoning.\nWhen I tweet, I'm very loud, yeah, and like people say, oh, you know, you're, you're\na portfolio manager, and you're coming across so emotional and aggressive, and you're\ncursing.\nIt's like, okay, I have 740,000 Twitter followers.\nPeople want to be entertained, and the truth is, the algorithm does amplify that, not\nmy opinion.\nSo, yeah, it's like, I believe in being compliantly Machiavellian, compliantly the\nends justify the means, right, from that standpoint.\nSo, from that perspective, it's like, all right, if that's what gets attention, that's what\nI'm going to be as a persona.\nBut everything is ultimately about trying to build that, that brand name, that presence,\nand hopefully have the halo effect, right, of people then seeing that I have these funds,\nA-Tattra, Roonjojo.\nNow, the thing is, of course, you can have an audience.\nThey might like you and believe in you, but you're approaching me and I'll be working, because\nyou have to be in a cycle that doesn't favor your approach, right, and this is where I think\na lot of people get tripped up.\nThey don't distinguish between me as an analyst and rules-based strategies that would run\nthe exact same way if I die tomorrow, that are, yes, based on my intellectual capital, intellectual\nproperty.\nI'm not behind it.\nI'm the entrepreneur that's funding it.\nBut they can't seemingly understand that, like, everything else in the business, they're\nenvironments that favor what you do, environments that don't favor what you do, and that's\ntotally independent of me providing analysis and market commentary.\nRight.\nAnd I think patients, the ability to have the patients, especially, we run a rules-based\nstrategy, you run rules-based strategies, and we know when they're going to work, we\nknow when they're not going to work sometimes.\nAnd so, you know, you got to be patient in this game, I think.\nAnd as a follow-up to that question, I actually interviewed Mike Fennudo on this podcast.\nHe's coming out next week, and he was also saying to me not only is, he was giving you\na compliment, not only are you out there doing content generation, but you are heavily\ntalking to clients and RAAs and prospects.\nAnd so, you know, how are you fitting, whenever we schedule this, it seems as if you're\nvery meticulous and organized when it comes to scheduling, because you're getting pulled\nin a lot of direction.\nSo how do you balance that?\nAre you blocking off time to say, okay, these are my client calls, this is my content,\nthis is my podcast, this is what I'll do, guests, you know, how are you organizing\nyour day?\nI don't know, it's a, first of all, you know, it's not uncommon for me that do 10 to\n15 calls per day, right?\nAnd those are our conversations with prospects unrelated to my funds related to partners\nof ours that I help try to get in front of the right types of allocators that's related\nto those that are interested in launching ETFs at Title Financial Group.\nSo to your point, it's got me, it's highly highly organized, right?\nAnd I don't schedule the calls, I always say give a calendar link and people schedule.\nAnd whenever I happen to have a availability, I'm happy to spend time.\nI would do that by the way, for subscribers to the Lead Lack report, which again is a\ntotally separate entity from Title Financial Group, meaning, yeah, I've got over 1,000 pain\nsubscribers.\nI will literally one by one, do a mail number, or just say, listen, yeah, if you want to talk\nmarkets, here's my calendar link.\nBecause I do believe that especially because it's rules based I can do this, I have the\ntime to do this.\nLife is a series of scratch off tickets, right, meaning you've got to, you don't know\nwhich scratch off ticket is going to pay off for you, right?\nAnd I view every relationship like a scratch off ticket, right?\nYou don't know who you're going to help and who's going to help you, which I don't believe\nin burning bridges unless somebody's really going after me in a really aggressive way.\nBut it's a lot of organization, it's a lot of, you know, going back to that earlier\npoint about, you know, what do I do for fun?\nIt's, this is why I don't have much time because I'm constantly putting constant out there,\ndoing podcasts, talking one-on-one of people.\nSo a lot of what people see on Twitter, they think I'm just kidding all day, it's like,\nI should be focusing on so many things, I have so much time.\nIt's like, no, it's that old expression if you want something done, give it to a busy person,\nright?\nAnd really is that.\nAnd the organization for it is really, really, really critical, like, I'm very adamant.\nIf I have a 30 minute phone call conversation, I don't go, I'm going to pop up that,\nbecause I guess I'll answer.\nYeah.\nWell, that's great.\nAnd I've never heard the scratch off ticket analogy before I like that.\nI might have to use it.\nBut let's pivot, because I want to get into your funds, that's why you're here.\nI want to talk a first about ATAC mutual fund.\nThat was your first baby.\nSo what made you decide to launch that and can you talk a little bit about the strategy?\nYeah, actually, it's funny, because you, uh, this goes back to cycles, okay?\nSo when I was at the other RIA, when I launched prior to launching the mutual fund ATACs,\nI was going to let me, you know, the presence, you know, was writing on seeking out\nfor I had written for Mark Fobber, the Bloomberg would do report,\nthe rate goals, uh, John Moldin, this contributing content.\nAnd I got a pretty big, at that time, a call right now, I say, it's more conditions,\nbecause I think I've matured in a way that I think about workers.\nBut back then, I had a pretty big call saying, I think there's a summer crash happening\nin 20, or that's going to come in 2011.\nYou can see those, those pieces, those are still out there.\nYou know, you had that August crash, SP's down 17% in three weeks.\nI was the only one that was aggressively saying it very aggressively saying in a pretty much\nevery single writing like 17 articles of which in the title sets summer crash.\nSo it happened, then I hustled to try to get a journalist to talk about it, then I started\ngetting the media, and all the while I had created, basically, an assembly match,\na counter strategy around this kind of risk on risk off.\nThen in 2011, Gibbs Verify Performance of that Composite was up like in a half percent.\nIn 2012, the Gibbs Verify Performance of that Composite was 45%.\nNo, right?\nAnd because I was getting so much media attention, I was kind of on fire at the time,\ndoing Bloomberg CNBC almost every day.\nIt's like, all right, well, let me launch a mutual fund with my partner at the RA.\nSo I launched the ATAC Rotation, what I then called the ATAC Rotation Inflation Rotation Fund,\nwas the original name.\nWe've since removed the word inflation.\nNow, I haven't launched that strategy the day before quantitative easing three began.\nOkay, now that's actually a very important marker for a lot of reasons.\nSo, the back testing on the model was really strong.\nThe actual performance in 2011, 2012, for the SMA Composite was very strong.\nRotating risk on offense equities with leverage, risk off defense, treasuries,\nlong duration, and the risk on side is rotational across large caps,\nbut more importantly, small caps and emerging markets.\nBecause if you think about from an asset location perspective,\nwhat's the only way you beat the SMP?\nIt's one of two ways in the absence of leverage.\nIf you're going to be equity along only, you tilt smaller or you tilt international.\nRight, that's it.\nIt's not stockpicking, right?\nFrom an asset location perspective, that's all you can do, really to ultimately beat the S&P in a\nmeaningful way, assuming the cycles in your favor.\nSo, develop the model for the Composites, bring it to the mutual fund.\nDay before QE3, the effective quantitative easing three was that you effectively killed off left\ntail risk, which means you have an approach that thrives on risk off on treasuries, on\nin high volatility sequences for stocks, and every time you get a signal,\nthe market says screw you and keep going on.\nYep. And that's because the cycle was so dominated by money printing,\nit's gouache of all, squash of all authority.\nLike he didn't work so, playing beef.\nNo, yeah. Right, and there's been a lot of not just for me, but for a lot of active\nmanagers, right, which tend to thrive from down side.\nAnd you know, out of the gate, the mutual fund did well.\nIt had, you know, people were throwing allocations to it because they saw me in the media,\nand I was on fire with a lot of things. QE3 happens.\nAnd then on top of that, it wasn't just a function of a cycle that, with the except of 2020,\nit was purely risk on him. And, you know, late 2018, with the Christmas Eve Masker.\nIt was also that it purely was dominated by large caps, the cycle, the fame for no one.\nYeah. Yeah. So, here I am, I created a model, which prior to 2012,\nassumed there would be occasional risk off periods. But then on top of that, it assumed that\nrisk on man persistence in small caps, and persistence in emergency markets to try to benefit\noff of that drift that momentum, small caps peaked relative to large caps in 2014.\nEmergency markets, as you know, have been like volatile cash, debt by a thousand costs,\nyou know, have gone nowhere while the SV has been the only game now.\nSo, what I mentioned all that in the conscious mutual fund, my timing for launching that fund was\nhorrible with hindsight, because I happened to enter a cycle that favored pure risk on,\nwhich meant a lot of whipsaws around risk off, and pure large caps, which meant a lot of\nwhipsaws around risk on small caps for a small emergency markets. So, that fund only really had\ntwo good years. 2017, lowest quality year in history, a lot of whipsaws around a risk off,\nbut small caps and emerging markets had real drift that year. So, the new fund was up\n27% in 2017. And then 2020, yet the COVID crash, it's in treasuries, it ends 2020, up 72%.\nAside from that, it's just an English, right? And it does go back to this point that every\nstrategy is a function of the cycle that you operate in. I need a very particular environment for\nreally old my funds. I need an environment where there's some left tail risk to have a chance\nof getting risk off right. I need an environment where it's not just about large caps. We haven't\nhad that in a while. Yeah. And yeah, I have the same in the strategies where we run, we need\nleft tail risk, and we need large caps to perform. So, you and I would probably perform quite\nwell in similar years. Right. Just that curiosity, since you've launched the other two funds,\nwhich we're going to talk about here in a second, why choose to continue to keep a tag as a\nmutual fund? And not good. Oh, okay, that's interesting, okay. So, a couple of reasons. First of all,\nI differ from my colleagues in the view that ETF will fully replace the mutual fund industry.\nAnd I say that because I think there's an incentive misalignment. So, a couple of things. First of all,\nas you know, inside baseball, right, with major wirehouses, like UBS, for example, and other firms,\nmore insanely so much of what they want to get paid for having your strategy on the shelf.\nRight. So, usually they think if one's called the 12B one side of the feed, right, the platform\nfeed coming from the fund. They want to get paid just to have to be available. They do the diligence\nand now successful for their advisors, but they want their share. Okay. So, why has it,\nhouses don't have an incentive to open the floodgates up to ETFs because they don't have that\nfeed that they can grant. Okay. So, that's an incentive assignment there. The other incentive\nmisalignment is that wholesaler salespeople really don't want to promote ETFs. And there's a very\nreal reason for that as opposed to mutual funds, which is that it's hard to get paid on what you raise.\nSo, in the mutual fund world, you can track flows, meaning you have a some wholesaler or some\nsalesman, they ask them advise a relationship that advisor ends up allocating, you can actually\nsee that flow. You can identify with the advisors on mutual fund end, and then you can compensate\nthe wholesaler, the salesperson, with something because you can actually tie it to that effort.\nWith ETFs, you can't track it. You actually, for the most part, don't really know who the buyers\nand sellers are. So, if you're a salesman or salesman in wholesaler and you have your\npresent with a choice, do I promote a mutual fund where I can get paid more because it's\ntrackable or do I promote an ETF or it's not trackable? What are you going to choose?\nOf course, you're going to choose a mutual fund. Right. So, to your point about why not, why keep it\nthe way it is? Because first of all, I've already got some, you know, presence on wire hazards\nthat would not consider an ETF. I've got some legacy there. But, I do also think that some\nadvisors just naturally prefer the mutual fund vehicle, independent of the tax inefficiency of it compared\nto an ETF. Yeah. That's interesting. And I agree with all of it. It's funny. I was talking to\na handful of ETF issuers. And it's like, we're maybe the only business that I can think of,\nwhere you just don't know who your customer is. Like, someone can buy the fund and be the biggest\nfan of it. And I have no idea who they are. I can't follow up with them. I can't build a relationship\nwith them and it makes them way harder to retain because of that. It's just very strange. I wish\nthey would wish there was some insight. But there's another dynamic which I think is also important\nreal quick, which is that. And I still see it even though I think it's better than it was.\nBut it's like, why did I create the mutual fund back in 2012 as opposed to ETF structure?\nAll right. The thing that worried me the most back then, and again, I think it's better now,\nbut it's still a problem is people confuse volume with liquidity. So, you have any ETF that comes out\nand, you know, you may believe in the strategy, you may like to performance, but the volume\nnot there is not trading, right? Because people are not buying and selling or transacted. Because\nyou can see the volume, traders and investors say, ah, you know, it looks like it's a liquid.\nI don't want to buy this, this ETF. Because it doesn't have the the movement. Even though\nthe volume is irrelevant, because it's about the underlying, right, where the liquidity is driven\nand you're fine, and you do a limit order and you'll never have any exit issues or anyway,\nbut it's going to fill the floor. So, with mutual funds, you don't see that. So, you don't have\nvolume, right? It's just price once a day. And that's it. So, my point is, volume I would argue\nis actually a big detractor in getting assets, especially for newer ETFs, whereas that's not even\nthe data point to consider the mutual fund. Yeah, I've had to do, let's call it education,\ncontinual education on this, because we're fund funds, as you run fund funds, and the liquidity\nis the underlying of what we're trading and not, you know, and so it just comes to education and\nseems like everybody needs educated on that, but anyways, let's move on. I want to talk\naround Jojo. Let's start with Roro. It's extremely interesting strategy. It's extremely\nsimple. You have very thoughtful. So, can you kind of walk me through the idea behind the strategy\nand also talk me through the strategy mechanics itself? Yeah, and it's also a one that\nno different than ATX and Jojo. I timed wrongly in terms of wind to launch, because there\nrelies on long-duration treasures to play the safe and risk off side. Okay, so like the mutual\nfund, it's rules-based. They are indices that are back tested. Somebody looked them up on market\nvector.com and see the theoretical returns of the Roro strategy and the Jojo strategy. The ETFs\nare designed to try to track those indices. So, the comfort for example, it's actually based\non one of these papers that I'm known for, that won the 2015 Foundas Award as a sort of starting point.\nBasically, the idea here is that lumber is a talent housing. So, the average home is 16,000\nboard feet of lumber. lumber is highly correlated housing starts. It's probably your best real-time\nway of seeing the demand for construction activity. Housing makes up 18% of the economies GDP,\nand as lumber goes, so too, typically does home values. So, if you believe that housing is leading\nindicator, you have to believe lumber is leading indicator. Just like, by the way, if you believe\nindustrial activity is leading indicator, well, then copper. All right, it's the same kind of concept,\nbut in this case, I'd argue it's far more predicted because most people's wealth is in their homes.\nNow, you compare it against gold, which is more of a safe-haven flight to safety type of commodity.\nIt turns out that usually when lumber is out of the foamy gold, stock market volatility is lower,\nwhen gold is out of the foamy lumber, stock market volatility is higher. Based on my opinion,\nbased on pure fact, and it relates to that idea that why would lumber be doing well,\nbecause it means housing is going to be well. Why would gold be doing well again,\nflumber, because it suggests there's this kind of credit contraction. Now, that's sort of\nthat the core, which impacts volatility. So, in 2020, when the mutual fund attacks got the COVID\ncrash, right, it was in treasuries made January in Wondration, TLT. It's up by 30, 40% coming off the low,\nand then go through the decadies. I tell my colleagues a title, listen, I learned a lot from\nmutual fund space. With hindsight, I think I made the mutual fund overly complicated, right?\nAnd not necessarily in terms of the strategy, but in terms of the communication,\nin risk on, risk off, in two of these treasuries as signals, small cap, and emergency market,\nlike you have to keep it simple, also in a story perspective. So, I said, okay,\nthis time, I got this lumber to gold relationship. People find interesting,\nat the percentage of all the process of country. Let's create an ETF. So, we went out,\nstarted that process, created the index with market vector, and it's a very,\nvery, very simple to your point approach. So, if lumber outperforms golds of less,\nreally short-term period, it's short-term time period, it goes risk on leveraged,\n1.3x small cap large growth, right? If gold outperforms lumber, it goes all-in long-duration\ntreasuries, you know, TLT is your proxy. So, it's only playing with kind of three parts of the\nmarketplace. Small cap large growth, risk on levered static, risk off long-duration treasuries,\nwhich tells you why I went through so much hell last year. So, I always go back to this point,\nas you mentioned, if you run rules based strategy, I'm sure you can relate to this. Every strategy\nis a function of three things. What's your signal? What's your look-back period on the signal?\nBut then, most importantly, which people really appreciate, what is your opportunity set?\nSo, the problem is I launch November 2020, I don't know, okay, 2021, nothing's right home about.\nBut then, here comes 2022. It's a risk off year, right, in the sense that you have\non-everage higher volatility, you have on-everage equities going down, you know, quite a bit,\nactually at the lows. But you have for the first time a history long-duration treasuries\nlosing more money than equities, right? And the signal was actually a risk off the bulk of the year,\nbut because the expression of risk off from the rules based perspective is long-duration treasuries,\nfor good or reason, by the way. Yeah. I could do nothing but take the pain. I called it hell.\nYeah, I called it. And they're the same dynamic with the attacks of the attacks,\nand each of them can be short-horrations, same dynamic with Joe Joe, which doesn't use leverage\nas the bond things. So, they all have this commonality that they all rely on that flight to\nsafety dynamic in treasuries. So, it had a horrible, horrible drawdown. Now, the thing is,\nit's like I launched the funds for a reason. Last year was an anomaly. A lot of people say,\neverybody could have seen this coming. I completely, completely disagree. Not from the same point\nof the idea that stocks and bonds are broken lose money. It's about the how, it's about the\ninteraction. I keep going back to this point that 59% of the weeks in 2022, the S&P 500 lost using\nweekly data that was negative. The only other time you had that kind of sequence was 1931. But then\non top of that, the number of weeks that long-duration treasuries lost money that yields rose was 74%\nof the year, most ever in history, germs of the sequence. So, you have an extreme in terms of the\npath behavior of equities. Number of, as a standalone, extreme in terms of the number of\nweeks that you'll lost money with treasuries, you have a weekly approach to aren't rotate the two,\nyou're damped. You can't possibly work with that. So, I launched it these after a long time.\nNow, and then Joe Joe 2021, I launched the same idea treasuries as the savior. Now, the thing is,\nlike, there's always this sort of interesting dynamic in this business, which, again, I'm sure\nyou can relate to, which is that you launched some approach that's not warming out of the gate.\nRight? Psycho doesn't favor it. You believe it. You know the research, but you also know that\nmarkets live in a long term, but we live in a small sample. So, people don't care about long-term\ndata. They care about what you've done really lately. You want to not want to have you done for me\nover multiple years. Right? So, there's an interesting question you have to ask yourself,\nas an entrepreneur in this business. Are you keeping a fund or strategy alive\nbecause you believe in it or are you doing the wrong thing by keeping a life subsidizing the expense\nbecause you're falling for some cost fallacy. Right? That you're committed to the approach,\nbut it's just not working, but you, yeah. So, you keep throwing money good money after bad or\nif you do decide it's some cost fallacy in which case you close that strategy,\nare you then closing it at the very moment that strategy is about to turn around? Yeah.\nAre you selling the low in data approach, which is not raising assets, which is not raising\nassets because the performance sucks because the cycle doesn't favor in that moment time,\nthat methodology. Right? And I'll say that is nobody on Fintwit,\nnobody that's outside of the business can possibly understand how challenging that is because you\ndon't know the answer to that except for hindsight. Right? Right? Like, I believe in my approach,\nI know the research, I know the cycle dynamics. I know that I happen to launch. It's not\nintroduced in a show all the data of how unusual the last decade has been because of really\nQE3 breaking a lot of intermarker ratios. Does that mean that I should give up after 10 years\non Mutualner? Does that mean I should give up on Roro after just went through a historic collapse\nin the risk off life safety trade or if I could do it all over again, what I would I today\nlaunch the funds now. Right? Right? And like the answer is on the quickly, if I could,\nif I knew the current force I'd had entered a year like last year, I wouldn't have launched. I'd\nlaunch now though because now you've got room to make money and treasures again. You have to\nthe entire dynamic. That's why there's a part of that that has been wildly frustrated and has\nthe anxiety is every I've ever launched Nur does. Right? And putting myself out there and that's\nnervous, but at the same time it's like I'm also oddly, really optimistic. You also have to get past\na lot of these dynamics which still are, I'd argue, very kind of unusual post-coped. Yeah,\nthat's, and it is like we said earlier, timing is can be everything and, you know,\n2020, too, was just a horrible year. I mean, even if somebody was past of 64 years, I mean, every\nsingle story broke. Even well broke, well, yeah, everything's not in June. Yeah, that was it.\nAnd there to follow up price, it always looks easy with hindsight. Yeah, but again,\nit goes back to it's not about the influence, about the answer between the influence,\nit's about the sequence, the path. I have one more quick question, simple question about Raro.\nOr is it a real-time trigger, or you said that they're indexed approach, so is it a, is it,\nthey pass technically pass of strategies? It's definitely active because it's using weekly\nweekly decision points, which are sent by the index provider, then we basically rotate based on that.\nOkay, got you. And then let's touch briefly. I know we're running out of time here. Can we touch\njust really briefly the strategy on JoJo, what that rotational looks like? Yeah, so it's not\nit's it's a similar conceptually to everything else that. So the idea here is that risk on risk\noff of our volatility, which is why you want treasuries because usually in high volatility\nsequences for stocks, there's a flight to safety trade in treasuries. So there's also a link between\nvolatility and equities and credit spread widening. So if you look at the vix and you overlay\nit against option, it's just a credit spreads, you'll see like a one for one relationship. Basically,\nwhat happens is when you have high vulnerabilities, the plan market perceives it as increased\nto fortress. So junk debt widened against trepally and that's why we get events.\nSo the whole idea of JoJo is not to use lumber to gold, it's actually to use the utilities\nrelationship. Same idea though, utilities are from the market, typically higher volatility,\nthe other form, lower volatility, low volatility regime is going to be good for credit narrowing,\nhigh volatility regime is going to be better for credit widening. So in that case, it's either\nall in junk debt, as the junk on risk on expression utilities, or all in long duration treasuries.\nNow again, it's frustrating thing about last year is that the junk was treasuries.\nYeah. Right, it was duration. So that approach really does need as a bond rotation strategy.\nReally does need a spread event. It needs to have one of these blowouts where junk debt\nis yielding like 20, 30% because everyone's just dumping it while treasuries yields are dropping.\nSo you make money and treasuries and then hopefully you go back to the high yield and much higher yields.\nWhen do you get the junk on signal back? You're going to have to launch it at the one time.\nIt's not as easy as it's just factual. I 2020-21. So now the thing is, I really do believe,\nand yeah, you can argue and bias on this. I don't disagree on that, by the way.\nI really do believe there is a credit event out there. And whether or not that fun can get it\nfully or even partial, I have no idea because the signal has to get it right. I believe in signals.\nBut I at least need to have a chance. And that chance needs, I need to have some\nvaulted and some risk off. Now if I'm right, they have a credit event. Flight-to-safety research\nrecession happens and suddenly there's convexity in the performance hopefully of all of my funds.\nAnd this becomes then the real big challenge, which is that suddenly people start chasing the performance\nof the funds, what they should be buying it now in advance of that. Yes. We struggle with that.\nA lot is strategy performance chasing and then they go, hey, wait a minute, this thing was up\n50% last year. So yeah, we should have bought it the year prior. It is manning that people do not\nunderstand that it is. And there's so many studies on this. You look at the morning store,\nwhat they call the morning star hurts. Those funds that are ranked like five stars, the last three\nfive years tend to be among the lowest decimal. The next year of our year, those that were in the\nworst one star, or the last three five years tend to be in the four five star category. Why?\nBecause their cycles have mean a version. People forget that most money is not made after performance\nalready happened. It happens at the turn of the trend. Yeah. And that's it's hard for people to\nreally understand that because everyone is just a basement trading, squirrely online technician\nand they want to see momentum already take place, not understanding how compound works. Yeah. So true.\nTwo quick last questions. When you're talking to advisors and RIAs, where are you suggesting\nthere? Where are you sliding in row row and Joe Joe? It's part of an overall model portfolio\nallocation. Yeah, I'm happy to look at it. I mean, these funds are never meant to be core\nholdings. Right. Right. The world would meant to be alternative five, 10%. Because they're very active,\nyou know, it's people think I'm anti-passive. It's not I mean as I pass it, I just believe\nin diversification. Yeah. I'm shouting strange, you say, but it's like diversification isn't\npassive asset classes, diversification is also diversification of strategies, which I have a very\nparticular type of approach that needs a very particular cycle. I need a cycle which is not\ndominated by large gaps and where there's risk off. If you're in a cycle that does not have\nthose dynamics passive, SMP is beautiful. It's actually the ultimate diversifier again for what I do.\nYeah. All they know. But because it's so active and because the true this, most of the time,\nthe SMP is the winner, although by magnitude, I can really catch up like I did in 8x and 20\nfunny with the right setup. You better to blend the two, right? But do it waiting wise properly.\nSo much more than five, 10% range got satellite of the core satellite approach. JoJo,\nI actually think of the three funds becomes the most interesting because at least it's got\nyield and income because it's a bond strategy. That can be a larger waiting. As you believe,\nthere's a credit event out there. People will be shocked at how I hope at least that fund can\nsuddenly be the number one fund in the bond category because all you need is one of these credit\nevents and hopefully get most of it right, then define like years of performance.\nSo last question, more of a fun question. Have you trademarked the word few yet? Or when do you\npull out the few? Well, a few understand that few is not for me. As I always say, it's like\nI start doing that because the whole Bitcoin Naxi crowd went after me in 2021 and that was\nthey were saying, if you were to say this, you know, it would have mean those from 2017. So\nbecause I'm a very stubborn guy, I started basically stealing that from Bitcoin Naxi because I\nthought it was ridiculous the way that the corporate was playing out. So then I added\nexquisite and atrocious, I put the lumbering gold eyes to poke fun with it. Yeah, so it's like\nand it goes back to my point about the persona on Twitter, right? It's like I'm trying to be\nentertaining because the reality is, I don't know what else to be. You know, going back to this\npoint about people can't differentiate between me and the analyst and my own funds. So I went\nthrough horrible horrible draw to unless you're, right? If I'm going to be a dry analyst, people\nwant to see my research and say, why the hell should I pay attention to you? You have crappy\nyour funds did. Totally ignore the context, the anomaly, the illness, the nature of last year.\nSo I don't keep the attention. I have to be somewhat loud, somewhat entertaining at the\nframe things in ways that people will say, you know what, this could actually be onto something,\neven those funds didn't do so well, right? And I have to basically buy time for the cycle to come\nto me, right? It's like people think that this is me being, you know, going off the rails. No,\nit's actually a very purposeful strategy because I don't know what else to do to keep the\nattention on me and then by extension of my funds when the funds have gone through such a big\ndrawdown and nobody's going to look at the funds now until after the fact, but by the time\nthey realize they have the facts before it's already happened. So I've got to just keep out there\nas much as possible. That's why it's a stubborn list though. Yeah. Well, I got a good chuckle\nwhen I saw the lumber and gold eyes. It really was funny. And look, I really appreciate your time.\nThis was super informative. I wish you all the best of luck. I also look forward to hopefully\nrun into you at a conference someday and shake hands in person. So again, thank you for taking\nthe time to sit with us and and working people find out about your funds. Yeah, that's it's\nATAC funds.com, ATAC, ATAC, tactical. It's just a plane on that terminology. And then I'm on\nat Lee Lagaport on Twitter and Scram YouTube Facebook and of course Lee Lagaport.com also on\nSubstack. So I am as you were saying in the beginning, right? Like, I'm in a lot of different places.\nAs I like to say, I am everywhere, but I'm also nowhere at the same time. Yeah. Well, Michael,\nthank you again and I appreciate your time. I appreciate your time.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}