{
  "id": "13307234",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nToday we have Mr. John Forelines from Donnie Hugh Forelines.\nThey have a really unique and diversified business.\nThey do have a model portfolio business.\nThey have an ETF business, and they also have a mutual fund business.\nJohn is a finance veteran.\nStarted at some of the larger institutions until he started his 4A into entrepreneurship\nand running his own firms.\nSo today we are going to talk specifically about their enhanced real asset ETF, which\nis Ticker DFRA.\nThey also have a high yield ETF and a risk-managed innovation ETF that we touch on.\nAnd we also hit very quickly their mutual fund business.\nJohn is a great guy.\nReally think you are going to enjoy this conversation with Mr. John Forelines.\nHey, John.\nWelcome to the show.\nHey, Brad.\nThanks for having me.\nI appreciate the time.\nSo today we have John Forelines from Donnie Hugh Forelines.\nWe're going to talk about DFRA, which is their yield enhanced real estate ETF.\nBut before we get into a John, I always like to hear about your background and how you\ngot into the position that you are today.\nI asked myself that question every day.\nThe long story story is I have just a sort of bin in a lot of different places.\nI started out actually as an English economic smasher in school and then came to New York\nbecause nobody was hiring jobs back in the time I graduated, which is probably recalls\nthe time of the 21% prime.\nSo went back to law school and when came back to New York and worked as a lawyer for\nabout four and a half years and basically what you would call the predecessors to what\nETFs are today.\nIt was in structured products, building vehicles for banks and institutions that allowed\nthem to say take a view on the DAX versus the NASDAQ or etc.\nAnd how also have yield attached to it.\nSo there were floors, caps, collars, you name it.\nIt was a derivative business.\nIt's very similar to the process that goes into selecting ETFs or portfolio basically.\nSo that's how I got started and then I went through a number of career permutations.\nJP Morgan at the time where I went was, after practicing law, was in tremendous flux.\nThey had the view, it was just correct.\nThe glass teague was going to go down under the Clinton administration and so a number\nof us who had worked in London had been secunded back to New York to essentially build\nan investment bank because they knew we were going to get powers to underwrite debt,\nequities, etc.\nAnd so that's, you know, I took over, well, a co-ran private equity for a bit, which was\nmy introduction to sort of the innovation side of the world because our largest as a single\nassignment was essentially helping liquidate a very large commercial bank portfolio of venture\ncompanies.\nThey were trying to get out of it because of the real estate crash high interest rates I mentioned.\nAnd so really, that's where I really met a lot of people in the tech side of the business.\nAnd then the next job, of course, I had was to run with another Morgan partner technology\nmedian telecom.\nAnd so that's where I've had my technology event, which is of course one or other ETS innovation.\nAnd so after that, in 2000, I was able to get out at the market peak, it was just a good\ntime.\nI mean, I think more anything else.\nAnd I helped Morgan liquidate a couple of their investments that we've made as part\nof the tech process and therefore I got my stock and equity and all that stuff out,\nwhich is good.\nAnd I started a family office, which exists today, which essentially does, I guess most\nof the thing you'd say, it does over the period of time, which is now 20 some odd years,\nis to find financial services or fintech opportunities that I can either operate or I found\nsomeone who's really good and I want to go in and go in with them.\nAnd so that's what the predecessor firm, which merged in with Oni who was, it was essentially\na quantitative and engineered ETF set of portfolios that were for broker dealers.\nAnd in 2009, that was actually a novel concept because there's only about 600 billion\nof ETFs outstanding, compressive with the trades that are now outstanding.\nAnd I remember going into brokers and with proposals to essentially sell the import\nfolios for on-use to their advisors and I'd get, I'd have six to seven pages in there\non what an ETF is and it just, it was amazing time.\nSo I sold that company to Don Hugh, which was a long time Boston base, tactical manager\nin 2017, and that's the results at firm, which is Don Hugh for on-use now, where we have\nan investment committee that essentially is more of an asset allocation committee now because\na lot of our, and you know this probably from your own firm, a lot of our stuff is built\ninto the ETF itself, which includes stocks screening and also in certain cases,\ntiming. And so, you know, our view is that the world's change and you need to constantly\nrefresh your product suite and you need to, you need to do a lot of these, communicate\nto people about what you do, because the old models, I think, have since, really since\n2018, 2019, have changed a lot. And that's, so that was a long answer to, you know, how\nI got here and what do I, you know, about my background, but that's a pretty good picture.\nYeah. Well, I'd say you made a good decision leaving, being an English teacher or a history\nteacher, but that you mentioned, and you know, congratulations on your success. And before we jump\ninto the firm, I always like to ask, what do you like to do when you're not working? What are\nsome hobbies that you have that keep you busy outside the office? So that's a great, great\nquestion. Number one, you know, I've got two grandkids now, I like to be around them, so that's\nan easy answer, and it's also probably the most truthful one. So, in terms of a bit of ask,\nif they're around and, and there's something else to do, I'll choose them. Yeah. And I like to,\nI like to work in, in gardens, so we've had, you know, two main properties since I've been up here\nin New York, and I've worked them all, and I'm now working on another one. So, that's really\ngood. Cool. You know, I'm moving dirt around, putting flowers and trees and stuff in. And then\nI'd probably, I don't know if you knew this or not, but I actually, I saw your, you know,\nyou made a reference to teaching. I still, I have three courses I teach at Duke University\non one day in each semester, so I teach on Thursdays each semester, and it's an economics,\nand it's a decision science oriented stuff. So, that's a real, that's a real passion, too. I thought\nI'd do that for about two years, back in 2012, but I've, you know, continued to do it, and I think\nit's something that I think about a lot, but, you know, how can you get better? Teachings one of\nthose things where, especially at university, where you're constantly challenged to get better\nevery semester, if you just mail it in, you know, students know that faster than anybody.\nSo, well, all three of those things are really fulfilling, and so, you know, it's good to hear,\nI've, I tried to plant my first garden this year is not going well, so maybe when we're off the,\noff the call, I can have some questions, but I don't think, I don't have a single vegetable yet,\nbut that's just me being an office. So, we're going to talk about DFRA, but before we do,\nlet's talk about the firm as a whole. Can you explain what services that your firm offers outside\nof the fund business? Yeah, so basically, the way, and this is, this is post 2017, because\nprior to 2017, Donnie had, Donnie, he offered a suite of products that were mostly in the mutual\nfund field, along with some SMAs, that were all around essentially risk, risk on risk of\nmethodology. That's the way to describe it. So, for example, if they had a dividend strategy that\ndividend strategy, they fully invested until certain market signals materialized, and then they\nwould switch to some type of treasuries. For a period of time, excuse me, and we brought, as I was\nengineered portfolios over, and it was pretty good mix, because all of a sudden, we had a different\nmix of broker dealers that we were serving, they were serving a different kind of broker dealer.\nMostly, they were more on the RIA side, so it was a pretty good fit, but something really weird happened,\nand you probably remember this, in 2018, prior to 2018, most of us were using either\nBlackRock or State Street type products to build portfolios. And we also, and we had a great relationship,\nours was more with the BlackRock team, mainly because they were in New York, I was in New York,\nand back in 2019, they took a real interest in young firms, like I had, so there's a lot of\nloyalty there, but what happened in 2017, 2018, is they decided to get into our business, basically.\nAnd worse, they started pricing their portfolios at zero, meaning they were essentially offering\nprop products in a kind of a free wrapper. So that was a kind of a killer, we had to really act fast,\nbut we did, we started transitioning our portfolios over so that we also had low zero to low fees,\nand that's where we had to do a lot of engineering about, and forcing we had it in all the different\npermutations of funds and ETS that we could build those portfolios to mimic what we were doing before\nwithout, with the third party products. Yeah, I think for those of us who were kind of in the\nmodel management or portfolio management, direct to RIA or brokers, that race to zero is real,\nobviously, and it's a real challenge for us to be able to both of us to be able, but we got a\nshow our differentiation, why it's worse the fee that we need to charge, because we definitely don't\nhave the scale, but we run very similar businesses, and I think we have the same investments\nphilosophy in many ways. We cut the cookie differently, but in our opinion, in your opinion,\nI don't want to put words in your mouth, but the risk of stance is often important sometimes.\nAnd so why is it important for investors and advisors really to implement some strategies\naround sound risk management techniques over just by and hold and modern portfolio theory?\nWell, it's rooted in psychology, and it's rooted directly into behavioral science, really.\nAnd I always laugh because people say, gee, if you're if you're Mark Witz who unfortunately passed\naway this week, or if you're running those long-term models, you just stay invested or the long\nhaul, you might want to rebound every now and then, big deal, but you'll do fine, and that is true,\nthat is absolutely true. And then I guess it was probably around 12, about 15 years ago,\nGMO came up with a seminal paper on basically, you have to look at,\nif you look at your portfolio that you're just managing your sister's money, you'll be out of\nbusiness soon. And Schiller at Yale picked up on this, and he basically said, look, it's probably\ntrue, the long-termist. Schiller won the Nobel Prize the same time as a long-termist one,\nbut if you do that, if you manage your, if you're an advisor, money manager, and you run your\nbusiness like that, every, every time a business cycle shifts over, or there's radical change\nin the market, like a 2008, you're going to lose clients. So, and in truth, if the behavioral science\npart of it is that typically, if you look at the risk reward spectrum, people are much more likely\nabout two and a half, three times more likely to be risk-averse with things like money and\ntheir health and other things that are important than gain seeking. So, that's really what we both\nbuilt our philosophy around, which is, and you know, we discussed this before, Brad, there's times\nwhen it can be painful as an advisor because the markets are going up because of monetary policies,\nnothing you can do about it, right? But to be poised to help out during those times of large\ndrawdowns, I think, is an important function. And it's one of the reasons why there are firms\nlike ours around because enough people, you know, believe that, gee, I don't have the emotional\nstability to make it through another 2008 again. I'm very happy with a certain level to returns\nand I actually, and it's true, if you've got a lot of folks and brokers who understand that strategy,\none of the things you'll find out is when you have a really good year from a nominal standpoint,\nyou know, good return year, there's questions asked about you. Like, how come you did so well,\nyou know, which is, which is absolutely different from, you know, a lot of people's experience when\nthey think about an investment manager, gee, I got a lot of good returns. Well, that's not really\nthe business, is it? The business is how much risk did you manage along the way and how much are\nyou willing to tolerate? And so that's what our businesses are about and it's a matter of constant\ncommunication and especially in markets where like this one, last few years, where we've been flooded\nwith monetary stimulus, it could be kind of daunting. Yeah, I would agree. And what I found in my\ncareer, you have a longer career than I have had, but it seems to me every time I talk to an investor\nor an advisor who says, well, you know, I want risky investments and I want to beat the markets.\nThey're generally the first person calling me or panicking when there's drawdown, right? So,\nyou know, I think that there's a place, whether it's a part of an overall model portfolio,\nto have something in there that can be risk off and make decisions in which is what I want to talk\nabout. So, in terms of your risk on and risk off decision-making across the book, as well as,\nyou know, potentially in your funds, which we're going to get to, how are those investment decisions\ngetting made or is everything rules based in systematic or how are you guys going about the\nprocess of making decisions? Okay, so the actual ETFs and funds are very much rules based.\nAnd for example, the one you mentioned, it's good way to kind of start the discussion with\nthat really having to get too deep into it. DFRA was it was it engineered by us because, you know,\nwe felt there was kind of a gap in the marketplace for an alternative type vehicle that actually\nhad yield attached to it, which is why it's called the yield enhanced real asset,\nETF. And so the philosophy in that, which is the same philosophy you think about, it's kind of like\nthe one I kind of grew up with, which is private equity, is that there's nothing better, you know,\na lot of the way screens and managers look at companies is wrong in our view in the public markets.\nAnd we look at it like private market folks do, we look just at our version of free cash flow.\nAnd so if you're looking at free cash flow, you're, you're not looking at manipulated earnings or,\nyou know, charges here and there and all the other stuff. It's just basically money of, you know,\nit's available for investors. And, and that, that is built, that methodology is actually built\ninto the screens and DFRA, which is we're looking for opportunities, which includes, you know,\nrates, includes companies that are in, you know, you would call them more like the commodity\nbusinesses in real estate that, that actually offer really good cash flow. And then they sort of\nfit into our philosophies. Okay, how, how much do we want with oil, how much do we want with real estate,\nhow much do we want with other components, like soft components. So that's not dissemilar, right?\nThat's not dissemilar from how you build a commodity ETF. But that first part is. And so what you end\nup with is you end up with really high quality type opportunities, but the, the yields you get are\nalso pretty high. And the yield, our, for my review is less, you know, suspect. It's, it's coming out of cash flow.\nGot it. And so that's how that's the philosophy behind what I call the, in fact, all our ETF\nproducts are built like that. But it's a good way to kind of ground your, you know, ground the\nconversation about how we start to build. And that's the first step. And then the second step is really,\nokay, now you have these products, you know, there's certain ETFs that are cash flow oriented\nand others that aren't, but they're all tactical in the sense. And they all, for example, have either\nsignals built into them. In fact, they all do, except one, and I get into that a little bit.\nAnd, you know, the bottom line is that stuff runs pretty well. And as you probably know,\nthere are times where it doesn't work well, but that's okay because that's, you know, it's,\nat least, if the, if market metrics, traditional market metrics, which define elevated risk\nare in place, we may miss some returns. That's the way it is. Now, in terms of just the actual\ndoing it, it's an allocation process where we have a lot to choose from, right? And you have percentages\nyou can choose from. And, and that's important, too. So if you, if you decide, you so, for example,\nyou may want to switch to an ETF in the portfolio that's in cash or treasuries,\nbecause you want to raise cash, that's how you do it as opposed to we're going to sell something.\nSo it sounds, you just to like, just to get clear on this. So it sounds like you have a\nrules-based screen that's going out and sourcing opportunities. You have a rules-based way you\nwant to construct this portfolio. In terms of those, kind of holistically, in terms of allocation\ndecisions to what pops up into your screen, is that something you guys do as an investment committee\nand and kind of choose how you want to wait things or is that also a systematic decision?\nWell, once the portfolio gets formed, it becomes more systematic, because once it's there\nand it exists, so say, for example, the global tactical allocation portfolio, which consists of\nDonny who forlines products, including the ETF products, a lot of the stuff is working,\nthe way it should work, and then the questions going to be, is there any other circumstances?\nThis is your engineering point. Are there other circumstances where we need to probably be\neither more cost or less cost. And that typically, you think about a global tactical allocation\nportfolio is at neutral, something like 60% risk on, or classic risk on, I should say, because\nas we now know, it's very possible in a 60-40 portfolio or in our case, probably since that\n60 includes alternatives, it's very possible for everything to correlate, and that strategy is\nsort of flawed, so you had, that's another reason where you may want to engineer something.\nYeah, the last thing I want to get into before we jump into DFRA is the risk off or risk on\nsignal, or those derived by looking at certain macroeconomic indicators, or are you combining\nthat with technical, you don't have to get into the secret sauce, that's not what I'm asking,\nbut how are those decisions derived and what things are you looking at?\nYeah, so what happens is they were all built with exception of GTA, which is the ones we brought to\nthe table. They're all built around long-term, going back to the creation of high yield,\nmarket performance, and what happened in those markets, in other words, the indexes themselves\nare built that way. So the signals that come off of them are historically based, but there's a lot of\nthis happened the same way each business cycle, right? So that's probably most of what we have,\nthe two of the ETFs, which doesn't include DFRA, are built around the notion that\nthat signal should be probably just around a potential recession, meaning that's the\nprobably the largest drawdown you're going to have either right before or during it, and that's\nwhen you need that signal to kick in. The others probably have a little faster twitch, and that's\nmore of a function of the fact that if you look in the last 20 years, the incidence of volatility\nis greater than it used to be. It's volatility used to be here and then not here here and not here.\nWell, now it's almost always here. Right. Yeah, it seems like the frequency of a 20 percent\ndrawdown is becoming, you know, every 18 to 24 months at this point, and definitely more instances.\nSo let's talk about DFRA. We touched on it a little bit, but let's really kind of help\nadvisors and investors understand it, which is DFRA is your yield enhanced real estate asset ETF.\nCan you define for me yield enhanced real assets? Yes, yield enhanced real assets are basically\nobviously high yielding companies, which are comprising the screen. We really start with a\nRussell 3000 and screen for companies that have high dividends, but they are well supported by\nfree cash flow. So that's how the screen initially kicks through. And then, of course, we're looking\nfor diverse mix in there across all alternatives. You end up primarily in with real estate rates\nand companies who are in the oil transmission business, that kind of thing. But still, it's consistently\nhigh yielding portfolio. And frankly, it's less volatile because of that free cash flow notion.\nThat's just historically that relationship has stayed constant. Got it. So so the fund, what is\nthe fund specifically trying to accomplish? I think you just answered this, but are you kicking off\nlike monthly yield or is that kind of the purpose of owning it? Can you just talk about\nwhat you're really trying to fit or where this is really trying to fit inside a model portfolio?\nIt's a sleeve product and a model portfolio that actually does contain two aspects. One,\nto the extent that we're in periods where alternatives are non correlated to stocks and bonds,\nit does provide that. And most of the time, it does do that. For example, we're going to appear\nnow where that is the case. But if you look at the constituents, which are rates,\ninfrastructure, oil and gas, commodities, natural resources, you're looking for strong free cash flow\nand a high quality of earnings and a high dividend yield. Most people who buy it and it's\ninteresting because it goes to that notion we said earlier. It's a very popular instrument\nin this now higher interest rate environment, even where people do want steady yield. So for example,\nit's often used in retirement portfolios where it does kick off that high yield. And yet,\nit doesn't have, it doesn't typically track what else is in there, which includes their\ntypical smattering of stock and bond holdings. So as far as communicating with a\nadvisor in a model portfolio, what ETF are holding in there would you most likely try to get them\nto replace or peel from to add DFRA? That's a good question. I think the main replacement\nis your typical commodity ETF. A lot of times, we used to notice that advisors would incorporate say,\noh, I'm just going to throw in the energy ETF, actually, or something like that into a portfolio\nand say, look, that now I've got alternatives in here, right? Or they would use ones that\nwere structured of those types of instruments. And so we felt like that was lacking in the sense\nthat yet, at some point, be less correlative to stocks and bonds, but not really. Historically,\nthat's not true. So you have to have the other pieces in there in order to make that even possible,\nnot saying it works all the time, but make it possible. And then there was this notion that almost\nalways, we've had great success with yield products. And it's mainly because, I don't know if\nwhen I first got started, we were dealing a lot with insurance brokerages and they're more conservative\nand they have a lot of people who use them for retirement accounts. I think that's there's some\ngrounding in that, but nevertheless, I think that's a fast growing business, demographically,\nand it's a place where if you don't have that yield component, it takes some work to figure out\nwhat you're doing different. Yeah. So you touched on waiting decisions. What about rebalancing?\nHow does the fund rebalance, is there a set frequency, or let's just talk about the rebalancing\nschedule if there is one, or is the fund active? So it's basically done, it's the whole things\nthat rebalance once a year, but it's reconstituted monthly. Okay. So the reason for that is,\nand I think that's, we had, I actually had some debates with folks about that and we first built it,\nand it was to my mind, if I'd have built this in 2015, I wouldn't have had it quarterly and\nannually, right? Quarterly recon annual rebalance. And I just felt like there's, just take a look at\nsome of the periods we've had, Brad. I mean, think about what happened to pandemic. We had a,\nyou know, what, a five week bear market? Five weeks and 30 percent. Yeah. And you had that in\n22. You had 22 tech stocks took a dive and, and as you pointed out, we talked about this earlier,\nbang, you know, hardly anybody anticipated the route upwards. You'd have after such a horrible\ndecline. Usually you have, you know, the battlefield gets picked upon and the wounded walks out\nfor a while. And suddenly, you know, year later, people start saying, gee, you know, maybe there's\nsome value in here. That's not what happened. So that's why we went to the monthly recon, which is,\nlet's take another look now, because thanks are moving too fast. Yeah. I think that's smart. We've,\nin some of our strategic portfolios have increased our rebalancing and reconstitution schedules as\nwell, because since the computers have taken over, it just seems like you don't get those periods,\nlike you just referenced of, I need to lick my wounds and reevaluate. It's more, we are risk off\nand we are risk off quickly and we are risk back on and we are all in rather quickly. I mean,\n2020's perfect example. I mean, five weeks, 30 percent and then what it took, I think it took\neight or nine months from trough, but that first, you know, the first part of that recovery, I think\nit was 20 percent was, I mean, really, really quick. So this, this is really, really interesting.\nI want to give you an opportunity to talk about your other two ETFs. You have DFNV, which is\nrisk management innovation, which I'm excited, I'm excited to hear what that is. And DFHY, which is\ntactical high yield. So can you briefly talk about those funds and, you know, what are the objectives of\nthose funds? Yeah, they're, they're both, you know, built the same way, the other one is on a, you know,\nwhat I call an initial set of screens. And that's, they're built off the Russell 3000\nand they get at a free cash flow component. So in other words, the same thing that happens in\nDFRA happens in happens in DFNV. And to a lesser extent in high yield, high yields kind of\nlittle easier, because you do have credit ratings of companies. So it's not quite as difficult,\nbut still what you're seeking all three opportunities is a little bit higher quality. And so,\nyou know, it'll, it'll probably knock out a lot of the, in fact, if you're not, if you're not\nthinking about it, and we don't think about that way, but if you're thinking about it in terms of\ncap weighted, you don't end up with a lot of small caps, right? You end up with mid and large,\nbut that's okay for us as long as it's getting the characteristics we want from free cash flow.\nThe, the twists and innovation is that we add a concept known as, you know, research intensity.\nAnd it's different from a lot of the, you know, people say, oh, we're going to add R&D back\nin, because that's how we tell the companies innovative or not. And our view is that's just,\nthat's a quarter of the battle. We're looking, research intensity means that you spent money\non, you know, on research and perhaps even buying companies that have great research. And\nyou're, and you've got new product revenue flowing from that. Got it. Right. So there's,\nyou know, that's why, for example, yes, every now and then you'll see Apple pop in. And, and you'll see,\nbut you'll also see a lot of, you know, folks like Nvidia will show up in those screens,\nprecise because they have great cash flow, and precisely because they are spending money like you would\nbelieve on research and, and are winning with the research. So that's that, that piece. And how\nYale, it's just, it's, I think the secret sauce in high yield is that free cash flow points\nwas higher quality junk, if you will, which is kind of hard to describe the people who aren't\nin the high yield business. But it's, the other key to that is, like innovation, the innovation\nhas a really deep recession signal built in. And typically won't hit until there's those dynamics\nplay out, which is interesting because it wouldn't have been triggered in the pandemic one, right?\nThere's just no, no way for a long-term signal to have any kind of infect there.\nBut, or have any kind of trigger. And the high yield one has a tighter signal. And that's\nbasically indicative of how that market works. Because a lot of that market, the high yield market\nis a lot of hedging goes on between treasures, high yield, et cetera. And there's a mimicking\nprocess of that, so that we're trying to keep with higher duration when it's, you know,\nwhen it pays. And then short duration when we think it does it.\nWell, John, I think you guys have a great lineup of ETFs. It's very interesting on how you built this\nvia the screen first. So I appreciate you walking me through all that. How are you, obviously,\nyou would be doing this if you guys weren't out there trying to grow? What are you guys doing\nin terms of marketing? You know, what's working? How are you finding distribution in terms of\ngetting these three names out there? Well, I will say this, the pandemic changed everything in terms\nof how you market. It was already starting to inch up to that even before the pandemic,\na lot of the large firms that we competed against had started to cut back on their class at what\nI call classic distribution cost, which are salespeople in the field. And indeed, as you\nprobably know, we find that the sales function is really, really accelerator in the pandemic.\nThe not many advisors or product people who are inside a broker dealers want to hear from sales\npeople anymore. That's a sea change. That's a big change. And I'm not trying to integrate those roles.\nThere are roles where that works. But if you've got products like ours and yours that need\nto have a story attached to them that are worth the while of the product person or the advisor\nhearing it, you have to develop different strategies like this one. You know, you have to have\ngood communication. So we try to do that on a very regular basis. You know, we'll never turn\ndown an opportunity to do that. Now, a lot of that's also allied with the particular platforms\nthat were on and where we'll push them to say, gee, you know, how much content do you guys have\nbecause, by the way, that's, you know, advisors want that. They want to have something that's recorded\nthat they can listen to in their own home. And they do. So we do, you know, we do not only webinar\non what we're doing, how we're doing. We do it on content stuff like, gee, you know, what's really\ngoing on with inflation? And why is it? It's, everything seems kind of different now. We'll do\nthose things on a pretty consistent basis too. But I think big challenge is if you're not, if, you know,\nif you don't have all your investment professionals talking to, you know, in those communication\nchannels, you're, you're, you're hamstrung these days. Because again, it's, I don't know,\nVinnie, I don't, I think that's just really super important. Particularly again, if you're trying\nto fight against the guys who have, you know, large checkbooks who can kind of buy their way into\nplaces. Yeah, it's amazing how quickly after the pandemic, the, the invitations for the\nstay-cow slunch by a wholesaler one away. And you're right, it has changed a lot. And in a lot of ways,\nthere's a lot of noise now. So I'm trying to, trying to get yourself in front of the right people\nis, it can be a bit of a challenge. But the last question I have for you before we kind of\nmove on, I saw you guys have a robust line up of mutual funds as well. Any thoughts around converting\nthose strategies to ETFs, or do you have a reasons to keep them as mutual funds? I talked to a\nmanager last week who has some mutual, has a mutual fund as well. And, you know, there's certain\nadvantages to keeping it, especially with that vote that's been put around broker dealers. And obviously,\nhow mutual funds can provide some economic benefit for the advisor. So any thoughts about converting\nthose, or are you going to keep running that business strong? I think we're going to, you know,\nwe had, we like everybody else have called that line up. But the bottom line is the stuff that we\nhave we like. And it's, and I think you're, the guy, you talk to is right. There are reasons\nyou want to have some mutual funds and that's why the big firms do too. For example, in the 403\nB channel, that's what you have to use. And we have that channel, some of that, some in that channel too.\nAnd that's the education channel. And then you also strangely enough for night, maybe not\nstraight enough. It's, we're big in the annuity business. Okay. So for example, when, when an insurance\ncompany puts together a multi manager package, we're all fund included there as a sleeve. And that's,\nthat's a pretty successful business. It's sticky and it's, you know, it requires a lot of upfront work,\nbut once you do the upfront work, it's kind of stays in there. So those are two main reasons\nwhy you probably, again, it's, it's, it's, it's, it's, endemic to whatever the firm is. But that's just\nhow we came up in the business and we want to serve those channels. But I, you know, I, to, if you\nask me today, if we're going to look at any new products to build or buy, I would be saying\nthe ETFs because I have that market's growing in a faster rate. Yeah, I would agree with that. So\nJohn, you've been very gracious with your time. Before I let you go, where can people learn\nmore about your firm and your funds? Go to DonahueFourline.com and it's a, you know, I will say\nthat's another thing, you know, we've built a wonderful set of communication tools including\nthe website and you can get fact sheets, all the stuff that, you know, you and I can't talk\nabout on the radio about returns and all that stuff's in there. And, and, and, and specific stocks\nwithin those ETFs all and again, we're, we're restricted to say you can read it yourself. So that's\nthe best way to do it. Great. Well, John, again, thank you for your time. I appreciate you being with us\nand I wish you the best and hopefully some time in the future will get to meet face to face\nand have a conversation. Absolutely. And thank you again for the time and the invitation\nBrad and good luck to you in your firm. Thank you.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}