{
  "id": "13350151",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nToday we have Neil Azus.\nHe runs Rare View Capital.\nThey have a model business which is goal-oriented rather than risk-oriented.\nAnd he also has a series or a suite of four ETFs.\nWe're going to talk mainly today about their systematic equity ETF,\nticker, RSEE, that is a long short strategy.\nWe dive into a little bit why long short can be a great compliment and benefit\nto a holistic model portfolio construction.\nWe also talk about their dynamic fixed income ETF, ticker RDFI.\nAgain, very unique construction uses closed-end funds and makes a very compelling case\nas to why this is a beneficial strategy.\nSo without further ado, let's bring Neil Azus onto the show, and I hope you enjoy this conversation\nwith him.\nNeil, welcome to the show.\nThank you for having me, pleasure to be here.\nSo Neil is the founder of Rare View.\nAnd so I want to talk to him today about his firm and about his background.\nSo why don't we just jump right into it?\nWhy don't you tell me a little bit about Rare View and tell me about your background\nand how you got into the position you are today?\nSure, Brad.\nRare View Capital is an independent SEC Register Investment Advisor and ETF sponsor.\nAbove all else here, we champion goals-based investment management.\nWe believe aligning investment solutions with investment goals is really the best approach\nto reaching once aspirations.\nThe idea of investing by a style box or exposure to a region or an asset class\nin our experience does not deliver the real world outcomes that investors seek.\nAnd that's our overarching philosophy at Rare View, Brad.\nIn terms of where we fit in, I believe the asset management industry can be grouped into three\nThe first one is disrupting the existing distribution framework\nor the electronification of investing.\nSo think of Robo Advisors.\nThe second one is commoditization of scale or passive management.\nSo think of the large firms out there, Vanguard BlackRock, Dimensional.\nAnd then the third one is a specialization that requires expertise or active management.\nI would want you to think of Rare View Capital's fitting into that third bucket.\nThat is, we specialize in non-traditional investment strategies.\nWe deliver model portfolios to third-party asset management providers.\nWe implement protective strategies that require derivative expertise.\nWe focus on customized solutions, especially anything related to interest rates.\nAnd finally, we produce our own research. We don't consume it.\nRegarding my background, I'm the founder, the managing member and the chief investment officer\nof Rare View Capital. I had our investment team and oversee all portfolio risk management activities.\nAnd I also serve as the portfolio manager to the four Rare View ETFs that we manage.\nI've been fortunate enough to have worked with some great firms like Goldman Sachs,\nStiles and Lovekan and Genre and UBS investment bank.\nAnd I've been trained in various capacities by some of the best minds of the industries\nthat have pioneered various products that we use every day in the capital markets.\nAnd as a result, I have a multi-assup background, a global macro investing foundation.\nAnd I guess the best way to think about me is I'm not a bull or a bear.\nI'm either an inflationist or a deflationist.\nAnd I absolutely have no religion when it comes to contentious topics like Gover China.\nThey're just another commodity or country to me.\nUltimately, I'm agnostic to the region or the asset class or whether something is a cash or\nderivative investment. And the benefit to all that is that allows me to be processed, driven,\nand reduce human devotion when it comes to investing.\nWell, you and I then share a lot of similarities. That's how we definitely view things as well,\nagnosticly, which is why traditional media for guys like you and media don't work so well,\nbecause they ask us what our opinion is on, you know, the tech industry and\nsounds to me before we jump in here that when you have a process like that, you really don't care.\nAnd the signal is the signal. Am I assuming too much there? Is that kind of how you view things?\nNo, that's exactly where we skewed towards. And we try to stay to that philosophy to the best of our ability.\nYeah. So before we jump in, I want to talk more about RareView. I have some questions and then\nobviously the ETFs. But I like to ask everybody on the show. What do you like to do outside the\noffice when you're not working? Do you have any hobbies, things you enjoy doing, you know,\nwhen you're in your spare time? A few things. I like to play tennis. I like to go on walks,\nlisten to podcasts. I'm an old movie boss, so I still watch movies, listen to music. But at this\nstage of my life, I spend most of my time on free things. My family, the health, and work.\nNot a lot to do outside of it. I wish you would more time. That's great. Yeah. I would really like\nto get into playing tennis. I started watching that Netflix series point break and it looks fun,\nbut I stuck to golf and I didn't pick up the secondary country club sport, which would be tennis.\nSo maybe something I'll do when I have some more time and not have young kids because I have\nthe family as well. So we're here to talk about two of your ETFs specifically and also\nwe have two more. But let's talk about the services of RareView Capital as a whole.\nCan you explain to me kind of the Ancillary Services outside the ETFs? So the model business\nand kind of what you're delivering to financial advisors to deliver to their clients?\nYes. So we have two businesses here, acid management and wealth management.\nThe acid management is anchored by our ETFs suite, wealth management is more traditional.\nAlthough we're a bit more selective in how we work with people, as we're focused equally\nas much on the acid management side. Within that, we also offer an outsourced chief investment\nofficer solution, which includes the delivery of model portfolios. And then separately from that,\nwe may deliver our model portfolios to various tabs or turns the acid management providers.\nBut what we're really trying to do in that puntile role is either give access to our models,\nbut at the same time help other financial advisors grow their business through efficiency\non the investing side. And those services can range from anywhere from attending their\nregularly scheduled investment committee meetings. The delivery of model portfolios helping them\nwith marketing, consulting solutions of that like. We also do one of our main value\nads is that prior to the launching of our registered investment advisor and our funds,\nI owned and managed a global macro research firm. And so part of our deliverables,\nwhich we may complimentary to our investors or shareholders or prospects, is that we provide\nthem our research. And our research focuses on three things. Idea generation, risk mitigation,\nand portfolio construction most importantly. And so we're trying to fill that void between\neconomic strategy and trading of putting it all together in a process driven framework. And then\nbeing very transparent about that and filling in all the blanks regarding the questions around\nportfolio construction, what the market is doing, etc. And so we make that available as well.\nYeah, so let's talk about model portfolio construction. So you have as you alluded to\nand I was on the website a goals-based approach. So you go down from growth or you start from\ngrowth all the way down to kind of asset protection. How are you how are you building those models\nand are those models also active as your ETFs are or are you letting your active ETFs\ndo the work inside of those model frameworks? So it's a combination. I'll come back to that second\nquestion in a minute about what's implemented inside them. But but broadly speaking, you have two\ntypes of approaches to those model portfolios. One are the traditional risk-based ones where\nyou're grouped in sort of an 80, 20, 60, 40, 50, 50, you know, type of blend between stocks and bonds.\nWe don't subscribe to that where, you know, it's specifically based on your risk tolerance.\nIt's more so geared towards what goal are you trying to achieve? And when you dump it down into\nreally three or four buckets along what I call the wealth curve. You're you're left with\nyou want to grow your money, you want to preserve your money or I guess outperform the loss\nof your purchasing power. And then in the third phase, you want to spend your money or the income\nphase. And then in the fourth phase, you want to be able to transfer those assets to the next generation\nor some other entity. And so our portfolios are more geared towards achieving those goals.\nAnd while it's always important to consider asset allocation, style, premium, all of those things\nthat would traditionally go into that, it's less of a focus. We want to just meet that goal and find\nthe best instruments to meet that goal. So that's the primary input to those portfolios.\nRegarding the security selection, they can range from passive or active. They can be low\nfee like a Vanguard. They can be a higher fee if they're trying to triangulate on to a particular\noutcome. And in terms of our case, we have an ET at one ETF that we're model that fits into each of\nthose buckets. But they're not going to be 100% concentrated in that. They will measure the amount.\nSo we will certainly use other instruments in there that meet what we're trying to do in terms of\nthat goal. But our product could be anywhere between 2115 percent on average into those models.\nGreat. Yeah. And we talk about how holistically across the firm, investment decisions get made.\nYou had said you're agnostic and aren't really focused too much on what China's doing or what\ngold is doing. I'm assuming you have a very strict rules-based and systematic process.\nCan you explain that in a mile on the right path there? Sure. So it's different for each asset class\nor potential product. So on the fixed income side, for example, our discipline is\nprobability based outcomes using the vast array of instruments in the fixed income markets,\neither the short term instruments or the long term ones. There are so many instruments and it's\nthe only asset class that you can pick a scenario in your head and then go recreate that using those\ninstruments looking for particular outcome. So we focus a lot on the shape of the yield curve.\nWe focus on probabilities around the path of Federal Reserve policy and that's a model of\ndriven approach. So we have a spreadsheet. We have lots of different inputs in there. It's been refined\nor honoured over decades and it helps us identify where the asymmetry is in various probabilistic\noutcomes. So keeping things simple on a scale of zero to 100, something gets between 80 and 90,\nwe want to sell it, something gets between zero and 10 and we want to buy it. And then rinse and\nrepeat that as the probabilities around the path of the interest rate hiking cycle or cutting\ncycle start to change every six to eight weeks. So it's completely model driven on the fixed income\nside around that. Secondly, on the income side, we're specialist in closed-end funds and so that's\na model that's built in Python. It identifies to us the least expensive or the cheapest security\non an interest sector basis. So if we've got 10 or 11 sectors across fixed income,\nwe will identify in our model what we think is fundamentally the cheapest one. And then we\nwill implement that and as it changes in its valuation through this model, we will sell that out\nand buy another one. On the equity side, we've partnered with a firm called GST Management\nthat is my opinion a world-class index methodology developer of strategies and that product is\nalgorithmic. It's systematic. It's quantitative. There is absolutely no human emotion or discretionary\noverride involved in it. The idea of it being long short is that it's risk mitigating\nby itself. I mean, it's developed that way. And so there really doesn't need to be a human to decide\nwhat it needs to do in terms of going along or short. So everything we do here and throw that decision\nmaking process is model driven. There are different types of models, but that's the primary\ninput for us. And then, secondarily, we want to do everything as quantitatively as possible.\nAnd the idea of being here is that it's like moneyball baseball. It's statistical. We want to play\nin favor of the statistics that are hired a degrees of success and stay away from the ones that\nare human driven or that force you to be in your seat at any given time knowing that you're\nnever in your seat when it matters the most. No, that's interesting and very similar to how we\nconduct some things over here. But kind of the last question before we pivot, since you have\nboth sides of the business model delivery as well as the ETF and the fund business, which side\ndo you feel or are fine to be more challenging, specifically kind of around growth or even just\nday-to-day maintenance? I appreciate that question a lot, Brad. I actually more than you know,\nbut something that has been asked to me in a long time. But as a business owner, but also as a\nCIO slash portfolio manager, you think about things differently and it's sometimes challenging\nto separate that, meaning you might have passion out investing and really believe in your product.\nAnd then on the flip side as a business owner, you have to weigh the resources that go into certain\ndeliverables and what your ROI is on that. In my experience, the ROI in the tamp business\nas much as I appreciate the growth of that channel, which is fairly substantial these days,\nis really horrific. The idea that somebody wants to work for 10 basis points to 30 basis points,\npotentially cannibalize the rest of their businesses in terms of ETFs or wealth management,\neither one. And then the time spent on that from a regulatory or compliance standpoint.\nAnd then in the sense of you need to make sure that you're treating all of your investor basis\nequally along the way, meaning a wealth management client is treated the same as a tamp deliverable\non a model, as well as your ETF and how you do that. In my experience is that it's an important\npiece of the puzzle to be involved in the tamp world and the model delivery. And it can mirror a lot of\nthe models that you currently run. But by the time you introduce the business component in terms\nof GIF's performance tracking, marketing to the various tamps, managing those models equally\nas if you're running them for a wealth management client or an ETF. So you can see the piano\nof the real time like it's yours. It's a very big challenge for me personally and for our firm.\nAnd I would just, I would be remiss to say that it hasn't been less than fruitful in my experience.\nAnd so it's not one of these exercises any longer. Like it was maybe five or six years ago,\nyou go put a model on a platform and you think somebody's going to buy it, which they've used to a lot.\nNow, you don't just do that. You have to pay to get onto a platform. And then you have to have a\nbody that's dedicated to that platform to market to it. And these platforms that have marketplaces\nallow this, they now have a thousand plus type of investment strategies on there. So the competition\nin that open architecture is extremely high, but you're generating probably one third to one\nfourth of what you normally would in some other type of revenue strength. So it's really a question\nof your resources, but economically, it's challenging from the business standpoint.\nYeah, I couldn't agree more. The one thing I think you left out there is the expectation of the\nadvisor who's using that model of you is a manager. I feel as someone goes out and buys an ETF,\nyou know, they have a place in the portfolio for it and sits there. And if it does well great,\nif it doesn't meet their expectations, right, they sell it. When you're driving kind of\ncore model business for a advisor sometimes, the expectation not only for that model to perform,\nbut also the expectation of the advisor for you to provide ongoing support for that model,\nwhether it be commentary or webinars or talking to prospects or clients of theirs,\ncan also be a heavy lift. That's a good point, Brad. I agree with that a lot. It's good that you\nmention that extra part. That's one of the reasons we provide our OCIO service for consulting.\nIt's a much higher touch deliverable. And hey, go buy a model, read some research that comes out\nonce every two months, and expect that to be a winning relationship long-term. Yeah, so let's pivot.\nI want to talk about your systematic equity ETF, which is RSEE is the ticker. You're the first\nlong short ETF manager we've had on the show. We've had a lot of really unique and boutique strategies\non here, but you're the first that runs a long short equity strategy. This is really kind of a\ntwo-part question. First is why is long short an important component in an overall model portfolio?\nAnd second, how do you go about setting expectations for advisors going in? Because as you and I both\nknow, market volatility where long short is very helpful. Kind of clusters around best in works,\nmarket days, and sometimes you have to be on the wrong side of a short trade for a little while\nuntil it materializes. And sometimes that's hard for them to understand. So the question really is,\nwhy is it important for them to have? And how do you go about educating the advisor as they implement it?\nSure. So, can't see your first question, the historical component of adding a long short hedge fund,\nor really any hedge fund to a portfolio was to generate some additional performance or what\na quote, Alpha. That really was the pathway from say 1995 to 2008. Since the global financial crisis,\nthe hedge fund vehicle has become more of a diversifier as opposed to an alpha generator.\nAnd so what you end up with in today's world with the 10,000 plus hedge funds out there in that strategy,\nis more of a risk mitigator, something that helps manage the downside risk. But in order to do that,\nyou've given up a super majority of the upside potential in terms of performance.\nAnd so it's a trade off. You want to mitigate the downside, but you got to give up the upside.\nThat's the traditional approach and where we've really been for the last 15 years.\nI don't subscribe to that philosophy. In my experience, Brad, clients or investors are accustomed\nto weathering a garden variety stock market correction of say 7 to 15 percent,\nonce every year or once every two years. And if the markets are down, they don't have that\nbig of an issue with their financial advisor or ETF man. However, if the stock market's up 20 percent,\nand you're only up 4 percent because you're running some type of hedge product,\nI tend to see people fire their financial advisors or replace that ETF with another one due to that\nsignificant underperform. So what I'm saying in English is that upside capture to us is\nvery important, if not equally as important as the downside capture. And that's really the trick\nand finding a vehicle to solve for that is not easy in the traditional long short space,\nbecause by default, they run somewhere between depending on how conservative they are,\na 0.2 percent, sorry, a 20 percent net long to on average is 60 percent net long. So let's just\ncall it 40 percent net long or 0.4 beta to the S&P 500. So by default, if the S&P is going to be up\n10 percent, they should be up around 4 percent. They're leaving a lot on the downside. I'm sorry,\nleaving a lot on the upside, you know, based on that model. In our particular case, we wanted to\nreimagine that. And we sat out and said to ourselves, what do we need to create or what is the product?\nAnd so I came across a person. His name is Rod Jones. He runs a firm called GST Management.\nHe worked at some of the top places in the world. He was an index methodology expert,\nconsulted and constructed portfolios for some of the largest pools of capital in the world.\nAnd we discussed this product, which is now the strategy that drives the rareviest system\nat equity ETF. And what we wanted to do was find a vehicle that addresses what I think is the\nseminal investment issue for investors, which is, how do you stay invested in bull markets avoid the\ncatastrophic stock market sell-off in bear markets? And then minimize that time back to break even.\nNow, I know every product looks for that. But in our case, we made an acknowledgement or\nrod strategy acknowledges that in order to try to achieve that, meaning you're going to participate\non the upside, you're going to avoid a catastrophic drawdown. Well, that is very difficult to\nrecub from catastrophic defined as something south of minus 25 percent, not the garden varieties\nstuff that happens every one to two years. And then figure out a way to stay invested,\nminimize your time back to break even. There has to be something of a sacrifice in there.\nAnd the sacrifice is that you don't know what's going to happen tomorrow if you're long.\nAnd you don't know how much you have to give up on the downside, meaning you have to sacrifice\npotentially the first zero to 10 percent on the downside to achieve this type of goal of staying\ninvested during bull markets for the long period of time. And that's really what we're talking\nabout here. And then, at the same time, you want to remove the human emotion. And so what the\nstrategy does that drives the Rareby Systematic ETF for RC is the symbol R S E E. Is that it makes\nthe difficult decision when to get back into the market as opposed to the human financial advisor\ntrying to pick the absolute bottom or make that determination overall. And it won't always be\nperfect. You're never going to pick a bottom. But what it will do is make that decision to get\nlong. And then when it gets long over a period of time, it will average in or it will get longer\nin that episodic period. And you will be back in the game of staying invested and help you get back\nto break even quicker. And so that was where this strategy fits in. And in our case, just to take\na step back, we have a fullot. Not we, I mean, the strategy has a philosophy where we don't\nbelieve that markets are micro-efficient. But we believe that they're macro-efficient. So that's\nthe old Dictum from Nobel Laureate Paul Sandilson. But we focus, or the strategy focuses on index\nlevel exposure to add value. We find that it's possible to generate above active equity returns\nwhen you exploit the behavioral patterns on a regional basis or a different volatility regime.\nWe don't believe that that's the case in picking single stocks, meaning the alpha generation is\nextremely hard and isolated to just a small group of the 10,000 funds that do that. And then\nsecondly, we also find it very difficult from quote unquote, a risk adjusted return basis\nto try to focus on style premium or picking sectors. For example, being long tack versus short\nenergy, you might be having a very good year this year. The last year you had a terrible year.\nAnd the volatility of that approach is probably two times the amount of the stock market\nfor being compensated half those returns over the long. And so we just stay away from that.\nOur goal in launching this product and partnering with GST Management on the strategy was to fill\nthe void of finding a solution that can stay invested, get short when it needs to get short.\nKeep it simple to index beta and keep people in the mark as opposed to we want to focus on factors\nor style premium or single stock selection. We're trying to address a long-term solution,\na core solution for our investors. And that's really the trick here. And so that's how we approach it.\nI can talk in length about certain things about it. But in general, our goal is just to capture\nthe upside, not just the downside, meaning we seek to beat the market and pull and bear\nmarkets, not just one. Yeah. So, leaves me, I think I have the majority of this. But in terms of\nsecurity selection process, you mentioned an index-based approach. So, are you continually\ntrading a fixed set of holdings or will call it like a bench or are you kind of rotating\nthroughout different indices? How are you building the holdings of the portfolio?\nYeah. It's very simple. So, the investment objective is to seek a return that exceeds global\ndeveloped and emerging market equity. And so, the funds benchmark would be an all-country\nworld index. And the performance or the strategies performance is derived from four regional\nsubstratages that we believe target important sources of global equity market return. So,\nthere are four indices, one that tracks US large gap. So, the S&P 500, one that tracks US small\ngap, the Russell 2000, a third one for non-developed, I'm sorry, not US developed markets such\nas EFA and then the final one being MSCI emerging markets. And so, there's always four indices.\nThey never change the weightings of those four indices, mirror the weightings of\nall country world index, meaning the global benchmark for equities. And that's it. And at any given\npoint, those four substratages could be long or short. Okay. Now, when talk about, so you hit on\nweighting, but that weightings can be variable because of the active nature of the strategy.\nAnd you alluded to this somewhat when you were talking about the strategy where it could kind of\nlean into the market and average in. So, is there a position sizing variable like certain states\nthat the algorithm might be in to say, hey, we want to be fully long, we want to be a little bit more\nneutral and we want to be short. We want to be really short. Like, how are those weighting,\nthose active weighting decisions made in real time on those four indices?\nNow, they're fixed weightings. And so, keeping things simple like US large gap is always going to\nbe around, say, 42% of the strata. That doesn't change, you know, it rebalances monthly,\net cetera. But there's no, I like this or I want to overweight or underweight that. Those\nweightings are fixed. The strategy overall can either be 133% long or 33% short with 67% in cash.\nAnd so, you can think of it as if all four were long will be levered or $1.33 for every dollar\nthat we have. If we're short, all four, there will be 33% of a net short exposure and 67 cents\nin cash per dollar at that time. And those, again, those four strategies have different permeations\ndepending on whether they're longer short at any given time. So, currently, for example,\nthe models that drive each of those strategies have long-term bicygnals in them. And so,\nwe're long all four of those substratages and the total exposure of that is 133% long.\nAnd that's broken down in terms of the all country world index, you know, weightings.\nGot it. That makes a ton of sense. And if you get in the leverage by using futures,\nis that how you're adding portfolio. You can acquire it several ways. We are very focused on\nwhat I call operational alpha at rearview capital. And what I mean by that is we're highly sensitive\nto costs and taxes or tax efficiencies. And so, when you use futures to toggle long and short.\nSo, for example, always have a base long, a long base of four ETFs that make up 70 to 80%\nof the weightings. To toggle long and short, we will use the equivalent of those futures,\nwhich are the most liquid in the world, those four in the equity futures markets.\nWe'll do that for transactional cost purposes to keep them low. We'll do that to minimize the overall\nportfolio turnover. And then the first 40% of futures of a futures position are always treated\nlike the long term capital gains. No matter how long you hold it for one day or two years.\nAnd so, we want the added benefit of that. So, it makes the implementation\nmore efficient overall. And that's why we do that. Yeah, that makes a ton of sense. And so,\nif you're when you're talking to an advisor, you're out selling the CTF. This ETF specifically,\nhow are you kind of driving them to make an investment allocation decision in their existing\nmodel portfolio suite? So, is this something you're suggesting five to ten percent or five to 15\npercent of the whole model portfolio? Sure. So, I guess I've start to answer that question with\nstating that we view it as it could go into two buckets. First, it's a core solution\nnot a satellite position and it belongs in the growth bucket. So, if you were long the S&P 500\nor help some type of globally diversified equity portfolio, where a replacement for that given that\nwe the product is globally diversified at the index line. So, we view it first as a course\nloop to decide what weighting that should be, what we would normally do is take an example,\na snapshot of somebody's existing portfolio. If they're willing to share that with us,\nand then provide them a replacement analysis in different weightings between five and 60 percent\nto show them what the increase would look like. I'm sorry, the benefits would look like\nin terms of risk adjusted return profile. And so, meeting is the optimal performance at 20 percent\nof a weighting or ten. And we'll demonstrate that in a spreadsheet so they can see what that\nlooks like and then decide for themselves what the right weighting is. If you want to just\nkept it super simple and somebody had a traditional 60 40 portfolio, 60 percent stocks, 40 percent\nbonds, we would advocate that we should be between 15 and 20 percent of that 60 percent on the\nequity side. And that got to increase the risk adjusted. Got it. So, let's pivot to another product\nof yours I find interesting, which is the ticker RDFI, which is your dynamic fixed income ETF.\nCan you talk about the strategy of this product and what is trying to accomplish? Sure.\nSo, those are not familiar with closed end funds. They're one of the four\nin registered investment companies, the 1940 act along with open end funds, unit investment\ntrusts, and exchange traded funds. And closed end funds actually have been around since the 1890s\nthey've been around really for over 130 years. And there's about 530 of them that trade on the New York\nstock exchange. And if they're utilized appropriately, they could be wonderful instruments. If they're\nutilized inappropriately, they can be pretty challenging when performance is impacted from market\nvolatility. So, just a caveat out front is that if you're looking at closed end funds,\nyou I would recommend that you speak to specialists in that to make sure you're going about that\nprocess appropriate. The benefit of them is that in my experience, they're the only instrument\nthat I've ever come across where you can make money potentially three different ways. The first\none is that they're an income strategy and they have a very high distribution yield. So, for example,\nthe universe right now, depending on how it's as allocated, you could be anywhere between\neight and a 10% distribution. The second component to be able to make money is that there's\npotential principle appreciation from the underlying holdings or all the NAV of that fund.\nAnd then the third one, which is very interesting as well, is the potential for alpha generation,\nwhich is what we call discount to net asset value capture. And so, if the closed end fund is trading\nin a discount to its net asset value, and you can buy that at say a minus 10% discount,\nand then over the next year that discount narrows to minus 3%, you could lock in that 7% of discount\nnarrowing or alpha. And when you combine that, you've got this high distributionally at yield,\nthat's going to pay you no matter what unless they cut their dividend. And then you've got the\nprinciple appreciation potential. And if you have a model and you know what you're doing in terms of\nevaluation, you have the potential for benefiting from this discount to net asset value capture,\nand rinsing and repeating it. And so, for us, we just philosophically love that profile,\nwhere you have the potential to make money from three different avenues. And if nothing,\nif you're not doing anything, if the markets aren't cooperating or you're not doing great\non the discount capture process, at a minimum, you're going to get this high distribution yield,\nwhich helps generate the income or provide an allowance for somebody, or mitigate potential\nmarket volatility. And so, that's the background on that. In the case of the rare U dynamic fixed\nincome ETF, or the symbol RDFI, what we've done is take in the non-traditional advantages of\nthe closed-end funds, which are the three return streams that I just referenced. And married that\nwith the traditional benefits of a dynamic fixed income strategy, which is a comprehensive fixed\nincome strategy, where asset class exposure is managed more dynamically or active,\nand it's really driven by market opportunities and risks. So, not necessarily asset allocation.\nSo, in our universe, there are 11, 16 income asset classes. We would identify the appropriate\nweightings to each asset class based on the market opportunity of the risk in each of those asset\nclass. And then, once we've done that in a determined the weightings, we have a model that would\nselect the closed-end funds in each of those sectors, and then optimize the weightings based on\nthe number of factors to go into that particular sector. And what we found is, is that\nthat blended approach of traditional benefits of dynamic fixed income and the non-traditional\nadvantages of closed-end funds ends up being, you know, a vehicle that gives you the allowance that\nyou need, if you're an income, if you need an income where you have a budget to spend. But at the\nsame time, act as a potential total return product as well, and work in various environments a lot,\nif you know over the market cycle, when rates are more contained or come down.\nIt's extremely interesting. You answered a lot of my questions on it, so thank you for that.\nThe only additional question I would have is, you know, with this, this is almost, it's\npseudo-fixed income. I mean, it is a fixed income, but it also has the offer generation.\nWhere are you putting this in a model portfolio? Kind of the same question we had with RC,\nyou know, is this, are you going to be peeling from fixed income bucket in this case?\nYeah, we, we, we, if we go back to the wealth curve that I referenced at the beginning of this\nconversation, growth preservation of capital income transfer of assets, this would fall squarely\nin the income bucket. And are you, is this kicking out a monthly yield as well?\nThat's correct. It does. Yeah, that's great. So quickly, you have two other funds,\ntwo other ETFs. I might have to get you back on to, to go through them in more detail, but\nwhy don't you take the time to quickly touch on those, what they are, and, you know,\nwhat they're trying to accomplish as well? Sure. In that same spirit of the income strategy,\nwe also have one that uses closed-end funds, but focuses specifically on the municipal bond\nclosed-end fund sector, and that's designed for qualified accounts or strategy people are looking\nfor that tax efficiency. So it's, it's virtually the same strategy, but just at one particular\nsector level for people who are looking for tax efficiency. So those would be in our income\nstrategy. The, the last one is our, what's called the rare view inflation deflation ETF,\nand the objective of that is, is to seek a rate of return that exceeds the rate of inflation\nover a business cycle. So what we're really trying to do in that is say, okay, the markets move\nfrom inflation to hyperinflation to deflation to disinflation. What is the proper set of\ninstruments along those different regimes? Or you could look at it like, okay, we are entering\na hiking cycle, then we're in a hiking cycle, and then the hiking cycle is over, and then we\nmigrate to a cutting cycle. What are the best representations for each of those regimes? And they're\ndifferent, meaning you could be long-fixed income beta or short-fixed income beta in any of those\nregimes. You could be take a bet on the shape of the yield curve, not to get too walky here,\nbut is the yield curve flattening or steepening. Those are very big decisions. And then the third\none is, do you want to make bets in the options market to find bets you never naked short volatility\nor short options, but to find bets or long-only bets on the path of interest rate policy\nby the Federal Reserve, and make different bets on probabilistic outcomes using options. So in theory,\nthere's three return streams, right? You get the market bait and the regime right. You get the shape\nof the yield curve right, and then thirdly you want to get the path of the Federal Reserve policy,\nright? And each of those three return streams will make up some type of risk budget. And\ntheoretically, they're all supposed to act as diversifying sources of return streams, doing something\ndifferent. And if you could get all three right, well, you're going to have a really good year.\nIf you get two out of three right, you'll have a good year that likely outperforms the aggregate bond\nindex. And if you get all three wrong, well, then you're probably going to underperform the aggregate\nindex. And so what it's really designed for is that if you've got a 60, 40 portfolio and on that\n40% or the risk free portion of that 40% that sits passive, you hand it to an active manager like\nand we're seeking to beat that rate of inflation or the loss of that purchasing power over that\nmarket cycle to try to do better than what you would get just in that passive approach of not really\ndoing anything with your 16 combata or the duration in your portfolio. Got it. Very interesting, Neil.\nI love the thoughtfulness of the product lineup. I think you have some really unique and interesting\nfunds that can provide some additional diversification, some different ideas in an overall\nmodel portfolio for advisors. So first and foremost, thank you for your time. And where can people\nlearn more about rare view as well as your funds? I thank you very much for having me and I appreciate\nthat the simplest place is always to start with the website at www.rareviewcapital.com.\nIt's all in one place. The second one I would encourage people go to the SEC's website,\nread our form ADV, do a deep dive on us, do your homework. But those would be the two main places.\nThe SEC's website on our background as well as our store front being our website. Great.\nWell, Neil again, thanks for taking some time with us and I wish you the best going forward.\nMy pleasure. Thanks again for having me. Enjoy your summer.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}