{
  "id": "13389794",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice and it is meant solely for educational\nand entertainment purposes only.\nWelcome to Behind the Ticker.\nToday we have Adam Egelston, the Chief Investment Officer at Thor Medible.\nThey run the Thor Medible Fund, which is Ticker F-O-R-H.\nThey also have Kong, K-O-N-G, but today we primarily talk about F-O-R-H.\nThey run an RIA, they also run a private fund, and they also have another ETF coming\nhere in the future.\nSo you're going to learn a lot about the firm, you're going to learn a lot about for\nage, in particular, and how that could fit well inside your portfolio, I think specifically\nsomething that's a little bit uncorrelated and more as an alternative to fit a holistic\nmodel portfolio.\nI hope you enjoy this conversation with Adam Egelston.\nAdam, welcome to the show.\nThank you so much, it's a pleasure to be here.\nWe have Adam Egelston today, the Chief Investment Officer at Thor Medible, and before we\njump in, we're going to talk about their ETF, the formidable fund with Ticker F-O-R-H.\nBut before we do that, let's talk about Adam, can you give us your background and kind\nof how your career progressed to get into the position that you are today?\nYeah, of course.\nI got started, I guess, early, I mean, it was one of the few people who kind of stuck\nwith their college major all the way through.\nBoth of my parents were teachers, so my knowledge of the stock market came from winning\na stock market competition when I was in six or eight or something like that.\nSo it was kind of always new, that's what I wanted to do, you know, first job, but we're\nfor CPA, firm, come and straight out of college.\nAnd ultimately ended up more on the manager research side.\nI was the CIO of a pretty large trust company in Memphis, and we did due diligence on all kinds\nof asset managers who ran SMS for us, so we got to see you kind of all lens of the\ncontent you and value growth, quant, story stocks, all that kind of thing.\nSo did that for a while, and then in 2012, ended up pivoting and going to work for one\nof the managers that we followed a firm up here in Cincinnati, where I'm based, called Opus\nCapital, which was found by a husband, a wife, team, Jackie, and Len Houseler, who to their\ncredit were one of the earliest firms to really do kind of a quantum mental approach, which\nI really liked.\nIn 2013, they turned me loose to work on a small cap dividend strategy for one of our\nclients, which I thought was really interesting, and that's really informed a lot of the\nbottom up framework that we use here at formidable.\nIn 2018, we were lucky enough to launch an ETF.\nWe were sub-advising that.\nAnd in 2019, essentially Opus split into the institutional side where I work was divested,\nand ultimately, we ended up losing that sub-advising business for the ETF, which didn't make\nme really that happy.\nSo I turned in my resignation shortly thereafter, and was in the office cleaning out my\ndesk when I ran into a will-brown who's the CEO of formidable, and he asked me what\nI was doing, and I said that I'd quit, and was going home, and he said, well, I don't\nshould come upstairs to that, so I went upstairs and got hired by formidable.\nThat was a few months before COVID hit.\nWilt is credit really saw a lot of that coming, and our private fund did really well\nin 2020, and then we really used that as somewhat of the launching point to get interested\nin ETFs.\nI had an affinity for those, and we green-lit those and started that process in 2020, and\nI launched 4-H in 2021.\nYeah, no, that's great.\nIt's, you know, you'd mentioned, kind of working for that trust company and doing some\nSMA due diligence.\nI did that for a short while as well, and you really learn and understand so many different\nstrategies, and I think it helps us as chief investment officers really builds, you know,\nkind of more robust portfolios, and so I could not agree more with that.\nI think that's absolutely correct.\nAgain, you see both ends of it, right?\nYou kind of see what works, what doesn't work, and it's just the insight you gain, and I\nthink the other piece, too, and not to disparage manager selection, but when you're\nultimately the person in the seat, making the individual selections, it's just a whole\ndifferent level of accountability versus the manager selection piece of it, so that was\na one thing for which I probably wasn't entirely prepared to live and die by the daily\nreport card you got.\nYeah, yeah, that over time, though, you learned to stop looking at the daily report\ncard and just trust the strategy and know what it's going to work and when it's not\ngoing to work, and yeah, I who was a, I was a P&L watcher for far too many years, and\nI think it's probably why my eyesight isn't so good anymore from staring at a screen\nfor all that time.\nBut so Adam, what do you like to do outside the office?\nI always like to hear people's hobbies, things that they enjoy, and then we'll kind of\njump right back into formidable in the firm.\nYeah, of course, you know what the fourth of July upcoming, I've got plan to poem\nmy children around town in a rickshaw for the Wyoming Fourth of July parade, but aside from\nthat, I've got three, three youngest children, so I coach their soccer teams, and when I'm\nnot injured, I still still play a fair bit of soccer myself.\nYeah, I've, it's funny, I also have young kids, and when we started five-year-old soccer,\nI thought, you know, this is going to be horrible, and then I find myself at six-year-old\nsoccer, like yelling on the sidelines and being that parent, and it's way more fun than I thought\nit was going to be.\nOh, for sure it is, and I joke with my wife all the time, the only thing worse than coaching\nis not coaching kind of things, so the first year that my daughter played, she was probably\nthree or four years old, and I took it arguably too seriously, and was watching very\nnice guy try to coach my thought.\nI think I can do better than that, so I've gone down the path and getting my coaching\nlicensees and all that kind of stuff, because it's not this similar from building portfolios\nin terms of building soccer teams, so there's lots to learn from that type of interaction.\nYeah, I actually, I actually did the same thing, I was, I was a assistant coach this year,\nI couldn't, I didn't want to take on the full-head coaching role, because it part of the,\npart of that task is organizing who does snack time when on what days, and I didn't want\nthat responsibility, so I figured I would just help coach and let somebody else worry about\nthat important stuff, like who's bringing the cheesets?\nYeah, for sure, it's one of the things where you can sit at your desk and make large trades,\nbut what always terrified me was getting a match day wrong and having the parent show up at\nthe wrong place at the wrong time, so that's right.\nYeah, for sure, that's a lot of responsibility.\nSo we're going to talk about the ETF mostly today, but before we do, let's talk about\nformidable the firm more holistically.\nCan you talk about all the different services you provide, because from what I saw, it looks\nlike you have a robust asset management and planning business, and they're also, you know,\na private fund business as well, so I'd like to talk about both of those things.\nSo what do you guys all have going on it for medieval?\nYeah, we have a lot going on.\nPlease to report that the firm just hit its 10-year anniversary, so really a credit, so Will Brown\nand the team that he's built here, he spun the firm out.\nI think it's really part of our ethos is that we will build something if we think we can do it better,\nand that was really Will's impetus in building the firm, he's done a great job of recruiting\na lot of talented advisors to come to the firm over the decade it's been in existence,\nand that was really the progression for the ETFs as well.\nAs I mentioned, we had been doing a private fund since 2016, which predated me,\nbut that fund had some success, especially in 2020, thanks to some of the hedging we had in there\nand some of the academic management.\nSo we really wanted to broaden the ability to offer that beyond just our walls here,\nand that was really what took us into the ETF business, but we're really fortunate we have\nsome great advisors who are focused on planning, and I would say the model is very much a hub and\nspoke kind of models, so with the hub of the firm, you have compliance, you have operations,\nyou have CFO function, you have clients service, you have investments, and then we have\nsix rate financial advisors who plug into the ecosystem, and some of them, you really are extensive\nusers of the models that are investment team built, and other ones choose to go their own route\na little bit, so that's really in broad strokes, the history, the firm, and how it's structured.\nSo with the private fund, is that fund still an operation?\nYes, that fund is still an operation, it is pivoted over time, so what we found is that a lot of\nthings that we were doing in the private fund found their way into 4-H, and we really like the ETF\nwrapper there, and the private fund has changed a bit, and that's become a little bit more of a\nhybrid between some of the traditional public equity stuff that we do, and also some more\nesoteric private equity, a private placements, more traditional private equity, etc. So the private\nfund has shifted a little bit over the last few years. So is the ETF kind of a version of that fund\nX, the private investments, so does it mirror it all, maybe the equity selection in that fund?\nI think at one point it did, and they've really diverged in some interesting ways.\nReally, when we used a lot of the learnings we had, some of the successes we had in the private\nfund, we decided to bring those to bear in 4-H, and then we built the structure around that\nto a greater degree too. So again, if you think back to that hub and spoke model, what we found\nis that as we were putting models together for the advisors to use, that the more traditional\npieces of it, you could find solutions there for the most part. Now, if that's not to say that\neverything out there was perfect, then as I mentioned, they're often cases where we think we can do\na better, and that's what's prompted us to launch additional funds. But what we found is that when\nyou got to the alternative sleeve, that often you had very small pieces of the eradicating,\nand it just became administratively a little bit of a headache if you had a 1.5% weight in\nREITs and 2% in listed private equity and 2% merge arms. So you had all these little pieces out there,\nA, and B, what you also found is that if you were using ETFs, that often those were just straight\npassive options, and we would essentially dig into the ETF and found that we didn't often like\nhow those ETFs were constructed. So what we decided was to develop 4-H into what we would consider\na single ticket alternative solution that takes all these various alt sleeves and puts them into\none wrapper that's very tax efficient, and where we can also bring to bear the hedging component,\nwhich, again, that is one thing that is congruent with how we ran the private fund in 4-H was\nthat we wanted to have the ability to cut off the tail end of the distribution. When you have\nmarket events like you had in 2020, to a less degree like you had in 2022.\nRight. So can you explain the construction of 4-H? What type of investments are clients and\nadvisors going to see inside of there and kind of just talk about the strategy as whole? Sure.\nSo the components are individual equities and options, and those are designed to reflect\nany number of alternatives, sleeves that we find attractive in terms of an overall investment profile.\nThe fund itself is constructed from both a top down and bottom up perspective,\nand you had a great interview with somebody in the risk parity space, which I was listening\nearlier this week. And I would say their aspects of the top down component that are risk parity\nish. You also had the Black Swan Guide, and there are pieces of it that are a little bit like that,\ntoo, in terms of trying to hedge some of the tail risk. So if you think about it, we look at the\nworld in terms of four broad regimes that you can have, which is, again, sort of like risk parity.\nAnd if you think about the portfolio construction, we have 11 sleeves. So for example,\nyou have a merger, orbs sleeve, listed private equity, royalty sleeve, which the running joke in the\noffices that I love royalties as much as I love my family. So we really had to have some exposure there.\nAnd so those, those weights in the relative sleeves are determined by the top down view within\nbroad parameters. So if we think that we're going to go into more of a risk on environment,\nit will amplify the exposures to what we consider that the higher beta portions of that, or\nthe companies that might benefit from inflation, metals of mining, commodity stocks, things like that,\nwhereas in an environment like we have now, based on the top down view, we're a little bit more\ndefensively structured. So again, I think of a kind of like a soccer team since that's my background,\nbut in the case we're right now, the structure, we've got a few more defenders on the field,\nand then you think about the hedges as being like the goalie. Yeah. So as far as that framework is\nconcerned, when you're doing that analysis, how are you deciding internally what regime you\nthink we're either in or heading in, is that something that you have a process for, or is that\ndone by investment committee? That's definitely a process, and it is very committee-oriented. So\nwill and I are the copiums on the fund, so we work together very closely on that. But also leverage,\nagain, we have a lot of really bright people here at the firm, and those are, we do take input\nfrom them in terms of thinking through what our outlook is. So there's an investment committee,\nbut it's really willing I'm making the ultimate decision. In terms of how we think about the\nvarious factors, if you will. So if broadly speaking, we're trying to determine, this is, again,\nit happens back to risk parity from both an absolute level and a rate of change perspective,\nwhat does growth look like and what this inflation look like? And we kind of break that down\ninto seven different categories. So we're looking at inflation, GDP growth, fed policy,\ninterest rates, credit spreads, stock multiples, and earnings growth, and then we put those on a\ncontinuum, and that can range from more negative all the way to more positive. And what we found\nis that really recently, at least most, most of our indicators have been in the more negative\ncamp. That really helped us in 2022, as we navigated that environment, and clearly in 2023,\nit has worked as well. So, again, to your point about not checking the tracking sheet every day,\ncertainly it's one of those things that you want to be confident in the process, and we remain\nconvicted that over the long term, we're going to be more right and wrong as we, as we get these\nthings on the continuum, but there appears at time when animal spirits take hold, and I think that's\noverseeing right now. Yeah, no, I couldn't agree more. I think you guys definitely aren't the only\nones holding the view that defensive positioning is probably warranted. I have an interview with\nMichael Gade that came out before this interview, and he talks about his indicators were all\nrisk off, but his rotation was in two bonds, you know, long bonds in 2023, or I'm sorry,\n2022, and he's like, look, the signal was right, but my escape valve was wrong, and, you know,\nyou just, you just, you never know what the market's going to bring you, but, um,\nno, and that's a great point, right? I mean, you think about the historical correlation\namong asset classes, and I mean, if you were to just have a time machine said, look, this is\nwhat's going to happen, what do you think would do well, and your anchor on this historical\ncorrelations, you could very easily make that case, which is for us why we prefer to use hedges,\nbecause those are mathematically a more assured way to do it. Now, there is a cost associated with\nthat, and we're dynamic in terms of how we do implement the hedges, we tend to use, uh,\nputs on HYG, uh, we find that that correlation does tend to be higher, uh, but the implied\nvolatility is much lower, and then if we're in a very risk-off environment, at least what our\nmodels are indicating to be risk-off, in those cases, it'll be more of a balance,\nsuspenders approach, and then we'll have a put spread, uh, in this case, on, uh, on IWM, which is\nthe small cap ETF. Got it, makes a lot of sense. So, I read on the fact sheet, uh, something called\nthe O-O-D-A loop framework. Can you explain that, and how is that implemented? Yeah, of course,\nit is, so it's observed oriented side act, which is, uh, I think it was Thorpe's work,\nhe was a fighter, but, boy, it's work. So he was a fighter pilot who came up with this.\nIt's essentially the way that they improve, uh, not only fighter tactics, but also, I think, uh,\nplain development, uh, post-beat-nob. So, it's essentially, you're trying to get through that\nloop faster, um, if you can, from a combat perspective. Now, for us, what we're trying to do,\nis take a look at the factors that are there. So, that's the, uh, the seven factors to what\nI alluded earlier, and, and take a look at what those rates of change are, where they're going,\nand can we get through that loop faster, make those decisions. As a smaller shop, we're clearly\nmore nimble, um, than a lot of others. So, that informs the top-down piece, that, uh, that, the top-down\npiece is something that we're addressing on a monthly base. Uh, I don't want to give a short\ntrip to the bottom-up piece, because that's important too. Yeah, my background was, was more on the\nsmall and mid-cap side, uh, the fun gets categorized by morning star as mid-blend. In truth,\nit's more all-cap. We have a few larger cat names in there, but it definitely skews more\ntowards a small and mid-space, and within that part of the portfolio framework, we are very much\nfocused on breaking the components of, uh, of returns into their, into their various pieces. So,\nin our mind, there are three of those you have yield growth and multiple expansion. Uh, one of our\ninterns just updated the study, uh, that, that looked at the S&P, I think using Schiller's data going\nback to accept, I don't think we went back to inception, because I think that's 1870. So,\nI think we went back to 1900 and looked at the different components of return. And what you find\nis that even though a lot of investors focus a whole lot on that multiple expansion piece,\nthat that really comes and goes, um, decade by decade. Uh, really from our perspective,\nif we can get more of that total return from dividend yield and from companies that we think have\ngood, uh, good prospects for growth, we think that puts us in really good stead. So, that, that\nreally, uh, overarching philosophy as part of the bottom-up security selection, and then those stocks\nare the ones that make their way into the various sleeves. Yeah, that was going to be, that was\ngoing to be my next question. So, we talked about kind of the, the four regimes. And so, once a\nregime is identified, the, uh, is there, are you, are you, are you running a screen for stock selection,\nbased off of these categories that you just mentioned? Is that how you're actually identifying\nwhat is going to go into the fund? Yeah, absolutely. Very, very much screen-oriented. Now, we're not,\ndogmatic in terms of everything having to fit that screen. There are certain examples where\nsomething may come across your guess that that's just too compelling. But on balance,\nthe majority of the stocks that we own in the portfolio would be companies that pay a dividend\nwhere we think there is a good prospect for earnings growth. There are a few some of the parts\nthings that make their way in there, maybe in the list of private equity sleeve or the merger\nare sleeve. But on balance, most of the companies fit within that framework. So, we talked about\nhow investment decisions in terms of, gets made, what goes in the portfolio. Now, when you remove\nsomething from the portfolio, is that going to be the same screen, or, or there are other decisions,\na certain target, maybe something is met that you put in that's done well. How is the removal\nprocess? The other side of that coin work? Yeah, no, that's a great question. And it's something\nthat I've given a short trip to actually in terms of describing the overall process. So, we certainly\nset price targets for the names in the portfolio. And what you find is, because there's an\noptions overlay to this, I mentioned the hedging side of that, we also write calls to generate income.\nAnd we use that oftentimes for an extra strategy as well, especially if you see the implied\nvolatility on an individual name relatively high, if it's getting near our target, we can write calls\nand either harvest that or have a call the way, and we're perfectly fine with that. So,\nwe do set price targets. In those are cases of success, it's right, like that's the ideal scenario\nto exit a name. We also run a sell this fund that we review on a weekly basis. And this goes back\nto my small cap experience where, oftentimes, the narrative is the averaging losers kind of\nthing. And there's the famous Paul Tudor Jones, losers, average losers kind of thing.\nWhich I think was a little bit more to remain for commodities, but based on my experience,\nthat can hold true for smaller cap stocks too. So, on a weekly basis, we're looking at what\nwe would call our interval losers. So, there's a company that lagged the index by a wide margin.\nLikewise, we look at the big winners. We look at companies where they're approaching our price\ntarget, et cetera. So, we look at all those things as we think through the sell this fund,\nand then our exit strategy is informed by if the company is near a target, can we write a call\nand exit that in a little more opportunistic way? And then, of course, the other side of that,\nand part of the beauty of the ETF and the custom basket, is that can we use that function\nto essentially get rid of those gains via the use of a custom basket?\nSo, what about waiting? How are waiting decisions made? I've looked at, you know,\nnot everything in there is obviously equal weighted. How are you guys deciding how many chips to put\nbehind each stock as it goes through the selection process? Of course, conviction weighted.\nWe tend to run a relatively concentrated portfolio. So, normally it's around 30 or so stocks,\nand some of those weights can range up to 6, 7, 8% and those are the names that are higher conviction\nnames than the portfolio, and some of the smaller names are ones that's either A,\nwe've been trimming over time as they've near to valuation target, or B in certain circumstances,\nit might be essentially a sleeve within a sleeve. So, an example that would be in the merger\narm sleeve, we may look at biotech names and try to find a list that are trading below cash\nthat we think have a good catalyst, and those are cases where we don't want to allocate as much\nof the risk budget to a name like that, but we might buy three of those at 1% positions of\npiece, and then concentrate elsewhere in the portfolio. Got it. So, how does the, is the fund on a\nconsistent rebalancing schedule? It sounds like you're just going to let things run if they're working,\nremove things if they aren't, and so it's really a pure active strategy from that standpoint,\nbut are you doing a consistent rebalancing schedule, or is the portfolio just so active that\nrebalancing kind of takes care of itself? I would say the latter rebalancing takes care of itself,\nbut it is a truly active fund. So, we know there are other managers out there who have more of a\ndiscipline to approach rebalancing. We think that's great. That's just not how we run the portfolio.\nAgain, most everything comes. There's a result of our weekly investment committee meeting\nin the event that something falls outside of that, and it's an idiosyncratic event. We'll address\nthat as PMs, and then work to either enter or exit that position in is judicious away as possible.\nSo, let's talk about the hedges, and also the calls that you, that you write,\nis the fund, can the fund get net short ever, or is it going to stay kind of long only or net\nneutral, and then on the flip side of that, if you're buying call options, does the fund ever take\non some leverage? No, no leverage. We use options just to manage the risk, and again, part of\nthat risk is trying to manage the drawdowns, which the fund did well in 2022. The other piece of that\nis writing the calls to harvest income in as an exit strategy for for some of the names. So,\nthat is really the extent of how we use the options in the fund. I think by prospectus, we may be\npermitted to buy calls. That's nothing we've done. It goes if you had a scenario where the market\nwas massively, let's just say you had an event, and the hedges were paying off massively, and you thought\nthat there was an opportunity there that you could allocate to calls, but that's really nothing\nwe've envisioned. This actually, we use the hedges as providing capital to then fund a repurchase\nof the basket at less expensive prices. Got it. No, I must understand that myself. Yep, that makes sense.\nSo, if you're sitting down with an RIA or an advisor that's either at working at formidable\nor hopefully outside as you scale this thing, how would you use this inside of a already existing\ndiversified model portfolio? Where would you, where would you kind of bucket it and what investments\nthat might you typically see in there already? Would you suggest to maybe peel from to add exposure\nhere? Sure. We've seen people bucket it in two ways. One would be, as it was designed, which is the\none-stop alt-sleeve for portfolio, and depending on the overall asset allocation, that could be between\n5% and 20%. The other way that we've seen some people use it is because it's categorized as\nmid-blend, and because you do have relatively the reasonable portion of the portfolio that is small\nand mid-cap, we have seen some people use it for more small, mid-cap exposure, but you would have,\nyou would certainly have some basis risk there because it's just not going to track that in\nnext particularly. To be perfectly blunt, it doesn't track any index particularly well,\nwhich is a blessing in a curse. So certainly a blessing in 2022, when you had during a down market,\nI think incredibly good performance versus a pretty large drawdown, and then obviously,\nless good this year, but I think that speaks to essentially our ability to deliver\nuncorrelated returns here, despite the fact that the portfolio tends to be majority equities.\nRight, and I always find that question funny when I'm talking to an advisor about a model\nthat we're running or our ETF, and they're saying, well, the tracking air is really high.\nI said, well, yeah, if I'm going to create any alpha for you on the downside,\nor the upside, we need to have some tracking air in there, and add some diversification and non-correlated\nbenefit, or else, I might as well just buy the essay. Yeah, absolutely. That's well said.\nI agree with that 100%. And that can make it challenging, but it's also why we think the fun\nis a great compliment to where most investors are, right? I mean, we're at the point in a market\ncycle, where the S&P is once again crushing everything, and it really is down to a handful of\nstocks, which I know you've had prior guests talk about that, and it's in the zeitgeist\nof a bar of this where you look. But no, it can make it a little bit tougher sell,\nand a good friend of mine once said that really within you portfolio, there should always be\none stock or one fund that you really don't like at any given time, because that's your\ndiversifier, and I think that's really the role that we play, again, to make it more of a soccer\nnow. This fund is different. Everybody wants the striker fund, the fund that's glitzing glamor\nand story stocks and all that kind of thing, and I would do this fund is more like an attacking\nfullback, where when the opportunity presents itself, we'll get aggressive, but on balance,\nour job is to play a fair bit of defense. So I think it's maintaining that discipline that really\nhelps us fund what we want it to do, and again, we would encourage investors to look at it from\nthat perspective. Yeah, and I couldn't agree with that more. What we've seen, you know, in our\nexperiences, especially with kind of small to mid-sized RIAs, is that they tend to want to\nstrategy chase, and they'll come in and buy a fund like yours, or buy a fund like ours,\nafter the damage has already been done, when in reality, that should have been allocated to it,\nwhile the party was still going on, and just stay in the portfolio all the time.\nRight, like our phone was ringing a whole lot more in January and February on the heels of 22,\nright? It's been pretty quiet lately, but I think what that shows you is that for a fund like\nyours, a fund like ours, but yes, it's a, when you get a drawdown, and you need to reallocate\nto risk assets strategically. It's a source of capital, and then you opportunistically rebalance\nto it when it's out of favor, and maybe you're harvesting some gains in your large cap growth\nand you're allocating to all, so the time like this, right? That's how a discipline advisor\nwould tend to use this fund, and we're lucky enough here to have a lot of great and disciplined\nadvisors who are using the fund that way. Yeah, no, that's great. So outside of the advisors at\nformidable, how are you guys approaching kind of marketing and distribution of the fund? Right,\nthat we talk about all the quote unquote hard stuff of making investment decisions and putting\ntogether a really unique and differentiated and robust strategy, but really it all comes down to\ncan we raise assets? And so how is marketing and distribution going and what are some things that\nare working, maybe what are some things that you still find to be a bit of a challenge?\nNo, for sure, and one of my lessons from working at Opus was that to sound\nMarxish, but it's important to control the means of distribution. So we were terminated from a couple\nof sub-advised relationships there, and that really gets one to focus on how do I distribute this\nmyself? So from our perspective, clearly we have the formidable RA as a great source. We are working\nwith a third-party firm, safe harbor, to help with more of the traditional distribution. So that is\nthe very much to cliche feed on the street, knocking on doors, making phone calls, email, campaign,\nkind of thing. And that's still in the earlier days. I mean, as you know, the sales process is\nrelatively long, even for traditional funds that have great performance. Again, this is a much\nmore esoteric fund that is uncorrelated. So it's an necessarily be a longer sales cycle from that\nperspective. So for us, we think that a really unique way that we can attract assets to the fund\nis by drawing people into, I guess what I would broadly call the formidable ecosystem. So\nI mentioned earlier the hub and spoke model that we have. So we can use that to attract\nother advisors to join the firm, and then all of a sudden they express an interest in using\nthe fund. We generate a lot of great intellectual capital, market commentary, model port, like\nwe're doing all this work already. So it makes perfect sense for advisors to join us or for those\nthat don't want to join us and continue to do their own thing. One thing that we've explored\ndoing is doing this and more of an outsourced CIO type of way where we can help these advisors\nfocus more of their time on attracting new clients and taking care of current clients. As you know,\na lot of these RAs tend to be pretty small. They don't necessarily have a team of CFA charter\nholders and research analysts to do their work for them. It can be one or two people who wear\neight or ten different hats. So we see that avenue in terms of being a partner for some of these\nfirms to provide a more holistic investment solution powered by our ETF as a way that going forward,\nwe're going to be able to generate some traction for the fund. Yeah, I think that that part of the\nbusiness at OCIO business is just going to continue to grow. I mean, as people become more\nentrepreneurial in nature and want to put their own single out, you've got a hundred or two hundred\nmillion dollar broker who leaves a wirehouse and decides to open up their own shop. I mean,\nthey were used to having those services provided and quite frankly, when you have the accounting\nhat and the marketing hat and salesperson hat and the planning hat on, you know, trying to build\nportfolios and stamp on top of research can become quite a challenge. Well, there's no doubt\nabout it and I remember meeting with firms years ago and they would spin out of a wirehouse\nand they would celebrate the freedom that they all of a sudden had and then all of a sudden you're\nin this, you go from this very well defined sandbox of investment choices to this undefined\nsandbox of choices and you're just it's decision fatigue, right? Like we've all seen the studies\nfrom a behavioral finance perspective where you can only deal with a certain number of choices if you\nwill. So that's just the math of it. And again, I think that we we're reviewing a lot of\nstudies as we started to put this together and there are essentially three main responsibilities\nthat advisors have, they typically work a 53 hour week, half that's taken care of clients,\n40% managing their business and 10% investment. Well, I have to tell you, I spend a whole\nlot more than five hours. I'm sure you do too on managing investments and that's kind of the\nminimum one. Like it's just if you're only spending five hours a week doing that, you're just\nnot going to be able to do it as well as you probably want or that your clients probably want.\nAnd I think there's actually a pretty big disconnect too between the relative value that clients\nplace on investment performance and unique portfolios and how much value the advisors place\non those based on the studies I've seen. So I think that disconnect is really an opportunity for\nyou and for us to find some of these advisors who might be willing to take a step back and\nto be perfectly fair. Again, I'm I'm grateful to work with a lot of really great CFPs. They're\nincredibly nice people. Their time is much better served being in front of clients. I'm a much\nmore personality person. My nickname here is the algorithm because I don't have any feelings.\nThey don't want me in front of clients. They want me here cranking away in my computer making\ninvestment sessions. So it's kind of a highest investor use of time kind of thing too, but I think\nmore firms are starting to come to that realization. And again, I think that's a great opportunity\nand it's the best thing for the client ultimately too. I think they're going to get better out\nhome. Yeah, no. I agree with all of that. That's funny. You know, I was a CFP charter holder\nfor a number of years and realized that I'd belong behind the computer as well. I don't do\nI don't love the one-on-one planning component, but you got to find, you got to find what your\nwhat your lane is, but I can relate to you, Adam. That's awesome. Yeah, no doubt about it. Again,\nmy first shot was working for a CPA firm that was always the old joke is that the extroverted\naccount, it looked at the other guys, she used kind of thing. There's some truth in that, so. Yeah.\nSo before I let you go, do you guys have any plans to maybe launch some more funds or you're going\nto keep just laser-focused on your first issue here? So we have two that are active currently,\nand then we have a third that is undergoing SEC review. I think literally as we speak, I don't\nhave an update from our council on that yet, but we are working on a third that we think is going\nto also be, I probably shouldn't say too much about it, but we're excited about that. It really\nbuilds on that, that the D component of our D plus G equation. So I didn't, I didn't notice the other\nfund. I'll let you take a minute or two if you'd like to talk about it. Oh, of course, yeah.\nSo ticker is, is Kong, K-O-N-G, which is a tremendous ticker. Erie Balkhun is even tweeted about it\nwhen the fund was launched back in July of 22, so we've got that up at the office here. Really,\na little bit of a legacy fund, so it's a strategy that will put together before I join the firm.\nIt's called the Fortress Strategy, and so Kong's name is the Fribble Fortress, but really focused on\nhigher quality and bid to large cat names, quality businesses, strong growth, high margins,\nfortress balance sheets, etc. So that, that is how that fund is put together similar from the\nperspective in terms of concentration. So about 30 names there as well, maybe a little less active\non the, the call writing side, a little more disciplined on the rebalancing side. We tend to do\nrebalances a year there, since it is more, more factor oriented than 4-H, as far as that goes.\nYeah, it's been something that's been great. It does have a tail head shoot as well, so that's more\nof a, a put spread on the S&P, since that's a little bit better reflection of Kong's market cap\nversus 4-H's market cap. Got it. Stumglad, I'm glad you, I'm glad I asked that question, because I\ndidn't know that was out there, so I might have to have you back on to talk about Kong another\ntime and dive into a little bit more detail on it. But with love that, we may have made\nme through that one over to Wilson's, that's his baby. Okay, yeah, happy to talk to Will.\nLook, where can people, before I let you go, where can people learn more about\nformidable, where can they learn more about 4-H, where can they learn about Kong, where\nsolve your information out there? Of course, so a little bifurcated here, so as you know, in terms\nof dealing with the world of ETFs, a little limited in terms of what we put on the funds website.\nSo if you want more information on 4-H or Kong, you can go to formidablefunds.com.\nIf you want more information on the parent company, the RA, if you will, that is formidableam.com.\nAnd I would say there, you're probably going to get a little bit more appointed commentary.\nWe write a monthly newsletter, actually, in the process of working on that now, that is titled\nto think a break point or point break. So we have a little bit of fun with that.\nOur podcast is there. Some content, we write for Forbes, et cetera. So formidableam.com,\nprobably get a little bit more insight into our thinking more holistically, and then\nformidablefunds.com is where you're going to find the meat and potatoes on the funds.\nBack, she's perspective, all that kind of thing.\nWell, Adam, I appreciate and I'm very thankful for your time. Thanks for joining us.\nThank you so much. Yeah, and we'll talk to you soon. I hope to run India at some point in the\nfuture, hopefully to conference or DTF conference and be able to meet you in person.\nWould love that, absolutely. All right, have a good day, Adam.\nThanks for taking care. See you, bye.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}