{
  "id": "13428351",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nToday we have David Shohoff.\nHe is the CEO and founder of MUSQ, which is the first pure play music ETF.\nHe is a very compelling background, very interesting and fun and unique background.\nAnd we talked a little bit about that, we talked a little bit about the innovations\nthat are happening in the growth in the music space.\nI think you're going to find this conversation very entertaining, also very educational.\nI think David's done a wonderful job constructing his index, and please enjoy this episode\nwith David Shohoff.\nDavid, welcome to the show.\nThanks for having me on your show, Brad.\nSo you have one of the more unique backgrounds.\nI would say prior to starting an ETF.\nCan you tell us about your background on what led you to ultimately found and start MUSQ?\nSure.\nWell, I've been in the music industry for my entire life, really.\nI went to Georgetown University, graduated college early.\nAnd the first job I had was working for a guy named Jimmy Ioveen at Interscope Records.\nJimmy later went on to, he was the founder of Beats with Dr. Dre, which they sold to Apple for\n$3 billion, but I started working for Jimmy getting exposure to the music industry.\nI went back to law school, got my law degree, and then I was recruited by Disney to go work at Miriamax\nand Dimension Films, and I was the music attorney there for seven years, also overseeing\nall the music for the studio.\nAnd during that time, my developed relationships with songwriters, publishers, labels,\nconcert promoters, everybody sort of in the home music industry.\nAnd I went on to start my first company, company called Evergreen, which was a private equity\nback company.\nI was backed by Lehman Brothers.\nI'd raised $100 million in financing to go and roll up music companies, roll up music publishing\ncompanies, merch companies, record music companies, and we bought everything from Bill Monroe to\nDeath Row.\nWe acquired everything in Bluegrass, Hip Hop, Rock, a lot of jazz catalogs, and consolidated that\nportfolio and sold that to KKR.\nThat company became BMG rights management.\nAnd after that, I went on to become the president of two other music companies, including\nmy last company, which was a company called Live One, a public company, which owned Slack\nor radio and podcast one, and over that time during my career, also was the sponsor and board\nmember on two SPACs, so I raised two SPAC vehicles to go in a choir companies.\nSo I've been running sort of public and private music companies for the better part of 25 years.\nAnd I guess around this time last year, I was leaving, I spent four years at Live One,\nand I was thinking about what to do next.\nAnd I said to myself, I can't really go back into publishing because like everybody's doing publishing.\nEvery private equity firm is paying 25 times for spring, steam, for Bob Dylan,\nfor Neil Young, for Tom Petty.\nI wanted to create something different.\nI wanted to sort of blend my skills as an investor and as an experienced operator and music\ncompanies, and I decided to create an exchange trade, an exchange traded product.\nAnd what I realized was over my career bread that it was really hard as an investor to get exposure\nto music. You had to be an LP, a lot of these private equity firms that I mentioned.\nAnd you had to show net worth of whatever it was, a million or five million dollars.\nAnd so over the last 10 years, you've also seen an explosion of music companies become available.\nYou have everything from streaming to content, a live music to ticketing, to satellite and to radio.\nSo I wanted to design and create something as an investment product for the masses.\nSo that's sort of my background and where I got to today.\nYeah, well, I would say that there's not probably not too many people on planet Earth,\ngiven that experience that have more knowledge or deep knowledge of the music industry than yourself.\nSo I'm actually excited to talk about some of the things that are going on in the music industry.\nAnd just as hearing that, I got to ask who's got to be the most famous musician or artists you've ever met\nin your long-tenured career in the music industry?\nWell, you know, I've had the privilege and the good fortune to meet a lot of talented artists.\nBut I'd say probably the most impressive artists that I had time to spend time with get to meet talk to was Bruce Springsteen.\nYeah, probably the most interesting, the most charismatic, the most deep-thotted songwriter that I've ever had a privilege of talking to.\nThat's really cool. My father-in-law will appreciate hearing that. He's a big Bruce Springsteen fan.\nSo I ask everybody on the show, what do you like to do outside of outside of the office?\nYou know, what are some of the hobbies you have, maybe outside of music and outside of, you know, investing in companies?\nRight. Well, you know, so one is naturally related. I play a lot of guitar and I do a lot of songwriting myself.\nPurely recreationally, but I am a songwriter. I like to play harmonica and I like to play guitar and play piano.\nBut I'm big into sports. You know, I love tennis. I love golf. I love snow skiing in the winter.\nDo a little bit of surfing. So I'm pretty active.\nYeah. No, that's, I had a feeling you were going to just reading your bio and looking at everything you've done.\nI had a feeling you were going to say guitar. So, so let's talk a little bit about the music industry as a whole because I'm fascinated after reading some of the literature you had.\nSo what are some of the innovative things that are happening in the music industry today that investors need to be aware about?\nYeah. Well, look, streaming is driving a lot of the industry today. It's driving about 40 to 50 percent of the revenues and, you know, every, you know, every individual on the planet today that has a mobile phone is a potential new music user.\nSo you think about the tam on that. It's pretty, it's pretty big. I mean Goldman Sachs just reported that the industry was going to double to 131 billion by 2030, right?\nAnd a lot of that is driven by by by the top streaming companies like Spotify, like Google, like Apple. So that's driving a lot of the revenue.\nAnd, and then content is driving a lot of the revenue. You have, you know, a lot of big companies around the world. Big Cape Cape Pop is becoming a massive force.\nYou look at our index. I think we have maybe 10 companies. I think seven content companies and three streaming companies that are in Cape Pop.\nAnd so just, you know, every country in the world now, you know, has some music service, right? Whether it's in China, you have cloud music or 10 cent music or Japan or Korea or India.\nSo, you know, it's a global force and streaming and content is driving a lot of that. That's about 70 percent of the companies on our index are about or about streaming and content.\nSo, you know, the, the tam is big. It's growing. Live music is growing. You saw what happened with recent tours like from, you know, tamper Swift, the aristore and the yellow brick road. These are massive numbers that are having huge impact on all of these live music and ticketing stocks from, you know, from live nation to Madison Square Garden to sphere all the ticketing companies like vivid seats.\nYou know, like CTS eventem in Germany, you know, these are all very big businesses. Kids love kids are driving. Kids and super fans are driving the industry today.\nGen Z audiences and millennials are driving a lot of that streaming. You saw about a week ago, Warner Music Group license. It's entire music catalog to tick-tock.\nWell, it was a very big deal because that's where the audience is today. So, so it's a, it's a booming industry. It's growing and, you know, all these companies are on MUSQ.\nYeah, and it's not only is it a growing industry, it's something that's never going to go away, right?\nI mean, everybody's going to always love and consume music. It's just how we consume it in the, in the avenue in which we consume it. I mean, I want to talk about that in a little bit, but AI is a really hot topic right now.\nHow is, if at all, at this point, do you see new innovations or disruptions to the music industry kind of by this AI boom? Is it going to affect more of, you know, maybe the editors or even songwriting? I mean, where do you see AI fitting into the music industry?\nSo, I see AI very complimentary to the music industry. I don't, I don't view it as a threat, you know, remember, every like 10 years, there's always a new piece of technology that disrupts everything.\nWhat you go back, whether it was compact disk and everybody was like, oh my God, what do we do with our vinyl collections? What do you do? You replace them and that exploded, right?\nYeah. That like doubled the industry when compact disk came out. So, you can go through every 10 years in the snaps. It was like, oh my God, Napster, everybody's stealing music. And then what happened? Then you had page streaming platforms. So here we are 10, 15 years later with AI. What AI is doing, Brad, it's giving creators new tools to create new music, right? It's giving an opportunity to, you know, even the most amateur,\nperfect, on, in the most amateur musician to create music. So it's giving them tools to do exciting new things. You saw what Paul McCartney just did, which online and which is incredible.\nYou know, kids out of their bedrooms now can create new songs. I think something like 120,000 new songs are being uploaded every day.\nAnd what that's doing, by the way, it's making the labels even more valuable, right? Because now you have curators, right, that are actually out there having to listen to this music.\nYou still need, like, a company to come up with a marketing plan to come up with a song to take to radio. But like, but the point is that anybody can actually create music right now. They have more tools available themselves. You know, you saw what happened with,\nwith, with Drake and the weekend and some of the piracy there. But look, when that happens, when you have a fake weekend or a fake trick, like there's a take down notice, right?\nThey can send immediately. So, you know, general counsel was on right away to Spotify. They took it down in a second. So there is the threat of piracy.\nThere's the threat of forgery with AI, but I think the benefits far exceed, you know, the threat of the costs associated with it.\nYeah, I would agree. So last question before we talk about the ETF.\nYou actually just mentioned this where we went from, you know, vinyl to compact disc to CD to now everything is, you know, digital, not everything, but mostly everything is digital or streaming.\nHow do you see, you know, 10 to 15 years from now us consuming this type of content, whether it's just music in general, or, you know, having the ability to maybe have immersive experiences at a live show from sitting on our couch.\nHow do you see, how do you see the regular everyday consumer 10 and 15 years from now consuming this type of content?\nYeah, so I see it as, you know, everybody has a mobile phone 10 or 15 years from now. Everybody is consuming short form content, whether it's short form video and everybody's accessing music, right?\nAnd music's incorporated into every aspect of life. You go back to and every video, every, everything you see all day.\nYou mentioned something about consumption and food and water. That's really our view.\nOur view is that this is a non-correlated investment and it's as important in life as food and water.\nI don't think a human being can go through life without listening to music in some way.\nYou celebrate music and good times at your weddings and your prongs and you celebrate and you use music, you know, an unfortunate times like COVID.\nSo 10 or 15 years from now, music is more ubiquitous than it is today.\nPeople are streaming it. People are consuming it. It's on their phone. They're accessing it all day long.\nAnd then, and people, and once they discover that music, they want to figure out who that artist is, right?\nThey want to learn about that artist, right? And then they want to go see that artist perform.\nLike, they want to actually see that person. I'll never forget when my daughter saw Taylor Swift for the first time at the IR radio festival.\nAnd she and it was like this, this genie that came out of this bottle. And the look on my daughter's face.\nAnd if she had been listening to Taylor Swift, it was like that figure came alive.\nRight? That was a beautiful moment. And that's why that's why live music is so important.\nSo streaming content, live music, that's driving the industry.\nAnd radio, people still want passive experience. You still spend two to five hours a day in the car,\nwhether you're commuting to work, whether you're driving to see your friend.\nAnd that's a passive time for you can't look at your phone.\nObviously, you're driving. But what you can do is listen to the weather.\nYou can listen to news. And you can discover new music.\nSo music discovery will continue with radio. It will continue on your phone.\nStreaming services will thrive. Content will strive. Live music will strive.\nPeople will continue to buy tickets. All these companies are on our index.\nAnd that's why we believe that music is like part of life.\nYeah. Well, let's talk about the index.\nYou make a very compelling case about the growth and the opportunities in the music industry.\nSpecifically, you know, going forward. So let's talk about MUSQ.\nWhat types of companies are you investing in?\nI know they're in the music industry. There's some companies.\nI briefly looked at the holding.\nThere's some companies we know. There's some companies that I don't know.\nSo can you talk about how that, how you're putting that index together?\nAnd what type of companies you're investing in?\nSure. So the companies really fall into five different categories.\nRight, leading the category would be streaming companies.\nRight. We have 11 companies on the index there.\nSo those are big companies like Amazon, Apple, Google, Spotify.\nYou have companies like Cloud Music, Tencent Music.\nAnd you have smaller companies like click digital like live one.\nRight. So those are all streaming companies.\nThat's about 35% of the portfolio on the index.\nSecond big subcategories content.\nSo there you have big obvious names like Universal and Warner Music Group.\nThen you have all the big Kpop companies.\nYou have, you know, you have high, you have JYP, JYP plus.\nYou have SM Entertainment. You have Cube.\nRight. These are all very big businesses.\nVery big important companies.\nThen you, and you also have companies in every country.\nIn Japan, you have a muse. You have next stone.\nIn Thailand, you have him.\nAnd then you have the smaller royalty trust that are actually really important.\nAnd focused on songwriters and publishers.\nYou have companies like Reservoir, Music and Hypnosis and Round Hill.\nSo those are all of the content companies followed by content.\nYou have, you have live music and ticketing.\nRight. So there you have some of the obvious names like, you know, live nation.\nMassless regards, fear entertainment, CTS event and vivid seats.\nThen you have equipment and technology.\nYou have important companies like Yamaha, Rollin, Sonos,\nAvid, Dolby Corp.\nThese are all companies that are whether they're producing guitars or producing keyboards\nor producing the editing equipment that musicians and artists\nneed to need to record music.\nLike these tools are all on the index.\nThen you have radio, right?\nAnd you have broadcasting.\nSo you have companies like IHeart, which are so all around the country.\nYou have companies like Serious Radio.\nYou have companies in Australia like Arne and Southern Cross.\nYou have Town Square Media.\nSo those are the five categories.\nWe have 48 companies on the index.\nAnd we give investors broad exposure to the entire ecosystem.\nMUSQ is the first pure play music ETF designed to give investors global exposure\nto the music industry ecosystem.\nYeah. And I think that's important too.\nGetting global exposure is not just domestic.\nAnd so I'm curious.\nHow are you locating these companies and these investment opportunities?\nIs it market knowledge or are you running some sort of screen?\nHow are you finding these opportunities?\nOkay. So just on your on your previous point, you are correct.\n45% of the companies are domestic.\n55% of the companies are foreign.\nAnd that's why we think that's a unique product too.\nIt's giving you giving investors access to all these companies.\nAnd for the self-directed Robinhood investor,\nthey can't typically get access to those international companies.\nThey have to open up custody accounts and it's difficult for them to get access.\nSo this gives them broad public exposure.\nSo, you know, Brad, when I was thinking about first of all,\nI kind of like reverse engineer this.\nIn my head, I wanted to create the most perfect product for music.\nRight. So I thought about all these companies in my head for a long time.\nLike, wow, this could belong.\nThis belongs on the index.\nThat belongs on the index.\nThen I had to like, okay, after I had that in my head,\nthen I had to actually design rules around them.\nAnd I had to figure out, okay,\nhow do we actually create the index?\nSo MUSQ is a passive index.\nAnd the rules, which I designed in partnership with EQM,\nmy higher Jane Edmondson over at EQM,\nand she's been amazing to work with.\nYou know, we spent probably six months designing this, right?\nAnd so what we came up with was a methodology,\nwhich we first, you know,\nscarred the universe for all music companies, right?\nThat were either directly involved in the commerce of music\nor peripherally involved in the kind of ecosystem of music.\nWe concluded was we designed an index that had had to include companies\nthat were generating at least 50% of their revenues from music.\nThat was one critical criteria.\nOr they were a top five player in one of those sub five categories.\nI just mentioned, or they controlled greater than 10% of the global market share\nand any of the five categories I just mentioned.\nSo that includes small cap mid cap and large cap companies.\nAnd on the small side, they couldn't have a market cap less than $100 million.\nThey also had to have minimum trading volume of $500,000 a day.\nAnd if they had less than that, $200,500,\nthen they would receive a half weight.\nSo all the companies, all the companies are market cap weighted.\nThey'd be a half weighted if they fell 2 to 500,000.\nAnd the big names that I mentioned, because I had to include them,\nright, they're all top five players, even though you don't think of Apple\nand Amazon as like pure play music companies.\nThey're still top five players and Apple is number two.\nAnd Amazon is number three and Google is number four after Spotify.\nAnd they and their market caps are, their market weights are capped at 7%.\nSo this index gets rebalanced every quarter.\nAnd even if Amazon goes above 7%, you'll have to see it rebalanced at 7.\nBut that gives you kind of the perspective on what the index looks like.\nAnd what are the advantages of all the companies across all those subcategories?\nYeah.\nAnd you just answered my next two questions.\nAnd you're definitely deeply familiar with how you put this all together.\nAnd thank you for that.\nAnd it makes sense to halfway some of the small caps.\nSo, where do you see you mentioned Robinhood investors?\nDo you see this product appealing more towards the retail crowd?\nOr are you trying to also talk with investment advisors about the opportunities\nand growth of the music industry to have them also see the potential, you know,\npotential for this, you know, outpacing the growth of the S&P 500 or whatever it might be, right?\nWhere do you see this product fitting in?\nYeah. So, first of all, it is outpacing the growth of the S&P.\nThe index is up 22% for the year.\nAnd the MUSQ index is up 22% for the year.\nAnd it is outperforming the S&P.\nSo it's definitely a product for RIAs.\nI see this and honestly, I see this in every portfolio allocation.\nI don't know how you don't have one or two or three percent whatever the number is.\nIt's not correlated.\nYou're getting, you know, very strong returns.\nAnd, you know, it's technology.\nIt's a lot of exciting things that you want to own.\nSo, I do think the RIAs are excited about this product.\nI think it's for pension funds.\nI think it's for hedge funds.\nAnd I think it's for, you know, self-directed Robin Hood invest.\nIt's really for everybody, right?\nFor somebody who has $10 dollars, $100 dollars, a thousand dollars.\nAnd if you want, you know, to put a million dollars or $5 million dollars,\na $10 million dollars, it's there too.\nIf you want exposure to music, that's what this is.\nIt's a very neutral platform for exposure to the whole industry.\nAnd, and for, like I said earlier,\ninvestors shouldn't have to like lock their money up.\nFor years, you had to be an LP.\nYou could not, uh, you could not get exposure.\nAnd, and even to now today, they shouldn't have to pick,\nlike, do I decide to invest in live nation?\nBecause tours are up or do I invest in universal?\nBecause Taylor Swift is like signed to Republic Records\nand Republicans owned by universal?\nNo, you shouldn't like, there's a lot of work to do, right?\nYou're missing out on Bruno Mars, who's signed to Warner Music Group.\nYou're missing out on Springsteen, who's signed to Sony,\njust by the index, you get exposure to all these companies.\nBut I think it's really exciting for, for all the investors, uh,\nyou know, retail and I think, and sophisticated investors,\nwho see the value of music.\nMusic is really too big to ignore today.\nIt's too big of an asset class.\nAnd there's honestly too many companies today\nto like study into diligence.\nYou know, these, uh, investors don't really have the expertise\nand the resources, but they need exposure to it.\nAnd that's what this is designed to do.\nIt's affordable and convenient way for all investors\nto get exposure to music.\nI love that.\nAnd so with that being said, because it kind of, because you believe it fits\nreally with everybody, how are you thinking about marketing and distribution?\nYou know, what is your plan in terms to really get the word out\nand start getting flows into the, uh, into the font?\nYeah, so there's a couple of things.\nSo we've been, uh, you know, I've been out there promoting it,\ntalking to, you know, we've had nice articles written in barrens, uh,\nall the ETF period articles.\nWe've got some nice interviews on, uh,\nI was lucky to be a guest on like, you know,\nTD Ameritrade and, uh, you know,\nthanks for having me on your show podcast,\nlike yours.\nYeah.\nSo they're doing, you know, a lot of advertising and promotion.\nUh, you can follow me on LinkedIn, by the way.\nI regularly write, you know,\nthoughtful articles.\nI think about the industries.\nYou can follow me David Schohoff on LinkedIn,\num, where I provide, you know, all kinds of educational content,\nuh, white papers that we wrote, uh,\nyou know, all kinds of articles, uh, anything going on like,\nlike YouTube raises rates last week.\nWhat is active to the streaming stocks,\nSpotify raising rates?\nWhat does that do to the streaming stocks?\nDo I talk about current events that are happening?\nAnd how that dovetail back into the index?\nUh, so I maintain, you know,\na strong online presence,\nwhether it's on LinkedIn or also on Twitter.\nUh, we're doing financial advisor outreach.\nI've got a couple of webinars coming up.\nI'm invited to speak a future proof in September.\nAnd then we have partnerships and sponsorships.\nSo we're, uh, we're actually sponsoring a few upcoming conferences, uh,\nmusic industry conferences.\nSo, you know, all kinds of marketing strategies.\nAnd then lastly, you know,\nwe're about to announce some partnerships with some artists that are getting on board here.\nSo the artists will be promoting it,\nuh, will be doing deals with them, uh, you know,\nso my goal is to make, you know,\nand then lastly, we're also going to do a, uh,\nan MUSQ conference where I invite all the CEOs of all the companies, uh,\nfrom all that.\nAnd if you're an investor,\njust like the Baron conference, you get an invite invite invitation to the Baron\nconference, you'll get an invitation to the MUSQ conference.\nThere'll be artists there for you to mingle with.\nThere'll be panel discussions with CEOs.\nUh, so our goal is to kind of do a lot of outreach to the finance community and,\nand give, you know, all investors access to,\nyou know, all the exciting things we have going on in the music industry.\nThat's great. No, it's, and, and you,\nhaving such a niche product with such a singular focus,\num, I think gives you an upper hand in terms of marketing and distribution and partnerships.\nAnd so, well, I'm going to,\nI'm going to be buying shares now,\nbecause I want to come and mingle with some artists and hang out at your conference.\nAnd I hope to see it future proof.\nI need, I believe I'm going to be out there as well,\nmaybe only for a day or so,\nbut it's all very exciting.\nUm, and congratulations on the work,\nbut you're a recently launched fund.\nAnd I, I believe I saw and correct me if I'm wrong.\nYou're, you're working with exchange traded concepts to,\ndid you work with them to launch the actual fund itself?\nI did. So I designed the index,\nuh, you know, with, uh, with EQM,\nand then I licensed it to exchange traded concepts.\nYeah.\nAnd they've been great.\nYou know, Garrett and Rich Hogan and Jay,\nand the whole team have been amazing to work with.\nYeah.\nSo I had Garrett on the show, um,\nreally an interesting guy and, um, a cool guy.\nAnd so just from your perspective,\nas, as a, as a brand new issue,\num, it doesn't have to be specifically about exchange traded concepts,\nbut can you tell me a little bit about the process\nthat you went through in order to get this successfully to market?\nYeah.\nSo, well, first,\nI did a lot of research and due diligence, you know,\nso I kind of got the idea as I said a year ago,\nand then I really did diligence on the,\non the whole business,\non the whole industry,\nthe tam,\nhow many ETFs are out there?\nUh,\nI wanted to make sure that I had a first to market,\npure play and music ETF.\nSo I was confident that I had that product.\nI designed that product,\nand I had to quickly get it to market,\nwhich I did.\nUm,\nand I wanted it to be a compelling product,\nand I wanted it to be a,\nwe back tested it to death.\nI wanted to make sure it was a great product that was going to deliver\ngreat returns to investors.\nAnd I think that we put together a product that aligns\ninvestor portfolios with that opportunity.\nSo I'm very proud about that.\nUh, and then, uh,\nand then we took it to market.\nAnd then, you know, once I identified,\nuh, you know,\nthe partners,\nwe then, you know,\nrushed to, you know,\nfile the paperwork.\nUh,\nand it was all done,\nyou know, in that 75 day period.\nAnd we had comments back with the SEC.\nUh,\nwe, um,\nyou know,\nand then we had to design our website.\nWe had to,\nyou know,\nget that live.\nAnd then, uh,\nyou know,\nhere we are.\nWe,\nthe product is now,\nthe product is now live.\nAnd, uh,\nI think that we were able to,\nreally.\nAnd then I think that we wanted from a successful launch.\nAnd now we're out there,\nyou know,\npromoting it.\nUh,\nAnd getting investors excited about it.\nWell, David, it is very exciting.\nAnd congratulations on the launch.\nCongratulations.\nI know.\nUm,\nwere kind of creeping up on our one year.\nAnd I know that, uh,\nthat's three to six months of work.\nor longer, right,\nas, uh,\nthat I'll tomorrow get. Before I let you go, any other ideas for additional funds in the future\nor are you going to be singular focused on the CTF? Look, I like the industry. I think I think it's\na clever industry. There's a lot of capital out there. Last, the last, you know, I think Tom\nLydon and Vettified told me there was $10 trillion in ETF money out there. I couldn't even believe it.\nAnd so look, there's obviously a lot of access to capital out there. I think thematic funds are\nreally interesting. You know, I guess I could see myself creating another thematic down the road.\nBut I want to make this really successful. I think this is a great product for everybody\nwho loves music. My goal is to turn this into the triple cues of music, right? When you think about\ninvesting in music, just you invest in music by music, MUSQ. So I really hope, and this is like\nhonestly, whenever happens, I'm just really proud of this product, right? I know I designed a great\nproduct. And I want this to live forever. I think this benefits everybody. Anybody who has a\nfascination and interest in music can now benefit from the industry. And so I just, I would love\nto see this get really big, but I'd also love to see just people excited about it. Yeah. Well,\nagain, congratulations on the launch. I think you do have a compelling product. And before I let\nyou go, where can people learn more about MUSQ? Yeah. So they can go to MUSQ.com. Go down there.\nWe have our fact sheet, our white paper, our investment case, our pitch deck. If you want to read\nup on the index, you can go to MUSQ index.com. There, you can also see another white paper.\nWe've got our methodologies there. Tons of information about the industry. But MUSQ.com is\nwhere you can go to, you know, get all the investor materials that prospectus and you can trade\nfrom there and just call up your broker and ask to place a trade with MUSQ. Well, David,\nthank you so much for your time. I wish you the best of luck and look forward to hopefully\nrunning into you in the future. Likewise, I'll see you at future proof. I'll be on the thematic\npanel on Wednesday, Wednesday morning. So I look forward to seeing you in September, if not before.\nAnd thanks again for having me on your show. Yeah. Thank you, David.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}