{
  "id": "13471022",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for educational\nand entertainment purposes only.\nWelcome to Behind the Ticker.\nToday we have Alejandro Garza.\nHe is the founder and portfolio manager at Aslin.\nThey run the Aslin Global Stock Selection, develop markets, small mid-cap ETF.\nIt is a mouthful, but it perfectly describes what this fund is trying to accomplish.\nIt has the Ticker AZTD.\nThey use a very unique and proprietary rules-based strategy to identify\nin their opinion, the top 27 stocks based on fundamental factors that you should be investing in\nin North America, Western Europe, and developed Asia.\nThere is a real opportunity for alpha generation with this strategy.\nI talk to Alejandro about a variety of things.\nI really think you are going to appreciate and enjoy this episode with Mr. Alejandro Garza.\nAlejandro, welcome to the show.\nBrad, thank you very much.\nVery, very nice being here.\nThank you.\nSo before we get started, please explain your background and eventually why you decided to start\nthe firm Aslin.\nThank you. Yes, well, I started the firm almost seven years ago,\n2016, and right at that point I had spent 10 years with the Aschmore Group,\nand before that with emerging markets management,\nwhich used to be one of the pioneer years in emerging markets investing out of Washington,\nD.C. in the Washington D.C. area.\nSo I had that experience, 10 year experience, before that my experience was in corporate finance,\nand also in the Western Banking Merch and Acquisitions.\nMost 20 years of experience at that point, and really what I wanted to do,\nfirst of all, I wasn't getting any younger.\nSo this was something that I always wanted to do.\nBut the reason why I really wanted to do this was\nand still is because I thought there was a better way of approaching investments\nglobally, and basically what that boils down to is three things.\nNumber one, combining quantitative analysis with fundamental analysis.\nI think the combination of those two ways of approaching markets and investments\nis really helpful, and really provides for a competitive advantage\nwhen you combine those two aspects in an efficient way, quantitative analysis, and fundamental analysis.\nThe other aspect that I thought that we could really make a difference was in terms of stock\nselection. Stock selection meaning you have to build a concentrated strategy if you really want\nto beat the market. So combining those three things, quantitative analysis, fundamental analysis,\nreally in-depth analysis with stock picking and the aim of building a very concentrated\nstrategy or portfolio, 15 to 20 names was really the way that I thought this is the best way\nwe can achieve returns for our clients. It was really difficult to do that in a corporate setting\nor corporate setup. So that's what I intended to do and still try to do today.\nYeah, well, it's an interesting story, and I agree with you. We have a quantitative firm\napplying fundamentals can also be very helpful. So I'm very anxious to get into some of the things\nyou guys are doing with your strategy and how the process works. But before we get too technical,\nI always like to ask, what are some of the things I know you're in Colombia? Right now,\nwhat are some of the things you like to do when you're not running the company, when you're not running\nmoney? Well, let me tell you a little bit about myself, my background. I'm originally from Mexico.\nIt's been most of my career in the US, New York and Washington, DC. My wife is from Colombia,\nand so we spend some time here in Colombia. Maybe one or two months every year, we come down here\nto Colombia. This is a little town in the middle of the coffee fields here. It's a beautiful place.\nAnd we're able to combine some of the things that I'm really passionate about and really\nlove doing. And I've done all for my life ever since I was a kid. Reading is a big one.\nI spend a lot of time reading, hiking, going up the mountains and, you know, through the fields,\net cetera, in nature, that's another thing that we enjoy a lot as a family with a friend, et cetera.\nThe other thing is astronomy. Astronomy and astrophotography. Really, really love that. We have\nbeautiful clean skies here in Colombia, up in the mountains. So that's another big one.\nSo astronomy, reading, hikes and walking up the mountains. Those are some of the big things that\nthat I really enjoy in life. That sounds great. Me being and growing up and living in Pittsburgh\nan old cold town. I couldn't tell you the last time I've seen stars. So a nice clear, a nice\nclear sky would be great every once in a while. And I was wondering, too, you have a unique firm name,\nAslan. How does you come up with the name? What is the meaning behind that?\nYes, absolutely. Aslan is a word from a nautical origin. Nautical is the original language of the\npastics and some of the peoples in the central valley of Mexico. Obviously, I wanted a name when I\nstarted my firm. I wanted a name that conveyed that Mexican origin, Mexican tradition.\nBut I think it also has some beautiful connotations to it. It means it literally means place\nof heron. Heron in Spanish is gas, and that's my last name. So I was able to fit in there\nthe family legacy with the Mexican origin. And it's really a place of mythical origin\nfor the Aztec people. The myth goes that they came out of a place that allegedly was somewhere\nin present-day south west U.S., and they migrated to central Mexico, and then they found it to\nNorth Titlan, which eventually became Mexico City. So that's the origin of the name. And also,\nI mean, I was working with Ashmore, friends of mine were with Trotters, and we have all these\nEnglish names, or Anglo names, that in western Latin America, in Mexico, we wanted to have\nsomething that was from Mexico that in western and global markets. No, I love it. It's very unique,\nand I love the strategy behind it. So, or in the origin behind it, so thank you, thanks for sharing\nthat. But let's jump into, let's jump into the ETF. So let's talk about AzTD, which is your global\nstock, you know, small mid-cap strategy. Let's start at a very high level. What is it the,\nat the outset? What is the strategy really trying to accomplish? Absolutely. Thanks, thanks for that\nquestion, Brad. I think the first and foremost, what we do and the DNA for firm is we try to solve\nproblems. What are the problems that our clients and our investors have? How do we solve those problems?\nThis strategy is a global, developed markets, small and mid-cap stock selection strategy.\nThat's, you know, a long definition, but it says exactly what it does. And it came out of the\nrequirement of many of our clients three years ago, three or four years ago,\nthat we're telling us, okay, we're, we're well covered in the US. We have plenty of ETFs,\nindexed ETFs, we're well covered there. There's, there's some ETFs for emerging markets\nand for global markets. But this segment, we feel like there's, you know, a lot of interesting\ncompanies and there's not necessarily a way of investing through stock selection, a concentrated\nway like like we do. So, so what we did was, oh, and, and also we have a large investor base in\nMexico, obviously, for obvious reasons. And in Mexico, the local regulations do not allow\nfor actively managed ETFs for being listed in Mexico. And at the same time, if you are listed in\nMexico, you have a very significant tax advantages. Basically, a 10% tax, compared to a 30 plus\npercent tax on on on on on on returns. So, we said, okay, we have this quantitative plus\nfundamental process, we're, we're specialized, or we, we, we, we like to say and think that we\nspecialize in stock picking and we like to think that we're, we're good at it and we've had very\ngood performance. How do we build a strategy that is actively managed, does the stock picking\nin a concentrated way within this very specific segment of the global developed markets,\nsmall mid-gap space that can then be instrumented through through an ETF and then processed\nin Mexico. So, we, we, we, we, we set out to first create an index. So, we, we hired the\nselected, which is a European index provider. They're a lot of, uh, Frankfurt and Germany.\nWe created our index with our proprietary model and proprietary rules. And then after publishing\nthe index, the index was first published in November 2021. We then, uh, went with, uh,\ntitle financial group and they provided us with the white label, uh, turnkey solution,\njust following the, uh, the index, creating all the filing and all the, uh, you know,\ninfrastructure for the ETF and eventually listed the ETF August 18th 2022. So, we're just a few\ndays away from our first anniversary. Oh, that's great. Yeah. Um, well, yeah, that's what we did.\nWe, we solved the problem for, for clients. How do we, how to invest in small mid-gaps global\nmarkets through a stock selection strategy? And I want to stay on the ETF, but you mentioned\nsomething there, which is, um, kind of a strong investor base, um, in Mexico. Do you guys provide,\nSMA services on this index? Do you have other advisory type services you provide clients outside\nof the ETF? Yeah. It's actually, we, we started our business as, as an SMA service provider. And\nmost of our business is still in, in the SMA space. Uh, our investor base or client base is 50, 50\nMexico US. So we have, you know, uh, they, they, they significant business in, in, in, in the US.\nAnd, uh, our primary flagship strategy is the, uh, global development market stock selection strategy,\nbut it's a stock picking strategy. That's, an active strategy. And we do the full due diligence,\nand we meet with management companies, etc. And so the AC to the version would be a rule-spaced\nquantitative version of that same strategy. Yeah. And that's what I was going to, that's what\nI was going to ask. I did read it was rules-based, and it is quantitative. Can you, without going,\nkind of too far into the weeds? Um, could you talk about your quantitative process? What are some\nof the things you're looking at? Um, when you're identifying these certain stocks that are going\ninto the portfolio? We'll talk about the holdings, but can you talk a little bit about that quantitative\nprocess and, and what you're really trying to identify? Absolutely. That's, that goes back to the,\nto the origin of the firm, and, and the vision of, um, having a, a clear view of, uh, as to,\nwhat are the, um, you know, going, going one step further in terms of the quantitative part of the\nprocess, what are the specific fundamental variables or factors that within a quantitative framework\nwork best? And, uh, what we've done is we've developed our own proprietary, uh, quantitative model.\nThe model has six basic factors. They're all fundamental. Um, a couple of them, we could say,\nbecause one of the factors, one of the last factors is more of a technical factor. It's the momentum.\nAnd with a momentum, it's a stock price action. There's several components to that momentum piece,\nbut it's one of six. So the other five are really fundamental. First and foremost, free cash will.\nWe firmly believe based on experience that free cash was generation is the variable that really\nallows companies to, uh, to a great value and compound value over time. So we look at free\ncash will free cash will yield, uh, free cash will margin, uh, trends and free cash will. So the whole\nfree cash will component is super important. We look at return and equity. Another very important piece\nin terms of assessing the quality of the business. And it's ability to sustain returns over time.\nWe look at earnings growth. So there's, there's a growth component, uh, to what we,\nto what we evaluate earnings growth. Again, earnings growth trends. Uh, we'll also look at top line growth.\nUh, just, you know, there's, uh, I think some, uh, economies of scale that are captured\nthrough that component within the growth factor. Then we have the earnings revisions factor.\nThere's a lot of information when we started 20 years ago. There wasn't as much information\nas we do now. But now there's just good information in order to build a solid factor around\nearnings revisions. And there's, uh, you know, another component there where a consensus is\nlooking at or seeing the earnings trend going forward. Then very important. We have the value\ncomponent. So there we look at price earnings or the earnings yield. Um, and because, you know,\nwe want to buy high quality companies that grow and compound capital that high rates over time,\nbut are a good price. So, uh, evaluations just, uh, another component. And then finally, as I mentioned,\nmomentum. So we want to have that final confirmation factor that says, okay, yes, this is going,\nyou know, in line with the fundamentals. So I'm assuming, uh, when running the model,\nyou're looking at all these different factors in generating some sort of score,\nand then evaluating those scores and making sure that, um, you know, there's a positive momentum\nsignal behind those in order to really make a selection. Am I summarizing that correctly?\nThat is correct. Yes. That's exactly right. What we do is each of these factors have a\nzero to one metric. They, they have a specific depending on the variation that we're looking at\nfor ACTD and the selective index. This is equally weighted. So each of those six factors is one\nsixth. Um, and each of those, you know, we have a, we have a score from zero to one, one being\nthe top ranked, high, high, high three cash flow, high-sturning zeal, etc. Highs momentum. And what we do\nis specifically for, for the selective index and for the ACTD ETF, which is a stock selection,\nwhat we do is the following. We define our investable universe when we develop\nmarkets with three regions. North America, US and Canada, Western Europe, including the UK and the\nNordics, and the Valtation, which is Japan, Australia, and New Zealand. Three regions. We also\ndefine nine sectors out of the 11 sectors of the general classification that we're used to.\nWe exclude two sectors and one industry. The two sectors that are excluded, energy,\nand because it's a commodity, highly volatile, and in some parts of the\nmacroeconomic curve, we also exclude real estate. A lot of our investors already have a lot of\ndirect real estate exposure in their portfolios. So we don't want to have a double exposure there,\nso it's fluid real estate. And the industry that we also exclude also because of volatility is\npharmaceuticals and biotech. These are highly volatile. So it doesn't, you know, those stocks\nelections tend to work not so well, and a stock selection highly concentrated strategy. So we exclude\nthose, we're left with nine sectors. Industrials, consumer staples, discretionary et cetera, nine sectors.\nWith that, let's think about it as a matrix, nine sectors, three regions. We apply the model to the\nentire roughly four thousand stock investable universe and global development markets, small\nmidcap space, and by the way, small midcap is between 500 million and up to ten billion dollars in\nmarket cap. We apply the model, we rank the entire investor leaders, and what we do is we select the\nnumber one stock in each region sector. So we end up with a 27 portfolio, 27 stock portfolio,\nwith those 27 selections. So you actually walked into my next couple of questions beautifully,\nand I think you, I just want to expand on this a little bit because it's really interesting. So\nfrom a region's perspective, there's, are you equally waiting the regions by doing that,\nor is there constraints on region? Can you talk about specifically kind of, because when I looked\nat, when I was looking at the holdings, it looks like some regions as of right now as a snapshot\nmight be heavier than others. So does that just how it plays out? Can you just explain that a little\nbit more in depth? No, absolutely. That was part of the problem solving process that we looked\nat when we were creating the indexes. How do we define the portfolio weights, the stock weights,\nsectors and regions? We went through several iterations, there's a lot of work there, and we concluded\nthat the ECR solution or the ECS one was, the simple solution was the best solution. And that\nwas an equally weighted portfolio. So each of those 27 stocks has an equal weight. So that in\nturn translates into a third for each of the three regions in North America, they're all\nEurope and the rotation, and also one ninth for each of the nine sectors. So with that, what we\nreally achieved after looking at all the back tests and all the analysis was a very adequate\nsystematic diversification. So we systematically diversify a risk through regions, sectors\nand an environment in which we're selecting stocks based on quality. I mean, we're sort of\nlike in stocks with high-free cashflow, higher re with good valuations. So that worked really well.\nPerformance has been really good. It can always improve, but it's been good for the since inception\nperiod. And we're really happy with the outcome so far. It's funny how, especially those of us who\nwork in quantitative finance, how sometimes and often the simplest solution ends up being\nthe most effective. We tend to overthink things and want to optimize everything, but it tends to be\nthe simpler, the better. So as far as rebalancing, so I understand we're equally waiting holdings,\nhow often are you rebalancing the index? Assuming you're letting some of these things drift over time\nbecause you want to let your selections run when they're working. So how often is this index\nbeing rebalanced? And then with that also being said, how often are you re-running a screen to look\nfor new opportunities? Yeah, that's one of the features of the index and the ETF is that we have\na monthly rebalancing period. That's also different from from other index or rules-based ETFs that\nthat we see. They're typically quarterly or annually, every balanced. In our case, we do this\nrebalancing every month. Part of it has to do with the fact that we're selecting the 27 best stocks\nout of a 4,000 investment universe. So it's really concentrated and we want to make sure that the\nfactor exposures, higher-away, low valuations, high-castle, etc. All those are constantly, we're\nconstantly exposed to the top-ranked stocks within those factors. That's really what we want to\ncome to maintain that exposure. So we have a monthly rebalancing period. Within a 30-day period, stock\nweights can vary a lot, especially during earnings season and there are stocks that really do\nreally well. Fortunately, we haven't seen yet, you know, stocks that really poorly, but we're\ncomfortable in the different simulations and the design face of the product that, you know,\nthere's very good ample verification with high concentration, which is what we want to achieve.\nAnd so yeah, basically that monthly rebalancing frequency is one of the levers that we have to\ncontrol for that downside risk. Yeah, so it was such a big universe in such a concentrated\nportfolio. How often are you running a screen and something's popping up? A company's popping\nup that you've absolutely never heard of before. Does that happen? Yeah, I know that happens all the\ntime. For for for for for instance, with with the index and with the ETF, we have a month rebalancing\nso you know, perhaps we have a whole thing that was there last month goes up this month and then\nnext month comes in again because we're picking the number one. So it's hard to stay there on the\nnumber one over time. But very narrow kind of criteria for this election. But there are stocks that\nstay there and the number one spot over time. So those eventually make it to the stock picking strategy.\nAnd with with the full due diligence, interview management, visit them, etc. And so they're say a very\nnice communication between the index rule based ETF strategy, the ACTD strategy and our stock\npicking active strategy. So let's talk about the, you know, develop markets, small and midcap space\nas a whole. Why do you feel as a manager? This is the best place to be looking for opportunities\nand a place that can help provide, you know, kind of maximize alpha, if you would.\nAbsolutely. I think there are a couple of characteristics that are particular to a small midcap space.\nWe think this this space between the 500 million market cap and up to 10 billion market cap\nwill look at companies that are perhaps not well represented across portfolios\nbecause of size. They're, they're not captured generally in terms of, you know, the sell side\nanalysts, they're not the, you know, like the mega caps that are very popular and everyone has them\nin their portfolios. So it's unexplored that gives this segment a valuation advantage\nbecause it's underrepresented under bought 10, they tend to trade at a discount to the broader market.\nBut then at the same time, they're large enough that they're not as volatile as a smaller\ncompanies that are below the 500 million mark. So we think it's really the sweet spot of the market\nwhere we have opportunities to find really interesting companies, really differentiated companies that\nhave all the potential to grow into big caps, large caps, mega caps, and, and it's a very fertile\nground for us to do our research process. Having said that, we've also just recently published a\nvery, you know, brief analytical piece on our website linked and page, etc. Talking precisely,\nthat, that very point. Why do we think that small mid caps are attractive? And it's basically\ntwo or three reasons. If you look at the longer term trend the last 20 years, small caps, mid caps,\nhave traded at a discount to to do the large cap companies and have sustained much higher growth.\nSo the price, it turns to growth ratio is super attractive. It's, you know, below 0.5. Whereas\nfor the large caps, it's above one. We have high growth, but also very expensive valuations.\nSo it's really that combination of high growth higher than the large caps, creating at a premium,\nthe large Frening at a premium, the small mid caps out of discount, that also from a fundamental\npoint of view makes it a very interesting place to look for in investment ideas.\nYeah, so I would, I would assume given kind of the nature of the strategy,\nwhen you're looking at distribution and getting this inside of portfolios,\nyou know, the hardest part about launching a ETF is is obviously growing AAM and capturing market.\nSo I would assume, you know, you're working or looking at working with a lot of investment advisors.\nThis probably isn't a product that, you know, a lot of these flashy products that are looking\nat retail that are looking at, you know, betting or are looking at an AI focus, right? This is\nsomething that has to have some education and some things behind it. So how are you going about\ndistribution, especially as kind of a smaller kind of boutique issue, or how are you, how are\nyou and your team kind of viewing it, how are you attacking it and what are some of the things you're\ntrying to learn along the way? Yeah, Brad, this is a super important question for us as a business.\nWe think we have a very, you know, strong track record. We have a very good process in place.\nA very, very good team would been together for almost since inception the last six years as a team.\nWorking together, we think we have a good process analytical capabilities, but we don't\nnecessarily have the sales distribution capabilities in place. And so with, with, you know,\nthe development of these products and there are other ETFs coming, you know, charging in terms of\nour product pipeline. But what we have now is, you know, this is a product that is\nvery easy for investors to invest in. It's, you know, near stock exchange listed.\nIt, we agree. It's, it's perhaps a little more complicated story to unfold and to tell, you know, how\nit's all built and and why it's, we think, a very well built, where well designed to product,\ntakes some, some education for sure. But we think it's, it's a good product and has its place in\nthe portfolios of investors and advisors. As I mentioned, we think the, the small mid cap\nspace is underrepresented. If you look at the act we, the world act we buy chart and you compare,\nyou know, your portfolio or the, the advisors portfolio, the investor portfolio, you'll probably\nbe underrepresented or underweighted in terms of Japan, in terms of the Nordics, in terms of the\nsmall mid cap space generally. So this strategy has a space there. And for sure, this sales\ndistribution, the marketing piece is very important for us. We're, we're hiring a, we think top notch\nexternal marketing and sales distribution advisor. And, and we think it with the next 12 months,\nwe'll, we'll make significant progress on that front. Yeah. Well, you guys have made great progress\nalready. And, you know, I think the portfolio is really, really well designed. I think it's,\nit definitely has a place in a portfolio. Now, if you were sitting in an advisor's chair, where would\nyou put, where would you put AZTD inside a portfolio? Would you put it as kind of that smaller\nmid cap allocation? Would you put it more in terms of maybe an alternative sleeve? You know, where\nwould you put it if you're sitting in that chair? Yeah, absolutely. I think I think the, the, um,\nbased on the characteristics of the of the strategy and, and the performance that we've seen this\nfirst year, it's a great diversifier. It, it allows you to, the diversifier risk, for example,\nif, you know, last year that was a horrendous year for most strategies. This particular,\nthe strategy, if we look at the index, for example, which has a full year,\ndid really well, despite the fact that it excludes energy, which was the only sector that did well\nlast year. So, uh, and, and, and a down year, a very down year, like last year, it would have helped a lot\nsignificantly, um, in terms of overall, uh, performance and the risk returned profile for the overall\nstrategy. And I think I would look at it from the perspective of, uh, regional allocations,\nyou know, water my regional allocations, looking like what's my exposure to, um, uh, Western Europe,\nthe Nordics, Japan, Australia, how's that low-thike? Um, am I under, uh, weight those, uh, regions,\nor, uh, or markets, and also from, from the, um, from the small-med gap space. I, I think the small-med\ngap space is, as I mentioned, underrepresented in the, in the, in the, in the portfolios.\nAnd, and again, because of the fundamentals, higher growth, low-valorations, it makes for, for a, um,\na very compelling, uh, investment rationale to look at the, uh, at the sector as a whole,\nan ACTD as a stock picking, uh, means of, uh, gaining that exposure. Yeah, I would agree with that.\nAnd, and again, I, I think it's a really compelling and interesting strategy, um, and, you know,\nbefore I let you go, and I am very appreciative of your time, working people, learn more about you,\nworking people, learn more about the firm and the TF itself. Yeah, absolutely. I think, I think,\nuh, we have two websites, asked on ETFs, ACTLA and ETFs.com. There you can see, uh,\neverything about ACTD, how to invest, performance, etc. Uh, we have our, uh, company website,\nPastlin, EM, um, uh, dot com, and then our LinkedIn page, uh, YouTube channel, uh, etc.\nI think there's, uh, a lot of information there that we continuously put out there, not only\nin terms of, you know, our firm and who we are, but also analytical pieces, uh, and thought pieces\nthat we think also add value, um, uh, in general, for, for anyone that would care to, uh,\nlook at our investment process, how we approach investments. Well, again, Alejandro, thank you so\nmuch for being here. I appreciate your time. Good luck. As you continue to scale this product,\ngood luck on, on new launches. I'll be keeping my eye out on those and, uh, you know, hope to have\nan opportunity to run into your next time your in the states. Absolutely. Thanks so much, Brad. Thanks for\nfor your time, and thanks for this opportunity. Thanks everyone.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}