{
  "id": "13555401",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nToday we have Ryan Pennell, he is the founder of Kaiju Advisors.\nHe runs a handful of private funds and also his ETF dip, DIP.\nThe Ticker explains at a very high level to strategy, but there is much, much more\nbehind the hood as Ryan is a true AI specialist.\nThis is a 100% totally AI-wrong strategy.\nWe get into AI and what it means and how it operates to make investments decisions specifically\nin his strategies.\nI could have talked to Ryan for probably three or four hours.\nIt is very educational, it is also very insightful.\nHe does a wonderful job articulating what their strategy is and what they are trying to accomplish\nand how they have built their systems.\nSo I really hope you enjoy this episode with Ryan Pennell.\nRyan, welcome to the show.\nThank you very much, Brad.\nNice to be here.\nSo before we get started, please explain everybody, your background and how you eventually\ndecided to start Kaiju Advisors.\nThat is a loaded question and there is a secure answer to it.\nSo I will try not to just go off on tangent after tangent.\nMy background, I guess the most recent apical background,\nI spent time in applied cryptography and theoretical physics.\nI became an equity trader and then a portfolio manager for a large hedge fund and then I started\nmy own hedge fund and then funds.\nAlways quantitative in terms of process and about half a decade ago, I started using artificial\nintelligence, which we had used in a limited capacity while I was doing cryptography work in\nsupport of random number generation protocols.\nWe started applying that to investment management on the private fund side and that's been\nvery successful for us.\nA couple of years ago we were wondering why we were not seeing this on the public fund side very much.\nAI was really not being used to its full capacity.\nThere were a couple of funds that were using it as a filtering and calling mechanism,\nbut really not for end-point decision-making.\nWe started to investigate the possibility of taking one or two of our strategies that had\nbeen successful for us on the private fund side and converting them into an ETF.\nThere was one in particular that fit the bill for our partners, for the market makers.\nWe felt responsibly for the market at the time and that was a load of high mean reversion\nstrategy, so that's a geeky way of saying a dip buying strategy, it's looking for\nartificially oversold stocks and we turned that into an ETF last December, launched it on the\nNew York Stock Exchange, ticker is dip, DIP and that came down to the floor.\nOne of only six ETFs on the New York Stock Exchange floor a couple of months ago,\nCitadel helped us bring it down, so that was a big day for us.\nAnd it's been great so far. It's nice to watch something that you've spent a long time building\nsuccessfully operate. I'm sure as you know, like on the private fund side,\nthere's a lot of secret sauce there and a lot of undisclosed performance outside depending on your offering\nmemorandum, depending on what your allowed to share and not share.\nSo it's nice to have an ETF that's publicly accessible, performance is publicly viewable.\nI think we're somewhere around 12% plus 12% in the last 90 days, so that's been good for us.\nAnd we're just looking forward to trying to make these type of AI curated and directed\ntraining systems more accessible. Because today, I mean, what you've really seen these in\nhigh-end hedge funds, which your average investor is never going to get access to. So this is a\nway to sort of bring it to a broader investment base and hopefully do some good with it.\nYeah, so it's interesting. You being the sixth fund of the floor, we were actually the fifth.\nSo I was actually looking at your, given the nature of what I, you guys do, I was looking at your\npremium discounts and it looks like it's really done wonders for you guys in terms of keeping adherence\nto NAV pretty pretty strong. And that's the experience we've got and it seems like you've got the same\nexperience as well. Yeah, that's for sure. I mean, nothing against being up on ARCA,\nyou know, that that was a good place for us to start and the nice you guys were super assistive\nand getting us up there. We were really grateful to GTS, who is our LMM when we launched,\nhelping us with that. But with something that's, you know, has a, has a lower AUM and is\nthankfully trading daily. But, you know, when you're just getting started, there's not a ton of\nvolume there. And when you get spreads that are a 10, 12 cents and retail traders coming in with\nmarket orders, you know, they can get some disadvantages fills. And, you know, our concern was that they\nmay not understand why they were getting disadvantages fills. You know, they get filled up at the\noffer, or especially five minutes from open. It's a big blowout in spread. They get, you know,\nan erroneous match, you know, and they're like, you know, your ETF is 26 bucks and they get\nfilled at 32.05 and you're like, oh my God, this poor guy, like, can we, can we find out who it was?\nCan we do anything? And, and, and, and really coming down to the floor with Citadel's\ntighten that up to like two, three cents, you know, for the trading day. So we can be confident that\nthe investor is going to get, you know, a more appropriate fill relative to NAV. Yeah, and that's what\nthey were trying to accomplish and they did a good job at accomplishing that. We had a similar\nexperience with an advisor putting market orders in and closing auction over the counter. So where\nwill do you think they were going to get filled at? And, you know, you feel bad for them and then\nyou feel bad for, you know, your actual investors who are trying to get a clean clothes. But I\ndigress, it's good that you're down there. I think we're going to see a lot more of that. But I was\nlike to ask to before we get too deep into it. What other hobbies you have when you're not working?\nWhat are some of the things you like to do before you and I run the call you mentioned? This was an\nold ski room of yours. Do you a ski or a snowboarder? I do snowboard. Yes, I'm a terrible skier.\nI was, I, I started as a skateboarder and then a surfer. So snowboarding for me was the, the\nlogical progression. Still, you know, this is the right now. I'm on the west coast of Canada\nin Whistler. Usually here for the summer and at Christmas, normally I'm based out of Geneva.\nAnd, you know, here in Whistler, it's maybe a 60, 40 skier snowboarder split in the Alps. It's more like\n90, 10. So I still have like this pariah moments or you end up on a run that definitely was not\ndesigned for a snowboarder. But yeah, so I do that in the winter. I'm a big ocean conservationist\nand heavily involved in, in philanthropic initiatives to do with ocean conservancy. So I'm a free\ndiver, master scuba diver, sailor. Love, I'm happiest, you know, on in or under the water.\nYeah. So that's, that's kind of my thing. And I added, I added helicopter piloting last year, but\nI'm not very good at that. So, you know, maybe just practice in that on simulator until you\nget a little better at it, you know. Yeah, I like to say, you know, like if it's zombie apocalypse,\nlike I'm your guy, I can definitely get us out of there roughly. But if you, if you want to,\nif you want to grab the family and go for a little cruise over the Alps, there are much better\nchoices. Helicopter pilots than me. That's great. So let's talk about the firm before we kind of\nget into process and product. Do you guys offer any other services to clients other than just the\nETF? Is there any other advisory services you guys work on or things that you do? On the RIA side\nknow, as we just, we just create and then launch AI curated and directed ETFs. And we have several\nmore in the pipe. Dip was just our most accessible test. And on the private fund side,\nwe do manage four funds through a KIDU capital management. KIDU ETF advisors is the, is the SEC\nregistered RIA that deals with the ETFs. And KIDU capital management is our, is our BBI based approved\nmanager, which deals with private funds. So we do have private funds. They're all fully subscribed\nat this time. We don't really have much of a plan to add an additional fund. We have a new one coming\nout, but it started its life fully subscribed. So we'll see what happens with that. We talked\npreviously about maybe offering some consultative services out to other managers interested in\ngetting into artificial intelligence. But to be perfectly honest, I really don't, I don't see how\nthat would work, given our, our capacity right now. We're just, we're, we're at or above capacity\nall the time. And there's, there's, there's private fund initiatives in the pipe. There's ETFs in the\npipe. And that, that sort of takes up all our time. I wish, I wish I could say that there were\nother opportunities, but currently none available. Well, that's, I mean, that's, there, there\nare a lot of opportunities already there and, and in the pipe. And so while we, what we talk about\nAI, and you're right, you know, there aren't a whole lot of offerings in the space. I know we're\ngoing to see, you know, like we saw with with crypto and Bitcoin, everybody trying to come out with\nan AI product, but you've been in it for a very long time. Before we kind of get in the investment\nmanagement side of AI, because I am interested in hearing some of your opinions there, you and I\ntalked to a lot of advisors and just wanted to get kind of your opinion on where you think\ndisruptions going to, how it's going to affect their business, right? In the advice and\nrecommendation business, or if at all, I think it's important to have a person there, but it's hard\nto ignore what's coming down in terms of AI's capabilities and how it might affect that community\nrather than just ours. Yeah, I mean, I don't think it represents quite the same level of doom\nand gloom that others have posited recently. Like you said, you know, there needs, I think broadly\nthere needs to be a person there, right? Like people don't articulate their risk parameters,\ntheir investment objectives, very well, to a machine. Like I mean, if it was going to be automated,\nit would start with some sort of intensive AI calibrated questionnaire that you would fill out, right?\nBut, you know, there needs to be some level of challenge. I think as any RIA would tell you or any\nFA would tell you, like in meeting with a client and understanding what their objectives are,\nwhat they say, what they need, what they can tolerate, what they express, they can tolerate,\nwhat they actually can, are often very different things. And that's a process that we're the\nFA's experience really comes into playing. You know, you need to just because somebody says,\nwell, this is what I've gotten. I don't, I want high risk and high return and I don't care if I lose it all.\nThere needs to be a deeper dive into the impact of that decision, right? They might say they don't\ncare whether they lose it all. But, okay, in addition to this, what's your capital reserve,\nwhat kind of debt are you carrying currently? Like you might, you might not even be in a position\nto make this investment to start with, but nobody's told you that. So, AI can't do any of that.\nIt's terrible at context. It doesn't understand nuance. It's really great at smashing numbers.\nSo, I don't see it, I don't see it sort of taking that business away. I see it being a tool\nthat RIAs can use to get to answers more quickly. I think what you're going to see. Unfortunately,\nI think Robo advisors are going to make a big comeback. And I think they'll be AI Robo advisors this time.\nAnd I don't think that those are going to work out substantially better than they did the\nfirst time around for the, for exactly the same reasons, right? You just, you can't just presume that\neveryone is equal. And so, I'll just give you a basket of crap for you to buy and you go buy it.\nBut I do think that you'll see tools appear that are assistive tools for professional\nmanagers so that an FA or an RIA sitting down with a client, understanding all of their needs,\nwhat their assets are, risk tolerance, et cetera, will be able to use a tool to dial in a series\nof potential packages that that investor might consider. It's well, we could go this route,\nhear the pros and cons, we go this route, hear the pros and cons. So, that human is still there\nto use the tool, just as I, you know, I think you'll see doctors using AI tools and a diagnostic\ncapacity, but the doctor will still be there to gather the information. And then that will result in\nsome increased output. I do think, yeah, if you have a crummy FA or RIA that's hanging in there,\nbut at the bottom end of the, of the, of the food chain, a bottom of the food chain there,\nI think that AI portfolio generating systems might wipe those out, but I think that's a very,\nvery small cohort within the broader RIA space. Yeah, no, I think you and I share again,\nvery similar opinion there. I just, you know, we hear a lot from the advisor community and some of them\nare worried. Some of them think they're going away and I just don't see it. But you and I can geek out\nfor probably hours about system building. I've, you know, been obsessed with how to build, you know,\nmechanical portfolio strategies for a very long time. You have as well. So this, this is more to,\nmaybe more to be a fun question than a serious question. Do you remember like the first system you\nbuilt and, you know, what problems did you have to solve to get to where you are now to have,\nyou know, such successful running systems that you're able to kind of run, you know,\nmulti-private funds as well as a handful of ETFs. Yeah, I mean, I, I mean, I, I have those sort of\nmemories of different types of systems you've built for sure. I was part of the team that built the\nfirst 16 core computer system, 96 gigs of RAM. We built our own daughter boards. We built our\nown riser cards. It was running Windows 2000 server 64 bit and we had to build it in a filing cabinet\nbecause there were no towers appropriately sized to take it. So it was in a filing cabinet and\ndrives and we're in subsequent drawers. But I think, you know, you were probably aiming more towards\nthe trading systems. And yeah, I mean, in 2019, we built a very, very early, less sophisticated\niteration of the system that we run now. And, you know, rigorously tested it throughout the year,\nat the end of the year, you know, it was just crushing returns five straight months in a row.\nAnd, you know, looking back in hindsight, I just, we all feel like idiots. Like, we were high\nfive in each other. That's it. We conquered the market. We solved it. It's done. I mean, the performance\nwas so outrageous that we weren't mentioning it to anyone because we just thought that they would,\nyou know, they would not have, we wouldn't believe it. So we were sitting there going, how are we\ngoing to articulate this without looking like we're gambling or we're lying, like one of the two\nthings. You know, this was like serious conversations. And then the sixth month, this system\ncould not identify like deep sector rotation that occurred. And it drove like a bus full of my\nmoney off a cliff. Like, in one month, it wiped out almost all of the profit of the previous five.\nIn one go, you know, and, you know, we took it offline. Obviously, immediately, some of the guys that\nthat worked on it, I like to say it was like they went off to their bedrooms and they wouldn't\ncome out for a week. Like, you can get a lot of slack and they weren't responding to emails.\nEveryone was just sort of crushed by the fact that this thing that we thought was so sophisticated,\nhad this, you know, this capacity for fault. I always say today, I'm so grateful for that\nbecause it wasn't catastrophic. We were way up and then this thing basically took us back to normal,\nwhich is better than if it wiped us out. And it really paved the road to where we have got to now.\nLike, we were in hindsight, the guardrails that we placed were way too far away from where they\nshould have been. We were really optimizing for profit, gross return. And that's almost black box,\nright? When you're using a black box system, that's what you're going to get. You're going to\nget a 7,000% 10-year return, but you'll have two or three periods while you'll be down 70 to 90%.\nRight. You can't actually, unless you're just some, you know, billionaire that wants to mess\naround and has money to throw at these things. Yeah, fine. You can run a system like that. But,\nyou know, if you're a responsible manager, you cannot put client money on a system like that.\nNo matter what the 10-year yield is, or your disclosures. And so, you know, we added layers of\nrisk mitigation. That was really the beginning of us building the arc, which is our AI risk containment\nsystem. It's effectively an AI off-ramp, which handles all of that. And now, like, we don't come\nanywhere close to that outcome. But I don't think I will ever forget that iteration of the system.\nI mean, we gave it a name. It was TJ and TJ basically got drunk and drove off a cliff. So it's\nfunny now. It was not funny then. Yeah, I'm sure it's not funny. But it's an invaluable learning\nexperience, right? Like you need to have those because you go to market too soon with something\nand it goes, it goes haywire at the wrong time. So that's a valuable lesson at the right time.\nYeah, humility as well, I think, you know. Oh, yeah. Absolutely. So just one more question on AI,\nthen I want to talk about dip extensively. I've read that you guys apply, you know, machine learning\nto your AI systems. And I know you have guardrails in place. You just kind of iterated that. But\nat what point do you think as the machine learns, does do the investment system decisions start to\ncome a little bit like unrecognizable or it doesn't sometimes make sense to you or does that happen\nnow? Like sometimes it might buy something and you say, man, that doesn't make sense.\nOr it wasn't kind of the original design. Do you foresee that happening or do you have like\nreally strict guardrails in place to keep it really focused on certain defined opportunities?\nYes, it's somewhere in between the two. So, you know, true black box systems, you know,\ntheir investment decisions cannot be explained because they don't follow a linear path like\nwe do in making investment decisions. You know, I always the way I try to explain it is, you know,\nthe way that AI makes decisions is this exactly the same as we do when we decide that we like a\npiece of art or we find somebody attractive or we instantly like some music, right? So, you walk\ninto a room, it doesn't matter. You walk into a gallery and you see a piece of art on the wall.\nYou're like, instantly, you think, God, love that painting or you walk into a room and you see\nsomebody and you think, oh, man, they're attractive. If I stopped you in the moment and I said,\nreally, why? It would be hard for you to articulate that, right? You'd sort of back out of it and\nyou'd see, well, I don't, maybe, I don't know, the blues or the reds or if it's a person or I\nlike their eyes or you're like, you're not, you're brain-new at instantly. You didn't need to do\nany further calculation. So, we do make decisions that way. We just don't make investing decisions\nthat way. We go through this linear process, quantitatively, okay, the criteria that I had, flagged,\nwere met. Now, I'm going to evaluate further, is your fundamentalist, your reading reports,\ndoing fundamental forward-looking analysis, et cetera, to come to the yes-no-by-sell-hold decision\nthat we make. So, AI doesn't do that. And black boxes, the most outside. So, you can't explain any of\nthat. With us, we have an investment ideology that we teach the machine. And it doesn't, on the\nprivate one side, ETF side doesn't matter. It's always the same. There's a trading strategy,\nwhich we start off with is developed by humans. We've used it before it's made us money. We teach\nthe machine. Then there's this refinement period that we go through, where within the guardrails that\nwe place. So, you cannot use this more than this in terms of capital. You cannot accept more than\nthis in terms of aggregate risk. If it's an equity, long-only equity strategy, you can't show it.\nYou can't access the options market. So, we put these controls in place. And we tell it what it's\ntrying to do with what we give it. Using these do that. And then we ask it for optimization output.\nAnd it'll come back and say, okay, I can achieve that doing this. But I can achieve it better if I\nslightly alter it in this way. So, I'll just, an arbitrary example. Let's say that, you know,\nyour strategy was iron condors. And let's say you said, okay, I want you to sell one standard deviation\niron condors in something that has an IVR of 30. All right. So, there you go. It goes out and it\ndoes that. And then you say, how can you make more money selling spreads above and below the market?\nSo, must contain both sides. It has to be market neutral. And the machine comes back and says,\nwell, I'd like to skew it in this way. I'd like to add long units over here. And I'd like to sell\none point two standard deviations instead of one. Okay. Great. Much better. So, we're still on the\nsame page with respect to the investment ideology, but there's a layer of refined. Okay, so we go ahead\nwith that. And then we're using the machine learning layer. And, you know, just as an aside,\nall true AI has a machine learning layer. If it doesn't have that, it's not really artificial\nintelligence. It's just a repeating quantitative process, right? The ability to self evolve is what\nmakes it artificial intelligence. So, what it's allowed to do in our strategies is modify the\nweighting of the criteria that it is using to flag its investment decisions. And it can select\nfrom a larger basket of criteria. So, let's say we give it 50 criteria that it's going to examine\nto make an investment management decision in an underlying. But it really only thinks that 21 of those\nare informative. And it wakes those 21. It's like these three, man. If I see these, that's a guarantee.\nIf I see these, it's positive. If I see these, it's still a less positive. But still good,\nanything down here, I can't find a correlation with winners or losers, so I'm going to ignore that.\nBut it constantly reevaluates that basket of criteria. So, over time, as conditions change,\nmarket participants get added, some become more consequential, some become less consequential,\nit adjusts within that basket. It can't suddenly say, you know, I'd love to just\nshort shit all day long. I think that's what I'm going to do today, right? And you're like, whoa, whoa,\nwhoa, whoa, whoa, whoa, whoa, whoa. Unless there are no guardrails, ours can't do that. So,\nit can evolve within that space. In terms of like, are we going to see it get to the point where\nit just fundamentally changes the training strategy? No, because it doesn't even know that it\nhas the ability to do that, right? That's, that's what you get into science fiction at that point.\nThat's super interesting and well thought out and super well designed. And I'm glad we had an\nopportunity to talk about that because I know so many people were fascinated by it and we all know\nit's coming. I just hope that there's, there's thought and backtest and humility behind some of\nthe new AI issues out there and we don't see people get burned in chasing performances. You know\nthat investors love to do is strategy chase and then all of a sudden there's a problem. But let's\ntalk about dip. Okay. It's really one of the only pure AI ETF plays in the market today. So why don't\nyou take, you know, the opportunity to really just talk about the the high level investment strategy\nand what is trying to accomplish and what is trying to invest, really trying to get exposure and\nsure. So when we were considering which ETF we wanted to launch first, we had a few different choices.\nBleeding edge performance, but you know, more cavitation in the P&L, a broader base of assets\nthat it could trade, a bigger universe that is or dip, which is what we decided to trade and\nor decided to build and what dip does is it looks for artificially oversold conditions\nin largely S&P 500 components. So we wanted to keep the universe to something that was\nlargely seen as safe and stable. Right. So there's no OTCBB, there's no pinks in this,\nthere's no short, it's long only, it's equity, it's large cap. So you are not going to get\nlike a plus 80% year out of this by design. Right. It's designed with with safety in mind.\nIt was our primary sort of goal and it started with the universe and then it started with the\nwaiting within the universe. So broad diversification, it can't just pile it all into tech and,\nyou know, you have a accused type of collapse when, you know, semis blow up or technology\nsells off because there's lawsuits or anti-trust or whatever in the offing for a bunch of the,\nyou know, the big nine companies that drive the weight of that ETF. And then obviously the\nlong only component and then we were looking for something that investors strategy that investors\nseem to like, like investors like by the dip. It's an acronym, BTD or if you prefer BTFD,\nwe did try to get that as a ticker and we're just flat told no. But I guess they never\nseems sense of humor. It's something that makes sense on a fundamental level. A stock sell\noff, if you're bold, it represents a buying opportunity. Most capable companies over the long term,\nor the long term trend upwards. So why buy at the all time high? Why pay the premium? When\nit pulls back, there's your buying opportunity by the dip. The problem is that most investors\ncan't identify what we would consider an authentic dip. And so authentic dip I would say is an\nartificially oversold condition. So what the hell does that mean? Okay. So let's, let's use this\nanalogy that's been working for me recently. You've got a basketball sitting in a swimming pool.\nAnd that represents the stock's price, a fair market value, at any given time, as agreed by the\ndominant market participants in the stock. Okay. So it can go up and it can go down if you add\nmore water to the pool, if you take water out of the pool. Up it goes down it goes, but it's still\nsitting on the surface, which means that it is still the fair market value for that stop. Now,\nif I take my hand and I put it on the basketball and I shove it under water, I've artificially\ndepressed the stock, right? That basketball is underwater, but it's only underwater for as long\nas I hold my hand there. The moment I take my hand away, it's going to pop back to the surface\nof the water. Now, that does work on the other side as well. I can pick it up out of the water.\nIt's going to be above the surface of the water. So long as I hold it there, I'm not going to hold it\nthere forever. Eventually my hand's going to get tired. I'm going to drop it back down to the surface\nlevel of stock. Now, wrinkle being as I've pushed it down as I've lifted it up, someone could also\nbe draining water from the pool or adding the water in the pool. So when I let go, it just stays at\nthat level. But by and large, that action of pushing the ball underwater leaves a footprint.\nAnd that's what we're looking for. So how does that happen with a stock? So that's, you know,\none of the common ways that it happens is an HFT taking advantage of liquidity pockets and\nvoids in the inter-day trading of the stock. And that's, that's not like limited to like small\ncap low float, like Chipotle's enormous. And it's a liquid as hell in today. I SRG is a monster\ncompany. And it's a liquid inter-day malloy, a liquid inter-day, right? So you have these moments\nwhere spreads blow out. And the HFT will take a couple of feel-or-order pokes at the bid\nand see whether or not the market immediately drops down. And then it just unleashes that order\nflow, which like, yeah, who can compete with that? You know, it's $10 million or 60 seconds or something\nlike that just flows in. Stock collapses through, through the bid levels. You know, eats all the\nway through that, that side of depth of book until it hits an institutional bison. You know,\nand something like FMR is just going to soak up an unlimited number of sellers, right? So like\nthat's like a freight train hitting a mountain. And the HFT will shut off at that point and they'll\ncover. So it's shorted, it's sold down, it's covered. But now it's hit the institutional bison.\nAnd now the stock is going to pop back up. Now the institutional bison is a zone. The\ninstitution is not just going to keep buying it forever. So once it enters into this bracket\nin between these two points, they'll be buying when it exceeds the top threshold of the\nbracket. It's going to shut off. So you're going to get that little bounce, that that that dip that\npops up. And then maybe it continues, maybe it doesn't, that's not for us to say. So we're looking\nfor that condition and buying the stock there versus your average investor who maybe sees, you know,\nlike a 5, 6, 7% pullback. And I was like, oh, hey, it's a dip. But no, that might be the mean\nreversion right there. It was over speculated. It was over bought. It's now coming back down to\nFMR. It's value. You are not going to get a dip there. There is another reason for that happening.\nAnd so, you know, investors keep coming back to buy the dip because they've had intermittent\nsuccess with it, right? They've sometimes they identify authentic dips. They're like sweet.\nThanks for the 11 point pop there. Other times it's like God damn I buy this thing like every time\nand it's it's screwed me over and it's not popping back up. Yeah, because it wasn't a dip.\nRight. So that's why we took the sort of tried and true investor fan favorite. It said, okay,\nAI is really good at identifying authentic dips. If you like the concept of this strategy,\nthen let us do it for you. And just park whatever you were going to spend on buying the dip\nin this ETF and focus on whatever else you want to do with your name. Yeah, I love it. I think it's\nextremely interesting. And again, love how it's designed. But I see a mix of index funds as well as\nsome regular equities in there. Can you talk about that like diversification mix and and\nor those are constant kind of holding in there. They're also at a much larger weight at least right now.\nBut can you talk about kind of how the holdings, I know the equity holdings are going to change,\nbut what's the reason for the index funds in there? And I did notice at least as of today,\nthe holdings in those index funds, the weights are a little bit higher. Right. So that actually ties\ninto a problem that's inherent to some AI systems. Right. So it's easy for science,\nscience, easy, but it's appealing to build the profit generating mechanism. Right. So you're like,\nyou're looking for this and here's what you're going to do. When you see this pattern, you're going\nto buy it. So what happens when the criteria, the minimum criteria that the AI needs to be successful\naren't met. Right. Like in our case, what happens when there aren't enough dips?\nThere are always some. I mean, even in downward trending markets because you have, you know,\nobviously inversely correlated stocks that you that will then come out of their dips,\nyou know, as you get a down shift. But what happens when there aren't enough? And this was sort of\na core question of ours when we started building dip was like we sort of were able to chunk the\ncandidates into like five tiers. We had like tier one, tier two, three, four, five. And tier one\nand tier two were solid. Generally, we found them to be consistently profitable, high degree of\nsignal correlation. Okay. So they're awesome. So we want to trade tier one, it's tier two,\nwhenever we see these candidates. Three, four, five were still profitable. They were still good\ncandidates. But what we realized throughout our testing was that it didn't add more P&L. If you\nuse three, four and five, it just used more money. Yeah. And so we did not think that that was okay.\nSo that was, that was one way we could go because the core question is, how are you dealing with\nexcess capital? Right? Okay. So you've got, I know, billion dollars, but you've only found\n$600 million worth of dips. What do you do with this? Okay. You hold it in cash. That's,\nthat's allows a solution. Right. Your investors not happy there. Your investors not paying the fees.\nSo you could just sit there and act as an expensive bank account. Number two, you could trade\ntiers three, four and five. So you could use the capital. There's a case, hey, we're using all the\nmoney. Yeah. But we knew that they weren't going to get the performance out of that. And from an ethical\nperspective, we just, we don't, that's not how we manage money. Right. If, if we don't use it,\nwe'd rather you took it back with an ETF. We can't do that. So what else could we do? So we sort of\nembarked on investigation of using a weighted blend of index ETFs to soak up the extra capital.\nAnd what we discovered was twofold. One, over the long term in our tests, the weighted blend of\nindex ETFs generally outperformed any single one of those. Not in the short term. Right. I want\nto just be clear on that. Like if Q's is running, right. Like the bulls, and we're holding a\nweighted blend of let's say Q's, IWM, Diamond Spiders, it's not going to outperformed the Q's.\nThe Q's are running. Right. You don't get some of that performance, but not all of it. But in the\nlonger term, when you look at the averages, we found the weighted blend of index ETFs to be beneficial.\nSo that was one in that it's a responsible, instantly diversified giant cap investment that's\ngoing to do you well. Number two, because those represent, you know, broad technology, the largest\nof the large cap, the US markets in air quotes, and then small cap, you know, IWM, because it was\nrepresenting all of that, having one foot in in those funds at periods either, where there's\nincreased uncertainty, or where there weren't enough dip allowed us to pivot a lot faster. So suddenly\nthere's an explosion in tech, and we're holding some Q's, boom, then dip gets the benefit of that,\nbecause the discrete underlying holdings are not always going to be made up of those same\ncomponents, right? So we saw that in the regional bank in collapse. So coming out of the regional\nbanking collapse was the explosion in AI, but it was really like nine stocks that lifted the entire\nstock market, you know, and we had people asking us, well, why weren't you holding those nine stocks,\nbecause none of them were in dips before they took off, and it's not a Momo algorithm, right?\nIt's not like, hey, I'm going to wear, I'm going to trade off, take the dip head off, I'm going\nMomo, I'll just pile it into this, like who would want that as an investment man, right? Anyway,\nso that's sort of that's why you'll see sometimes you're going to see this weighted blend of\nindex ETFs, and then other times you'll see none, it will hold none of those. If it, if it can fill\nall of its allocation with tier one and tier two dips, those are more profitable, it'll take those\nevery time. If it can't, rather than not, we use your money, it's going to give you the performance\nof this weighted blend of index ETFs instead. Love it. So briefly, I know you would mention there is\nsome risk component, a risk mitigation component in this as well. Is there any, let's say,\nI know it's dip buying, so I'm probably, I probably am answering my question in my head.\nIs there ever kind of looking at the other side where it might actually raise cash on purpose\nto try and get a little bit more defensive or is it, is it always going to be fully invested in\nequities? No, yes, it's, it's very predatory and it's always fully invested in equities. There's,\nit actually isn't aware that high capital reserve is an option for it. It's mandated just\nprogram to use all of its capital, which is why you're always going to see at the end cash on hand\nis like near zero. Got it? It's, we program in the ability to hold cash on hand to safeguard against\nglobal collapse, right? And that's, and that's something that is insisted by, you know, partners\nand largely regulators as well to some extent. Like, you know, our custodian is US Bank and they\nwanted to know, okay, fine. So there's a nuclear warheads detonated in Washington. What does this\nthing do? You know, obviously, I think the markets are closed. I think we have bigger things to worry\nabout. I think it's, you know, canned food in your basement and the prepers are all going to say,\nI told you so, but fine, we've programmed in that if our regime classification and change detection\nengines come up against global anomaly in terms of their analysis. Like, you know, we run these\nengines at the discrete stock level. We run them sector and industry. We run them broad market.\nSo there's hundreds of classification and change detection engines. And it's not unusual for a\nbunch of the discrete underlying change detection or regime classification engines to come back with\nan I don't know, right? If it's something that it's never seen before in Disney or in Netflix or something,\nit's going to report, I don't know. But the global engine is bull bear neutral time. In in the time,\nin times of some sort of incredible collapse, a majority of those engines will report, I don't know,\nand then it's going to hold cash, right? It's not going to say, well, I'm sure there's dip opportunities\nout there. It recognizes this is not normal and it's so far outside of my risk envelope that I'm\ngoing to default to this panic cash position. But we don't outside of that expected. We'll ever do that.\nGot it. Got it. So as we wrap up here, if you're sitting down, I'm assuming given the complexity,\nsome of the complexity of the product, I'm assuming you're mostly talking to advisors and you have a\ngreat ticker, so I'm sure there's some retail out there buying it as well. But where are you,\nif you're sitting down with an advisor, it kind of recommending they find a place for this in\ntheir existing model portfolio? Is it a supplement to large cap equity exposure? Is it an alt sleeve?\nLike, where do you recommend this sitting? We usually recommend that it's complimentary to whatever\ntheir broad market tracker is going to be. So we're not trying to be or replace something like\nspot, right? There is always going to be the interest in allocating some part of your portfolio\nto something that effectively, and does matter whether it's spy or IVV or whatever, it was something\nthat effectively tracks the air quotes broad market, right? And then so you have your beta correlation,\nlike, right there. And then you're going to layer your alpha opportunities on top of that. But at the\nend of the day, responsible allocation, conservative investment will contain some sort of the\ndata tracking allocation like that. And what we're saying is, okay, so we don't want you to replace\nthat with us until maybe you get to a point where there's enough of a history there that you're\nconfident doing so at this stage, but consider us instead of some portion of that. So if you've got\n100 mil that you've dumped into spy, IVV, whatever it is, maybe there's 10, maybe 10% of it,\nyou want to drop into dip. We use the same components so you're getting the same security,\nor I should say commensurate security, not the same. But we're trying to opt into the upside\nand step out of the downside in and out in and out of that allocation. And we're using\nthis groundbreaking technology to do it. So if that investment manager wanted to access that type of\nsystem anywhere else, they sure is how wouldn't be paying 125 basis points, right? That door opens\nit to in 20. And the funds that run it effectively are usually like 3.5 and a sliding scale up to 40,\nright? Because they're generating these 40, 50, 60 percent returns. You look at Renaissance\ntechnologies. I mean, Medallion has been closed forever, but if Medallion was open to the public,\nit's 5 and 45. That's where you get that type of technology. So this is a way to get it\nliquid with very low risk for a percent and a quarter, right? So that's what we're sort of pushing\nthere is consider it for adding a little bit of additional alpha using the same components that\nyou know and trust already. And as there gets to be more confidence, if we're able to prove ourselves\nto your satisfaction, maybe that allocation skews. You know, it starts at 1% or 3%\nor 5% and it ends up being 20, but we don't think it's ever going to be 100, right? It's not going\nto replace. It's not designed to do that. Right? Well Ryan, this has been very educational, also very\nfun for me. And I wish you all the best of luck, but before I let you go, where could people learn\nmore about you and your product dip? If you want to learn more about dip, you can go to the website\nwhich is dipetf.com. If you want to learn more about Kaiju, the global ecosystem, that's Kaiju.ai.\nKaiju Capital Management is at kcm.ai and the RIA is at Kaijuetfadvisors.com. I really should probably\nbring those all under 100. Now I'm afraid they're very spread out. Well Ryan, again, thank you\nso much for your time. This has been awesome and I wish you all the best going forward. Thank you,\nBrad. It's always great to talk to you.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}