{
  "id": "13596923",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they can\nto grow their company.\nMany of these individuals are entrepreneurs and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nToday we have Elizabeth Alfonno.\nShe is the founder of Vegtech Invest and the portfolio manager of EV, which invests in food\ninnovation companies.\nShe is an expert in all things food and nutrition.\nAnd we talk about some of the things that are issues with our food, how we produce food,\nmake food, ship food, and I think you're going to find it extremely interesting.\nSo I hope you enjoy this episode with Elizabeth Alfonno.\nElizabeth, welcome to the show.\nOh, happy to be here.\nThanks for having me.\nSo before we get started, please explain for everybody who is listening kind of your background\nand how eventually you decided to start the Vegtech plant-based innovation ETF.\nSure, sure, absolutely.\nSo I've been after graduate school and BA.\nI've been working in food systems with the Kellogg company, special K Frosted Minuits,\nthese were my brands and I worked on them not from just the brand management perspective,\nbut from really running independent businesses.\nProduction, packaging, logistics, shipping, sales, marketing, etc.\nAnd I loved working in food and I loved working at the Kellogg company, actually,\ninternational company focused on healthy products, give or take, we'll say.\nSo I had always had a pension for working in food and personally I love to cook and I grew up\nin a household by my mother, I always cooked, so it comes naturally to me.\nThen at some point I shifted my own personal diet to no longer include meat and dairy,\nand I did that for health reasons and some other reasons, but I didn't do it for business\nor environmental reasons until I made the switch and I started researching the inefficiencies\nof our current food supply system. For example, it takes 25 to 35 calories of crop to get one\ncalorie of beef. So what that means is you deforest and you grow crops that have protein and fiber\ndo you give that food to people? No, you give it to animals and you have to do more\ndeforesting because the conversion ratio is so bad. That's just one example and I could go on to\ngive many like this statistic 41% of the world's tropical deforestation comes from animal factories.\nSo when I looked at the business equation of our current food supply system, it was so clearly\nright for disruption. And when I look at the business proposition of the replacements,\nmuch more efficient, much more sustainable 32% of our world's global methane emissions\ncomes from animal factories. I thought, well, this industry just isn't going to survive.\nLike, of course there's subities and they're lobbyists and they're holding on for a dear life,\nand but it's not a good business equation. It's bad for the business bottom line because it's\nbad for cost of good sold because it's so inefficient. So I started looking at what are the\ncompanies that I could invest in personally that got the memo that saw the business proposition,\nthat saw the disruption potential and, you know, sort of like computers, food is adopted by\neveryone. So it's not going to be this little shishi thing in Berkeley and Brooklyn. It's going to be\nChina, India, Europe, the US, old, new, young, educated, and educated. I mean, it's one of\nthose mass trends when you shift food, not necessarily what people eat, people are still going to\neat meat, but it's how that meat comes to them. It's going to be in a much more efficient way.\nWhen I looked at that, I thought, okay, I want to do the investing in these companies around the\nworld without our working on this disruption. And when I couldn't find that in the public markets,\nI thought, okay, this product needs to exist. And so that's when Dr. Sasha Goodman and I\ncreated the world's only plant-based innovation ETF called ETV. Yeah, and then we're going to talk\na little bit more kind of about the food and our food, the supply chain because you and I had\nactually a discussion before this that was really, you know, educational to me. But before we kind\nof jump into that and talk about ETV because I do want to, I do want to dive deeper into the product.\nUm, I always like to ask, what do you like to do outside the office? What are some of your hobbies\nwhen, you know, you're not working or you're not working on the ETF? Well, yeah, sort of as we\ndiscuss just as I hopped on the phone, um, I'm not on video today because as soon as this interview's\nover, I'm going to play tennis. So I do a lot of tennis jogging, hiking, swimming. I try to stay\nreally active pickleball. I just, um, really like to get out. And, um, of course, I love music and\nreading and I love traveling. I used to live in Paris, so it comes naturally to me to live in other\ncountries and I'll probably do that again. So, um, there's so much going on in the world. It's\neasy to stay very busy. Yeah, no, that's great. It sounds very active. I like to be active as\nwhile I go crazy if I'm not active. And pickleball came out of nowhere. It seemed like in the last\ncouple of years. And it's, I had to put one in my backyard. It's like, it's, it's so much fun. So\nI can relate to it. That's too funny. You know, I love pickleball. I do, but the game of tennis is\nso elegant. I just, I really do love it. And pickleball for me is, um, more kind of fun and social\nthan it is that that racket sport of, of elegance. But I have a great time and love doing it.\nYeah, 100%. And the nice thing is, you know, the way it set up is almost any skill level,\ncan play with any skill level. It's easy to pick up. And so, I mean, I can play with my six-year-old\nand it's, it's fun. Yeah. But I think let's talk, I want to talk about the food industry in general.\nI think more and more people are starting to understand that a lot of the food we consume over\nall is bad for us. It contains things, you know, maybe our body doesn't really know how to process.\nSo, um, I kind of want to touch on just, what are the major problems with our current food\nsources as you see them? Um, I do want to talk about the supply chain and the inefficiencies.\nBut what do you see is kind of some of the main, main problems with our diets is, is Americans?\nAh, as Americans. Okay. Because there's a real global conversation here as well, rising food insecurity\naround the world because how we produce food is so inefficient. So, only some people are getting it\nand not others. Okay. But for, well, you know, according to our world and data in the 50s,\nAmericans used to eat, you know, like a third of the meat that they now take a guess. How many pounds\nof meat a year, the average American eats? I couldn't take a guess. I just know that my father-in-law\nis like a three-stake a week guy. So, um, but it's probably a lot. Just a guess. Just, um, I'd say\nmeat was that include chicken? Yes, it is. I'm going to say 200 pounds. Yeah, yeah,\n290 as of 2019. 200 will like 285 as of 2019. So, now in 2023, it's almost 300 pounds of meat a year\nper person. Now, I'm not eating any meat. So, that means someone's eating more, you know,\njust my father-in-law. No, hold on. Let's let's back that up a minute. Meat has no fiber. Now,\nI know that's counterintuitive because you look at it and you're like, but wait a minute, it's fiber\nus. It has no fiber. That means we've got very long intestinal tracks. That means it's sitting\nin your intestinal track. That's why major cause of heart disease, diabetes, um, colorectal cancer.\nAnd that's regular meat. Now, if you're looking at processed meat, and that is a very large\nsection of meat would be, delislices, bacon, sausage, hot dogs. These are class-one carcinogens\naccording to the World Health Organization. So, you know, it's one thing when people use to eat,\nlike think of our grandparents, they'd have meat, the size of their palm three times a week.\nWe have long surpassed this. So, um, too many animal proteins is really causing these lifestyle\ndiseases that are really skyrocketing health care costs. And people say, oh, but we're living\nlonger. I would actually argue that we're dying longer because we're living longer on pills. So,\nyou know, if you could pull back the food that has no fiber and put in the food that has fiber,\nyou'd be doing one would be doing one self-awardal good. There's also, you know, not just\nthe fiber, but meat has cholesterol. It induces trimethylene and oxide. It has animal hem,\nit has antibiotics, it has hormones. So, you know, anything one can do to cut back. Do I think the\nworld is going vegan or plant-based? No one in the right mind thinks the world is going vegan or\nplant-based. It is not. We're talking about rolling back the unhealthy things, putting in the healthier\nthings. And, and that's, that's a health conversation, which is very different than a business\nconversation about efficiencies and how to get more food that is more nutritious to more people\nin a short amount of time. Yeah, and that's something I want to kind of touch on and talk about\nnext is, you know, it's very clear from your website. And when we talk that, you know, a lot of\nthis is also tied to, you know, climate change and so these companies that you're investing in,\nhow does technology and better, you know, farming practices help the environment and how can these\nadvancements help with really making streamwining, you know, farming and getting the right food\nto the right people? Yeah, that's like seven questions in one. I know, but I want to learn from you.\nThis is like I've started to very eye-opening, so I know it's a loaded question, but the floor is yours.\nYeah, so let me see how I can break that apart. Farmers come first and there's the fascination\nthat the American farmer is in a position like Old McDonald's Farm or something. And the truth is,\nlarge conglomerates have come in and they've bought up family farms. They're very few family\nfarms left and those family farms are squeezed into a very difficult position. So that's something\nin and of itself that we want to roll back and have better contracts, less debt and more options\nfor farmers. So when you think about growing mushrooms, let's say, rather than animals, you're going\nto use less land, you're going to use less water. You're going to have to deforest less because\nyou're not feeding animals that then give you this poor conversion rate. You can just go right\nfor the protein and let's say mushrooms and either eat the mushrooms themselves or use them to make\nburgers and meats and steaks and this kind of thing. So better for the farmer to have these less\nenvironmentally damaging products and then their chance for better contracts. So that would be one sort\nof simplistic way. Now you talked about technology and I love this because people often say like,\noh, but wait a minute, I don't want technology in my food. I am sorry folks, that ship sailed a very,\nvery, very long time ago. That's why you now have seeds that can produce monochrops of soil that\nis not fed to people. It is fed to animals. And then again, we're back to deforesting for that\nbad conversion rate. So even the hybrid seed of getting a certain kind of tomato, that sort of\nplant husbandry, if you will, that's all part of better intelligence, better technology. So it's\nnot that we don't want technology in our food. It's that we don't want harmful technology in our\nfood and there's a major distinction there. So when we invest in eat, we're investing in companies\nup and down the supply chain. That supply chain is so critical to the business equation,\nto the investment proposition. And that's going to include these early ag tech innovations that help\nprecision watering, for example. So we're better on land and we're better on water usage. It's going\nto work with the technology companies that are licensing out their IP. So you can have precision\nfermentation proteins. We'll talk about that in a second. Or you can have more prolific ingredients.\nYou know, the original protein comes from plants. Animals eat the plants. And then you get the\nanimal meat. Just go directly to the protein source. That's legumes and beans and other things again,\nlike mushrooms. So you look at the highest protein on the planet. It's lentils. It's not beef. Anyway,\nso if you go to the source, these legumes and pulses and things, you can be more efficient with\nyou can have crop rotation, so better for less mono-cropping, cover crops, better for direct\nprotein sources and using less land and water. So lots of efficiencies from having these alternative\nproteins worked into, as I say, either eating directly or as a steak themselves. But I digress a\nlittle bit. Talk about that supply chain and eat beef. So we're investing in these ag tech companies,\nthese ingredient companies, these technology companies, these flavor and texture companies that are\nworking out the innovations to make these products really taste great because Americans aren't giving\nup meat. We know that. So we got to get them what they want. And then the consumer package\ngood products at the end of the line. So that's kind of the investment proposal up and down\nthe supply chain. And I have no idea of a answered your original question because there are so many\nquestions in there. But that gives you kind of a sense for how we're starting to shift the food\nsupply system to be more efficient and when you're more efficient, you're more prolific. And that\naddresses food insecurity, which we can get to in a minute if you'd like to. Yeah, well, why don't we\nget why don't we walk into that? You know, the reason I asked that question is I see so many different\nfarming technologies specifically. I saw now that they're using AI and lasers to help with, you know,\nweeding or killing certain things that are harmful to crops. There's so much innovation in\ntechnology that's happening in this space that, you know, I think those of us who are in investments\nare focused on the big things, right? Like autonomous driving or AI, but we're not really\nfocusing on all the technology that's taking place that's helping us do various, I don't want to\nuse the word simple, but you know, things we've done for a long time, like growing corn.\nYeah, 100% and just before we classify this is not major, the food systems eight trillion dollars,\nthe meat industry is 1.4 trillion. I'll take 10% of that and be really happy for my ETF. So this is a\nhuge industry. And when the Boston Consulting Group did a study about investing in alternative\nproducts to impact greenhouse gas emissions and they compared alternative building materials,\nelectric vehicles, alternative energy. And alternative proteins and plant-based innovation,\nbecause those are the four that are really impacting climate change. We can talk about that.\nAnd it turns out that investing in plant-based innovation is three times to 40 times more impactful\nthan the others, old building materials, electric vehicles, and alternative energy. Because\nyou don't need as much cat backs to invest in shifting over that system. A lot of the\ncat backs already exist. And so you can get to change faster, which means you can get to impact\nand climate change faster. So in terms of an impactful investment for greenhouse gas emissions,\nit's one right at our fingertips. And one that we would be wise to spend, like we're spending\non all energy, we'd be wise to spend on all protein. But you had said food insecurity. And the\nreason this is so important, even if you have no humanitarian interest here, is there's a national\nsecurity interest aligned with food insecurity. So we're starting to see governments be very\nprotective about their food IP, because we saw food supply chains fall apart during COVID. We saw\nduring the Ukraine war. This is why you see China investing. So heavily, in alternative proteins,\nyou can't be an independent country if you're relying on others for your food. And when you've got\none point, four billion people, like China does, of course, you're relying on others for your food. So\nthey're looking at really alternative proteins, growing meat, because people are eating meat.\nThat's what they're doing folks, growing meat in controlled scenarios. So you don't have to bother\nwith animals, land, water, hormones, antibiotics, the whole thing. You can just grow from cells.\nThe meat that you want, when you want it, but think about this, how many people kind of\nforward filet mignon? Very, very few. But if you're growing filet mignon cells in, you know,\nwhat would be considered like a brew that, like how you brew beer, brew beer, but now you're brewing\nfilet mignon. It's filet mignon for everybody. You know, so there's some food justice issues there\nas well, if you care about that. But primarily, this is what's important. I'm saying so much,\nand we're cramming a lot into a little time. But this is what's important about governments\ngetting behind investing in food IP. You have the younger consumer, Millennials and Gen Z,\nMillennials, by the way, not that young anymore. But okay, we'll call them younger and Gen Z,\nand I guess even Gen Alpha. Very much behind putting their dollars where their values are and not\nbeing detrimental to the planet. So they're really driving the growth of plant-based innovation.\nWhat you have government spending in IP, at the same time that you have large food manufacturers\ncoming under scrutiny from the SEC and others for the impact that they have on the planet.\nWhere do you think, okay, take a guess? How many animals do you think are in factories right now?\nTake a guess. Around the world? Yep. I'm going to say two billion.\n80 billion. Okay, I'm always going to close. And times the amount of people on earth.\nEight billion people on the planet. 80 billion animals and factories. Where do you think they go to\nthe bathroom? Flash condos within door plumbing? No, it's your water. It's your land and water. So\nyou know, we're talking about huge environmental footprint. These companies are all coming\nunder scrutiny. So as supply chains become more transparent, as consumers care about this\ninformation and seek it out, they are under a magnifying glass, not just to better that business\nbottom line by reducing the cost of goods sold. Because right now they externalize those costs.\nThey get water for free. That's not going to happen as we move forward because you can see the\nshortages of water. So they they've got pressure on them. So what's the important point there?\nIndustry wants change. Government wants change. Consumer wants change all at the same time.\nSo do I think this is some little vegan play with people on a street corner in the sign? No,\nwhat is listening to them? I'm talking about consumer government and industry all wanting the same\nthing at the same time. Now they want it for different reasons, but they're all investing heavily.\nThat's why we see this as a mega trend. Yeah, no, I agree. I think the first time and the first\ntime we were kind of introduced via email, I was like I took the, I made the assumption to say\nit's a vegan play, but when you start spelling out the thesis and you start really making\nthe investment case for all the problems that need to be solved as well as the scale and size of the\nproblem, you make a very impelling investment case. And so I want to pivot into EATV, EATV,\nit's your veg tech plant-based innovation ETF. So we might have lightly through that kind of\ntouched on the overall strategy, but can you talk about the strategy of EATV and really what\nit's trying to accomplish? Sure, EATV, I would say falls squarely under something called impact investing.\nSo we are investing in the companies that are innovating to disrupt the global food supply system\nand that are working on food systems transformation to solve this business problem. We need to create\nmore food that is more nutritious in a shorter amount of time using fewer resources while creating\nless damage. You can solve for that. This is what business does well. It takes a problem and it\nsolves it at scale. You can solve for that. You're caching in big. So we are investing in those\ncompanies that are solving that equation up and down the supply chain, starting with ag tech and\nlike we're saying precision watering in these novel technologies, moving on to the companies that\nare focused just on the technology and licensing it out to others to use and we can talk about\nthe technology because there's cultivated meat, there's also precision fermentation and hybrid products.\nSo you want to know what's coming on your plate in the next five years, we can get into that super fun.\nThen we talk about the ingredient companies working on novel proteins and the flavor texture\ncompanies. Then the CPG consumer product goods companies at the end of the line in food and\nmaterials. So ultimately we want sustainable supply chains and we find in the fund it's a nice hedge\nto have 80% food but 20% materials. So if you're making less beef you're making less leather.\nSo you look at a company like dole that up cycles its pineapple skins to make alternative leather,\nwhich is very cool. So we sort of see that as a nice hedge which gives us diversification not only\nacross the supply chain but diversification across the globe and diversification across market\ncaps because we have small mid and large cap and then diversification across food and materials.\nJust a teeny notion here on the market caps. People often think, oh this must be a nano cap\nplay or something but okay just dispelling in the accuracy. People think this is a nano cap play for\nvegans. Okay couldn't be further from the truth. First of all if you want real impact you're\ngoing to have to go with the company's big enough to have ad budgets, large teams and huge distribution\nchannels. So no one's going for nano caps that makes no sense. So you know you have like Givo\ndown for example 100 year old company out of Switzerland. They're doing it all so they are focused\non texture and taste, working those flavors. They're also investing in innovation labs and the\nwest coasting the United States. They're investing in alternative cultivated meat growing meat\nfrom cells in Switzerland with joint venture with migros which is the big grocery store there\nand bueller which is the big food equipment producer there. So you see them doubling down and\nthat's what we want to see. Those that are putting in capbacks into the infrastructure so that\nwhen food hits they're really well placed to you know win or take all so to speak. So that would\nbe an example of you know mid-large cap company long established not volatile, know what they're\ndoing and positioning themselves to win big. So you briefly touched on this. So in the ETF itself\ndo you stick to kind of the you stick to keeping trying to keep the portfolio, you know 80%\nin kind of tech and supply chain and 20% in materials is that something that you try to\nkeep the portfolio waiting to? Yeah it's about 80% food 20% materials and food up and down the\nsupply chain at any point therein and Ronnie primarily focus on those that are innovating to\ndisrupt but you know we've got a large universe of you know almost a hundred companies and we\nmake sure that they're truly innovating not greenwashing not you know creating more chicken plants\nwhile pretending to have one little product that says plant-based or something you know you got\na like truly be focused on disruption and then then we really screen you for your financials.\nSo then you have to make sure of course it's profitability revenue, EBITDA growth etc.\nAnd then we do a final screen again just to make sure you play well in an ETF you know just\nmaking sure the liquidity is there no problems therein etc. So a lot of methodology going into it but\nafter looking at over you know a hundred companies globally where we usually land you know we're\nactively managed we usually land between 35 and 40. Got it and you led me perfectly into the next\nquestion and so the fund is actively managed and so how are you identifying the companies you\nwant to invest in and then further right so it sounds like you you have a screen and can identify\nyou know a hundred or a couple hundred companies that kind of meet your criteria and so how are you\nthen whittling it down into kind of a more concentrated portfolio of say 30 to 40 names. Yeah so you know\nyou've got that list of about a hundred and then you're just again making sure that the this\nruptive technology is a meaningful portion of the portfolio so we really look to be you know 80\npercent or higher is not in old legacy food production and then we really screen for the financials.\nSo once we've made sure that you're truly disruptive and that the majority of what you're doing\nis not in old legacy systems because we want when change comes and I get this quote from Cargill\nwhen change comes in food it's going to happen really fast because you don't need that cap\nexpanding that you need in other else like all energy so it's gonna happen really fast so we don't\nwant anyone that's hanging around in like the old way of doing things and then we're really looking\nat the financials we you know and not just the financials but what kind of mode do you have around\nyour IP what kind of IP do you have that maybe hasn't come to market yet but we know is coming\nthrough our research etc so we like to see who's really innovating again to kind of win big\nand then that last screen to just make sure they play well in an ETF. Sure and just had a curiosity\nyou know I because you're so passionate about the space and are so knowledgeable about the space\nare you meeting with or talking with management at all as you're doing due diligence or is it\nmore of a you know of check on financials a check in you know listening reading or listening\nshareholder reports about you know the ability for them to maintain a competitive advantage\nbut the simple side of the questions do you have the opportunity as a manager to kind of talk\nto management of some of these companies? Sure all the time yeah all the time because you know\nI'm so knowledgeable about this subject which is why I speak everywhere from Bloomberg news and\nintelligence to Berkeley to Yale to the United Nations like done that three times so I often know the\nplayers who can replace let's say way so let's say you have a company that's really dedicated to\nthe disruption but they still have you know animal proteins dairy proteins like way hanging out in\ntheir products just because they probably don't know that there are alternatives which brings\nme to precision fermentation so there are lots of substitutes for things like egg whites and\ncasin and way these animal proteins that are in things that have a much smaller\nsustainability footprint and that only helps the company and that protects them from risk so\nand we are there to do that we want them to you know do better and not be subject to\nrisky lawsuits or poor sustainability numbers because everyone's looking at these things now\nso we'll often say like hey you know have you heard of perfect day so perfect day is a company\nthat's doing precision fermentation what that means is they go to a scientific database they don't\neven have to bother with animals they go to a scientific database and they get the genes\nfor casin I'm like oversimplifying this but they get the genes for casin and they grow those genes\nin a controlled scenario with plant-based sugars etc that's why we call them part of the plant-based\ninnovation umbrella and you grow them with plant-based feeds and then ultimately you grow the\ncasing that you need outside the animal and you can or egg whites or whatever it is and you can use\nthat for cookies and baking etc and you're going to have a much better water usage land usage\nsustainability metrics it's cleaner you know so that's precision fermentation but again to the\npeople who are saying like oh my god that's freaky technology I will just say pharmaceutical got this\nmemo long time ago so they used to factory farm pigs for insulin then they realized pigs in factory\nfarms lived but to snout on top of each other it's why the United Nations says the next\nthree reasons the the top three reasons for the next pandemic are related to eating meat and animal\nintensification because they're living in this way of all the antibiotics I live in such bad\nconditions that you end up spreading disease anyway so the pharmaceutical industry said we don't need the\npigs we'll just precision ferment what we need in a lab and then we'll make all the insulin we need\nand we won't have to deal with feces in the insulin and all these things you know you've got feces\nin your chicken right you've probably seen all those studies you're just you know the USDA allows\nup to 25% of all chicken to have salmonella when it leaves the door of manufacturing because you\ncan't control it's just so messy it's so inefficient it's just a disruption disruption disruption\ndisruption it's just such a messy supply chain so you know farm a suitable got rid of that\na long time ago and we'll get rid of it in food because it doesn't serve us I grew up on me you eat meat\neverybody listening to this eats me it served us so well for decades but we have squeezed all the blood\nout of that stone and there is not enough land and water to continue to make food in this inefficient\nway and it's China goes middle class India goes middle class Africa goes middle class those folks\nhave money they want to be eating meat maybe we don't have the land and water to do it for them so\nnot to mention the pandemic risk so we're just going to make meat in a different way but everyone's\nstill going to get me well kicking back real quick to investment strategy when when you then\nidentify the companies that you're putting in the portfolio how are you waiting those holdings\nyou're doing it by company size is it equally weighted you know how how do you decide how much you\nwant to invest each company yeah that's great questions so Dr Sasha Goodman is the portfolio manager\non eat v and we do not do equal waiting again we're actively managed and we do have an algorithm\nthat we work with and of course it's weed it's not a machine doing it but we it's momentum based\nand we can tweak the algorithm to be momentum based but risk mitigation you know just because\nthese have been tricky volatile times and then when we feel that we're out of the woods and we're\nnot there yet obviously everybody listening to this knows we're still in a tricky economy then you can\nfocus it more to be just some momentum but that algorithm that we dial in for risk and momentum\ndecides on the weightings and then we double check those to make sure that they make sense\nmakes a lot of that makes a lot of sense um just the first thing that comes in my head is you know a\nvegan quant uh stock selection here so um you're gonna put that on a t-shirt and wear it around vegan\nquant um love it so what about rebalancing i know it's active do you have a regular rebalancing\nschedule or how often you kind of take a look at the portfolio i'm guessing from what i'm hearing\nfrom you that this is a daily a daily check we check daily that's a no-brainer we check daily but\ntry not to rebalance all of our testing has shown like your guess gonna have the the best results\nwhen you test quarterly so we test quarterly but we're actively managed or excuse me we rebalance\nquarterly but we are actively managed so we can go in and tweak as needed and this is the beauty and\nthis is what you want right you don't want an actively managed thing to act like an index so um\nthere are movements in the market there are movements in food you know IPOs etc that you\nwant to be there to take advantage of um and and things can't swing so we for sure quarterly but\nthen we look at it daily and we look at companies daily and we're always deciding if we need to\nmake any any tweaks yeah and so if you're sitting down across the table from um you know an investment\nadvisor um and how are you positioning edve as where would you put this or where would you advise\nyou know an investment advisor to put this in and overall model portfolio construction\nbecause like you said you're investing across the gamut in terms of company size you're also investing you\nknow globally um so where would you sleeve this or what what kind of your pitch is to where it fits\nyeah there are two things that we discuss with um financial advisors and and that is you're really\nlooking at high growth companies at low growth prices because the market hasn't priced in\njust how critical food transformation is and just how quickly it's going to change so given our\neconomics scenario where some things are still kind of depressed out there you know if you're not\nin video basically you're depressed you're fine but everybody else has got to still depressed so\nyou're looking at high growth at low growth prices so we talked to them about even though we're\n30% small cap 40% mid cap and 30% large cap we talked to them about um putting us in your\nsmall cap because we think small cap is highly undervalued and going to pop there or um and that\nwould be just for the person who has no sustainability umbrella or if you have a sustainability sleeve\nI mean we haven't talked about that too much but let's get into it super fast this is a huge\nplate it bringing down the carbon footprint of your investment portfolio so we had a third\nparty certifier ethos ESG and they came up with our carbon neutral certification because we are\nnot making the emissions to begin with it's called emissions avoidance so by replacing\nhighly-emittive products like meat and dairy with non-highly-emittive products we have emissions\navoidance and that makes us carbon neutral through emissions avoidance but then they took it a\nstep further and they said well what would the global temperature warming potential be of EV so what\ndo your companies collectively their footprint how's that going to impact global warming and it\ncame up with 1.18 degrees Celsius so our global warming temperature potential is well under the 1.5\nof the Paris Accords recommendation so then we said well okay compared to what so they took the most\ncommon investment that would be the S&P 500 index that global temperature warming potential is\n3.87 then we all know the planet doesn't function at 3.87 almost 4 degrees increase so you know if you\nwant a sustainability play and whatever that is for your portfolio 25% 20% 30% or maybe it's 50%\nfor younger generations 25 for older generations well we should be a big chunk of that for you and\nthen we discuss are we going to be 10% of that sustainability portfolio where we're going to land\nthere in but we have a huge sustainability play where carbon neutral without buying offsets and we\nyou know we're well under the Paris Accords global temperature warming potential so lots of lots of good\nthere yeah zero exposure to deforestation by the way so you know lots of good there got it well so\nI guess kind of one more question before we wrap up and and this is again I really enjoy talking\nto you I always seem to learn something new every time we talk and it's very interesting but from a\nbusiness perspective both of us are fairly newer issuers so what challenges have you faced so far\nkind of being a niche and new issuers in the space as far as trying to distribute the product\nand tell your story sorry could you say that again you're cutting out on my so sorry but you're\ncutting out on my feet I don't know why that's fine no I said you know as a new as a new ETF issuer\na newer ETF issuer and also being a niche niche issuers what challenges from a business perspective\nof you faced you know just learning the business and also kind of through the hardest part it's easy\nit's I shouldn't say it's easy it's easy to kind of come up with an idea and build a product it's\nmuch harder to kind of run the business and and make it a viable long-term product so kind of\nif you could you know quickly kind of talk about some of the challenges you faced and some of the\nthings you're doing to kind of push the ball forward I think the biggest challenges the one that you\njust mentioned this is not niche at all eight trillion dollars it needs to be completely overhauled\nI'm talking about the global foods system eight trillion dollars it doesn't work and it needs to\nbe completely overhauled meat is just 1.4 trillion of that not even including the dairy aspect but\nall of it needs to get revamped you know we ship live animals from Australia to the Middle East\nChina just makes no sense oh my gosh so these long transportation you know the carbon footprint\nthere in is also awful in addition to the animals and all the deforestation I mean just makes no sense\nthis is a you know eat three times a day and everyone does this is not a niche product I know\npeople think it is that's the biggest hurdle so we always knew when we started this product that\neducation would be key and luckily I come to public speaking naturally and I am a food system\ntransformation expert so I I'm very comfortable educating but I think people you know they're so\nfocused on solar panels and electric vehicles and they don't realize that you simply will not\nimpact climate change in the time that we need to do it you don't address our food system you just\nwon't that's ubiquitous so we are not an east product and it's hard to it's hard for people to\nwrap their mind around that well Elizabeth again I really appreciate your time I appreciate your\nknowledge and most importantly where can people learn more about you in the firm and eat V oh gosh\nwell you can go to eat V ETF dot com see all our performance we've been you know beating the\nRussell 2000 which is really kind of where we play well so just go ahead and check all that out\nthen if you want to connect with me or you want to ask me questions I mean it all starts with\neducation and people are fascinated by their food system what's going to happen in their food\nsystem so come find me on LinkedIn I'm always happy to chat with people personally and then for\nthe ETF itself go to eatvtf dot com well again Elizabeth thank you very much I really appreciate\nyour time and your knowledge and I hope to talk to you again in the future lovely thanks for having me sure\nyou",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}