{
  "id": "13640621",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nToday we have John Dovey, recurring guest John Dovey, and Frank Tidesko, they are from Astoria.\nWe talk to them a few weeks back about their ETF PPI, and today we talk about their newest\nissue, ROE, which is the US Quality Kings.\nWe talk about the strategy.\nWe also talk about markets in general.\nWe kind of talk about that on the front end.\nSome of the things that may have surprised us this year, some of the things we might be looking at\nas we head into Q4 into 2024.\nSo I hope you enjoy this episode with John Dovey and Frank Tidesko.\nJohn, welcome back to the show.\nLet's be back again, Brad.\nSo today we have John Dovey and he brought his partner in here, Frank Tidesko.\nWe're going to talk about Astoria's newest ETF, the Quality Kings ROE ETF.\nIt's your second fund, so I should say first of all, John, congratulations on being the first recurring\nguest of the podcast, and also congratulations on the new launch.\nThanks so much.\nSo before we get into the ETF, we've talked on a prior episode.\nIf you didn't have the opportunity to listen to the last episode about their inflation ETF,\nwe talked a lot about the firm and some of the different offerings they have.\nBut this episode, since we already have that, we're going to talk about markets a little bit,\nand then we're going to go into their newest offering.\nSo I mean, Frank and John, both of you, what do you think is your opinion really of the state of\nthe markets as we enter the fourth quarter?\nI think for me, at least it's been a surprising year.\nWe just got some news and some talk from the Fed yesterday and a rate hike decision,\nor I should say non-rate hike decision, but what's your opinion on kind of the state of the\nfinancial markets as we head into the fourth quarter?\nCool. Well, I'll lead, and just for background, when we talk investments,\nyou know, in a story, we are really coming from the standpoint of being longer-term strategic and\nnature, not tactical, but we do take out active risk versus our benchmark,\nand I think that's a big problem, not enough people make active bets and then portfolios.\nBut, you know, our standpoint has been for a few years now that we thought, you know,\nreal rage would be higher and higher for longer. Why? Mainly because, you know, the consumer,\nyou know, has proven to be healthier, the lady markets proven to be, you know,\nsecondly pretty tight, and inflation would be, you know, higher for longer.\nSo really, that's kind of like the three pillars I would say that we built our portfolio\nconstruction, and what that translates into is the idea that, you know, you kind of got to look away\nfrom US Metcap, you know, tax stocks. You got to include inflationary-linked bets that's in your portfolio.\nYou got to be more active in fixed income, and, you know, still have a need for a liquid-alt\nin your portfolio, you know, because there's still a lot of asymmetric risks in the economy.\nSo what do you think has surprised you so far this year? I mean, if you were to ask me at the end of\nlast year, if we, if I thought that the S&P would be up double digits this year, I would have,\nI would have laughed, but here we are, and I guess that's what financial markets do to most people.\nSo just kind of anything that's really surprised you, or you kind of in the same boat as we are,\nin terms of didn't really see the market accelerating like this in 2023.\nYou know, we put it together on a year ahead of outlook, and, you know, there were three big\nconsensus calls going into 2023. One was that there was going to be an economic recession.\nTwo was that there was going to be an earnings recession, and three, there was, you know,\npeople were preparing for like a death-comphide, left-tail race, for equities, you know,\na down 20 percent year. So we said that we didn't think that there would be, you know,\nall three consensus views, because the consensus used really pan out, but maybe one of those three,\nand I think it's proven that, you know, we have this earnings recession,\nbut it's certainly no death-comphide down 20 percent move in the markets, and, you know,\nno bigger economic recession. So everyone's been off side this year.\nI think like we're classic late-cycle, but usually late in the cycle, you have, you know,\ncrude oil rallying, which it is, you have people concentrated and a few select number of stocks,\nwhich we certainly see with the magnificent seven, you know, and just feels like very likely\ncycle. So I think like we're definitely surprised, but, you know, we try and take like more\nabout the long-term view, and it just like what's going to happen in the first couple quarters,\nrather than rather than doing that, we're thinking, okay, how do we build a portfolio for the next,\nyou know, two, three years and how do we make, you know, you know, intelligent decisions,\nand, you know, investments where we think we're going to be compensated and\nfor them on a risk-free time basis. Yeah. So, I mean, the one thing I'm really surprised about,\nyou touched on this, and I think we're going to touch on this a little bit in our discussion,\nis the just basically seven to nine stocks leading almost all of the return this year. I know,\nin my career so far, I haven't seen it be this concentrated. We're going to talk about ROE that\nis your ETF that does things in a little bit more equally-weighted fashion. I want to hear your\ntake on a while you think that, you know, that is a better way to do things. But before we transition\nover there, I think one of the things I find interesting, I'm not sure how many retail investors\nyou really get to talk to. I get to talk to a good bit of them, and they just seem tired. And they seem\nlike, now where rates are where they're at, they're very happy to be packing money into money market\nfunds and to treasuries and getting their five to five and a half percent yield. And just saying,\nhey, look, I'm good with this. I need a break. So, what do you think would need to happen in order\nto change that sentiment and see investors start to, you know, flock back away from that safe\nyield at five, five and a half and start to getting, you know, more concentrated in equities again?\nWell, I would say the Fed purpose that does that, right? The Jack front end rates that\nare trying to slow the economy to do exactly what they're trying to do, which is to take\na liquidity out. Because, you know, when there's too much liquidity provided to the marketplace,\nI would happen in March of 2020 post-COVID, you know, a ton of stimulus, you know, drop rates at zero\nto get the economy added recession. You know, it's always, they put too much liquidity in and\nhave to curtail it. So, we face the same sort of sentiment that you're referring to, which is that\nthen a more question we get from advisors is like, why do I need to own stocks? Because I can\nget risk-free and click, you know, buy it in a quarter. But that's the reason why we're rallying,\nright? Because it's like, who's left to sell? And so, that's why I think you have this, like,\nvirtuous circular, you know, kind of feedback loop. But what we'll take is what we will eventually\nhave, which is the economy will slow, you know, there will be some something will happen,\nwhether it either the consumer believes it does tap out, you know, unemployment, you know, spikes,\npeople lose their jobs, or they could be like an oil shock. And, you know, again, late cycle,\nright? So, pretty old $7.00 a barrel and July 3rd of this year, they before July 4th, when\neveryone gets in a car. And, you know, here we are now in pretty old, that did $90.00. So, you know,\nthat move from 69 to 90s, you know, 30% move. So, that typically happens late in the cycle,\nrallying, as they happen. So, well, before we, we talk about the ETF, because that's what we're\nreally here to talk about. I want to allow Frank, Frank, who's here, has been, has been waiting\npatiently. Frank, why don't you introduce yourself to everybody and give us a little bit about\nyour background, where he came from? Hi, but, yes, and thank you for having me on with John.\nI joined a story back in 2020 in the midst of the pandemic, and I've been with him ever since,\nI started that as an intern when I was at Ford University, and I've gotten the opportunity to\nbe present for the launch of both of our ETFs, PPI and ROE, and I've had more responsibility,\nwhich is exciting with this new launch of ROE. Yeah, that's great. And you're really coming out\nof college started a great place. It seems like at the type of place that it's kind of probably\nall hands on deck, and you got to learn a little bit of everything, and so let's talk about ROE.\nAgain, congratulations. I knew you were coming out with something else, but I didn't know what it was,\nand so here it is. Can you tell me, you know, at a very high level, what the strategy is trying\nto accomplish and what it is? Yeah, so we talked about it a little bit. There's a ton of\nconstant freight and risk in the large dependencies, which makes us reluctant, and there's data\nthat shows, if you go back to 99, that the S&P 500 equal weighted index has fairly significantly\noutperform the S&P 500 market cap, what it indexed. And you know, we understand that you can\nselect different periods of time to show performance differences, but the bottom line is over time\nequal weight has shown the ability to outperform. So that's the one premise that this ETF is grounded on.\nThe other is quality. In quality is shown through the research of the factors who have a higher\ncircle ratio, which means that per unit of risk you're taking, you're getting a better return\ncomparatively to the other factors. It may not achieve the same level of compound annual growth rate,\nand it's not the most volatile, but you get better predictability and higher quality companies\noutperform the market and lower quality companies outperform the market. You can look at the\nformer French data, but those are the two premise premises that this fund is based on. So now the\nconstruction, it's 100 of the highest quality US stock, and we sector optimized to the broader\nlarge cap universe. So what that means is if the market has 28% tech for example, we'll also have 28%\ntech in our ETF, but instead of three stocks making up 16 or 17% of that 20, we'll have 28 different\ntech stocks each making up 1% of the total ETF. That's super interesting, and I want to learn more\nabout that. So let's start at a higher level, which is you're doing, you're dwindling down all\nthe universe of US stocks. I believe I read it's between large cap as well as midcap, is that true\nmidcap is included as well. So how are you screening to get to these top 100 quality names? I'm\nassuming it's some top down approach, and then from there you're doing some sort of rank and\nselection process. So can you talk about this portfolio construction process to get you to\nnot get a call at concentrated, because from the universe it's fairly concentrated. So can you talk\nabout kind of how you get those names in there? Yes, great question. So we don't have a benchmarks\nand actively manage ETF. So we don't, the starting universe is all US listing, and then we from there\nget down to 800 by minimum market cap of 5 billion, minimum free float there, 25% enough,\nand we need about the correct me if a wrong giant thinks 50 million average daily volume going past\nsix months. So we want liquid stocks, we want stocks above 5 billion, so we'll have some midcaps in\nthere too, and from those initial screens, we get down to around 800 stocks. And then from there,\nwe use the quality metrics that best define each sector based on historical research. So the\nmainly it's ROI, ROI, and return on invested capital, but different combinations of those\nthrough different periods such as one year or five year, best define each sector. So we still\nthrough the best quality stock for each sector, and that's how we make those selections\ninto this sector optimization. Got it. And so we'll talk about the sector optimization in a second,\nbut how often are you rerunning the screen? You're saying, you know, the portfolio is active.\nIt does it have a, does it have a scheduled rebalance or is it something that you guys are looking at?\nDaily, like how are you putting this portfolio together and really sourcing these opportunities?\nDon't say it's an annual, you know, ads and deletes for balance, you know,\nquarterly kind of bring things back to tolerance. So, you know, each stock gets one percent,\nyou know, to start a little ETF, and then like every quarter will bring, you fill\none to 80 bits, so don't go back to one percent if you went to one point two five,\ngoes back to one percent. The real key thing for us is like it's systematic active,\nnot like we're picking forward versus GM at all rules based. The actual implementation of\nit, I would say, is active. You know, I spent 18 years on Wall Street Trade and Floor, and if this\none got to be, you know, let's say one day, you know, five billion dollars, right? You'd have all\nthese hedge funds out there that will try and game it, because they publish an index method all\nthat you got if you pass it. You see, you can trade on the clothes on the third Friday and March\nJune 7th deck. And all of a sudden, like you start to lose, you know, hunched basis points,\nbecause everyone knows you're trade and they're going to front-run you. So, like when we were balance,\nlike we will, you know, we don't have to do it on kind of third Friday, March June 7th deck.\nYou know, so that's why we wanted to make it active. Also, you know, with 100 stocks,\nyou know, I've also seen in my career, you know, N-1 goes to zero, WorldCom goes to zero. Like\nif there is some cataclysmic event in a single stock, we just didn't want to have to wait\ntill I can add your balance, to let's say kick it out. Like if something were to happen,\nbut that's like, that's not our vision. Like our vision is like we cut, you know,\nquarterly share our balance, annual stock portfolio. You know, we're picking the highest quality stocks\nin the whole US world. So, anything else, Frank, can you add to that? No, I think you're right,\nbut, Frank, you said it wasn't concentrated. It is 100 stocks, but, you know, it's called the\nquality king, it's because these are the kings of quality in their sector. So, this makes up\n100 of the quality kings in the mid-tap and large-cap US universe. Right. Yeah, well, I guess I was\nreferring to not being concentrated in the sense that it's not 10 names, right? You definitely\nhave some diversification in the portfolio. And so, let's talk about the sector waiting,\nthe sector in size waiting methodology. I think I understand it. It looks to me like you have broken\ndown different market cap, we'll call them tronches or buckets. And each one of those buckets\ngets 10 names a lot to it. Is that, and then from there, you want to keep the sector weight\nin relation to kind of the index. So, as you would mention, you know, information technology is something\nlike 24 percent of the, you know, the US large-cap sector. So, therefore, you want to maintain\nbasically around that percentage. But, to me, it look like when you're doing your waiting,\nthere's also a cap market cap tronch or size in which you're dividing out your holdings. Is that\ntrue? Can you make that crystal clear for me? I want greater than about $5 billion market cap.\nSo, you know, that's the ideas that we want, you know, the kind of, the whole view that we have,\njust to give the audience like this real strong, you know, clear uping it about us. Like,\nwe had lived in a world for the last 10 years, we was all about deflation, low interest rates,\nquantitative ease, and fed drop rates to zero. A lot of money was put into like tech,\nyou know, and they just created this like massive boom in like these like 70 technology,\ncontinuing to scroll down and restock. So much money went into passive annexation, so much money went\nto model portfolios, so many RAs, launch, like so many firms like your firm, our firm,\nand it, like, it exacerbated these concentration of these seven mega-cap stocks. So,\nwhat we've been saying is like, you know, if you take up those seven stocks,\nlike the rest of the US equity market actually really attractive, it's, you know, on average,\n15, 16p ratio, which is not terrible, right? Once you include those seven stocks, you know,\nforward earnings is like 2021, let's say. So, like, our view is like, you know, there's so many\ndifferent, you know, there's a lot of different opportunities out there, and not only US outside of\nthose seven, but in the rest of the world. So, like, let's get into the mid-cap space, let's get into\nlike the large-cap space. So, we want things greater than $5 billion, because we just want it to\nlike fill out our portfolio to take advantage of what we think in the next few years, which is going\nto be like a rotation out of the tech into like the rest of the world. So, so that's like the\nfilter is, you know, greater than $5 billion, which is, you know, let's see, right? Like that,\nthat could win up, you know, because if you get through these like your two periods like now,\nBorg is a timber where you got a lot of authority, you know, the mega-caps could do better, right?\nBut it markets for what now, and there's full participation that we would expect, you know,\nthe smaller tail to do better. Yeah, and I guess, like, as far as timing to, I feel,\nI can say this, I don't know, if you can say from a client's perspective, but running an equal\nwage strategy right now seems to be the right thing. I know, and I read some of the research\nyou guys did as far as equal weight, I'll performing market-cap weighted indexes. However,\nif you look historically, they're fairly correlated, and we had a massive correlation breakdown\nbetween equal weight and market-cap weighted this year. So, do you think this is an environment\nand where, or should I say, do you think this is a good time for an advisor to start rotating back\ninto, you know, equally weighted based indexes rather than market-cap since the juice of that\nmarket-cap weighted index seems it's, it's so out of whack from historical as far as correlation\nstandpoint that now might be a good time, and an equal weight might be the play going forward\nfor the next, I don't know, 12 to 18 months. Thank you, guys, with that, I want to say before\nI turn it to frankly, we, okay, when I started my career in 1999, it was all about, like,\ninternet stocks that are going up 3,400 percent. It was like the same server living in\nthat where, like, the only thing people wanted to buy was tech and internet stocks to drag\nup to valuations of the indices, and, you know, you knew it was a bubble, the difference between\nthen and now is that if you find those companies weren't necessarily the most profitable in the world,\nbut, like, you had too much concentration risk and tough. After that, for me, is when, like,\nfact, they're investing really became prolific in a sense that literally firms were created\nafter the late 90s bubble, right? Like, was intrigued, was low-inch, after that, like, Rob\nor not was, you know, building a big business, like, you know, for, you know, cliff-assness,\nlike, so I feel like we're in that period now, but from our standpoint, Frank, like, we don't\ntell advising, okay, put all your U.S. equity exposure and just high quality strategy,\nlike, use this as a compliment, but I'll let you drive that point home. Exactly. That's right.\nSo, like you said, when you started a story, or since you started a story or rather,\nquality has been the ballast of our core U.S. equity position, and yet concentration risk is\na hot topic this year, but the reason that it's impacted are portfolio positioning,\nit's because so many ETFs are market-tapped-weighted, quality ETFs are market-tapped-weighted,\nso you may not even realize, but your quality exposure may also be 20%, the stocks that are\nleading the S&P 500 itself right now, because they are a quality company. So, what we wanted\nto do was create an equal-weighted balance that can serve as a compliment to other growth strategies,\nor other market-cap-weighted strategies that already have exposures to the stocks that are\nleading the market. Yeah, I think you touched on this a little bit. You touched on the way\nit over time, if you could hold it, and you can be patient and keep it close slow, and equally\nweighted, you know, the frank main point that the S&P glee would index, which in fact says data\ngoes back to 1989, like that has outperform the S&P index, you know, substantially, or it's like\n50-60%. It's not a few in your basis points, right? And we've had some really big mega-tech rallies,\nright, but then like the bubble bursts, and then there's like a grown-in-out of the market,\nand that's why you think you get that out performance, right? So in the past performance,\nI don't think a future results. I mean, Eric Balchunus from Bloomberg tweeted out like the\nDow Jones and next, DIA ADTF. Just the ETF, you know, it's been around for 25 years,\nlet's say 30 years, you know, since that ETF is long, and that's price-related, that's up for\nthe S&P, which I kind of believe that, and this is, you know, they follow stuff religiously.\nSo the point is like, there's all their alternative ways to like weigh your risk for your\nactivities, you just have to adapt your patient. So it's very invoked right now what we're talking\nabout. I just don't think that we want to my optically say like, okay, just in this one quarter or\ntwo, like we think you should diversify with mega-capped, there's Google's F like excessive valuations.\nYou know, we want to use this as a compliment, as a tool to kind of harvest some of these premiums,\nthe premiums that we believe in, which is like, you know, quality is a factor when we\nquickly weigh distributed risk to like the smaller cap-ish stocks, the value-ish stocks.\nSo it's like the one, it's one way to express a lot of these factors,\nviews that are like near and dear to our heart as like multi-factor investors that we are at\nAstoria. Yeah, no, that's what that's what I'll put. And you touched on this a couple of times,\nand I just want to know how you're kind of driving conversations with investment advisors.\nIt sounds like to me, you want this to live beside kind of the large cap equity exposure inside\nof a model portfolio and help act as a compliment, is that accurate? Yes, that's accurate. And the way\nthat we're the way that in our experience so far advisors are adopting it is close to a third of\ntheir U.S. equity exposure. So it's like you said, it's a compliment. We're not asking anybody\nwho's suggesting you replace your entire equity exposure with the quality equal weighted fund.\nIt's just a good ballast in a good compliment because like I mentioned before, quality as a factor\nis first of all, our preference for, you know, our largest U.S. equity position, but it's also\ngot a better return for unit of risk. It's got a better star-breakdown than the other factors.\nSo if you buy it and hold it, then, you know, per the research in theory, it should have that\nservice near portfolio. It's great. And so before I want to just take a quick pivot, but before I\ndo that, is there anything else about this strategy and ROE in particular that you think it's really\nimportant for investors to know? I mean, the fund has been out for a month. I've seen some of the\nliterature and things come out, but is there something you really want to drive home that\ninvestors or specifically like investment advisors should be looking at as far as the strategies\nconcerned? Not for my side. Thank you. No, I don't think so. Not an ROE side, but maybe about our\nportfolios. John, do you want to speak on there? I mean, we, you know, we partner reason and just to\ngive the audience some ideas like, you know, we're not, we're the sub-advisor for this ETF\nand we have another sub-advisor relationship, managing inflation strategy. But, you know, the\nreal reason why we launched ROE is because, you know, we had a need for an ROE side. You know,\nrather than just trim in our index, baby TFs and, you know, smart baby TFs that we use to kind of build\nour strategic gas allocation portfolios. Like, we just felt like, okay, nothing out there existed\nin the form that we wanted it. So, you know, we're not going to issue another 10 ETFs just\nand trying to be the next biggest ETFs you were up there. It's just that we felt like, you know,\nwe needed it for our advisors and that was the real emphasis, you know, for us launching it.\nYeah, so let's talk about launch. You know, we're a single issue where you guys were a single\nissue where, how did you approach this launch maybe a little bit different to,\ndifferently than your first one, John, now that you know what you know about launching an ETF?\nDo you do anything differently? Let's just have to have it out there because, like, no matter what\npeople like, well, I need one, three of track record, five of your track record, or I need, you know,\na half a billion, a hundred million. So, you kind of just have to like issue the ETF and,\nas long as they can, like, stay afloat and it's, you know, negative, creative to your cash flow.\nLike, it seems like a good risk of what I mean, you know, the widely-able firms and we use,\nyou know, ETF architect, as our platform provider, you know, they make this stuff like very cheap\nin general. You know, so it's like the cost have come down obviously, right? We just explained\nthat we live in this massive deflationary world the last 10 years. So, if you told me 10 years ago,\nlike, you know, a story would have to ETF. Like, it was just the big behemoths with launch ETFs,\nyou know, 10 years ago. But, in fact, you know, a couple thousand ETFs have been launched in the\nlast two, three, four years. Like, that just shows that, like, if you've got to get strategy and\nyou've got the ability to bring assets to the table and it could be negative, it does make sense\nif you can warehouse it, you know, in Europe, if you have, if you believe in it. So, I think our\nexperience, our first ETF, we've got a wonderful experience, you know, we work with access and\ninvestments with that, you know, inflation is a strategy that I think is very new to people. So,\nlike, you really need to, like, have debt, you know, sales of marketing, and they serve as the\nadvisor for that fund. You know, something like, are we, it feels like, you know, we knew we had\nthe assets to bring to the table and, you know, we cost 50 million in eight days. And that's really\nhard, right, to get that kind of skills so quickly. So, you know, now we just needed to live\nout there on the GoSphere and, you know, hopefully, you know, sprints remain tight, vimes pick up.\nAnd, you know, people, it takes years, right. We know from our existing business that, you know,\nwe want to strategic asset outreach, you know, hopefully, a known finance day, one year, one or two,\nit takes, they need to see a five-year tracker, you know, seven-year tracker. So,\nthat's very positive. Yeah, no, well, yeah, I mean, I noticed the assets, kind of day one,\nand, you know, congratulations on, you know, a successful launch. And I really appreciate, you know,\nthe both of you taking some time with me today to go over it. And before I let you go,\nI just want to give you opportunity, where can people learn more about ROE, where can people\nlearn more about, you know, Astoria and get all the information they need to make an informed decision?\nSo, you can find more information about ROE at AstoriaAdvisorsECF.com. And you can follow Astoria's\nLinkedIn page. We're active on there as well as John's Twitter, AstoriaAdvisors. We're very\nvocal and social media and post-get out, you know, the Fed all that. Good. Well, Frank, it was a\npleasure to meet you, John. Thanks for coming on again. And guys, I hope to run into your next\ntime. Unfortunately, I'm going to miss you this time. And you have it right. You know, maybe I'll\ncatch you next time. Thanks for having a fun, Brad. I was a pleasure. Yeah.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}