{
  "id": "13684993",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nToday we have Kyle Wigs.\nHe is the founder of UX.\nWell, there are technology companies that help investment\nadvisory firms put together an efficient tech stack.\nThey also do trading, billing.\nThey also have a very unique set of model portfolio strategies that are made available to their\ninvestment advisors.\nA lot of those strategies utilize technology or artificial intelligence in some way shape or form.\nSo, Kyle has a very unique perspective from the investment advisory space as to what the\nbest practices are and how advisors are utilizing technology to make their business more efficient\nalso provide better outcomes for their clients.\nAdditionally, although Kyle is not behind the Ticker, he sees a lot of unique active strategies\nthat are either considering or have already converted to an ETF.\nSo, he kind of sees those in their infancy and has a unique perspective on how they make those decisions\nto get to launch day.\nSo, without further ado, Mr. Kyle Wigs.\nKyle, welcome to the show.\nThanks, Brad.\nSo, before we get started, can you share with us a little bit about your background and how you\neventually decided to start and form UX wealth?\nYeah, happy to.\nAnd thanks for having me in UX.\nSo, started my career in the early 2000s as an external wholesaler and spent many years\njust in advice with offices.\nGetting a sense for what was important to them and trying to\ntake that information, spent many years on various leaders' councils.\nAnd ultimately, the objective was to try to understand what the advisors were in\nmeet-up and what the firm was providing and close that gap.\nAnd then in 2013, went to a broker-dealer network.\nWe had about 4,000 advisors across the country.\nAnd I was responsible for really the platform technology, trading building, reporting, and distribution.\nThat entity was ultimately sold to LPL in 2017,\nreally at the height of the DOL.\nAnd so, the idea was to take everything that we had heard from the advisor\nteam and to see if it existed in the form that we thought the advisors were asking.\nOur assessment, as we looked around, sort of the landscape was that it didn't exist.\nSo, we did a bunch of due diligence, technology work, and ultimately formed and found\nit UX wall partners in June of 2020.\nSo, before we talk about UX walls kind of deeper, what are some of the things I always\nlike to ask everybody that you like to do outside the office?\nWhat do you do for fun when you're not working?\nAnd I know you work a lot.\nYeah, so a couple of things left to golf, big, big cyclists.\nSo, I try to get a couple of big rides in at least once a year.\nThere's one in Colorado.\nMany people would know called the Triple Buy Pass, which goes over three of the\nColorado passes.\nSo, I'd say those are probably the two primary ones.\nThat's right. You are from Colorado.\nWhy did the Denver Broncos stink this year?\nThe Denver Broncos stink because John L.A. was the best in the worst of GM's.\nSo, he was the best of GM's because he convinced Peyton Manning to come to Denver,\nand we got to Marcus Ware, and we got to keep to leave, and the list goes on.\nAnd they basically masked John L.A.'s inability to draft his talent.\nAnd so, once Peyton left, and to Marcus Ware left, and Vaughn Miller left,\nthat I mean, the cover was fair.\nAnd so, we have incredibly weak team that has no doubt,\nreally no talent.\nAnd we just traded for Russell Wilson, who's a disaster.\nSo, they're good at that.\nI didn't mean to, you know, rub salt in the wilderness early,\nbut, you know, I had to, I had to poke the bear.\nYeah, for context for those listening, the Broncos just gave up 70 points,\nand it could have been 100 if I had more.\nSo, let's get back to it.\nUX, well, so can you explain really in a little bit more detail what UX does\nfor investment advisors kind of soup to nuts, and, you know, explain the technology stack and how it works.\nYeah, so, many would be familiar with what's known as a tampe,\nor a turnkey asset management platform.\nSo, names or household names that the advisors would probably,\nparticularly in the RA community, less so on the broker dealer side, right?\nSo, on the BD side, you have your traditional tamtes, which are acid marks,\nand your S.E.I.s. with both of them.\nAnd what's happened in that space over time is that the broker deals are really\nto move assets away from those teams and get them on their own sort of in-house platform.\nIn the RA community, the names that people would probably be familiar with would be investment,\nyou've got Orion, you've got, you know, G.O.L. Smartx.\nAnd so, what we do in addition to sort of those firms is we do really everything that an advisor\nprobably has to do what shouldn't do, right?\nSo, the things that they need to outsource to create scale and efficiency and equity in their firm.\nSo, trading, billing, all reporting, we've built out the advisor dashboard, which is branded\nin personalized to an advanced business, the client dashboard, which gives client access to all\ntheir statements and billing files and reports. And then we've got a pretty sophisticated trading\nsystem that we've built out that pipes to all the boundaries of custodians. So, we work with\nfidelity, Charles Schwab recently was TD Ameritrade until the merger. Interactive brokers,\nApex, Axos, kind of you name it. And so, if the idea that we give access to the investment advisor\nwho's just trying to meet with clients, do a great job and grow their business and then we basically\ntake off their playing all the back office sort of responsibilities that they have.\nAnd so, for my understanding, kind of just looking at the website, you also provide a pretty\ndifferentiated list of available managers on the platform. I mean, it's a unique kind of a unique\nset of managers and why are you curating kind of these types of managers rather than what you might\nsee at a traditional tam. So, there's enough tamts out there. We didn't need another one that\nthat was kind of a me too. And then all of a sudden, you become the definition of a commodity.\nRight? You're doing the same thing as everybody else and now we're competing on either relationships\nor price. When I was in the broker dealer world, many of the BD's, unless they have their own\ntext act, use investment, and then they all source the same model managers, not picking on them,\nbut they're all the same. It's the Russells and the Vanguardards in the state streets and the American\nfunds of the world. And so, now we have a situation where advisers are all using the same technology\nlargely. And these are technologies that were built in the late 90s, really, 2000s. And then\nthey're all using the same investments and it's no wonder why we have feet compression because\nwe've essentially commoditized our business. And so, as we look at all of the model marketplaces that\nexisted, one of the questions that we had, really, as a thesis was, why is every other industry\npick one, healthcare, communication, you name it, using technology to sort of, not sort of\nbut to literally break down barriers and push industries forward. Except when it comes to how we invest,\nthe ways that advisors and clients are investing today in an asset management, from an asset management\nperspective, are not any different than we were doing in the 70s and 80s and 90s and so on. And so\nwe went out and we started asking a lot of questions of these various platforms, large institutions\nand really what we found was, it wasn't that they didn't believe that the technology could do a\nbetter job. It was more self-preservation. It was a CIO with a CFA designation who would say,\nwell, that's my job. So they didn't look at the technology as, hey man, this is something that\nperhaps makes me better at what I do or expand the universe of what we do. And so we couldn't\nfind it. And so we just decided that the hill we were going to die on is we were going to find\nthe best technology driven investment solutions that provide asset allocation models for clients\nbased on their goals and objectives, eliminate the human emotion and bias. And then we sign\nexclusive deals with most of these managers. And so really Brad, that was the idea behind it.\nWas that, you know, I don't know if it's going to be 10, 15 or 20 years, but they will come a day\nthat we look back on investing the way we do it now. I think similarly to, you know, when I\nfirst moved to Charlotte 2006, you could smoke in a restaurant. Okay, my kids will never step\nfoot in a restaurant where you can smoke and I think there will come a day where we'll look back\nand go remember when humans used to pick stocks and ETFs and mutual funds. We're not there yet,\nbut that's where we're headed. So what is it about these types of managers that potentially\ncan provide, you know, a better outcome for clients? Like why? And you briefly touched on it,\nyou know, the human element or the emotional element, but you know, what really is it about some\nof these, you know, emotion or computer, emotionless or computer driven strategies that have the\nability to drive better outcomes? So I think the first thing that we have to understand is what\nspecifically is the technology trying to solve for? And that's a question that we ask of every one of\nthem. Think of Tesla Brad for just a second. You know, Tesla has had challenges with their autonomous\ndriving largely because the problem of autonomous driving, it's a problem. And the technology is trying\nto solve that. And the problem is too big. There's too many variables that you can't program into\nwhereas when we meet with a manager, we specifically say, what exact and specific objective are\nyou trying to achieve? And I'm going to oversimplify this for a second, but there's kind of two broad\ncategories that we can find. One is a category that is looking to minimize volatility, looking to\nminimize drawdowns and portfolio. And then the other one is pursuing health. And so what we have\nfound is that the human component, when the proverbial, you know what hits the fan, I don't\ncare for the best money manager in the world. In 2008 or during COVID, like you became emotional,\njust like everybody else. And so your strategy, all of a sudden, becomes, you know, skewed if you\nwell by that human emotional component. And so what we look for are strategies who have a very\ndisciplined technology, almost rules base, that has proven whether it was 2008, whether it was\nfourth quarter of 2018, whether it was during COVID, they have a disciplined, on emotional way\nof derisking the portfolio and limiting drawdowns. You're not going to miss all of it and certainly\nyou give up some of the upside. But it's the idea over a full cycle if you can keep a client\nfully invested through the ups and downs. That's where we see the better ones. And then on the\nother side of it, some of these managers are using technology to measure things that humans can't.\nSo humans are inherently limited whereas these technologies can run literally an infinite number\nof sort of simulations and outcomes on a daily basis. And so maybe a specific example is a\ntechnology that we have that looks at sentiment. So it's looking at the 500 names of the S&P 500.\nAnd it's measuring in real time everything that's being said about a company in the digital world.\nSo it takes that information on a weekly basis. You think of the volume of info that would be\nrequired. And it forms an opinion. Is the sentiment about Tesla for this week, positive or negative?\nAnd then just ranks and it picks the top 30 names. Humans fundamentally, by the time you\nresearch analysis and we meet with the investment committee and vote, it's already priced into\nthe market. So we've missed it. So I think those maybe would be two ways specifically that we\nlook for various disciplines. Yeah. So with that being said, I mean, you've been in the business\nfor a long time. You've seen kind of the evolution of the way portfolios have been constructed.\nSo in your eyes, how is model portfolio construction evolved throughout your career? And where do\nyou think it's going? Well, that's a good question. I would say that the lion's share of the\nassets and the industry really haven't evolved. Right. So the acid allocation logic, you know,\nusing modern portfolio theory is sort of the singular thesis around how we construct\nportfolios really in a vacuum. That really hasn't changed. The allocations that you see today\naren't very, you know, they're not dissimilar than something you would have seen 20 years ago.\nThe vehicles that we are using ETFs and other products, right? The access to maybe more transparent\nand more liquid and lower cost vehicles is really, I would say, where the acid allocation is evolved.\nBut the allocations itself really hasn't. And so where I see it going is that technology doesn't\nhave an opinion. It sort of a buys if you will around, you know, growth versus value.\nU.S. versus intervention, a large cap versus small cap. It's simply is trying to determine.\nIs the environment we're in today better suited for a value company or a growth company, a large\ncap or a small cap, right? A U.S. or international ETF. And so it almost in some ways throws the rules\nout of you've got to have style box that's all checked at a certain percentage at a certain risk\ntolerance. And it's simply trying to find the most efficient combination of securities within\na given risk tolerance regardless of sort of all the rules that we've been living by for 50 years.\nYeah. So I'm going to ask the same question, but in a different way. So the RAA space or the\ninvestment advisory space, you know, how have you seen the technology evolve that advisors need\nto adopt in order to streamline their practice? I mean, at the bare minimum, what do advisors need\ntoday to streamline their practice? And on top of that, not necessarily bare minimum, but what would\nbe in your eyes the best practice technology stack they would need in order to efficiently run\ntheir practice as we kind of enter this technology phase? Well, that's a loaded question.\nYou have the floor? Yes. I'm going to try to give you a simple answer to a complex question. So\nno advisor is going to get a call from a tech provider that says, hey, my name's Brad Roth and my\ntechnology stinks, right? Let me tell you what it doesn't do well. Everyone says they've got the\nnext greatest thing, and Michael Kitz's CEO organizes, you know, information in such a way.\nThat really doesn't go very far though, because what is so important is how do the technologies\non the back end connect and communicate? And that's where we spend, we hired a gentleman to run our\ntechnology stacks, who built Circle Black, actually. And we spent a lot of time thinking about\nsort of the friction between two different technologies to ensure that data has passed\naccurately and efficiently. So what would advisors mean? The first thing that they need is obviously\nsome sort of a decentralized dashboard that can process and handle everything from the custodian,\nbecause the custodians are, that's not what they do, right? So you get an overnight sink and you\nhave to, you need to send that data somewhere that is very good and accurate at processing the data.\nThen they need a piece of technology that can automate and handle trading. Some advisors may not\ntrade that often, and it may not be as important. But as we see a wider adoption of technology\ndriven investments, how you trade is almost as important as the investment itself. So I think that\nthe trading component of the overmanagement piece is going to be really important. Along the lines\nof the dashboard, giving them a centralized view of their business, it needs to be able to connect\nwith multiple custodians. So an advisor might be a schwa, but they might have a prospect that's\ninteractive brokers. And that client may not want to repaper to come on board with you. So I think\neliminating that friction and having a centralized hub that can connect all of the custodians is\nimportant. Billing, having somebody run billing accurately, efficiently deliver, you know, your billing\nfiles and statements to the client portals and an automated fashion is one of those necessary\nevils that doesn't drive revenue for an RRA, but it's really, really important. And then beyond\nthat, I think it's having an open interface platform that can connect with, you know, one advisor\nmight like risk lies, but another one might like, on point, or stratified. And so having that\nflexibility, one advisor might like, wealth box, and someone else might like red tape. And so having\nthat ability to really, I think, have more of a hub and spoke model where you don't have to\ndisrupt the way you run your business in order to work with whoever your outsourced providers.\nSo I think those would be the sort of bare necessities that would be really important.\nWell, what do you think is next then, Kyle, if that's bare necessities? I mean, do you see\ndo you see an all-in-one emerging at all? I mean, where do you think we're going in the next,\nyou know, five years? And again, this is a loaded question that we don't know the answer to,\nobviously, but we're having a discussion like, when does AI get in the mix with a lot of this stuff?\nWell, so, AI can do two things right now. Again, a were simplified. There's what you and I are\ntalking about, which is true AI and machine learning that's helping us drive and make better investment\ndecisions. It's not perfect, but you're starting to see like, it's getting better,\nwhereas humans are relatively stagnant. So that's one piece. The other piece is that\nthere are firms in our space that are looking to leverage AI to\nautomate some of the service aspects of what they do. I think the sort of the dirty secret of that\nis the technologies that were built in the late 90s and early 2000s, not naming names,\nare not as efficient as the technologies built in the last couple years. So what they're doing\nto augment that is use AI to try to help solve for some of the service issues and inefficiencies\nthat their platform actually is creating. So going forward, I think you'll see that.\nI think you'll see an emergence of managers. I think you'll see AI as a service hub to automate.\nNot for all the firms, but for some, we have a different opinion on that. We're very behind AI\nin terms of investments, but not in terms of service. I don't know Brad, if you've ever picked up\nthe phone and call somebody and you just need an answer and you're talking to a machine and it\ntakes you 10 minutes and you want to throw your phone. I think there's a human component to advice\nthat's really important. I think that clients still want clients with money still want to talk to a\nperson that they trust and advisors with a good business still want a support team that they can call.\nSo I don't know that I see that. Your other question is related to an all-in-one solution.\nI think that there's two schools of fun. There are some people that really are drawn to an all-in-one\nsolution. I would argue and push back on an all-in-one solution versus the hub spoke that\nyou and I just talked about. Forces and advisors to make a really big decision. You have to convert\nyour CRM. You have to use their billing. There's so many things that you have to sort of say,\nyeah, and maybe you like three-fourths of what they do, and what happens if five years from now,\nsome technology that you and I don't even know about is being created and you know,\na lab somewhere in California. Now you have to make a huge, again, decision to sort of break away from\nwhat you're using. And so I really think more of this kind of boutique, hop spoke model,\nwhere it's a best of breed for now, and then having the flexibility for that to evolve over time\nis probably a winning strategy. Yeah, no, it's really, really interesting. And if you don't mind,\nI'd like to pivot more to like the manager side. Sure. You're not in the business of\nmanaging money, but you have a unique seat because you see a lot of different managers.\nYou hear a lot of other stories. You talk to a lot of advisors who have experience with these managers.\nAgain, a lot of the managers you curate have unique and more active strategies. Are you\nhearing from them with this boom and kind of active ETFs launching? Are you hearing rumbling\nthat they're thinking about going to market with product and get out there on a more public basis?\nYes. So you kind of expanding on that. What are some of the reasons they're kind of giving you\nfor wanting to make that leap? I mean, I can speak from my perspective, but it'd be interesting to\nhear what you're hearing from your side of the table as to why they think it's a good idea to take\nthat jump. I think if I had to simplify it, the motivation to do it is distribution and revenue.\nRight. Let's not shitter coat it. They see an opportunity where they say, man, I've got this\nSMA business. It's good. And if I can just get it into an ETF, think about all the wonderful things\nthat are going to happen. In theory, you can increase your fee. You can certainly increase your\ndistribution once you hit scale. It's a lot easier to purchase an ETF than it is in SMA. It's\nobviously trading is much more tax-efficient. There's a lot of benefits. Right. I get it. But the\nmistake that I think they are making, we try to talk them out of this, is don't be in such a hurry\nto launch an ETF and forget kind of your core business because our thesis is maybe the opposite,\nwhich is let's help you launch your SMA business. Let's prove that concept that there is actual\ndemand for your product. People like it. And then let them use it for two to three years. Let's\ngo raise a few hundred million bucks on your strategy. Then let's go to the very people that are\nusing it and saying, hey, you've got a $25 million allocation to the SMA and half of that's\nin non-qualified business. If we launch an ETF, would you be interested in converting that?\nAnd so now you could see where you could get an ETF to a hundred million dollars over nine\nversus a lot of them launch because the firm thinks they have a good idea, but they don't show up\non any screens. They don't have the assets. They don't have the history. They don't have any of it.\nSo we think taking the opposite approaches. Yes, you're right. By distribution, more tax-efficiency,\nhigher revenue to the firm easier to access. Those are all known. But getting demand first,\nbuilding that asset base and then launching it, we think is a much more effective strategy.\nYeah, and that's really interesting because I've talked with a handful of\nkind of white label ETF partners on here. They share a similar sentiment. Obviously, they want to\nbuild and get as many ETFs out there as they can. It's the core revenue of their business. But\nthe old adage, if you build it, they will come, is not true in the ETF space. So with the rise in ETFs\nand the rise of active, I mean, we've seen so many active listings this year. Do you see your\ntamp business evolving in some way to help these managers trade and execute strategies over time?\nI mean, if you have managers on your platform that want to, that have kind of met the threshold\nto launch. Is that something you can see your business evolving? Not evolving into, but as an\nancillary service? Yes, so UX today trades for an ETF. And so we offer that as a service.\nAnd then with the relationship that UX maintains with Thor as kind of a core manager,\nwe run into this all the time and Thor certainly owns its own series Trust, which was a big\ndecision that that firm made at the time. Just for, you know, reasons that everybody would probably\nknow. And so it's a situation where now we have the ability and infrastructure to do what you\nand I just talked about, which is this idea that you've got a great strategy or a suite of strategies.\nLet's identify the top one or two that are highly effective and cast a very wide net.\nSometimes they get way to some of these ETFs are so niche that, you know, they don't have\nmass appeal. And so once we identify one or two of those, we'll go and once we hit a 250,\n300 million dollar threshold, that starts to make sense to have a conversation with,\nokay, we have a series Trust. Do you have interest in launching an ETF and then we walk\non through kind of what that process, what the economics look like? Yeah, I mean, it makes a ton of\nsense, especially since you kind of have a pipeline to be able to do so. And so, do you see a world\nwhere you have, again, unique strategies on the platform that do different things and have different\nobjectives? Currently, advisors, I would assume have the ability to kind of blend these models together.\nDo you see a world where, and I'm a big believer of this, a rising tide, lifts all ships or boats,\nor whatever they want to call it? But do you see a world where you could kind of combine some of\nyour best-in-class managers together to create a single ETF utilizing, you know, them as different\nsub-advisors to create a really interesting, single solution that could help for, I don't know,\nsmaller accounts or help for, as you said earlier, kind of smaller or even non-qualified accounts\nthat maybe you get four or five different managers that have very unique strategies and create\none fund and they all kind of share in the growth and share in the revenue? So,\nthe short answer is yes. In fact, we are partnering with the University of Texas\nto do exactly what you just sort of laid out, which is we've got some very, very good and effective\nmanagers on our platform, but as I always say, no one's got them monopoly and best ideas.\nThere's no single strategy that's perfect that works all the time in all markets, and so we love\nthe idea of blending models, you know, no different than if you and I owned a, you know, since\nyour economic problems, let's say we were blessed and today we are now the hunters of the\ndemographics. We wouldn't go out and draft 11 core banks. You need a diverse, a five line up of\nplayers to be effective, and you have to think about where you allocate your draft capital,\nhow do you spend your salary, capital, and stuff? So, we're partnering with the University of\nTexas and they're quantitative finance department, really taking a page in some ways out at\nDFA's Playbook, where we're going to go very academic, but instead of a DFA sort of strategic\nbuy-and-hole bias towards, you know, value, all the ways that they manage money, it's going to be,\nhow can we blend in a single model, various managers that all complement one another, that over time,\nreally smooth out that return for the client. So, yes, that is something that we are doing,\nwe're actually launching our first kind of model of models under that category in the fourth order of 23,\nand then we're doing an advisor event in February at the University of Texas.\nWell, I mean, it's interesting, it makes sense, like if you have, if you have the audience and\nyou have the data and you have the manager, it makes sense, you know, to either utilize academics\nor in some ways quantitative or technology to be able to blend them together to get the best\noutcome, and I'm sure that that, you know, the allocation is to those kind of emulate kind of\nevolve over time, and so it could even be an active fund of funds, or an active manager of managers,\nright? But with that being said, kind of last question here, what do you think a model, what do you\nthink a model manager or an ETF provider needs to do in order to position themselves in the best possible\nposition to get their models utilized? I mean, there's a lot of people in the space, there's a lot of ETFs\nthat are launching, you know, what have you seen managers do to put themselves out there in a way that's\neffective and that gets some traction other than just obviously pure performance, but as you and I\nprobably both know, they're just investing based on pure performance is going to bite you eventually.\nSo, really, what do you think they're doing out there that separates them and allows them to\ngain scale? Well, I think it's important to understand first and foremost who you're competing against.\nI mean, you're not going to outspend or out hire the traditional names, right? The black rocks of\nthe world, the van guards of the world, the others of the world, there's the army of distribution.\nAnd so, with unlimited resources, so you have to sort of know that going in. So, I think you have to\nmake sure that A, you're doing something that you're selling a new problem and be very clear\nin what it is that you're specifically solving for. And I think in solving that, you need to,\nagain, cast a wide net. It's got to be something that has sort of mass appeal.\nWould be. And then I think once you, so you identify what you're solving, I think you need to very\nclearly articulate, you have a clear and concise message because you're not going to have a lot of\ntime to get it in front of folks. And then from there, I think you need to do what you say you're\ngoing to do. You have to consistently deliver of whatever that value proposition is because you're\nnot a known commodity. And so, I think if you find a space that needs improvements, you don't take\nyou guys as an example on the floor side, the low of all space has not been thought about for a\nlong time. And the ETFs that exist when you actually deconstruct them, I would argue they're not\nreally low of all. They're just a factor based ETF. So you guys have a very unique thought and approach\nto it. You do what you say you're going to do. And you clearly articulate it. And so that would be my\nadvice to these managers. Well Kyle, I always appreciate our time together. And thank you for joining me\nbut before I let you go, I'm not going to, I'm not going to hate on the Broncos again. But where can\npeople learn more about UX wealth partners and some of the services you provide? Our website is\nUXwp.com. Most information that you would need is there. And you can certainly reach out to me\nor anyone on the TV other website. We'd be happy to answer any questions we can.\nAgain, Kyle, thank you for joining me and hope to catch up with you soon.\nThanks, Brad.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}