{
  "id": "13744894",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for educational\nand entertainment purposes only.\nWelcome to Behind the Ticker.\nToday we have Paul Weissbrock.\nHe is from GTS.\nThey are a market maker for ETFs as well as individuals.\nStocks, they are front and center down on the New York Stock Exchange.\nIt was nice to talk to Paul today about the ETF industry as a whole.\nWhat they do as market makers as well as what it takes to really make an ETF launch successful\nand to go smoothly and to have longevity in this business.\nSo it is a wonderful conversation with Paul, so please enjoy this episode with Mr. Paul Weissbrock.\nHey Paul, welcome to the show.\nThanks for having me, Brad. I appreciate it.\nSo can you tell us a little bit about your background and how you have actually made your\nway to GTS?\nSure.\nI have been involved in the greater ETF ecosystem since the early 2000s.\nsomewhat by happenstance when I was at Thusquahanna.\nAt the time I had started there on the Nasdaq OTC market making desk and had an opportunity\nto go to the Philadelphia Stock Exchange and work on the specialist posts for spy and DIA\nthe diamonds and at that point in time this is called at early 2000s.\nIt was only a handful of ETFs, spreads were rather wide, volumes were certainly relatively low\ncompared to what we see today and there was just, I don't know that there was a vision that\nthere would be 3300 ETFs and mutual funds converting to ETFs and the progression that we've seen\nover the years and make your asset management firms going into the space.\nNo one was talking about any of that really.\nThese were just fairly straightforward market index beta funds that had traders in\ninterest, you know, the interest of hedge funds and certain, certain managers were using them.\nBut I think this was well pre ETF model ETF strategist ETF fund of funds.\nNone of that was really populated and not too many firms were doing it at the time.\nSo that's for the clock a bit, I then spent some time in an ETF issuer\npacer in 2008, 2009 time frame and obviously they're actually speak for themselves in terms of\nbelieve they have 25 billion in assets at this point in time, a decade later and a broad lineup\nof funds. So I saw the merits of being a startup, the challenges of being a startup and the ETF\nspace on the issuer side. But I have a good awareness of the distribution network and needs\nthat advisors have and institutions have and what they really look for when screening and adding\nETFs and their investment portfolios. So I joined GTS in 2019, post the acquisition of the market-making\ngroup and lead market-making commitments from Caner Fitzgerald and, you know, proud to be a\nmember of Reggie's team who has been in this space longer than I would say since the late 90s,\nthe team here has broad expertise in market-making, both on floor-based trading as well as upstairs\nelectronic trading and currently we oversee 341 U.S. listed ETFs as lead market-maker,\nadd another 40 secondary market-maker and we trade across the spectrum well over 3,200 of the\nU.S. listed ETFs. So we have, you know, very broad asset class expertise and ability.\nSo Paul, I always like to ask everybody before we jump into things. What do you like to do when you're\nnot, you know, what do you like to do outside the office? What are some of hobbies you get you have?\nSure. Hobbies, what one is certainly music? I enjoyed to play and listen to music and it\nseems to be easier than ever. You know, is it download albums and create playlists and store\nstore thousands of songs on something like YouTube music which used to be Google music?\nSo that's the technology fascinating to me, the ease of use and, you know, the sheer memory of\nhaving something that's just well-advanced compared to say like the iPod that we had\neveryone had to just several years ago and five hundred songs was something to to be fascinated about.\nNow it's more like you can have a hundred thousand songs full albums than what would have you on your\nphone. That's probably number one and number two, I would say basketball, swimming, and swimming\nfor the most part. Something both things that I ironically picked up, you know, well after high\nschool in college. So if you talk to or have been introduced to David Shohoff who runs MUSQ,\nthe music ETF? Yes, sir. We are lead market maker in MUSQ. I should add, we're also lead market maker\nin tune to UNE and those are the only two music industry ETFs that I'm aware of, both pretty\nnew to the landscape. You know, within the last six months, both launched and some of the points I\ntouched on earlier about YouTube music and the progression of elect, the electrotification,\nand if you will, of M23 isn't stuck, it's certainly core to what they're doing in their respective\nspots and running those ETFs. I actually saw him recently at the future proof conference in Huntington\nBeach just several weeks back. The conference had a music bent on it, obviously. There was\nlive music on the final day. Yeah, I had, um, I had him on the show actually a few episodes ago. He's\na really interesting guy, cool background. I also saw him down at future proof. I got you and I didn't\nrun into each other and I was at that concert at the final night. Right. Yeah, likewise. I mean,\nthe whole music live music aspect at that conference is obviously something unique and I think\nDavid bounced some ideas off of me in terms of, you know, what where the idea for the fun came from,\nwhere the idea for his company came from, but where he sees the future. And it's all all things\nthat I haven't even considered, which I found fascinating. So let's, let's talk about GTS itself.\nCan you explain to me, and to, you know, the advisors or somebody who's going to be coming to\nissue an ETF here? What exactly GTS does and, and as simple as a format as you possibly could,\nsure. So when an advisor is seeking to launch an ETF, if we, um, taking a account that they've\nalready selected an exchange New York Stock Exchange as XCO, GTS will provide the initial seed capital,\nbecause to fund a new ETF, you need AP slash market maker seed, that's some service we provide\nand as it's placing the first seed order so that the fun reaches the exchanges listing requirements,\nit can launch. There are some funds that are self-seated in the sense that they're a mutual\nfun conversion, with assets or an SMA and a contract transfer with assets. But that aside, for those\nnew ETFs that need to launch in a rather conversion, we provide the seed, and then we agreed to\nbelieve market maker on the respective exchange that they choose. And that means that we're acquired\nto post reasonable bid offer quotes during all market hours every day of the week. So 930 to\n4 o'clock, we have the responsibility to be posting continuous quotes. I, we can't, you know, take\na break and there's, there shouldn't be any gaps in time where we're not quoting or any gaps in\ntime where we're wide compared to where Nav is. So a barring, you know, system outages or street wide\nmarket data issues, you'll see our quotes bit ask for 340 some odd names right now. And I,\nideally hugging the NAV trying to provide liquidity for orders that come in electronically as well as\nfrom upstairs sources such as, you know, broker dealer desks or custodian desks when they're\ntransacting an ETF blocks for models for advisors. So what is it about GTS specifically that allows\nyou guys to win so much business? It seems like you, you know, as a, you know, what we use you guys\nas are direct, you know, for for trader now, but what is it about the GTS that you need to\nyou guys or something that you offer that allows you to get so much of this new issue business?\nIf I think it's the combination of perfect combination, if you will, of cutting-edge technology\nand speed and awareness of future needs on the technological front and that coupled with boots\non the ground experience with different types of clients that are trading or managing said ETFs.\nSo we, we understand the needs uniquely of a broker dealer block desk that's trading for thousands\nof advisors internally for models versus the needs of an RIA ETF strategist who runs an ETF model.\nFirst is say an institution that trades ETFs is just part of their strategy.\nPerhaps they're stocking bomb pickers by nature, but when they trade those ETFs because of the\nsheer size of the institutional plan, the blocks are large enough that they certainly don't want\nto create price impact. So I think that we have fairly broad expertise and that's what just\nbeing in the game for so long. It's speaking with different clients at what their specific needs are\nand are oftentimes in the consultative role in terms of examining of portfolios, liquidity,\nexamining which ETS they currently own or seek to buy and finding if there are anything\nin any esoteric details that we should bring to their awareness in terms of product nuances or product\npricing or differences from fund to fund. I think it's a combination of just being in the trading space,\nthe marketing making space, as well as many of us on this team have ETF wholesaling backgrounds.\nAnd once you can break down the barriers, what the various brokers for and look for\nin terms of what makes ETS successful and added to said platform, you can connect the\npoints of distribution to actionable trading liquidity. And obviously, volume and assets tend to\ndrive this excessive of ETFs. More so than performance I might add.\nYeah, and I definitely want to talk about that a little bit later. You mentioned their technology\nI was just there with you on the floor a couple weeks or last week, I guess it was.\nHow is technology change? You know, even in the last 10 or 15 years in terms of market\nmaking and trading and kind of where do you see it going even with the advent of AI and will that\nhave any impact on your business? I think that you'll continually see the need for auto quoting\ntechnology and automated technology, especially with a bevy of dozens of more ETS and different types of\nproducts coming to market. Even though there has been a wave of liquidation, some of the smaller\nfunds with lower asset bases have closed in 23. I think you'll see the net number after new ETF\nlaunches, which includes mutual fund conversions and SMA and contracts for it is still a positive.\nSo it's very realistic for me to say, you know, at some point in the next three years,\nthey're literally likely could be 5,000 ETFs, especially given a lot of the new ETFs will be existing\nstrategies that have converted from their current form into an ETF. So the longer the short of it is,\nit brings a higher level of sophistication of these products and strategies to market\nbecause some of the products that are launching are not their first in class, brand new concepts\nif you will to ETF world. You know, Ether products, for example this week, I saw an aluminum strategy\nfrom US commodity funds launching this week as well as the bevy of active managers that\nsimply have high asset totals in their existing strategy and the fund has the following,\nit has a retail investor base that will trade it. All of that needs to be supported by\nbetter technology. Technology that will continue to advance day over day, week over week,\nquarter over quarter. I think one example is the, you'd mentioned you alluded to this\nthan the New York Stock Exchange DMM model, which a fund company can now launch on the New York\nStock Exchange as opposed to the electronic ARCA. And there there are certainly merits to that.\nYou have a human overlay, if you will, on top of an auto quarter or now a rhythmic based\nquarter. And generally there's more market death, fighter spreads, the optics of the fund\ntend to be very positive, especially for newcomers that are looking at a new fund. And typically,\nyou know, the advisors have the same questions that you look at spread, volume, and then the\nnewness of the fund. Is it a month old or is it a five year morning star record? If the optics\nof the fund going into a trade or positive, I eat tight spread in some level of activity,\nin some level of market depth, chances of set advisor making a size of allocation or higher.\nSo I think we can speed that process of launching a fund and again, it's in success points,\n50 million, a hundred million a billion in an AUM. These are the conversations about mechanics,\noptics, and real-life scenarios, such as buying, you know, 10x, 20x, the average yearly volume\nand set product. So I think that the human, the human overlay, if you will, on top of what we're\ndoing, take the logically in our quoting systems, whether that be on NICI floor or ARCA,\nNASDAQ or CBO, because we were active on all of those venues, is certainly important. Understanding\nthat certain asset classes and certain products are unique from from fund to fund is probably\ncore to that. And each needs a special level of a tech chain, and a special level of detail\nto be successful. So staying on this DMM and floor trader touch and feel, I can attest to all\nthe positives that has brought us as a firm and in our product. So if you're a, I mean,\nreally any type of issue or specifically a smaller issue, or I can't recommend making that transition\nor launching that way from the start. But the question really is around, you know, two questions here.\nOne would be, everybody sees the floor traders, you know, can you just kind of give everybody,\nwhat are they doing all day? And what kind of unique skills does a floor trader need in order to do\ntheir job? Sure. On the floor, it is important to recognize that the specialist books consist of\nsingle listed equities that are on the New York Stock Exchange. Many of them well established\nS&P 500 companies where there's obviously quite a lot of demand to trade said names on a daily\nbasis, whether it's index related trading or just sheer shareholder retail interest, something like an\nIBM or a Disney or a JP Morgan or a Boeing. Obviously, all these stocks trade are noisy and there\nhas to be a specialist for a trader maintaining the books. The core of the specialist job is to always\nbe providing two side of quotes and liquidity and an orderly market, especially in times of news or market\nvolatility. And it's still required even though the order flow may be going against the specialist\nbook, they have to provide liquidity. It's not an issue of, you know, it's a specialist losing money\nor making money to the trading. Oftentimes, the only real bid in liquidity around is the floor specialist\ntrying to maintain that orderly market. So, in times of market stress, you know, where there's one\nway selling or one way buying for that example, for example, purposes. Specialists is the first stop\nin terms of quoting and keeping orders that are coming into the marketplace trading at reasonable\nlevels. And also matching buyers and sellers weren't necessary. They have a, they have a\nacute awareness of which firms may be active and that's certain price limit levels. And in certain\ncases may be able to match buyer seller, as well as take down positions for for the sake of stability\nliquidity within our own book. So let's pivot to kind of launching an ETF. And from your perspective,\nyou know, I'd like to take a little look behind the scenes when you're getting ready to take on a new\nissue to market, you know, what has to be done before trade day, then what has to be done kind of\non the day of launch? Sure. Before the launch itself, before the first day of trading,\nwe would highly recommend any clients that the issuers in touch with and their expectation to be\nactive in the fund in early days of trading. Simply just to check in with their custodians,\nwhether it be a Schwabber fidelity or an LPL or Raymond James, just to make sure that the ticker\nand the new Q-sip is available for trading. Sometimes these things aren't set up until post launch,\nsimply because it's a function of advisor demand or not. But it certainly pays to make these calls\nand figure out the landscape before launch so that there's not a mad scramble or no loss business\nfor no good reason other than, you know, RIA tried to place order in new ticker, but it was rejected\nbecause it wasn't asked instead of adding to the master database at firm level. That does happen.\nThat's unfortunate because I feel like the average GTF issue or probably doesn't know what's happening\nand sometimes it becomes a sheer function of numbers. There's just dozens of new launch\nis 3300 and more to come ETFs and the workload just can't be managed day-to-day without some\nhuman awareness and interaction. So I think one of the most important things to do is just make\nsure that your points of distribution where you plan on selling the fund that those gateways are\nopen and sometimes it's simply just adding a simple and adding a Q-sip to some master database\nand having it in there. I think a second point would be simply having a capital market\nsteam internally if not outsourcing that to a trading sub-advisor is an important role,\nit's worthy investment. It leads to successful launches but not just launches themselves but day-to-day\nweek-week efficiency. So having a team internally or one that you hire and there's obviously several\nthird parties that are very competent at this. They can watch for anomalous volume in the ETF\nif spreads which tend to be pretty consistent ever move away. They can quickly ping the lead market\nmaker and just ask a quick question or find out if there's a basket anomaly or perhaps some\nnames in the basket have news or are halted or something like that. At least get to the bottom of\na quickly and figure out why is the spread outside of normal parameters. If that's handled within\nseconds as opposed to hours or days by said ETF issuer, you're simply just running a better product.\nYou're running a more efficient product. You'll have less advisor questions and inquiries\nand just a tighter process overall. I think all that just leaves the better sales. It's simply\ngreat leads to a mature result with, we have tight spreads, we have acute awareness of our products,\nhow they trade minutes a minute, day-to-day and it could become cumbersome to add funds\nover time especially if they're different asset classes and they have different trading characteristics.\nIf you don't have like an internal way of monitoring it all. So growth is obviously a good thing\nscale is a good thing. Adding new funds all the time is a good thing. At some point that\nday-to-day labor may outstrip your current backbone of support. So we definitely see those that are\nsuccessful. Like I said, either investing in their own capital market steam or subbing it out.\nBut I think the notion of, well, we have, you know, advisor interest in new ETF. So we have assets.\nWe think these will be successful if we distribute them. That's all great. But I think there has to\nbe a plan before day one of if any of the above take place. How do we support growth? How do we\nsupport incoming calls? How do we support market maker questions? How do we support anomalous trading?\nDo we have a plan? If all of those boxes are checked, I think they're all the fastest\nsuccess. Yeah, we've talked about that a lot internally about making sure we're institutionalizing\nthe business and having all those boxes checked because as we kind of get down the line and I want\nto talk about scaling an ETF company. But it's important to have all those boxes checked ahead of\ntime and so you're not chasing yourself later. You know, when we launched early, you know, we weren't\naware of kind of the issues that can happen in the first 15 and last 15 minutes of trading and\nkind of those auction times as well as how certain things can go wrong in those periods and\nyou know, we had to learn fast and learn quickly and make adjustments. So you're right. I mean,\nhaving all those boxes checked on day one is extremely important. I like the term that you use\ntheir bread. It is institutionalizing, you know, the business because I think that's what it becomes.\nIn terms of whether it's a firm that's known for one or two neat funds, but they're successful\nand they raise assets or are growing line up of, you know, broadly diversified funds to extend\na long short commodity, long short equity may be some dividend value growth type equity ETFs.\nObviously, there's a lot of broad based companies that kind of have something for every season\nand for the full tactical or strategic manager. I think the issue is, you know, if we have\ndozens of funds, we have hundreds of funds. How do we support internally because on any given day,\nsomething anomalous could happen to one or more of them, largely because, you know, the ETF business,\nit's not necessarily easy to track, you know, where volume is coming from, right? You know,\nit's kind of a, you know, if it's model based action and you understand that your funds are\nbeing added or subtracted to models, there's some awareness of that in some way to track it,\nbut even that is done quietly and without footprints in most cases and it's usually\nenough to the fact observation. And then the thing comes down to, you know, your shareholders,\nwhich could be its institutions, retail advisors, could be retail investors, self-directed.\nThey're not necessarily emailing the sponsor, calling the sponsor and saying, hey, tomorrow,\nI'm going to allocate $5 million to XYZ, so get ready and, you know, make sure that our orders\nare executed correctly. I would say a small percentage actually give the heads up to the ETF\nsponsor or the trading firm, market maker, that's involved in the fund. The more that do,\nthey, they get a great outcome because all eyes and all attention is on to what they wish to do.\nBut mystery volume, as I call it, it's hard to address when you don't know where it's coming from.\nAnd oftentimes it catches people flat-footed, so we're all, I would say all of the time we're\ntrying to model better and prepare ourselves better for scenarios where average daily volume\nand a certain fund that's usually quite inactive will jump considerably. And they're trying\nto track where that's coming from, you know, usually it's model driven.\nSo we talked a little bit about launches, you know, just from your perspective, what sort of trends\nare you seeing in ETF launches that are coming to market? I've seen a lot of kind of niche products,\nalso a lot of active products. What are you seeing on your side of the desk actually taking\nthese products to market where things are going? Sure. Yeah, a couple of themes go about it.\nMe, some of them may be very obvious, but as the crypto regulation warms up from a regulatory\nstandpoint to what if you were looking to do, there's a long line of ETF sponsors that are\njumping into the crypto futures and ultimately looking to run spot crypto ETFs. That seems like\nan obvious one based on the progression in the last couple weeks and seeing the five lanes as well\nas long as it's from firms like Pro Shares and Grayscale and Van Eck at Valkyrie. It's so on.\nThat's number one. I think number two is continue growth in the buffered to find outcome space.\nIt took several years for the first billion dollar buffer, but it seems like once that happened,\nnot only are there more players in that space, but there's hundreds of fountains from various\nproviders, innovator first trust, payster, true mark, come to mind, in terms of\nout audience, all have the fine buffer outcome products, BlackRock has them now too. So there's new\nentrance, there's existing players that have been around for five years now in the space and\nthe assets are exploding. I think why because the retail base of advisors and institutions that\nuse these have confidence now the products are traded and structured and they they they suit and\nneed they suit and need within portfolios. So I think you'll continue to see options based or options\noverlay ETFs. Whether they're defined outcome buffers or something like AAPI, JP from JP Morgan,\nthere's no shortage of funds in that space now too. All within the last two or three years.\nSo it's gone from like a fund category of relative obscurity to something that has billions\nand assets and growing as well as new filing. Single stock ETFs long short with leverage continue to\nI wouldn't say hit or miss necessarily but there's some that are immediately successful given good\ntiming and the popularity of the single stock, the media Tesla come from mind and then there's other\nstock single stock ETFs which are quite small but the providers I believe think that the the\nsingle stock name will be in play at some point in the future so they want shelf space there.\nAgain, no shortage of new funds coming to market in that category. Literally,\nyou know, dozens, dozens if not in the pipeline that have launched already.\nSo I'm going to ask you a loaded question. It's a simple question but what do\nissuers have to do to survive in this business and scale? I like the question first of all\nwas I think we do a lot of thinking about this. The number one thing that comes to mind\nis differentiating between soft historical assets if you will and actual commitments to doing\nbusiness in the first 30 days after an ETF launch and that's that's the primary driver. I feel like\nif an issue were going to come to market with high confidence they can raise 50 million and 30 days\nsome of that may be internal via their RIA or other SMA strategies that they manage and convincing\nsaid investors that this new ETF is a better fit for our business and for you let's transition into it.\nSo that that comfort level needs to be established quickly and it needs to lead to action quickly.\nSecond of all, everyone has some level of pre-logged marketing which is obviously within compliance\nof their new ETF strategy and advisors will either be committed or will wait and see.\nIf it's wait and see and they want to wait until said ETF has a hundred million assets\nas a million shares a day on average daily volume, that becomes a bit of a dice roll for the\nissuers in terms of they're waiting for someone else to buy first and it is a chicken in the\nExynario which could lead to managing a fund with low assets month over month quarter or over quarter\nwaiting for others to appear and buy it and you have you know basically a bunch of retail\nadvisors that are waiting for activity to happen outside of them before they are comfortable.\nSo I think yeah that's my answer would be establishing a level of confidence on how quickly you\ncan get the 50 million because it's important to get to that scale and pay fixed costs that are\nyou know they're essential to running the fund officially and once you get to those levels\n50 million and a hundred million you can then call the retail platforms more confidence and\na higher success rate and get them to agree to allow the ETF to be distributed on said platform\nand there's no shortage of model driven and ETF driven advisors out there sometimes becomes an issue\nthere's 3000 plus ETFs and they have limited bandwidth so they need some help from a home office level\nthe screen if you will or filter what they can buy and what they can so getting to the you know\ngetting to the point of success is quickly getting on to those platforms not three to five years\nfor now but ideally inside of a year. Right yeah no I I couldn't agree more and I guess just\none one more last question with regards to this is like okay let's say you you do all those things right\nyou you have a successful launch you get to 50 a hundred million you have you know some pretty good\nsolid committed clients so you're covering your overhead. Is it just is it time and patience and\nmarketing and waiting for the right environment in order to maybe hit that home run or really\nstart to scale or other certain things issuers need to be doing on a daily and weekly basis to continue\nto kind of push the fund as time goes on. Yeah I like all the points that you mentioned in terms\nof being essential I would recommend all those and I would add to it if if one of the the points\nthat you made just simply doesn't line up with the current market I eat perhaps it's just a\nthematic strategy that's performing poorly in the short term you know it's tough to sell something\nthat has bad relative owner performance at that moment in time. I think instead of while we're\njust going to wait until performance turns around or we're going to wait and see what happens and just\nyou know the phones are quiet until then that's not a great strategy because it's the you know it's\nwaiting and hoping and the clock is running because obviously there are fixed fixed expenses\ninvolved that running in ETF. I think the the better strategy in that scenario where you're simply\njust selling until being as out of favor hasn't been embraced yet and that's a common problem\nespecially with all the new ETFs out there is to just look at what your best peers or competitors\nare doing assess what's the collective AUM in my peer group you know is it $10 billion or is it relatively\nsmall because this is a new segment like a music segment and is it several million dollars what\nare my competitors doing perhaps what I'm not that I'm not doing what platforms are they calling\nor what kind of marketing are they doing which conferences are they doing how what's their\nmessage of like role to the arts has anything changed you know in the last six months to a year\nin the way they approach things have they had that inflows or outflows. I think that you can\ncontrol to some extent the flows that having your own fun lineup but it's but it's ultra ultra\nimportant to just look at who you think your closest peers are and there may not be an Apple\nApple's comparison in many cases but that is probably the best source of intel because eventually\nyou can figure out how they're being successful or perhaps you might identify a misstep they've\nhad and capitalize on that so I think just having an awareness of who you're selling it\nspecifically you know is it an isn't each segment like I said the music industry or are we competing\nin like an absolute return category or something that's well populated like dividend growth equity\nwhere there's no shortage of offerings there and to stand out it takes a lot obviously so I think\nyou can kind of do that you know day to day week to week quarter to quarter it just examine that\nflows in your category and these these are your peers and make some kind of assessment I want\nmaybe working or what's not working well Paul I really really appreciate your time I thank you\nyou know for coming on and talking with us and before I let you go where can people learn more about\nyou know GTS and maybe connect with you of course I would recommend our website which is just\nwww.gtsx.com that's golf tangocierxra.com that'll give a good overview of the firm our activities\non your stock exchange our activities in ETF market making and a genesis of the firm and everything\noverall and if anyone does have interest I'd sent out an ETF weekly note every Monday trying to\nkeep up with all the progression of this industry as it's moving very quickly and I'm sure that\nyou can probably get in touch with me via Brad about that weekly note. Well Paul again thank you very\nmuch I hope to see you out soon here's conference seasons going to be getting kicked off here is\nthe winter months are slowly approaching. Thanks very much for the opportunity Brad I always\nenjoy speaking with you and look forward to the next time. All right well take care we'll see you soon\nbye. Great thank you",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}