{
  "id": "13775950",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nToday we have Will Rind, he's the founder and CEO of Granite Shares.\nHe is a very long and tenured career in the ETF business spanning over 20 years.\nHe's worked on products like GLD, and went out and launched his own firm Granite Shares in 2017.\nThey have grown quite significantly, and today we're going to talk about their single stock\nlevered ETF products with names like Tesla, Coinbase, and the video distribution and asset\ngrowth on these products has been very hot, so I think this conversation is very timely\nand also very interesting to get Will's perspective on the ETF space as a whole.\nSo without further ado, please welcome Mr. Will Rind.\nWill, welcome to the show.\nThank you so much, Brass.\nThank you for having me on, pleasure.\nYeah, absolutely.\nSo before we get started, can you share with everybody a little bit about your background\nand how you eventually ended up starting Granite Shares?\nYeah, sure.\nI have been doing this for a long time, so over 20 years now, that might kind of\nhistory with ETFs, because all the way back to the beginning, so I'm originally from\nthe UK, and was involved at the time in the early 2000s with ICNs or Buckwheat\ninvestors, which everybody knows now is BlackRock.\nWe were launching the first ETFs in Europe, and I really just stayed with the product\nthroughout my career, so after I share as I did a startup, I became very successful,\nalthough I ultimately was sold to wisdom and trading, and then after that was the CEO of the\nWorld Gold County, so all this GLD and CF, which is the largest gold and commodity fund\nin the world and ship the state's street, and then ultimately left that to set up Granite Shares\nin 2016, so I've been doing this since 2016, and building this ETF business.\nSo I always like to ask, everybody before we kind of jump into it, when you're not working,\nwhat are some of the hobbies or some of the things that you enjoy doing outside the office?\nFor me, I've got three kids, they're still relatively young, so a lot of what I do outside\nrevolves around them, so let's call it finally time. I decided about enjoying lots of things,\nlike I've always enjoyed trampoline, get to work, fortunately, and it was,\nfrom time to always like trampoline, I like food, I go into restaurants, etc, and then in some\ntime, less than the winter time, I like boating and activities come on the water.\nThat's great, yeah, I also have a handful of little ones, and it seems like\nas soon as five or six o'clock rolls around, and then all day Saturday and Sunday, it's just\ntheir world, which is fine with me, it's great fun.\nExactly, there's no love room for that much else, but we find the time.\nYeah, we do, so let's talk about Granite Shares business as a whole. You have a unique product lineup,\nwe're going to talk more specifically about kind of the single stock issues a little bit later,\nbut what types of products did you really set out to offer, and kind of how is that business\nevolved over time? Yeah, so we think about ourselves as really being on high conviction ETFs,\nfor the high conviction investment, and the reason why I say that is because we all know that\nand it's actually pretty sharp, so that worked and there's a huge amount of selection,\nhuge amount of choice in ETF industry, but a lot of it is generic product, priced,\nwe are Walmart's style, highlight selling, extraordinarily cheap, and there's nothing wrong with that,\nit's just that those products tend to be, obviously, generic benchmarks of which they're being done,\nyou know, many, many times over, so if you're starting companies as a space,\nreally, you can't do something long those lines, you have to offer signs different to people,\nyou have to offer a solution to the problem that exists and or capture a build,\na new segment of the market, and that's what we're trying to do, so high conviction ETFs\nto ask can be anything from commodity plays to income plays to the magic ETFs to leverage,\nbut as long as it sort of captures that's eye-guised of conviction plays,\nthey fit with an unstable and unstable. Interesting, so let's talk about kind of the single-stock\nlevered ETFs because that you've seen tremendous growth there over the last, you know, since they've\nbeen released, I was just curious as I was, you know, kind of reviewing the lineup\nis when you set out to make these, you know, did you have any issues getting these approved\nor having kind of the levered and also inverse levered index products already out there that\nmake the path a little bit easier? So I think I would start by saying it's always difficult to\nget things approved when you're doing something for the first time, so you need somebody to\nkind of set the path or someone to build the right away, you know, before you can then land,\nso in our case, that was us in terms of building that out now. We had a little bit of\na little bit of help or a little bit of experience in the fact that we've been doing this in\nEurope for a few years, so we started this business in Europe, it's a very popular business there,\nwe operate in all major markets in Europe, so we did have experience doing it, always wanted to\nbring it here to the US, but yes, clearly we did go through a process to get there, but ultimately\nwe were able to, you know, to bring this product to market more excited about it. So when you\nset out to make the product and bring it to market, how did you go about kind of picking the\nnames that you picked, right? You've definitely have picked some of the more hot stocks, I would say,\nso is there any rhyme or reason? I'm sure there is, but, you know, how do you go about picking\nwhat you want to create product for specifically in this single stock leverage space? It is,\nbut I'd be honest with you, Brad, it's definitely more of enough for the science,\nand we're not going to get it right all the time, but as I mentioned, we had some experience in\nEurope, so we were buying the stock stock for European investors. Now that doesn't\nautomatically translate clearly to the US, but hopefully the kind of high conviction investor that\nwe're looking for is a sort of, I would say, it's a global crowd, and there's a lot of similarities,\nso the stock market has loads of good one whereby I think it's just a stock that has universal\ntheory, almost whatever country you're hearing, you know, the US, all the major companies in\nEurope, it consistently shows up, let's say number one on number two stocks held in\neverything that's helpful for theirs, so you have ones like that, which are maybe a bit of an outline,\nbecause they're so popular, but we try also to marry popularity of stocks versus solving the\nproblem or providing market assets, so for example, Alibaba, when you have an unstable,\nthe reason for that is because it's dual purpose of it provides access to Chinese tech,\nChinese markets more broadly, but yet it's also a pop of the stock that people like to trade\nto give exposure to, just leverage for that company. But we've launched Coinbase, we have a\nlevered Coinbase ETF, there was no leverage crypto play in the market at that time, so by doing a\nlevered ETF on Coinbase, that was the only way that people could get leverage on crypto in\nan ETF form, so again, it was a, it was a, it was a proxy for crypto, proxy for Bitcoin,\nbut providing leverage when no solution existed, you're prior to that, and then, you know,\nin India, which has been our biggest one this year, and obviously it provides leverage exposure to\na video, but it caught the whole airline box, and really the stock, or can the stock really high this year,\nso that's been an amazing success story. Yeah, I'd say, and I want to talk specifically about that\nhere in one second, and you, you know, as well as I do that, you know, kind of hot stocks or highly\nheld stocks tend to kind of go through rotations over periods of time. You know, you have kind of a\nradar in house that kind of looking for maybe what's next, or as you said, it's kind of an art,\nand you'll kind of know when you know that you need to maybe add, you know, one or two names to your\nstable. Yeah, I think I think for us, it's less about the, the stocks themselves, because I think\nwe have a very good idea of what might be popular. The boring answer to the question is that\nit's really more about managing costs from a business perspective, because running these funds\nis very expensive, so launching a fund and then managing it, or maintaining it is very expensive,\nand so we've just got to be careful that, you know, it's not like a fast food front-shies, whereby\nwe just over-expand, and you see, you have a small town of America, and then a floppy few at\nits times because you can't support a growth. So we don't even want to do them, and we've got to\nbe thoughtful about, you know, we grow, I think we know, we know where we want to go, it's just a\nquestion, you know, jigging it in a sustainable way. Well, it's actually going to ask us later,\nso we might as well talk about it now. You have grown quite fast, I think first products were out\nin 2017. If I read the website correctly, you know, you've got about around 1.7\nbillion of AUM on product, so as you've grown and keeping that in mind, you know, what changes have\nyou had to make to the business in order to kind of handle that scale in that growth?\nSo I think the way that we've been able to adapt is clearly number one as people,\nso, you know, outside of anything that you do, it's, you know, kind of being people to support\nthe growth, to support the different steering functions and things that you, when lucky in\nthe sense that we build our technology, kind of from the day one and made a spine that says this,\nwe'll give a chief technology office for an previous company, so he came for the music team and\ndid a couple of us with that work. I see for the company building our technology in front of me,\nand so we have, like, it's been, it's probably very overused, but it's worried, but it is true\nand it's said that, you know, we use technology to enable everything that we do and we can\nmake the core access from from day one, so unfortunately, you know, that's why we've had some\nhelp to hugely in terms of being able to scale and that's enough, so that we can launch and then\nwe can launch, you know. Yeah, so as far as like as far as scaling a UM as well, are you,\nyou know, have you over time kind of scaled yourself a sales force or boots on the ground or you\nletting kind of the product do the work for itself and making sure that, you know, people have\neyeballs on it and awareness that it's out there. For this, this time of offering,\nwe're definitely leaning more into marketing, then we do into sort of what in my\ncourt traditional sales. So again, when we think about our audience, our audience is a global\ncommunity of high conviction investors. Those investors are typically mobile, you know, they have\naccess to online trading accounts through near brokers, etc. And, you know, those guys know\nwho what they want to trade is a question of us making our product accessible to them. And so\nit's finding that sort of digital connection for us, it's an marketing first approach. So we spend\na lot of time on PR, which is probably the most old school, you know, thing that we're doing,\nbut we're still very effective in everything else is all digital type techniques to try, you know,\nget a product in front of the right people. Sure. I guess staying here further, you know,\nyou're saying, you know, high conviction investors, I would assume also these products are heavily\nused by day traders as well. Is there any, is there any utilization or are you finding any\nutilization inside the, you know, registered investment advisory community, are they using these\nsomehow to maybe support a model portfolio or try to, in, in the video's case, or I guess in,\nand most of these cases these stocks have done pretty well is try to supplement return or generate\nalpha somehow, or is it pretty much sticking to that high conviction or, you know, trading community.\nI think on the advice of space, it's a bit more tricky because the vast majority of\nmoney that's managed a day is typically done in a some kind of managed portfolio and those\nmore often than not are really kind of set, you know, my reports are quarterly lately,\nso it's been largely defined for the 60, 40 and so those kind of model portfolios are long term,\nyou know, set and forget type money management offerings, where you do get application is\nclearly anybody that's still trying to add value through alpha, that's really the key. So you get\na portfolio manager, a stock broker, advisor, whatever you want to call them, that still believes\nthat their job is to add alpha to their clients portfolio, meaning then the portfolio manager,\nthey're the one that is going to go in trade and so that could be somebody who's a, you know,\nfollow or build their business around technical analysis, so more trading oriented,\nsomebody that, you know, perhaps has their experience based and start picking all these things,\nbut the key is it's somebody who believes that the job is of investment advice or is to add\nto, to be the, so to speak, those people there's application, but they're definitely,\nsay they're less of those people and then they're in terms of the more long term.\nOf course. So let's specifically talk about NVDL, which is one and a half times in video.\nSo can you tell, can we walk a little bit through the product construction and how we're getting\nthe exposure and also getting the leverage? Sure. So in the, in the simplest form, it's an ETF,\njust like any other and all leverage ETFs work the same. So they're typically providing exposure\nvia swaps, which is a derivative contract that you procure from an investment bank and investment\nfor those providing with the leverage and via this stock contract to the funds. So\ncollateral, you have margin and you have a derivative contract that gives you that exposure.\nAnd all these funds rebalance at the end of each day. That's why we target the stated leverage\nfactor we call it, but that's why you'll see there's a amount of times in the case of\na lot of funds is different. So you mentioned some of the funds are all one and a half times.\nIs there any sort of, behind the scenes, talk about why something might be 1.25, 1.5 or maybe 1.75?\nIs that have to do with the underlying volatility of the stock itself or, you know,\nhow does, what drives that decision? Exactly. There's a, there's an SEC's derivatives rule,\nwhich we and any other ETF has to abide by. The's using derivatives, of course.\nAnd what essentially does is you limit your leverage based upon the volatility of the\nunderlying stock. So very simplistically, the more volatility under the, the underlying stock,\nthe less leverage you can deploy it, the less volatile the underlying stock, the more\nleverage you're able to deploy. So back to NVDL, the ETF is up quite significantly, you know,\nyear to date. I don't want to give an exact number for compliance who is definitely going to\nlisten to this. So hello to your compliance department. So as far as that performance,\ndo, have flows followed performance, where did you see flows a little bit early on because of\nthe uniqueness of what the product was offering? I think a bit of both. I mean, it's, it's always\nchallenging because, you know, one of the most frustrating things about being a ETF issuer is we\nnever see the actual order. In other words, the client never buys from us directly. What we see is\nthe net effect of all of the buys, all of the sales in the market on a given day and the residual\ncomes to us in the formula in order to create more shares or in order to cancel or redeem\nshares. So it's difficult, but I think it has to be a combination of the both. I mean,\nI looked yesterday, an NVDL was the best performing TF of the year so far, so it's done incredibly\nwell. And whenever you get something like that, when you top the charts, you're going to get people\nwho are buying in because they see the performance, but we've had people buying in, you know,\nsince the beginning of the year that just loved the AI story and believed in the company and\nI would just, I don't want to make the assumption, but I would assume\nwhen the market goes through volatility, just like anything really, that you're seeing flows maybe quicker\nthan the average issuer to the other side, right? So you're getting more redemption when\nthere is volatility there because of the leverage. I mean, is that, is that right frame of thinking?\nYeah, the way that the word we use internally is we say the platform is alive,\nbeing that just on a daily basis, we see terms of activity, we create your device of sales,\nevery day, you know, orders coming through it can be in the same product on an NVDL, you can get\nsimultaneously, you know, a few orders to create shares and a few orders to redeem shares.\nIt's really quite unique and something that we have to see, and it's certainly, you know,\nmore dare to say it traditionally, yes. Sure. So just had a curiosity, have you thought at all about\nmaking single stock levering versus it all? Yes, we have, we have some, they're kind of relatively\nnew fixture, and again, it was, we started with all long, not just because the market naturally\nskews long, and you know, with our book again in Europe, the majority of that's long,\nso you might have 20 to 30 percent of that short, not only given day, but it's never 50, 50.\nSo we started with long here and we've gradually introduced some leverage shorts as well.\nSo we have Tesla, we have the highest or the most leverage short testlets of TSDD.\nAlso on a video, we have 1.5 times short on a bigger NVDL as well, so we're going to have some\nshorts, we have a short NVDL and that one is not like, it's just an inverse AMT, and that's not\nagain because the volatility thing we're talking about. Yeah, we were starting to introduce more\nshorts. So out of curiosity, I don't follow the European markets as much I'd like to get your\nkind of observation, as we both know, the ETF issuance and product development has absolutely\nexploded here in the U.S. Is that, is there similar product creations in, is that business,\nas healthy as it is here in the United States? It's definitely healthy. It's not as healthy,\nbecause America just has some fundamental advantages, which Europe will never be able to\novercome unless and unless or certainly not my lifetime probably, but, you know, the U.S. has an amazing\nadvantage before you start talking about any intricacies, because you have one currency, you have one\nexchange, you have one regulator, and you have one language. And there's all, might seem pretty straightforward\nto people, but that makes a massive difference for liquidity, for scalability, for consistency,\ncontinuity versus in Europe, you have multiple languages, multiple exchanges, multiple regulators,\nand all you're doing is sort of fragmenting your liquidity pool, fragmenting your scale,\nbecause you have to take, you know, your product offering to each market, and sort of do a\nlaunch and stop business in particular. So, anyway, think of Europe, we think of bonds,\nentity, but, is obviously when it comes to, to the, I mean, I saw a flow chart of far market\nversus the European market, and it is about as complex as it can get over there, comparison.\nI mean, don't get me wrong, people love UTS, it's just, there are just, there are just some\nfundamental challenges, which mean that the U.S. has accelerated, you know, far faster than anything\nin Europe, and, and, you know, some people say that Europe's like five years behind whether you\nexist, and it's probably one way or another. Yeah. So, well, you have, you know, tremendous amount\nof experience in the space you've worked with some of the largest ETFs in the world.\nWhat advice would you have for people who are either thinking about issuing today for newly\nissued as their kind of entering the space in order, what should they be thinking about and doing in\norder to make sure that they can run a successful business, this is kind of a loaded question,\nbut run a successful business or, or get the business to scale. The big change that's happened\nin the last 20 years is that 20 years ago, the barrier to entering into ETFs, really,\naccepts that to six, four as much as long. Now days, it's flipped. So, the barrier to entry in ETFs\nhas never been as low as it is today. I mean, if you want to launch an ETF, you can do that.\nNo, I don't want to set up a growing solution. Joe, the company is accepted.\nAnd you can go up to two of the whole three of the ETFs on your path, all you have to do is\nget it right. Yeah, it wouldn't, right. Yeah. So, the barrier to entry is never been lower.\nThe barrier to success, however, has never been higher. And that's because the product proliferation,\nthe proliferation of product means that it's just harder and harder to get eyeballs on and\nlaunch harder for products to bring three, harder for people to get shelf space on,\nwhich distributors, et cetera, distributors, it just becomes much more different,\nand less you really don't necessarily know what you're doing. So, that's really the fundamental\nthing to think about, because there is, anybody can launch, but it's really hard to succeed unless\nyou have a very concrete game plan, just because of what the market is and how it's sort of\nintuitive. Yeah, I couldn't, I couldn't agree more, but again, will I really, really appreciate your\ntime. This has been extremely interesting. Where can people learn more about you and where can\npeople learn more about granite shares and your full suite of products? Next place is a website,\nwhich is granite shares.com. We've got a good amount of information there, really on all the products\neverything that we do. I am on Twitter, we were on LinkedIn, but the best place as far as learning\nmore about the business would be on the website. And then obviously there's a lot of just a\ncontact customer, really, which people can do so freely. Well, again, well, thank you so much.\nI appreciate your time and look forward to speaking with you again in the future. Right, thank you so much,",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}