{
  "id": "13816952",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nToday we have Katie Stockton.\nShe is the founder of Fairlead Strategies.\nShe is also the portfolio manager behind TACK, the tactical sector rotation ETF.\nI was very excited to talk to Katie.\nHer and I have a lot of the same beliefs and ideas around investing.\nShe is also a veteran when it comes to technical analysis.\nAnd she is also a CNBC contributor.\nI think you will find the strategy behind the rules-based strategy behind TACK,\nquite compelling, and so I hope you enjoy this conversation with Katie Stockton.\nKatie, welcome to the show.\nThanks so much Brad, good to be with you.\nSo before we get started, I always like to hear about your background\nand what eventually led you to start Fairlead.\nWell, it is actually Fairlead, and it is funny because Fairlead is not a really\nknown thing, but it is a part on a boat.\nAnd what it is, it is essentially, it looks a bit like a cleat,\nbut it is designed to allow the lines to run free and not get tangled up.\nSo there is a nautical reference and there is so much subtle.\nSo that is how we came about Fairlead strategies,\nand obviously the goal of hinting at technical analysis as a discipline\nas giving folks an edge in investing.\nAnd technical analysis has always been my discipline.\nI have used it since I was in college, and I wasn't an investor at a young age.\nNor was I inspired by my parents to get into it.\nAnd but I was always interested in math.\nI ended up being a finance major.\nAnd in that major, we had the opportunity to have an internship,\nand it was the internship that set me on the path initially,\nto study in technical analysis as a discipline.\nAnd so I picked up an internship at an old pain webber office down in Richmond, Virginia.\nAnd one of the advisors had on his desk, a pile of papers with exes, and I was on it.\nAnd it turns out those were point and figure charts.\nSo I was really interested in what that was, because visually it is nothing like I had ever seen before.\nAnd it turned out it was from a local firm called Dorsey Wright in Associates.\nAnd Dorsey Wright, because they were local ended up hiring me as an intern.\nAnd I worked there part time for a couple of years during college.\nAnd so that really sort of set me on the path that I'm still on now with a lot of deviations, of course.\nI don't know if you've met Tom Dorsey, but he's pretty inspirational as a person.\nAnd really energetic. And just then for me at a young age,\nI knew pretty much then a narrow that I wanted to do technical analysis.\nAnd to be on that side of the business, sort of the markets, the public market side of things.\nAnd so I had this unique experience of being able to hand chart point figures\nfor a couple of years. And I found that it was a really great way to be close to the market.\nAnd indeed, that's what I first did straight out of college as well.\nIt believed it or not, my university had coursework in technical analysis too.\nAnd at the time was one of 12 universities that had that.\nSo it was really very fortunate. It was a graduate level.\nOf course that I audited as an undergraduate. And they brought in all the big technicians.\nSo Ralph Beck and poor. I mean, one example of that, you know, he, again, is another inspirational,\nsort of figure in my small world here. He stood in front of our class and\ntore the Wall Street Journal on half and said, you don't need this anymore.\nSo a little controversial for a finance major right with our, you know, sort of 101 investments\nclass and what have you. But I knew what I wanted to do. And, you know, there really weren't\njobs necessarily in technical analysis. And sometimes I would argue that there's not really that\nany that here now either. I think it's really hard to find a job as a technical analyst\nper se doing it full-time all day. But indeed, that's what we do. We, we focus at fairly\nstrategies on solely technical research. And we started fairly in 2018 or early,\nand before that, I really had, had spent most of my career on the cell side on Wall Street.\nI've most recently at BTIG, which is an investment bank in Manhattan. And started my career in\nSan Francisco. And always had sort of a technical bent to what I was doing. I did deviate.\nI was a sales assistant at DLJ for a while. When I moved back east, I grew up in Connecticut.\nI ended up picking up a job at Morgan Stanley on their technical strategy team, which is now\nno longer an existence. And that was really unique experience as well, because I got at this\nscope of, you know, what the, what the listeners were sort of consuming and hungry for. So in these\nroles on the cell side, I was able to get a perspective really from the clients as to what's most\nhelpful, which to me was no longer point in figure charts. I found as much as I appreciate them\nfor the analysis. They were really hard to go in front of a client who was not technically\ninclined with, because it really had to start from square one with your explanation. So I found that\nthe bar charts were a little bit more digestible, almost from a marketing perspective. And that\nbecame my discipline over the years. I worked under some great people. One person who really shaped\nmy methodology was my curly. I worked for him at E offering. This was the investment bank of E trade\nat the time, back in the dot com bubble. And we published technical analysis research on\ntechnology stocks and that was it. That's all we did. And those were fun times until they weren't.\nAnd that's when I ended up coming back east. So a couple of things that are, you know, really\ninteresting about that. It's funny. My first internship as well, I was actually at Morgan Stanley\nwas introduced to an advisor who built his whole practice off of Dorsey Wright point in figure charts.\nI remember having the same thought, like, what is this? And really diving in because prior to that,\nI was, you know, a novice technical trader in college and trying to kind of figure it out.\nI actually know my curly pretty well, actually. I just talked to him last week. So we know\nthe best. Yes, just a wonderful, you know, nice guy. As far as what you like to do outside of work,\nI always like to ask hobbies. You know, have any hobbies when you're not staring at staring at\nscreens and selling and selling research and ETF? You know, I have, I don't know if I'd call them\nhobbies, but things I want to do more of. We are, we are obviously really busy here,\njust being a small business. So that doesn't leave much time for it, especially with the kids\nin their schedules, which are arguably more demanding than mine some days. But I really enjoy being\nby the water saline. We'd be sometimes will erase sale votes and Connecticut here. I enjoyed\npainting when I had more time for it and running when I had more time for it. But, you know,\nwe'll get back to it. I love traveling when I can. I definitely put a priority on that whenever I\ncan get away and explore new places, that's always fun for me. But, you know, retirement,\nprobably will never happen, but I'll try to do more and more of that stuff, roll it in when I get more\ntime. Yeah, it's funny. This is episode, I don't know, 2021 or 2022, and you're the second sailor\nwe've had on the show. So I was, when you explained what fair led met, a fair lead, sorry,\nthen I kind of had an inclination. You might have been a voter as well. So again, before we jump\ninto it, I did see the video of you getting the opportunity to ring the bell at the New York Stock\nExchange. Can you walk me through that day a little bit? And what were the nerves like? You know,\nit, I watched it and it just seemed like, you know, five seconds after it was pure joy. It seemed\nlike something really exciting about doing it. It was a truly sort of the pinnacle I feel like\nof my career to be honest. I've been doing this, you know, in some capacity since the mid 90s.\nAnd I don't think in the earlier stages of my career, I could have ever imagined having that\nopportunity. So to me, it was really just amazing. I was so grateful for it. And the coolest part\nwas having, you know, my co-workers, my friends, my family there, my kids there,\npinned to celebrate with us and to celebrate the launch of our ETF, which again isn't necessarily\nsomething I intended on, but that became, you know, a byproduct of what we were already doing.\nSo it was really just exciting. And I don't know if it would be nerves that I'd say,\nbut it certainly just that joy, like you said, just pure joy and looking around the room and\nseeing so many familiar faces, it was really exciting to be. And you've had a great experience with\nthe NYSE. I had been down there many, many times with CNBC broadcasting, but never in that capacity.\nAll right. So that's fun and exciting and cool. And, you know, I hope one day I have an opportunity\nto do the same, but again, very cool opportunity. So you mentioned the ETF maybe wasn't\nsomething that you intended to do. So can you talk about all the services you guys offered and then\nkind of what led you to eventually launch the product? Right. So when we launched fairly,\nit was to be an independent research provider. I think that's the best description of the firm.\nAnd technical analysis solely, although we believe it's really a complement to other disciplines,\nnot a standalone. And that just happens to be our expertise. So it's where we focus, but we\nwholly believe in macro research, fundamental research, political inputs, as drivers of the trends\nthat we're trying to understand. And we essentially did what we always did on the cell side to\npublishing very good quality research. I'd only pervade to institutional clients in the past.\nAnd this gave me the opportunity, which was one of the reasons I started fairly to reach a broader\naudience. So, you know, we felt that the discipline had really an uptake on Main Street.\nAnd I think that came with just access to information. I mean, think about going from hand\ncharting to then being able to scroll through the S&P 500 in a couple of hours. It really is remarkable\nto me now what we have capacity to do. Market scanning and filtering and just the capacity for that.\nBut also the accessibility of the discipline for young investors. I think it's really exciting\nbecause it gives some tools to manage risk and difficult market environments of which, you know,\nwe're being dealt one now. And I'm quite sure that's not the last time. So we wanted to bring\nthe research to the broader audience. Our client base has really grown on the advisory front.\nSo we have a lot of investment advisors who find value in the research. And the research\nwhat it looks like right now we have seven different reports that were publishing. And they're\nprimarily, I would say, focused on U.S. equities. But we do sort of different variations around that.\nWe have a daily report that's so much short-term in its orientation. It kind of creates an\nepisodic view of what's happening. It shows some short-term internal measures and S&P futures\nflow, that type of thing. And then we have three weekly reports of which one is focused on sectors.\nWe call it sector deep dive. One is really our comprehensive kind of top-down report,\nwhich also has some long and short ideas in the S&P 500. We call it fairly tactics. You're\nprobably gathering these more voting references in here. And fairly tactics are foundational\nreport. It has our views on the S&P 500 on the sector relative strength. It has\nviews of crude oil, gold, the dollar, treasury yields, really anything that influences equities.\nAnd that's where we help people find opportunities, manage risk. We highlight some\nthemes and ideas in that report as well. We recently launched something called the ETF Navigator.\nKnowing that a lot of advisors are using ETFs as a primary investment vehicle. We cover, I think it's\nclose to 60 ETFs in this report week over week. We'll have like apples to apples comparisons,\nusing charts that will show folks how the indicators stand. We roll in different asset classes\nweek over week so that each gets monthly coverage in that report. So that's also very comprehensive\nand meet a really good way to, I'd say keep yourself honest because to not let biases work their\nway into your views. I think the quickest way to do that is to create yourself a chart book.\nRight? And you can't argue against the trend. You can't argue against the indicators for sure\nand to have that apples-tapples comparison is a great way to go about that. And more conservative\napproach, I'd say, to technical analysis. We also have a sub-stack newsletter that we're publishing.\nI'd say more opportunistic ideas outside of the S&P 500 and that it's designed for more retail\naudience. And we have cryptocurrency research that we put out as well. I'm probably forgetting something\nbut we're really very prolific. I think it's idea and all of that and our methodology became\nI'd say the basis for what we now have as an investable product. So we went from producing research\nand doing a lot of consulting around that to then realizing that there was demand. I would say for a\nproduct that was in following what we're learning from our clients that they were doing\nsector rotation strategies. And we found a lot of advisors were using things like the sector\nspider ETFs to try to leverage trends and say technology or financials or energy.\nAnd in doing so that they were, I'd say, trying to follow the trends but it wasn't necessarily\nsystematic in the way they were going about it. So I saw opportunity there because I really believe\nin approaching markets systematically because that's really what we're doing with the charts and\nwith our methodology. We're trying to take out some of the gray area and let the market tell us\nwhat's happening. We're not trying to be ultra predictive in our work. We're rather trying to react\nto trends, trends, shifts, momentum shifts over bought over sold indications, things of that\nnature. And we think that that's one of the best ways to invest long term in the equity market.\nAnd we also felt that the sector rotation mark, which is something that we've always really been\nvery close to in our research, was sort of the lowest hanging fruit from the market in terms of\nfinding sources of outperformance or underperformance. And sort of an easy way to go about it from a\ntop-down perspective because any given year, I mean, you see major dispersion on the sector front,\njust looking at the S&P 500 sectors. And you'll see, you know, what was it? Energy app 50% in a year\nwere nothing else was in the green. It just wild dispersions. And sometimes they're hard to capture,\nbut over, you know, the course of 20 plus years, it's been a really great way to go about markets.\nSo we believe in the sector rotation strategies, but we found that an ETF wrapper and a systematic\napproach is a really good way to go about that because the ETF wrapper gives the, I'd say,\nsort of tax advantages. Certainly of, you know, trading individual sector funds themselves, right?\nSo you'd have to be pretty active in doing so to take advantage of trends. But then also, you know,\nversus mutual funds, which have obviously sort of faded in their popularity for largely tax reasons.\nSo we felt like the ETF wrapper was the natural sort of investable product, but also the\nmost accessible. So to go back to our goal of reaching a broader audience with high quality\ntechnical analysis, this is what we wanted to do with an ETF product. Even though an ETF is\npretty difficult, I would say, to launch. We felt that it was the best product because it is a\npublic-leaved traded instrument, right? So you can go and, you know, buy an ETF on your platform.\nYou don't need to fill out a bunch of paperwork. So as long as it's offered on that platform,\nwell, then you don't have to, you know, spend much time with your due diligence unless you're\nso inclined to do that. So we felt like it was an accessible product, a tax advantage product,\nand a strategy that we found that really held appeal for our client base and also in our research.\nWe felt like it was a good way to go about market. So we created this strategy and it took a\ncouple of years. We were inspired in part to do it as a rules-based system by some quantitative\nsort of friends of ours in the business, and we worked together to isolate our, you know,\nmethodology into a series of rules, and therein came up with something that's, I would call it a\nsophisticated technical model, sophisticated without being terribly complicated, and that it's just\ndesigned to sort of trade alongside long-term trends on the sector front. And following also with\nthe way we think about the world in a way and also, I'd say, are more conservative approach.\nI don't know, you know, if you've ever seen me deliver a presentation or or anything like that,\nbut you'll find that I'm almost, I'm sort of unemotional about the whole thing because I don't\nthink we can even get too passionate about anything that's coming from math. It's just math, right?\nSo, so we feel that, you know, our conservative approach to markets, really dictates\nusing technical analysis for risk management, and without wanting our first product to have\nleverage or to use derivative strategies, we found that the best way to sort of simply go about\nmanaging risk was to use alternative asset classes when the sector ETFs that we're trading,\nwe're not doing what we expected them to do in a strong environment. So, and of course, we don't\nalways have a strong environment. So, we wanted to make sure that we had something that was\nadaptive, and that's what we created. Something that is focused primarily on sector rotation,\nbut in markets, that just aren't friendly to that, necessarily. We created the ability to\nmove into these alternative asset classes that tend to do better over history versus equities\nand certain environments. Well, you said a lot of things that I really, really agree with there,\nand that I hold, you know, near and dear to my heart, in terms of, you know, how you're approaching\nmarkets and kind of your risk, you know, looking at risk first, almost. Diving into tack a little bit\ndeeper, can you talk about kind of the portfolio construction, you kind of have a bench of what\nyou're out there looking for, and then kind of talk about what happens in different environments\nwhen the portfolio might be more risk on, or it might be a little bit more risk off in terms of\nits general setup. Yeah, well, we're starting with eight buckets, it's the easiest way to think about it,\nand they are equal weighted buckets. So, we want to in a strong market, so bull market,\nand when we say that, we mean for more than just a few weeks, we want to bull market that's\nestablished and still has long-term upside momentum. We would expect to have eight sector ETFs included\nin that portfolio, so we would max out at eight, we do that intentionally because we tend to see\nthe more defensive sectors of the market, at which we feel that there are three of them.\nReal estate utilities and consumer staples, we tend to see those underperform, and of that,\nwe would expect them not to add much value to a portfolio, so we sort of took out three out of the\n11 sectors and created this sort of eight bucket portfolio of which we would expect to have all\nbut those defensive sectors firing on all cylinders from our model, and so we'll run the\nsectors spider ETFs. We wanted to use the spiders because state street funds are very popular,\nbut also very liquid and low price, so we felt that they were something that our client base was\ntrading anyway, so there was a comfort level there with them, so probably the most popular sector\nETFs out there, so we wanted to kind of stay aligned with what people were doing already, and we\ntake those and we put them through our model and we evaluate them for characteristics that are measuring\nlong-term momentum, long-term over-bought over-sold conditions, and long-term relative strength\nversus the broader market, so those qualifiers when they are met will fill the bucket with that\nsector, when they are not met, we then move that bucket into different asset classes.\nWe do also have a quantitative momentum overlay that will apply when we have more than eight\nsectors qualifying, and when we move the buckets into the alternative asset classes,\nwe do it in a diversified manner, which has really helped the portfolio since we launched it,\nwhich was in March of 22, because there was a long-term treasury market at the same time as an equity\nbear market, which was pretty damaging for portfolios that would toggle just from long equities\nto long-term treas. So we have that diversified exposure between long-term treasuries, but also\none to three-year treasuries, so short-term treasuries and gold. The gold position hasn't helped us\nrecently, but it does over-history tend to do better than equities in bear market cycles,\nand that's certainly was the case at times last year. So we have this sort of, it's not exactly\none third, one third, one third, one third, but it is a diversified bucket of alternative asset\nclasses. So we can have a given time, only three ETFs in the portfolio, being those three\nrisk off categories, but that's only happened over the course of our model that only happened three\ntimes, and I think you could probably guess exactly what times it was worth, right?\nThere are just the major bear market cycles going back to 2000, and we saw the portfolio\nget very close to that last year, but it didn't quite get there. It still was rewarding energy\nwith a position, and now it's really interesting because we have what I call it sort of a market\nneutral strategy right now and play, and it means that half of those buckets are inspectors,\nand they happen to be the leading sectors for the most part from this year, and then the other\nhalf of the buckets are filled with those three alternative asset classes, and so it's positioned for\nwell near-term upside perhaps from a relief rally from the leading sector, so it does have that exposure\nto boost the fund, but it's still in risk management mode. And when you look at the charts,\nwhen we look at the markets from a long-term perspective, it's fairly obvious to us why that's\nhappening, because while long-term momentum has certainly improved this year, it hasn't improved\nto the degree with which it's saying, okay, this is a secular bull trend. We have what we would\ncall a cyclical bull trend within probably a big wide trading range, and until we feel that the\nlong-reterm indicator shift more decisively positive, you know, we would expect to be still a\nmore in-risk off-mode, and what would it take to change that? There's a lot of different factors\nthat get built into the model, so there's not a simple answer to that, but what we're saying in our\nresearch, which is, it means a little bit, I'd say, more intermediate term than it does long-term,\nwhat we're saying is that if the S&P 500, we do expect a relief rally here, if that relief rally\nis strong enough, meaning that the breath is good, and that it can get the S&P 500 above a resistance level,\nwell, then we have the potential to see something that's more lasting. But the resistance is quite\nstrong, the long-term indicators are, I'd say, lean positive, but not strongly positive, and we have\nthe headwind of long-term over-bought conditions for one, so we really want to see the market\nimprove, and then we would expect to morph right back to that sort of full sector exposure,\nwhich is where we essentially started early 2022. So when you have, let's say, you have all eight sectors\non, is it all equal weight exposure? And so if that's true, do you ever have to do a regular\nrebalance or bring something in line if you start to see maybe, let's just use tech goes on a\npretty big run, and you've got kind of out of whack a little bit, is there a regular rebalance\nwhere you try to pull those back to equal weight? Yeah, so what we do is essentially a monthly\nrebalance, and because our indicators that we're using as the basis for a model, they are\nlong-term, and for that we're using month-end closing data, and that's by design, we found that\nany shorter term inputs just created more noise without adding value from the risk-reward perspective.\nSo that month-end closing data was smoothing things out, but not to the degree with which we\nwere disadvantaged by it. So every month we will evaluate the model, have month-end, and make the\nchanges, very close to the first trading day of the month, and if we see one of the equal weighted\nbuckets, which are 12 and a half percent, of course, if somebody is deviated quite far from that,\nwe will rebalance it accordingly with intention. And so it's a matter of just keeping an eye on\nany kind of drift that we have there, and it's a good problem to have, of course, when something\nruns away from that 12 and a half percent. And you know, it's the rebalance that it's the dynamic\nnature of the model, and I think that this is where it's a real testament to technical analysis,\nand it's benefits, and that it will react to a market shift that it deems important.\nYou know, it won't react necessarily to what it would consider to be a sort of a corrective move,\nor something that has a potential just to be a knee jerk based on our indicators.\nBut when there's a major trend shift, it will react dynamically, and it will do so that investors\ncan ideally use it as an alternative to just the old fashion by and hold, right? So versus buying\nthe spider ETF, as an example, you can find that the goal here is to build on the return's\nlong term versus the broader market versus our benchmark for the ETF, and then do so with\nlimited drawdowns. And it's those limited drawdowns that over history can really be\nincremental. Obviously, missing a 2008 would be probably the best example of that. And indeed,\nI think 2008 was when technical analysis really got a great reputation and got that uptake\nthat it hadn't really had in the early part of my career to be honest. I always felt like I was\ntrying to defend my discipline, but now I don't have to do that anymore. And I think it's because\nof those types of environments that people said, well, gosh, if I even just had a very simple\nlong-term momentum overlay, I would have been protected by that. So it's the limited drawdowns\nand in our conservative approach, also a lower beta, and you know that well, pardon it with\nyour fund too, something that's a bit more conservative and with a lower standard deviation.\nSo as far as trade frequency, and you're looking at long-term trends, but if you get a,\nwe'll call it a signal. If you get a signal to, I don't know, rotate out of a bucket\nand get more of a risk-off stance. Is that done in real time, or are you kind of looking at the\nportfolio on weekly or monthly basis? I mean, we're always looking at the portfolio as you can\nimagine. It's like we eat, sleep, and breathe it. And that goes for the broader market as well.\nOur process is looking at a lot of charts and we do that by default because we're writing about\nthese charts every day. So that's really a big part of our process is to have that kind of visual\nelement that is very specific to technical analysis. And so we're watching things every day,\nbut we are only making the changes once we have that month-end closing print. So we're only\nadapting, not intra-month, or intra-week, but rather once we have that month-end closing print.\nThat's over history, been the right way to do it. Because you can get moves,\nintra-month, that are just wild. And I would argue that right now, the market's very prone to that,\ntoo. We have what we've seen pretty high in volatility. So when you can take out some of that noise\nweek over week, I think it's beneficial in terms of your positioning. You don't want to\nover-trade something. It tends to just give you more transaction costs without much benefit,\nand you're essentially carrying more risk by doing that. So we wait for the month-end closing\ndata. That's also, of course, like the integrity of the charts and indicators that we're using.\nLike we can sort of eyeball them and say, it looks like this is probably going to happen,\nbut until we have confirmation, you know, we don't want to react to that. And it probably\nit's something that's getting somewhat ad-nausing for our client-based hearing. I say,\nyou need to wait for confirmation, but it is that conservative approach to me that's\na very wise and systematic investing. You want to make sure a breakdown is confirmed.\nA breakout is confirmed. You can't dispend one day there because if you think about,\nyou know, resistance and support and the basis for that, you know, it's not a precise point.\nSo you want to make sure that, you know, something is cleared, one way or the other, that you're\nactually seeing that hold for, you know, whether it's a day or two, a week or two, you just want\nto make sure that it's decisive. And that's indeed sort of part of our methodology and trickles\ndown into the model. So it's actually led really well into my next question because I deal with this a lot.\nHaving to wait a month, but waiting for a confirmation at the end of the month,\ndo you ever look at your basket knowing what you know about fundamentals and just go,\nI can't wait to the end of the month. Is that ever happened?\nWell, we've not had, you know, a live portfolio for all that long at this point.\nBut, you know, we are always anticipating the next move. It's just the nature of what we do\nand being so close to the market. But we often think about it more from a top-down perspective,\nnot for the individual positions per se, but how sort of the overall composure\nshould be reacting in the certain environment. So, you know, none of our analysis really tends to be\nultra-productive. What we're trying to do is just stay on the right side of prevailing trends.\nAnd that's how we can help people manage risk and also discover opportunities. So we are watching\nit every day. The temptation might be there to make a change, but it's against our better judgment\nto be subjective and how we're approaching it because that would be out of following with the\nmath behind what we're trying to do. Right. So when you're sitting down with advisors and you're\ntalking about tech, where are you kind of generally recommending this would fit inside of holistic\nmodel portfolio? Yeah, for sure. And that's been something that I've learned as I've gone along.\nWe, as technical analysts, we're not advisors, well, we are technically investment advisors,\nbut not the kind that you're talking about. So we ourselves don't have client accounts with\nmodel portfolio. So we've learned as we've gone along in terms of how advisors are using it.\nMy intention truly was to create something that was holistic, right? So let's say a retail investor\ncould just buy tech. And that could be their equity market exposure. So it really is a holistic\nportfolio. And over the course of the model, it becomes by the nature of the asset allocation,\nsomething close to maybe a 70, 30, or 60, 40 type of model, right? So it's somewhat\nin following with what a lot of advisors are trying to do for their clients with multiple funds,\nright? So it creates that 60, 40, or 70, 30 type of portfolio with the unique piece and gold,\nso the gold would be sort of the outlier there. So it is a unique strategy and that it is holistic\nin that way. But we found that it's fit into some models as either liquid alternatives,\nbecause it is that. I mean, it is based on technical analysis and that that differentiates it.\nOthers have treated it as a hedged equity type of portfolio, and others are more simply\napproaching it as a US large cap equity sleeve. So there's different ways to approach it. I think a\ngreat way to use tack would be as a core holding. That is then supplemented by opportunistic\npositions in strong environments. So let's say, we have this relief rally underway in the equity\nmarket. And in our research, we're telling people to take advantage of it by increasing exposure\nto higher beta assets. And so tack remains a holding, but then you could supplement it perhaps\nwith high growth, innovative technology stocks, something of that nature. And that would boost\nperformance in a strong tape. And also, you know, create opportunity to, I know a lot of people\nreally like individual stock investing, we do too. And so a way to express those views, but to do\nit in a way that you still have that safer core position. And then you can essentially trade\naround it, right? Have positions that build on it at different times when the market's dictating\nit. So we'd like the idea of adding that technology exposure at times when the market's really\nvery strong. You know the technology sector is the biggest sector in the S&P 500. So with an equal\nweight position, arguably, we might not be rewarding it enough in a certain environment. If it's\na tech lead bull market, then we certainly want to have tech supplemented by some technology\nexposure. And that's of course not always the case. I mean, we've had what an energy lead market\nbefore. So it's nice to be able to reward the smaller sectors when they are outperforming too.\nSo how are you guys thinking about distribution? I know being out there and telling your story\nis definitely a big part of it. But is there anything else you guys are learning or implementing\nas far as distribution goes? I mean, you've done a great job of raising assets so far. Congratulations.\nBut I know is we kind of scale and you get to the point where you might want to\nmaybe add some salespeople or certain things. So how are you guys thinking about distribution at this\npoint? I mean, that is really the challenge isn't it? And it's another one of those things that I\nthink I've learned as we've gone along because I had this feeling when we were launching,\nI said, well, gosh, you know, the here it is. Now our work here is done. But it's not at all the\ncase, as you know, there's much more to it than building the strategy and maintaining the strategy.\nIt's really difficult to get a product deeper into the marketplace and certainly our partners\nhave been instrumental in helping us do that. We have the NYSE for one is where TAC is listed\nand they've become a great resource for us. We also are the sub-advisor to TAC. The advisor to TAC\nis a large independent advisor down in Virginia and they have given us some of the sort of,\nI'd say, resources in terms of trading and compliance and marketing that have been really instrumental\nalso in growing the fund to where it is now today. And then we, you know, we haven't really made any\nI'd say concerted marketing efforts outside of continuing with our thought leadership, I would say,\nin terms of the research and we do tend to get a lot of exposure for what we're doing. I'm a CNBC\ncontributor. And so that exposure certainly helps. I'd say build a following. So, you know,\nwe're learning as we go, but so far so good. That's great. Well, before I let you go,\ndo you have any plans of potentially launching more product in the future? Is that something you've\nkicked around? Well, we first want to see TAC succeed in the Ford other products. This success\nis there on some levels, but we are very conservative not only in our sort of investment approach,\nbut also in our business. So we want to make sure that we have a good foundation and can feel\nconfident in launching a new product. We are a small firm, but we also have really great partners.\nEven even state street has been a great partner to us in terms of helping educate us, right,\non the industry, and its challenges, and providing us access to certain events and people.\nAnd so, you know, we'll lean on people that have been great helps to us, and hopefully some\nday we can launch another product. Well, again, I really appreciate your time. Where can people\nlearn more about you, the firm, and the fund? Right. Well, it's pretty easy, of course, to find\npeople nowadays where we have a website fairly strategies.com. And through the website, I would encourage\npeople to sign up for a free trial of the research. It's really the best way to not only get to\nknow us in the methodology, but to also access us, because we do provide access to the team through\na free trial. And we do a lot of webinars, teachings, the media exposure, and of course,\nall the written product there. So that's something I would encourage people to check out.\nWe are a little less active, perhaps on Twitter than some, or X now, but we do have a profile\nthere in Twitter at Stockton Katie, so people can follow us there as well. And for the ETF,\nthere's the fund website, which is fairly funds.com, and folks can track the holdings and learn\nmore about the strategy that way. Well, Katie, again, it was a pleasure to meet you.\nReally happy we got the opportunity to do this. And I hope to, you know, meet you sometime in person\nhere in the future. Same here, Brad, that'd be great. Thank you.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}