{
  "id": "13860065",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, chief investment officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nToday we have Steve Cook.\nHe is the head of ETFs at Harbor Capital.\nWe talk about the business.\nThey got their start by sourcing investment managers.\nThen dove into the fund management business, managing mutual funds, CITs, and a handful\nof ETFs.\nSteve has a ton of experience.\nIt was nice to talk to Steve.\nWe talked about NYSE floor listing, and we also talked deeply about their product hedgeer,\nwhich is a all-weather commodity ETF, a little bit more active, and a little different\ntake on commodity exposure.\nWithout further ado, please welcome Steve Cook.\nHey Steve, welcome to the show.\nBrad, good morning.\nHow you doing?\nThanks for having me.\nI'm great.\nBefore we get started, can you talk a little bit about your background in your current\nrole at Harbor?\nSure.\nCurrently, I'm the head of ETFs for Harbor Capital Advisors, and kind of overseeing\nthe product selection, capital markets, and operations for the ETF business.\nI got my start in ETFs a long time ago when the NASDAQ launched the QQQ, BNYBELL, and was selected\nas the trustee.\nAnd back in the early days of ETFs, before Reagan and MS, exchanges created the ETFs\nto drive volumes onto their exchange.\nBut they didn't want to have the burden of a 40-act fund with a board, and register as an advisor,\nall those sorts of things.\nSo, they registered the early ETFs as unit investment trusts, and they cast kind of all\nthe responsibility for operating the trust and ETF onto the trustee.\nAnd so, Banking York was selected as a trustee, and I got to first hand look across the board.\nThe investment management piece for an index perspective of the capital markets and trading\npiece, because there was no centralized data repository.\nAnd so, the folks trading these things on the floor would call you for information and updates\non how what changes the ETF made made, and the basket knows what to think.\nSo, you really kind of got immersed in the ETF ecosystem through that, and that, that's how\nI first got involved, and then had a number of roles within the ETF industry ever since.\nYeah, no, that's really interesting.\nAnd before we kind of jump into more about Harbor and more about the ETF business, I always\nlike to ask everybody, would you like to do outside of the office, any hobbies or interests?\nSo, I enjoy playing golf.\nI'm a big beach guy.\nSo, oftentimes people talk about lakes with beach.\nIf I'm not within like 20 minutes of the beach, I twitch, because I really like to go and\njust hang out and enjoy it.\nSo, that's when I get free time, but most of the time right now, I drive my kids around\nto competitive soccer tournaments and games.\nYeah, I'm just entering in the world of soccer.\nI'm used seven girls right now, and I'm kind of dreading that step up into you eight, where\nthey start to travel, and just consumes your entire weekend.\nYeah, I'm at you 17 and you 15 right now.\nSo, we're going all up and down to East Coast and it's all kind of time consuming, but\nit's a lot of fun.\nI know it doesn't last forever, but it's quite quickly Brad, so enjoy it while you're\ndoing it.\nYeah, I love it.\nI got baited into coaching this year, and I was like, I don't know anything about\nsoccer, but I think I can motivate kids, and I tell you what, it's like the most fun\nI have all week is kind of not yelling at, but cheering for, you know, the\nthese girls during their games, it is a lot of fun.\nSo, so can you talk about Harbor Capital and the types of services you all provide?\nBecause it is a pretty interesting business as I kind of look into it, and so I'd love\nfor you to kind of talk more deeply about Harbor and everything you guys do over there.\nSure, so Harbor was formed initially as kind of the pension management arm of Libby\nglass and a few other Ohio manufacturing companies 40 years ago, and it really focused\non manager selection to manage the pension assets and the executive team at Libby felt like\nthey were doing such a good job, and the manager selection was so on point that they said,\nyou know, why you spin out and become a professional mutual fund firm as a manager, manager,\nselecting and finding asset management firms and niche areas and start mutual funds.\nAnd so they did that primarily for the first 35 years of Harbor's existence, they were a mutual\nfund shop that would go out and seek managers and specific asset classes and launch funds\nwith them.\nAnd they had, we had a lot of success doing that.\nWe found we were the first to launch Pimco in a retail, you know, mutual fund structure.\nSo if you wanted access to Pimco, the only place you get that was to a Harbor mutual fund.\nWe have over a 50 year relationship with Genesis and Associates, a fantastic growth manager.\nAnd that Harbor identified early on and we have our largest mutual fund with them, capital\nand so that's kind of the DNA of Harbor is to go out and seek really strong managers and\nspecific asset classes where you as a retail investor may not be able to get access to them.\nAnd that's what we did for 35 years and then, you know, as kind of the retail broker's\nenvironment changed and shifted, Harbor first launched CITs about four years ago for the retirement\nmarket and then made the decision to get in the ETFs for more the wealth market, you know,\nas buyer behavior started to shift, you've seen a 10 year secular decline and investors\nappetites for mutual fund and tilted more to ETFs. So we launched ETFs in September of 2021\nwith the same idea, you know, bring really unique products to market for investors that they\nmay not be able to get elsewhere and certainly with managers, they may not have access to elsewhere.\nYes, so that was the part that was interesting to me. So are you guys going out and sourcing\nmanagers or managers coming to you and can you maybe talk a little bit about that due diligence\nprocess if you know what it looks like? Sure, so it's a little bit of both. Initially we had to go out\nand seek managers, you know, for our first few ETFs, you know, once you've gained a little bit of\nsuccess in the area then you start to get managers who reach out to you with ideas so it's a little\nbit of a both. But either the way the same due diligence process is undertaken, we have an investment\nresearch team that goes out and looks at manager ideas and overall managers and ensures that they\nhave the capability and history of generating alpha for investors in any particular asset class.\nAnd so we're trying to look and make sure that whatever generated the alpha in the past is repeatable,\nit's not wasn't just some sort of benchmark hugging where they got a little lucky and\ntilted, so by some factor. And you know, the other real thing that we want to see and ensure\nis that there's a constant process of improvement and that the managers have an underlying\ndesire to continue to develop whatever, you know, process, they're utilizing to generate\nalpha to improve that over time. And so those are the two areas that we really dig in on and our\nIRT team seeks out and does a wonderful job looking at it. And so, you know, either way, whether we\ndecide that we want to have a product that's unique in the small cap space or somebody comes to\nus with an idea that says we've got the better way of providing access to commodities, you know,\nwhat will undertake, but the research disciplines there in both respects.\nSo, can you talk about maybe the next steps there? So, let's say you've sourced or, you know,\nfound a manager that can run a unique strategy for you. You know, can you talk about that kind\nideation to actually getting the product to market and what that looks?\nYeah, so, you know, once we've determined that the idea, the thought process, the manager,\nhas the chops to deliver that alpha, then we work with them to understand what it takes to\nmanage and exchange traded fund. It is slightly different than either a non-registered product\nor a mutual fund. So, we partner with them, we'll refine the idea, you know, maybe you have to\nmake a few tweaks in order to perfect the process within the ETF structure, you know, whether that's\nthe way they trade, the way they might rebalance, the number of securities that they hold,\nyou know, maybe you have to exclude an aim in order to make it more tradable,\nthose sorts of things. And so, we'll go back and forth generally for a few months\ntrying to perfect the process. And in that time, we're also helping them to understand\nand update their technologies and their systems to be able to copy the ETF exchange\ninformation and data that goes on. We're working with our service provider to pull them in\nand then we're updating the necessary regulatory filings and exchanging information.\nAnd so, all that generally takes, you know, three to six months\nof working kind of behind the scenes. And, you know, then towards the end of the process, we're\nout seeking a partner from a liquidity standpoint. And an AP standpoint, somebody has to help launch\nand see the initial day one ETF. And so, we have a number of partners that we try and focus on.\nWe do try and keep that narrow though. You know, if we're ETF perspective as you well know,\nyou don't want to have 15 market-maker relationships for 15 products. It becomes unwieldy and very\ndifficult. And so, we seek partners for that and then we prepare for launch. And then we start thinking\nabout, you know, how are we going to market this? How are we going to get the word out to\nadvisors and the investing community that this product is coming or what it does show up?\nYou know, what makes it unique? You know, why do we launch it? How does it fit into an investor's\nportfolio? And why don't we really think that there's a need for it?\nYeah. And I definitely want to talk a little bit about that later about how you guys are handling\ndistribution and marketing. But you, Harbour was one of the first to decide to move to NYSE floor.\nI don't know if you remember, but you and I actually had a phone conversation because I saw the\nmove and I wanted to make, I wanted to, I was exploring that move as well. We eventually did it.\nSo, can you talk about why you decided to make that move to the NYSE floor and why we're seeing\nmore ETFs do it? Yeah. So, you know, it's funny after 25 years in the ETF space, you know,\nyou look back and you think, okay, there are certain things that everybody already understands\nabout ETFs and you take that for granted as somebody who's gonna live and breathe it every day.\nAnd I think one of this more, um, and fact of things that we see currently is,\nit's folks still understand how to trade some of these vehicles and understand necessarily the\nwives, right? And so, um, you know, the constant preaching, you want to avoid the first 15 minutes\nof trading in the ETF. You want to avoid the last 15 minutes of trading in ETF. And throughout the\ncourse of the day for more thinly traded ETFs, as best you can, if you're not using a block order,\nyou want to use limit orders to avoid these widespread occurring in the product. And what happens\nis, in the morning, you know, as all the underlying securities in ETF, let's say you're,\nyou're fund those, 115, all those 150 names, the markets for those individual securities and those\nequities has to open. And as it's opening, there's price discovery going on and each one of those\nindividual equities could have, you know, a three-cent swing in its opening price. Well, you put\nall that together and the broader swings for the actual ETF can be 15s. And it's nobody's fault\nthat's just the way the kind of market opens, particularly when you're utilizing computers to come\nup. Um, computers are gonna assess the market, they can say, wow, these three equities are having\na hard time open. We need to widen out this ETF to protect ourselves against, uh, somebody who might\nbe trading it actively or professionally, um, to protect ourselves. And so, um, you know, those\nfirst 15, it's going to be difficult. However, when you're introducing new advisors into the ETF\nspace that may not be used to trading ETFs, you know, they're, they're looking at the best way for\nthem to buy a block of 20,000 shares for 100 clients and then allocate those 20,000 shares\ninto those 100 client accounts. Well, because we're a difficult for them if they have a hundred\ndifferent prices on those 20,000 shares and they're trying to allocate all that stuff down. And so,\nthe way advisory systems work, it's easier if they put in a market on open trade, right, because\nthey're trying to buy and bulk for a number of clients and they're getting it. So those two things\nare in conflict, right, the way ETF opens and the way an advisor through their platforms would normally\nbuy shares. Um, and so one of the, the real major benefit to going to the floor is you're taking\nthe computer out of it and you're inserting a live individual back into it. And so if I'm Steve\nCook who is the ETF issuer and, and your Brad and your, the market maker on the floor in the\nmorning, you could look and say, okay, I know there's an advisory trade coming out of Fidelier,\nSchwab or or Commonwealth or one of these other platforms. I know it's not a professional trader\ntrying to pick me off. This is just a person trying to buy 20,000 shares with ETF, a fair price for\ntheir opinion. I'm going to then do my own homework, Brad's going to do his own homework,\nlook at all the other on ETFs in there and, and he's going to say, okay, I know this is a good trade.\nI'm going to open it and I'm going to trade it at two cents above what I think the fair value is\nand so you've taken away the whole mystery of avoiding the first 15 minutes market on the open\nand the last 15 minutes market on close and you're providing a fair price because there's\nsomebody who's, you know, manually inserted in that process and could look to make a fair market for\nfolks. Yeah, I mean, for us, I think it was one of the best things we've done. I mean, the only\nthing that kept me up at night about this business was those opens and closes and, and, you know,\nwe were halted once, you got wild swings and somebody was throwing in over the counter market\non close orders and just just throwing us around and I can say at least for myself,\nit was probably one of the best decisions we've made and I, I'm looking at kind of your products\nas well as seems like it's, it starts. It really has, when we were seeing some advisors put in\n30,000 share orders and get the execution 10 cents away from where it should, right?\nSo immediately, you know, the order magnitude there, you get a number of the, you're talking\nyour costing investors, tens of thousands of dollars a year in, in, in market making spreads.\nAnd there's, it's not necessary. And so if we could pay a little bit more to have a human being\ninserted in the middle of that trade and save our investors money and make it easier for advisors\nto get in and out because we have to meet advisors where they are. Obviously it's better for them to\ntrade that way. It's easier for them to trade that way for their clients. So we got to make sure\nthat if they put in at 931 and market on the open order or at 359 and market on close order\nthat they're going to get good execution and by moving down to the floor, it really has done that\nand we've seen it. Well, you know, there's been no trade that's done, market on open above\nthree cents on any of our ETFs that are on the floor now. And so I think if we start to encounter\nthose trades more frequently in our other products, we'll continue to move more, more of our ETFs\nto the floor for a better client experience. Yeah, that's really what it's about, a better client\nexperience. And, you know, I couldn't see us launching anything that wasn't\nfloor traded just because of how our products are in the size and, but let's pivot. We're here\nto talk about, uh, hedge your HGER, which is a commodity all weather ETF. So can you talk about\nwhat the ETF is trying to accomplish in the strategy, you know, sure. So, um, you know, this is one of\nthose firms that after we've launched a few products, we are our present Christophe Lace,\nand that relationship, preview with some of the senior folks at Quantix, and they reached out.\nAnd, you know, we've been looking at all of the products that are available to investors\nthat investing commodities and are meant to protect investors from it. And, and they're all based\non P.K. or G.S.C.I. Bloomberg Mighty Index, or Boban Mighty Index. And, those particular indices\nwere were created for the purpose of protecting investors against inflation, or giving investors\nexposure to these to help them during periods of inflation. They were created for manufacturing\nand other firms that use commodities in their daily business to hedge their businesses against,\nyou know, swings in commodity. And so, everything that's out there, you know, wasn't purpose built\nfor the reason it's being utilized. And we think there's a better solution that we can create\nfor investors to give them exposure to commodities during periods of inflation that will protect\nthe portfolio. And so, that was kind of the genesis of the why. Now, um, the folks at Quantix\ncommodities, Don Castoro, Matt Schwab, and a number of other folks have a long history, um,\nDon Ren, the commodities trading desk for Goldman Sachs for 20 plus years, uh, and all the people at\nQuantix were were principles and partners or managing directors at Goldman Sachs with a\ncommodities perspective. So, these folks have a long history in trading and understanding the commodity\nmarket. Uh, and so, they went about and tried to create the, the, the Quantix total return\ncommodity index in order to, uh, again, create an investible product that gives investors\nexposures to commodities, but does so in a way that's going to, um, uh, take the best advantage of,\num, the economic cycle and, and the commodities that get included in the index and the\nweightings, um, so that they're protected against inflation. So, can you talk about some of the\nholdings that are in the portfolio and what investors will generally see, uh, in invested in?\nSo, um, the index, uh, can have access to up to 24 commodities, uh, um, you know, at the beginning\nof the year, the index community of Quantix looks at kind of, um, the economic weight of a commodity,\num, in the market, um, understands kind of the role you'll dissociate with all the contracts that are\nin the, um, the, the index itself and tries to develop the index to optimize, uh, both the exposure\nand the liquidity along with the role yield of the prevailing commodity included. And then the last piece\nis, uh, based on either scarcity or, um, or the basement indicators, they will increase or decrease\nexposure to precious metals in particular goals. Uh, and so, uh, in general, um, you're getting\nbroad exposure to petroleum and energy, heating oil, Brent, West Texas, Egypt, gas oil, um,\nsome, um, smaller but certainly present in grains and soybean products like corn and wheat,\nsoybeans, uh, soil, uh, some softer commodity exposure, uh, in cotton and sugar, um, right now there's\nno, uh, livestock exposure, but there is a bit of habit, and then in base metals, copper,\naluminum, nickel, zinc, uh, and then, as I said, there's about a 30% uh, current exposure to gold,\nand all of these things, uh, can be increased, increased, again, depending on the outlook,\nthe scarcity of those commodities and whether, uh, there are signals of, uh, the basement or\nnot. So when you, is the portfolio active or is it, uh, more of a rule space, kind of passive portfolio?\nSo it's a rule of base passive portfolio, um, you know, in theory, but in practice, the underlying\nindex itself is what we would call actively management. So harbor, you know, uh, history and\nbelieves in management, but we do have some index, you know, base ETFs, but even the ones that we\nlook at that are indexed based structurally, we think of them as active because they're, we're\nactively managing the underlying rule set within the index. And I think that's important, um, you know,\nparticularly redger, um, although it's rule of based, there's enough dynamism in the underlying\nconstruction of the index, uh, and there's enough, um, input into the rules that define it\nthat you're going to get quasi-active management within the index structure. So how often is that,\nuh, index kind of reconstituting itself, um, and making change. So it'll reconstit in terms of the\nactual commodities that can get included in the index on an annual basis, uh, but it will rebound\nitself on a quarterly basis. And so, you know, the rules that govern, um, debasement, or scarcity,\nget looked at on a quarterly basis, and you will dynamically increase your decrease allocations to\nall the commodities and gold based on what's happening in the market at that particular time,\nand how the rules are interpreting on a cycle. Got it. So when you're sitting down, you're talking\nwith advisors about this product, where are you trying to fit this in terms of an overall\nmodel portfolio allocation? You know, we think that investors and advisors, um, for a number of\ndifferent reasons, have structurally underweighted, uh, allocation to commodities in the full, you know,\nuh, to the top. Um, and in particular, over this last inflationary cycle, they, you know,\nadvisors and investors have been really underweighted to commodities. Uh, but there's a lot of\nreasons for that, right? Again, I think you look at the choices that traditionally advisors had to\nallocate to commodities, and there weren't really a lot of good solutions. Uh, there's certainly\nweren't many solutions that allowed them to allocate to one product and get dynamic exposure to gold\nand none of the other offerings really took into account the potential for role yield within\nthe underlying commodity allocation. And so, um, you know, for those reasons in the past,\nadvisors have a lot of bad memories and nightmares of previous allocations to commodities for\ntheir clients. Uh, and so they generally try to shine them a little bit. Um, and so, you know,\nour conversations are all around. This is why this is a better product. This is why we kind of\nconstructed it the way we did. Um, you're going to get a natural allocation to gold when you need it\nfor your clients. You don't have to worry about trying to time the market. The index itself will\nincrease their periods of debasement, decrease when there's really scarcity, which means, you know,\nnot enough commodities to go around. Um, and, but it will provide you with the comfort to know\nthat you're going to get that allocation to commodities to protect your investors portfolios\nagainst, uh, against inflation. And, and, and it really is work. Right. You look at the last, you know,\n18 months of, of hedger being, it's done what it says it's going to do. It's outperformed almost\nall other commodity indices and products that are in a market. Um, and, and, and done so in a way\nwhere it's dynamically increased or decreased if the allocation to gold, um, that's, that's kind of\nhelped them. And so our argument is, you know, you should probably have an allocation around 68% of\nyour clients portfolio in commodities. You know, maybe a little bit higher right now because of the\nfed inflation. Um, doesn't always mean you have to, but you can continue to hold this throughout\nother cycles because of some of the other base metal and manufacturing, um, that are in there.\nYeah. I mean, it's a really interesting product. Um, and, you know, you've recently crossed\nthe $100 million mark. So, congratulations. Um, look about what the distribution efforts had to\nlook like in order to get there and some of the behind the scenes. Because we talked to a lot of\nETF issuers here and, you know, the easy part is getting the market. The hard part is finding\nyour market and, and growing. So, uh, I do see you guys are pretty active, um, out, you know,\nout there telling your story. So, um, can you talk about what your distribution should look like?\nYeah. So, you know, you know, as well as anybody that there are kind of stages to the distribution\nprocess for an ETF, right? As you articulated, the launch is the easy part, you know, getting the\nfirst couple million bucks in there is a great seeding and it's very easy. Um, and then it just really\nbecome a challenge to get to certain breakpoints or levels where your product can become more\navailable across more platforms. Uh, and so, you know, the, the, the magic is trying to identify advisors\nwho don't have cumbersome, uh, gates that won't allow them to invest in a product early on in\nthis life cycle. If they think it's a good product and if it adds something. And so, you have to work\nto find investors and advisors who will jump in early on your products, you know, that's zero to 25\nmillion in assets because many of them simply won't talk to you. If there's, you know, two million\ndollars that yours in there and it trades, you know, two shares a day. Um, and so you just kind of\nhave to continue to tell the story. Um, you know, we've, we've launched our ETF products and built\nout our sales team kind of at the same time. Um, you know, we had a much smaller, uh, whole sale and\nteam and internal whole selling team and we kind of kind of built that out as we've launched the\nproduct and it's been cut that would be good. Um, you know, we've identified some of those, uh,\nearly advisors who were willing to jump in early. You got it to 25 million. Then you add, uh, you know,\nmore advisors who really like the story and you're telling it constantly in the market and just going\nback to them and so, okay, when you hit 25 million, come back, you know, I'll be interested in doing it.\nAnd they might allocate a little bit at that point, right? And then it's hand to hand combat with a\n50 million. And then once you get the 50 million, more of the independent platforms and, you know,\nwell, I have to talk to the third advisory network about it and you'll start showing up. Uh, and so,\num, you know, you just add a little bit and, and then as you know, the kind of magic number is $100\nmillion. Once you've reached that $100 million threshold, now I'll certainly get on some of the\nlarger, more nationally recognized distribution and advisory platforms. And then you really have a\nstory that you've been telling 18 months, all of a sudden becomes a little bit more real.\nAnd these folks are saying, okay, I told you, yeah, when, you know, when you get to certain levels,\nyou can come back and talk to me. And now all of a sudden, you know, the pipeline, the opportunity\npipeline kind of explodes because, you know, you've been telling the stories for 18 months, people see\nit working, but they're waiting for that period of time where they're able to actually go in and\nnow you're starting to see that. So this is where it really gets exciting. Brad, you know, I mean,\nyou're starting to see kind of folks say, okay, you got to the $100 million number, now I'm going\nto allocate that opportunity pipeline is really growing quickly. Yeah, no, that's, that's great. I mean,\nwe're, we're kind of at that same threshold now. And it's funny, you know, trying to solve the business\nscale, you know, scale issues as you start to grow, right? And an institutionalized the business a\nlittle bit more and trying to find salespeople. So it is a fun business, but again, congratulations.\nAnd before you kind of let you go, you guys have a full suite of product. There's a lot of them.\nSo we don't need to go through them all. But one other ETFs or products may be set up well,\nkind of currently that advisors should be looking at, get environment that we're in.\nYeah, so we have an international equity product, tickers OC, S-E-A, run by a firm\nout of your, called C-Worldwide, the interesting international ETF. They have a defined process.\nYou know, they have a, a competition for capital as they call it. They will only ever own 30 stocks\nin the portfolio. So it's a nice concentrated. These are large global businesses that when you look at it,\nreally want to own. You want to have exposure to. As folks are seeking out returns and uncoorrelated\nterms, looking at international products that are, that are owned businesses that you want,\nnot just for diversification, but because they're really well run. And and C-Worldwide looks at it\nas international compounders. So folks and, and management teams that kind of compound the success\nof their business over time by reinvesting the capital or the stewards of capital. So that's a\nreally interesting portfolio should really strong returns over the last 12 months and we just\npulled my part there. So we're really excited about, as a product. And then two other larger equity\nportfolios win, which is large kept growth ETF that we've launched with Johnson Associates\nand G-Div, which is a both dividend portfolio that we launched with our partners at Westfield.\nThat was actually a mutual fund that we converted so it's a long track record there. But if you combine\nthose two ETFs in the investors portfolio to offer kind of the growth aspect along with the defensive\nequity portion of it, those are really nice compliments when you kind of put the portfolios together\nin in a client's portfolio. So, you know, we're really excited about as you noted all the ETFs\nthat we have. But we think those four in general provide a really nice set of core holdings for\ninvestors as they look out the next 24 months through the the various kind of business cycles that we\ncould see, you know, whether it's higher for longer or, you know, a soft landing, you know,\ncombining those four and the right allocations provides investors with a unique set of returns\nthat we think are going to be really good for investors portfolios. Yeah, that's great, Steven.\nWe'll have to have either you or somebody else from your team or one of your asset managers\nback to talk about a couple of those products and you guys keep innovating. So I'm sure we'll have\nyou back. But before I let you go, I just want to say thank you for doing this and where can people\nlearn more about bonds over there at Harbor? Brad, again, thanks for having me on. It's always a\nlot of fun to talk about ETFs. We all have a lot of energy and enthusiasm for this space. And so,\nyou know, customers love to talk about it. But you can find out all the products that we have listed\non both ETF and mutual funds side at HarborCapelAdvisors.herheartlevel.com.\nGreat. Well, again, Steve, thanks so much and hope to see you soon.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}