{
  "id": "13902113",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nToday we have Reagan Steinke.\nHe is the founder of Ballast asset management.\nThey have a long history in the space, specifically small and midcap SMA products,\nand have jumped into the ETF world a few years back with their small midcap\nactive ETF, MGMT.\nI think you are going to find this conversation extremely interesting,\nspecifically around their fundamental process, as well as how they\nview and evaluate management and how they view and evaluate risk.\nSo without further ado, please enjoy this episode with Mr. Reagan Steinke.\nHey, Reagan, welcome to the show.\nThanks for having me, Brad, excited to be here.\nSo before we get started, can you tell everybody a little bit about your background\nand how you got into the position that you are today?\nSure, so I'll go back a little ways.\nI think it will be helpful to offer some of how I got my start.\nSo my first job of college was with Arthur Anderson,\nand this is the mid 90s.\nIt's an evaluation group that I'd like to say that's where\nto gotten things in the real world, as opposed to an academic perspective.\nIt's also where I met one of my business partners, Jason and I\nwent together.\nThen went to EBS in New York.\nIt was software analyst initially, and then moved into the strategy role.\nAnd there I worked with my other business partner today.\nI'm forwarding.\nSo I've met him for over 20 years.\nI was recruiting to a company called Westwood here in Dallas,\nin 2004, and where, again, I started the mid strategy.\nThere at Westwood, raised three and a half billion.\nThere is another billion or so in a sister strategy.\nAnd then I left in 2015 and started ballast.\nThey after I left.\nHistorically, we have a managed primarily institutional capital.\nI've got a point in the beginning.\nProbably 85% percent was institutional.\nAnd then three years ago, through a, or I should say, as a result of an\nSEC opinion letter.\nI've got a lot of different interests such as ourselves.\nThey have the same efficiency and an ETS strategy.\nIt's the, we launched the first my knowledge.\nSmaller.\nThat's probably made the gap actively managed ETF.\nSo that brings it through today.\nYeah, that's great.\nAnd before we jump into that, I always like to ask everybody what interests\nyour hobbies do you have outside the office when you're not behind the computer screen\nrun a money?\nSure.\nWell, I can, I'll tell you.\nI have four children that are all relatively young.\nSo I guess one of my interests and hobbies is coaching them and use sports.\nI've spent a lot of time doing that.\nBut outside again, I'm a big outdoorsman.\nA lot of things and fishing and sharing that.\nI'll be working with children.\nYeah, no, it's great.\nI'm actually, you're from, you're in Dallas.\nSo, are you still in Dallas?\nI am.\nYeah.\nYeah.\nI might be adopting the cowboys as my team this year because the\nSteelers are just awful.\nSo.\nWell, I will tell you to be careful that the cowboys are certainly good\nand breaking hearts on with the regular occurrence.\nYeah.\nYeah, they've had some high expectations and have not done what they probably\nshould have been doing over the last couple of years.\nBut they're my team this year.\nAnd yeah, I also coach you sports and it's very filling and fun.\nAnd I got a couple of kids.\nSo I definitely know where you're coming from and can relate.\nSo, let's talk about, you know, balanced asset management.\nI know you have the ETF which we're going to talk about.\nYou guys, did you start out running SMAs and then converting SMA assets into the ETF?\nIs that kind of how you got your start?\nWe did.\nI hope running SMAs and continue to run SMAs to the head.\nThe way I think about the ETF is the same strategy.\nIt's just a different vehicle or act to think of the same strategy.\nWe have a single strategy.\nThis is all we do.\nDone it for going on 20 years now.\nAnd so yeah.\nSo let's dive into MGMT, which is your small and mid-cap ETF.\nCan you give kind of a high level overview of what the strategy is trying to accomplish and what it's designed to do?\nSure.\nWhat the highest level, what we are trying to accomplish is to turn health\nregeneration into a manufacturing process, rather than a process that is robust.\nI don't know if you can teammates ability to be right for that.\nAnd it really starts with a focus on quantifying downside.\nIt's really the cornerstone within our process.\nIt's just a minute to explain, because there's an important distinction between buying something with at a discount to its intrinsic value or with a margin of safety.\nSo the common buzzwords you often hear, and what we're ultimately trying to buy within 20 to 30 percent of the worst case scenario that we can envision.\nAnd once we quantify that downside, then we'll look at the upside, where we're forecasting the base business out three years, coming up with price targets.\nAnd then very simply, we're marrying those two bits of analysis that we have this downside versus upside on the call that we interpret and call it a report to bridge ratio.\nAnd we're looking for a symmetry of at least three to one.\nAnd again, our process is compliant on exploiting that asymmetry and being extraordinarily consistent in applying this framework over and over and over again, is opposed to being using things like conviction or some of the other common buzzwords a year of time.\nAnd the reason for that really is that when you use things like conviction or probability, you are inherently exposing yourself to many of the behavioral pitfalls, we as humans are subject to a huge student of behavioral finances.\nI won't say that common interversity are required reading to work at ballast, but it's heavily incorrect.\nAnd so we're trying to do everything we can to take as much as many guardrails in as we can protect ourselves against those behavioral mistakes.\nIt's definitely important, I'm a big believer in behavioral finance and trying to avoid those pitfalls and everything we do is systematic as well, but before we dive into kind of like the investment process.\nI want to get your take on why that small and midcap space for such unique opportunity, specifically for finding kind of alpha generating companies and higher growth.\nAnd what is it about that space that you find attractive and what is it about those companies or maybe the management team specifically that allows you to drive and generate that alpha.\nSure, there's a there's a couple of things one that I don't often hear talked about, but it's actually.\nBut come worse, I guess, others for managers over the last 20 years and I'll take you back to the 90s when these are not just reading on the fractions, you know, 16th and 8th, whatever point moved into the early odds and went to customization and initially those commissions were five to seven cents.\nThe commissions are the up any or half a penny of share and a lot of these days and the reality is that many of the large brokerage firms.\nUse commissions from their trading deaths to pay sell side analysts to cover these stocks just don't cover the because they just they don't trade enough generated enough.\nAnd we've seen over the last 20 years a remarkable drop in coverage for many of the reasons we own and while that, you know, makes it a little more difficult to get up to see the rewards folks that are willing to roll their sleeves and to to the work themselves.\nSo let's talk about kind of the investment selection. I know you talked about, you know, the risk and reward ratio. I mean, are you looking at that through like a fundamental screening process, like how are you drilling down and finding opportunities.\nSure, so we have really starts with eliminating things. We just know when had interested in.\nWe have evaluation frameworks that we're going to pay more than let's thought, you know, Robert 13 to see, but for business we want our businesses to.\nWe want financial leverage and generate returns through financial leverage so we're extraordinarily focused on the sheets.\nWe don't met again, that's what we're looking at with financial leverage.\nfocused on management teams that are very capable of flying capital and a very high\nattractive rates of return and who get paid based on their success world like\nthere of and doing that. So that's really kind of step one for us super focused on\nfree cash flow having worked again at Arthur Anderson early in my career. I can tell you\nthat companies are able to manufacture earnings through accounting,\ngimmick-free, you can't just store the quality of the one thing you can't distort,\nit's cash going into and out of like a bank account. So those are really sort of the\nprimary metrics that we focused on early on, you know, as we get interested in working on\nme. So you briefly touched on looking at management. What's specific qualities you\ntrying to identify that makes a great management team that you're comfortable with and\ntaking an investment in their company. Right. All that just for your listeners, I'll tell you\nwe actually run away from this, it's on our website, if you want to get deeper, but we've got\nkind of management checklist and it goes into a couple of things. First and foremost,\nwe want to make sure that management is aligned with our customers and we do that by\nif really digging into how they get paid. And notice I said how not how much we want to\nmake sure that the metrics that are used to trying and what they get paid on, you know,\nkind with when they went out of construction. So just as a quick example, if you are a retailer,\nlet's see you over retail company and you get paid based on revenue growth. The easiest way to grow\nrevenue as a retailer is to just build more stores. Well, may or may not be the right answer\nor an investor. You know, incremental capital being void, it could be done at, you know,\nat the terminal with lower rates of return. So the focus, I should be just focusing on your\nsystems. That's a big component of it. The other thing is evaluating throughout the management\ncareers, how well they have done at the point, the previous jobs or previous\nprovisions and the same company. And then the third piece is making sure that the management team\nthat is there is the right fit for that company. So having a manager that is\nconveniently focused on growth for a more mature business that really needs someone that is\nmore operationally focused might be a great match and having someone that is purely operationally\nfocused for the business that is a little earlier in its lifecycle. So we're really, again,\nfocused on trying to make sure that we've got the right team or the right company at the right time\nand they have a history and an opportunity to execute. So that's interesting. So you could be\nexcited about a company's financial metrics, but maybe not excited about the management team.\nAnd if there's a shake up or a change in management, would that take something off of kind of\na no-fly list and put it on a fly list for you? Yeah, absolutely. And the top and the number of\ntimes where we have found a business that we are interested in, but they have a alignment of interest\nwith the management team. And then oftentimes that'll be, you know, either the wrong CGO in place\nor the station structure. And when we'll see that change, you know, you bring in a new CGO\nand change just as the current compensation structure is being focused on getting revenue or earnings\ntargets. And then, you know, things like return come on whether it's trying to get to get over\nturn on equity, etc. And we'll be able to re-evaluate the decision that. Yeah, that's interesting.\nSo you talk about risk management being paramount. You know, I could, how are you quantifying\nwhat the downside risk is? Like through kind of fundamental analysis and, you know, obviously\nlooking at management, like, how are you identifying and quantifying the risk of the downside?\nBecause it's, it's a lot easier to be optimistic, I think, in finding what the growth\nopportunity is, but sometimes the other side of the equation is a little bit more difficult.\nCan you talk about that process a little bit? Yeah, and this really goes back to Jan and\ntoday, that our grander said, our days and our grander said that the business that we should\ngroup. We look at it in ways and it will change somewhat depending on the business that\nit's a good looking thing. So let's take a thoughtful company as a friend. And it, there's\nthose business models that change somewhat over the last decade. But, you know, if you think about\na software company, we'll look at the component of a return rate of debt. And just say,\nokay, let's say, you know, their new product growth goes to effectively zero and we've got\na renewal, but it's a return rate. You know, what does that look like if we just\nsort of look what they've done into the future? Or, you know, we've got hundreds of examples that\nthose types of software business tend to get bought for somewhere between three and five. They're\nmaking a structure. So that's an example. We'll look at, in a way, we will take their own book\nand do a part in a category by category. So we'll look at, you know, the mortgage side of the\nwhat the commercial real estate side of the business look at historical periods of recession.\nAnd, you know, what the values and loans it went to during those times, stress.\nWe do, you know, LBO and now we will do, you know, some of the parts now. We've literally\nlooked at shipping companies where we said, what is this, you know, what is, what's their fleet\nworks in secondary market during the time that's stressed, you know, what's worth the\nso really hitting on these from a number of different angles. And oftentimes, you know, the\nreality is that at your point, the upside may look extraordinarily attractive, but from our perspective,\nthe downside is just too great or we can't quantify it and therefore we won't invest.\nYeah, it's an extremely interesting process and completely well thought out in design. I\nmean, I talk to a lot of ETF managers and you guys are definitely taking kind of the extra\nstaff of really looking at demand and looking to see what the downside risks are. I'm curious,\nwhen you start to identify, you do, you run your whole process, you find, you know, your investment\nselection, how are you then compiling the portfolio in terms of position sizing? It's not equal\nweight. Is it? You're putting, you're kind of moving chips around and overweighting some things.\nAnd maybe underweighting some others? Yeah, you're right. It's not equal weight. And so we use all L\nSQL that we work to race ratio that I'm visioned. We use that in order to size positions. So\nfor example, the greater the asymmetry and the versus downside, the larger the position size\nto a three percent person. So the way to think about this is that, you know, over time,\nthat is a talk goes up and we work to risk ratio. We'll use that to cut that decision.\nAnd then we overlay that all L SQL, but we overlay on top of that. We have a proprietary\nrisk management model that that we employ to help help them understand and putting those different\npositions together. And we say an analyst job is paint perfect stroke on a piece of\ncanvas. That's portfolio manager. It's our job to make sure that we have a picture that\nmakes sense. So part of this model is fundamentally driven. We look at all the revenue and earnings\nassociated with all of our businesses and break those down based on one of those things like\ncyclicality and markets, etc. And then we aggregate that data and stuff. So we have a holistic\nview of risk. So the combination of overlaying on top of that that rewards risk ratio.\nSo when does MGMT have an, I know it's an active ETF, but does it have a set revenge schedule\nwhen you're kind of rerunning screens and reposition sizing, or are you guys doing everything\non the fly over there and things could change day to day?\nYeah, there is no set revenge schedule. The rebound thing occurs purely when we're\neither behind or selling positions on a position by position based.\nSo when you guys are out there talking to RIAs or advisors or institutions and they have kind of a\nmodel portfolio framework already existing in the firm. Where are you positioning MGMT as a\nholding to kind of encompass or fit in that overall model portfolio?\nSure. So it's really two things. Either A is a replacement to Pantos ETFs and a lot of\nmany of the ETFs out there within that our competitors trust or either something\nor quantitative or just peer-prepared. And we are part of the fundamental one.\nAnd I think it's something like this where there's a lot of uncertainty that that's where\nreal value comes in play. And the other is just purely in allocations.\nWe've seen over the last 10 years the large cap growth is basically dramatically\nperformed a small cap to you. And our perspective is that the next 10 years is unlikely to\nlook like the last 10. And that one should have a justification to talk about you.\nYeah, no, I would agree with that. And having experience in both the SMA world and the ETF world now,\ncan you talk about just how you see the sales process differently for maybe going out and trying to\nhave an advisor utilize your SMA versus having a publicly traded process or a publicly traded\nproduct and getting ETF allocations is the sales process. The same is a different,\ncan you talk about distribution a little bit? Sure, I would say it's very different. Within the SMA\nworld, particularly on the institutional side, we had historically focused on that is very\nconsultant. So the process is to get approved by the major consultants, you know, the\ncount lines and broad tools and anything to use of the world. And the process in and of the\nself they can take years. But once you're approved there, then you're able to get included in searches\nanytime there's a movement, you know, a public plan or a corporate plan needs to replace or\na manager, you know, you're able to be included in those searches. That's a different one.\nWe've learned within the ETF space and much more driven by, you know, the heart of both the\nfunders, family office, etc. It's just much more hand-to-hand and you, you know, there's the process\nof building your brand and getting your name out there. But also just a huge effort through\nour partners at Skypoint that just hauling on advisors every day. Just trying to get them up\nto speed on the story and they think requirements will have more content. Watch the order content,\nour letters for the ETF and being much shorter, much more often. And it feels like it's much more\nof a volume. Yeah. Yeah, no, I couldn't agree more. It seems like running an ETF these days,\nyou've got to be front and center almost every day and getting that brand recognition. But,\nyou know, Reagan, I really, really appreciate your time. Very interesting product that I think is\nwell thought out. I think deserves a spot in that model portfolio process. As you said,\nespecially with kind of the environment we may be entering in here over the next, you know,\nnext few years and next decade. But before I let you go, where can people learn more about\nballast, where can they learn more about the ETF and get all the information on your firm?\nSure. So you can learn more about the ETF at mgmtetf.com and you can learn more about the\nballast at the B.A.L.L.A.S.T.A.M. dot com. And we put down all the material that we write,\narticles on the funders and I did those two websites. So I would encourage you to go there first.\nVery much appreciate you having us on the call and I will tell you where I'm always told people\nwant to ask me to put some up. It's just a little bit of single sentence. We are the farm that\nlooks both ways when we cross the one way street. That's perfect. We'll Reagan again. Thank you\nso much for your time. I appreciate all the information and hope to have the opportunity to meet\nin the future and learn more about you in the firm. Absolutely. Thank you, Brad.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}