{
  "id": "13946987",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nToday we have Yuri Kojermirion.\nHe is the portfolio manager for the Tema Monopolys and oligopies ETF, Ticker TOL.\nA fascinating product, extremely well thought out.\nI loved my conversation with Yuri talks about how they go about picking the certain companies\nthat sit inside their ETF.\nWe talk about portfolio management techniques.\nWe talk about risk management.\nWe talk about diversification.\nAnd Yuri has a lot of great information, and I think that you will really enjoy this conversation\nwith Mr. Yuri Kojermirion.\nYuri, welcome to the show.\nBrad, thanks very much for having me.\nSure, so can you tell everybody before we get started just about your background and how\neventually you got into the position that you are today?\nYeah, absolutely.\nSo I guess I started my career in finance and investing back in the depths of the financial crisis.\nSo my first job was July 2009, actually applied for lots of jobs in the middle of the financial\ncrisis, had a job offer from a big bank which I want to name, and then basically said no\nand they're kind of regretted immediately because on Friday,\nLehman Brothers went under and pretty much the whole financial world ended.\nBut I was determined to get a job in finance, particularly investing.\nI was obsessed with stock market and picking companies and I was reading about it all the time.\nSo I applied and I got quite fortunate to end up at a place called Majedi as management.\nThey were kind of a young boutique starting 2002, spun out of a big asset manager.\nAnd very focused on kind of good long-term fundamental equity investing.\nSo I started my career as a sudden July, 2009, and middle of the financial crisis,\non a long short fund, focused on picking stocks across the globe.\nAnd yeah, I worked my way up, basically as an analyst for about four or five years,\napplied to trade, and then got promoted to run a fund.\nSo for about six, seven years, I ran a UK income fund together with my old colleague and co-manager.\nAnd we basically, you know, it was pretty successful fund.\nWe produced good numbers for our clients, and it's peak it was about $2 billion fund.\nSo that was kind of my training and finance really one place focused on stocks.\nAnd then I left Majedi and I got, you know, I always really like entrepreneurship and kind of\nfocusing on what I would call kind of trying to build your own thing and your own culture and\nall these kinds of things. Majedi was very much that kind of thing when I joined with\n20 people. So if you sort of needed anything done, you had to do it yourself.\nAnd so in that entrepreneurial journey after I left Majedi, I met our founder, Mordz,\nwho was starting 10 LATFs. And so we talked a lot, we connected on a lot of things.\nAnd I just felt it was kind of the most exciting place going on in the act of management and\nspecifically active ETFs. And so I joined, but a year ago, a few feels hard hard to believe as a\nyear, we've achieved so much. We've kind of launched five funds in the market. And we're really\ntrying to pioneer this space of active ETFs, specifically focused on, on be the interesting\nlong term structural themes. So that's a little bit of my background how I ended up where\nwhere I am. No, that's great. It's, it's actually quite similar to mine, although I didn't\nrun a credit fund. I did run a long short fund along the way. And so it's interesting that we\ntook kind of a similar path to get to a similar place. Before we jump into all the, all the fun stuff\nabout the strategy and the ETF, I always like to ask, what about your hobbies? What do you like\nto do when you're outside the office when you're not running money? Great question. So I like\nexercising quite a bit, used to do CrossFit. I think it's really important. I wasn't the\nsportiest kid. I picked it up much later in my life. And I just realized how important it is to\nkind of support your, you know, if you've got quite a cerebral draw, which investing is,\nyou've got to have a pretty sound body of which your headset's on. So I do quite a lot of that.\nAnd then I know this is going to sound extremely lame, but I probably a lot of people you meet here\nin terms of investors. They're just obsessed with investing. I mean, I basically every waking\nminute I can. I spend time reading. I read a lot. I try to read as widely as I can,\nbecause I think it's, it's quite important to read lots of things like fiction books, you know,\nfor loss, for all this kind of stuff that made up, not seeing immediately relevant to the job\nwith investing, but I think the wider you read the more interesting things you come across.\nAnd I think a lot of the best insights you can have are where interesting connections are made\nbetween fields that might look completely separate, but actually, you know, somehow get connected.\nSo I do that and I think it's kind of, that's pretty much always spent my time. I just, I just\nhad a baby boy as well. So that's also actually a lot of my hobbies are going out the window\nrapidly taking care of you. Yeah. You're, you'll, you'll find that eventually the sports\nonce they start doing sports or other things at that, then we'll take the majority of your time\non the weekends as well. But good for you and in congratulations, I did a short sting of CrossFit\nand who's in the best shape of my life. And then started working too much and got out of it.\nAnd finally, I brought myself back to to exercise and again, and I feel a lot better.\nYeah. But it's so important, right? Like, it's, it's just, it helps a lot. I mean,\nyou know, people will say this about CrossFit. It's, it's somewhere, it's just becomes addictive,\nright? And then you feel really terrible. And what do they say?\nHabits take about 60 days to form, right? That's the official statistics. So if you can hang on there for\n60 more days, it would be back on this one. I'm trying to make sure I stick with that.\nIt's never dropped within the 60 day window. Yeah. I get messed up. Like, when I start\ntraveling a bunch for work and then I fall out of it. And I just do a bad job of, if I go to the hotel\ngym and I'm like, they don't have everything I need. Now they're going to excuse and then I'll fall\nout of it. But, you know, it's that motivation, right? You've got to, it's like with a lot of things\nlife, like you've got to find what motivates you. For me, it was really what I liked about it is that you\njust show up, right? And you just, because you're addicted, you make that decision to show up. And then\nyou don't really have to do anything. Everything's kind of laid out in front of you. Or as a hotel,\ngym is just a, it's just an excuse to go to the bar, right? Instead of just spending time with the gym.\nThat's right. That's right. So we're here to talk about toll today, the activity management\nopportunities and all the copies or ETF. Before we get into the strategy, can you define some of the\nbarriers to entry that would classify a company to be in a monopolistic type position? Yeah,\nso basically, you know, monopolies are kind of interesting based, right? A lot of people associate\nthem with mode investing. But I think what we are trying to go for is it's probably like a harder,\nmore strong definition of what a competitive mode is. Almost a lot of the companies that we define\nas monopolies, the mode is, I would even describe as contractual, right? Like it's, it's so ingrained\nin the way this company's industry structure is built that it's written in contracts. And in many\ncases, it actually is in the case of infrastructure and some of the companies that we invest in.\nBut if you sort of try to dissect it, I think there are kind of five key sources of competitive\nadvantage for monopolies. I think the first one is non-replicable physical assets. I think, you know,\nthe more the world is moving to digital, the more people forget that actually physical assets are,\nyou know, what the makeup of the world and digital is sort of infinite, right? Whereas physical is,\nis finite and a railroad is a perfect example of that. There are six class one railroads in the\nUnited States, which is the large ones. There used to be hundreds or 180, I believe. In the 1920s,\nwe've gone all the way through mergers and bankruptcy's down to six. No one's ever going to build\nanother railroad in the United States. It's just going to be impossible. The permission is prohibitive.\nAnd so I think that means that you have this asset that cannot be replicated. So that's kind of\ngroup number one. Group number two is, is a classic kind of network effects. I think essentially\nis every user that gets added to the network creates more value for everyone who's already a member of\nthe network. Now, social media doesn't fall into that. We're going to get explained why in a second\nwhen we get on some of the other topics. But I think things like financial exchanges is a perfect\nexample of that. There's regulation around it, but also liquidity gets more liquidity and more\npeople trade it out of any of the more valuable it is to other people. Then we have high switching\ncosts, so places like medical devices, where switching some of these, in between competitors,\nis almost impossible. It's prohibitive and expensive in terms of time and training. So that's a really\ngood example of that. And then regulation, as I said, many of the monopolies are semi or quasi-regulated\ntype businesses, whether you think about airports or actually torrows like the ticker TOLL. These\nthere's a contract, the concessions often run 70, 80, 90 years. So this is the kind of arises\nwe're talking about when we speak about monopolies and lots of things can change in the world of\nother types of companies. But they're sitting on this concession and they'll continue to do that\nand a lot of the stuff is written into the contract. So that's the kind of regulatory part of it.\nAnd then the final bit is kind of economies of scale. So here we're talking about companies that\nessentially created so much scale that in the end they can produce the marginal costs at\nwhich they produce the product is really low and therefore no competitor can produce it. And a great\nexample of that is semi-conductor manufacturing, where we, you know, you have to reach a level of\nscale. And in this case we're talking about scale in the tiniest amount. I mean, I don't know if you\nread the word article about TSMC, but, you know, he goes and visits the fab and he calls it like,\nyou know, it's like seeing God. I mean, it's essentially, and there they produce so many\ntransistors that it's more than every factory's produced of anything ever in the history of mankind.\nAnd it's kind of mind-blowing, but that's the kind of scale that you need to produce transistors.\nAnd as I mean, conductors at good costs, in which case you beat your competition. And so each one of\nthese is, as you can see, kind of draws very strong competitive answers. Sometimes you have companies\nthat are both or a combination of the two where it comes particularly powerful.\nSo that's the one, yes, we're going. No, go ahead, please. No, I was just going to say the\none thing missing from that, which a lot of people often associate with most things like\nintangible value. And for us, that's just too weak of a reason for competitive answers. That can\nbe broken much easier than people think. And I think that's an really important point to\nto mention as well. What isn't them an opening? So what do you think generally creates this\nadvantage? Is it time? Is it first to market? Is it combination of both of those things?\nYou know, how how do these things come about, I guess, is my question?\nI think that's a great question. And it probably hits at the heart of why, you know, we get\noften asked like, oh, you know, aren't monopolies with evil and, and you know, surely it's a bad\nword. But I think the point is it's to actually look and study monopolies and understand why\nthe good ones of these have a risen and the way why they exist today. They exist today\nbecause they produced in many cases what we call a mission critical product. So it's really valuable\nto the consumer of that product or it was over a long period of time. And over time, this monopoly\nis created a lot of customer value by providing this product. So take the example of visa, right?\nI think it's known to spew that mass-card and visa between them control about 84% of the kind of\nnetworks payments business. That is a duopoly if there ever was one. But visa has created an incredible\namount of value for everyone in the ecosystem. Start with consumers, you know, the ability,\nand people forget this, right? You can just walk into a store and pay with this card and it's\ninstantly accepted. This is accepted. I think in something like 140 countries and there's only about\n150 countries in the world. So it's ubiquitous, right? And it's just created this value for consumers\nand for merchants as well, to be able to accept payments safely without fraud. All of this stuff\nthey've created and all they do is take a tiny little, as we call it, toll, right? And so that's why\nI think a lot of these other sources of competitive advantage all come down to this kind of thing\nwhere if you're a company that provides a mission critical product for customers and has provided\na ton of customer value over time, that's the kinds of businesses that over time will morph into\nthese source of competitive advantage and then create value for for consumers. And it goes across\nall of them, right? Railroads have created a lot of value by moving goods around. That's why\nit's consolidated as well. If you look at the stats, even though there's only six railroads,\nactually pricing continues to come down many ways in terms of real terms and it's a very competitive\nindustry against things like truck. I could go on with lots of different examples, but I think the\nkey point is mission critical, lots of customer value creates each one of these five different types of\ncompetitive advantage that then creates them an office that we see today. So that's what we think\nyou're not bad, right? They're not evil because they're created this value for customers.\nYeah, no, I agree with you. I don't, I don't, I think I look through the holdings. We can talk\nabout the holdings in a little bit, but these are not necessarily evil companies. They're long\nstanding quality companies that have significant amount of scale and kind of staying on that,\nthese companies that have gotten so big and have scaled so widely. How do they continue to\ncreate shareholder value, right? All we hear about now is tech tech tech and growth growth growth,\nbut there's a lot of shareholder value, these companies still deliver to investors and\nhow do they go about doing that and in all of your research by looking at them? I'm sure\na lot of them do it differently, but yeah, look, I think there's always a shareholder value\nis kind of to sort of defense and offense, right? In terms of defense, a lot of these companies,\nand why are we really like them? And why it's important to pick the right but not please.\nThey don't gouge pricing, they don't rip off consumers, they don't exploit their monopolistic\nposition. Instead, they take off some of those profits and reinvest it, a constant innovation.\nSo all the companies that you'll see in the whole things and the ones that we really like\nare ones that are sort of not resting on their laurels and milking their advantage,\nbut instead are constantly reinventing and reinvesting. You know, you take a big bet within\nthe fund, this information service companies. And right now what they're doing is going to\ntransformation service of AI and people kind of think about Nvidia and they think AI,\nbut actually they should be thinking about companies like Moody's that have enormous databases,\nthat are proprietary. You know, Moody says the biggest database of private and public companies\nin the entire world. That data is just beautiful for artificial intelligence,\nused over it as a feature and a layer and Moody's investing heavily in that. And that's the kind\nof thing that we want to see, right, creating value by playing defense and investing in your business.\nThat's part one. In part two is obviously these companies have because of their strong competitive\nposition, this highly recurring revenue base, a lot of this contractual kind of safety that's\nwritten into them, they just have pristine financials and often have very high returns on investor\ncapital. And as we all know, return on investor capsules is like investors and shareholders,\nfriend, right? It's essentially like the easiest way to make money in the market is you let companies\ncreate this value through high returns and keep reinvesting those returns over time and\npounding. But I think it's very, very important that quality often in the market is well known.\nBut the thing, the reason why I'm not really such a good investment is because of the durability\nof that return and that quality, all our time is spent understanding that durability. And I've\ntalked about the kind of 60, 70 year concessions, that durability creates a kind of a way for the\nfade not to ever happen because market is very conditioned on returns to come back to the cost of\ncapital. And for these companies, this doesn't really happen. And the market just cannot\nprice this properly. And that's why you see share price of these companies go up over time because\nthey're constantly kind of beating expectations of the fade in the market. So what I'm\nsaying would say is not enough to just buy high RYC companies where you need RYC companies that\nhave durability over time. So can you talk about the process for identifying securities that you're\nadding to the portfolio? I'm sure there's a screening process and some fundamental research that\ngoes into that. And so can you talk about that process a little bit? Yeah, of course. And I think\nthis hits at the heart of what we're trying to do at tema. We're really focused on creating a\nkind of a pristine, thematic universe for the companies that we look at. And if you look at a lot\nof our themes, monopolies being a good example of that, it's not easy to index or to to screen\nfor these companies, right? Like if I told you, give me a list of monopolies, it's actually quite\ndifficult to put it together. There's nowhere, I mean market shares one of the hardest numbers\nto find for companies. But even when you found it, it's a really true monopoly to have that position\nwhat's the competitive dynamic. And so you really need to kind of an expert, a person who's\nre-spending all of their time thinking, okay, what is the universe of monopolies out there?\nThere are different issues in our perspectives about what they are, but that's the main\nname of the game. So that creates your thematic universe, which we call a pure thematic universe.\nIt purely expresses the theme as it's written on the name of the fund. And then we apply\ngood old fashion from the mental equitynosis, which I've been doing for it all over a decade.\nBasically thinking, okay, what are the best 30 companies I can come up with in this universe?\nThen you might use some screens, you know, for example looking at balance sheets or other\nmetrics, but really what we're doing is good old fashion from the mental analysis. We usually\nand narrow down usually to a research set of companies and then we apply what we call\nkind of the four pillars of our investment process. So we look for companies that have strong\noperating bases, you know solid foundations of their businesses, good balance sheets and cash flow\ngeneration. And those are really really important those two factors. They really are the reasons\nwe don't invest in companies that fail those two first tests. And then we think about the upside.\nWe think, what is the valuation case here? And in my world of monopolies often, some of these\ncompanies are a little bit richer value than the market. And you need to really build a really\ngood solid valuation case. And then finally, what is our edge in this particular stock and investment?\nAnd that's a really difficult question of fund managers often don't ask themselves, right?\nAnd so we force everyone in the terms of the time of process to ask that. If you need all\nfour tests, then it's a security that can be part of the portfolio and enters the investment.\nAnd that's the kind of work we do. It's a lot of fundamental work, meeting companies, talking\nto the building financial models, working with reading the conference transcripts, all of that\nkind of good old fashion from the mental analysis. So by the time you're finished with your screen,\nwhat is the portfolio look like in terms of number of names? I think you might have mentioned.\nIs it 30? Did you say that? We tried to aim for a conviction portfolio without taking\nexcessive risks. And we can talk about risk management, which is a key tenant of of of tema.\nBut we look, we we try to aim anywhere around 30, 35 holding. So I think where you can express\nclear conviction of the portfolio. I don't think we'll ever go about 50 or 60, but they're\nmight be cases where it happens. We won't all go below 25 holding. So that 35, 30,\n35 is a pretty sweet spot for the funds. And how often are you adding or removing names from\nthe portfolio and rerunning the screen? Yeah, a great question, because obviously, once you've\nidentified them in order to surely get someone to believe forever, I think valuations change.\nWe're very cognizant of the valuations of some of these companies. I would say you probably\nwould expect the turnover of the fund to be anywhere between 15 to 20% a year. Maybe a bit less.\nMaybe 10. For some of our other funds, it's higher. I think that a lot of that has to do with,\nyou know, we build our thesis and investment case. And if it plays out and we feel that the stock\nis fully valued and the potential has been expressed, then then we'll sell it and replace it with new\nideas. And I think that's really important, right? Because you want to constantly have competition\nfor capital, your portfolio. So you have your thematic universe, which is runs in the hundreds of\nstocks. And is that every, are those the 30 best monopolies out there at any particular given\npoint in time and the 30 best valuation cases that you can, you can put together? So we do that.\nAnd then we do quite rigorous risk management. Sometimes that means you might chop and change names\nif there issues that arise. So we watch a lot of risks, very, very careful here. And that can\nlead to a sell as well. Well, let's talk about that. Because there was one of my questions on the list,\nbut it was a little lower. How are you, one of the pillars, obviously, is risk management.\nSo are you looking at risk management from a valuation case? Is it from a bad news case? Is it\ntechnical? Or how are you guys defining an employing risk management within the portfolio?\nYeah, it's extremely important. And I think the reason we've made such a big deal about it is because\na lot of people in our industry don't take risk management as seriously as they should. I think\nit's definitely not great in a lot of active funds, especially active ETF funds. And we've made\nit a big deal. And my philosophy on on risk management is it's kind of philosophy of jumping\nout of a plane with a parachute. If you jump out of a plane with one parachute, your chances\nthat the parachute doesn't work is like 0.01%. But if you jump out of a plane with two parachutes,\nit actually multiplies the probabilities. So 0.01 times 0.01, which is a much, much smaller probability.\nAnd that's how we try to think about risk management. Multiple layers of risk management means\nthat you're always, you're reducing the probability in a multiple good way. So it starts with\nthe security selection, making sure that for example things like balance sheet are solid for the\ncompanies that we invest in. And I'm talking about balancing the broadest possible sense. And\nI, you know, a CIO, I obsess about this because getting the balance sheet wrong in a company\nmeans a permanent impairment of value of the equity. You're never going to get it back.\nYou know, we've seen that with many examples. We work being the most prominent example this week,\nbut it happens all the time. You know, it's Silicon Valley Bank. Get that wrong. You never get\nyour equity back. You know, proper warnings, margin resets. You can get your money back. And so we\nare just always a really cognitive of that. And then you have kind of the portfolio construction\nprocess, which is an interesting way, you know, idea that we've put together, which is kind of having\nthree conviction tiers of physician size. And that controls your highest kind of position size,\nbut also make sure you don't have the behavioral biases that risk management often needs to\nkind of counter that makes sense. And then we have lots of different checks. You know, I said\ndown with the fund managers every two weeks. We discussed the portfolio. We make sure is either the\nworst thing is taking risks that you don't think you're taking. And make sure that we won't\nknow all the risks we're taking. And to make sure we're happy with the risks that we're taking.\nThat's the kind of philosophy that permeates. And then we have a lot of the modern kind of tools\nin terms of risk models to try to understand how these portfolios will behave in different environments.\nRemember, we're running 30 stock portfolios, so they can they can move around. And so it's really\nimportant to know if another crisis happened, what happens here before you? How do these stocks behave?\nAnd we run all kinds of analyses to do that every quarter to make sure that portfolios are sound.\nYeah. So when you briefly touched on waiting, how are you going about waiting your 30,\n35 holdings inside the portfolio? Are you doing that? Is it via market cap weight? Is it company\nsize? Or is it you guys deciding where you're kind of placing chips on the table? How is\nhow are you going about your waiting decisions? Yeah. So one of the first things I did when I joined\nbefore we launched the funds or hired any portfolio managers sit down and think about the investment\nprocess. And one of the key things that we wanted to focus on, especially with this idea of risk\nmanagement is his position sizing. And if you look at the literature and I spent a lot of time reading\nand talk to a lot of market participants, you realize a couple of conclusions. First, a lot of people\ndon't think about this problem at all. They either go for a very mechanistic approach or they\ngo for a completely free for all approach or the financial decides. And too, if you actually read\nthe literature, you realize that there are just lots of really interesting rules that show how\ngood portfolio should perform in terms of its sizing and how what are some of the pitfalls that\ncan happen. There's a lot of behavioral science behind this as well. And so we did all of this work.\nWe talked to multiple multiple participants in the industry, read a lot of academic literature.\nAnd we came up with a process as a little bit of a middle ground where we have three tiers of\nposition size moving between the tiers is a conviction decision. So we have the highest conviction,\nmedium conviction and sort of entry position as well. And that means that you have a minimum\nposition size, which is very important from a behavioral perspective. People often have little\npositions that don't really impact the end investors outcome, but are there because, you know,\nthe farm manager feels comfortable. You also have a maximum position size so you don't take\noverly confident risks as well and keeps you cognizant. And then you move up in between\nas you make trades that are substantial trades if that makes sense rather than sort of moving\nlittle tiny bits that don't really impact the decision. But then this framework works really well\nand it also has that active systematic rebalancing approach where you essentially, the\nfund manager makes a decision but they're always thinking about rebalancing the right time rather\nthan rebalancing in a mechanistic way. And this is what we found. We've been testing in the market\nin lots of the models and it works really well. Fund managers is like the structure around it because\nit gives you this kind of risk management approach. And the reason for this is,\nfrom the mentally active management is really good in general. The good fund managers are good at\npicking stocks. They're not that good at sizing the positions. So you need some rules and guidelines\non sizing to make sure you harness that stock picking alpha in the funds.\nSo if you have a high conviction position and that position works for you,\nyou're then going to go through a rebalance to pull that back. And that's done randomly,\nquarterly systematically. Maybe you expand on that a little bit more.\nYeah, so exactly you don't, it's kind of like guideline rules, right? So if it's drifted above\nthe weight that it's supposed to be in the portfolio based on this conviction, the highest conviction\none, that is a marker for you to be like, okay, this position has gone up. Should it is the risk\nreward still valid within this portfolio? And what you find is the rebalancing is not at a set\npoint in time. It's more of a sort of, I would call it like event based, but anywhere between\nthree to six months, you want to be looking at and thinking about that. That is the optimal rebalance\nfrequency, by the way, which is a happens in the literature. So what we do is every quarter, we sit down,\nwe look at it and we say, okay, has this, you know, I sit down with the fund manager and be like,\nhas this gone above what you think is a right risk reward for this particular stock. And you\nmake that decision at that particular point in time. It's active management within kind of what\nwe call guidelines. So it's different to a completely systematic approach where you have to\nrebalance every six months. It works well because sometimes you don't want to be doing, you know,\nselling that particular position. Equally though, it counters ideas that people should let their\nwinners keep running because in truth, if you look at the most successful fund manager, the\ngeneration of alpha and really good ideas is about a 18 to 24 month life. And so you don't,\nand I think that's important to say because you don't want to be scaling positions up at the time\nwhere the ideas probably pass its best point. Sure sense. Yeah, no, it makes a ton of sense.\nSo kind of last question around risk in portfolio would be, how are you diversifying the portfolio\nin terms of industry or sector concentration? Is there guidelines around, you know, how much\nyou'll put in a specific industry or sector? So all the portfolios are built bottom up. So I think\nit's very, very important that the individual equity stand on their own ground and our ideas that\nthe fund managers really like and want to own. And then what happens is obviously that spits out a\npie chart of industries geographies, currencies, market cap bands, unitment. And what we do is we just\nmonitor those extremely carefully. And that is where the CEO oversight comes in, where we sit down,\nwe talk about it and we say, okay, you're 20% in financials. As are you happy that you're taking\nthis kind of risk at the top down level. So it's a kind of security selection from the bottom up,\nrisk management from the top down. And I think that that works really well because all it does is\nit means I pose personant questions to the fund managers and ask them, are you sure you want to\nbe taking this risk? And also it illuminates risks for people. And we cut the portfolios in\neverywhere you can imagine. You know, including proprietary ways, different subsector allocations,\ndifferent risk profiles that we've identified, interest rates, macro environments, you name it.\nAnd it's always the conversation is, hey, your portfolio is too exposed to, you know, it's\ncorrelated to the long bond yield. I assure you want to do that. Maybe you want to diversify it a\nlittle bit. And that's what we're trying to do. But ultimately the security selection comes\nfrom the bottom up level. So it's a more of a question. After you've picked the portfolio,\nthen it is in the process of picking the portfolio. Yeah, that makes a ton of sense. So when you're\ntalking to potential investors or, you know, RIAs, like when you're looking at their model portfolio\nconstruction, where are you recommending the toll fits inside an existing model portfolio?\nYeah, again, a great question. Look, I'm going to give you an, you know, it's it's the\nmatic investing. So often people think, oh, that should be in a satellite allocation. But the,\nbut the truth is, these are really good high quality long-term durable businesses. And in many ways,\nswitching in a core allocation or part of a core allocation, especially, remember, the toll\nportfolio is a global portfolio. So it invests overseas as well. It, it's a high grades your portfolio\nin terms of quality and long-term durability of it. And so we're often speaking to clients and,\nand a lot of clients are, are very open to this idea that, hey, this actually makes a ton of sense,\nright? I've seen a lot of success in terms of people taking US exposure and adding a quality\nfilter or factor. If you look over very long period of time, you know, going back to the 1920s\nand it's a great paper by a QR, where they analyze different factors. A quality factor in equity\nis global equities and US is one that works in almost every single environment over a very long\nperiod of time in and out of sample. And so we think that is that, and this is a very\nquality for you, but this is a subset of quality for you that has a lot of durability built into it,\nbecause it has this innate building, those who's kind of keep fighting the fate of returns. And so\nwhere we're often having these conversations where we're saying, you know, you're probably your\nown SPY, you're actually, and you're actually own seven stocks, right? Let's be real here,\n30% of that portfolio is those seven stocks. Are you a stock record? No, okay, should you be\nthinking about diversifying your allocations to something else? How about some international?\nHow about high grading the portfolio? And we go down those two avenues, and that's where we're told\nfits. Yeah, when I was looking at kind of the whole thing's portfolio construction,\neverything you guys do to me, it seemed like, you know, large quality, large value,\nlike that sleeve of the portfolio made a ton of sense. So I, I kind of position it that way,\nor I would position it that way. But Yuri, this has been really fascinating. I really appreciate\nyour time before I let you go. Where can people learn more about you? Where can people learn more about\nTamah and your ETFs? Yeah, so the best places obviously are our website. So if you check out\nTamahetf.com, this is a ton of information, I think for we've written a lot about different things\nand our different themes. So in the inside section, there's also interesting things and there's\na fun page is there. You can check out toll to your LL. It's the ticker and there's some of\nour other funds as well, which are, I think, a really unique and interesting theme in terms of\nthe purity of expression of theme and just the level of expertise, you know, people with 20,\n30 years of experience investing in the market with a really consistent investment process.\nAnd that's that's where you can find information. And again, Yuri, thank you so much for your time.\nIt was a pleasure meeting you. Great, Brad. Thanks very much for having me.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}