{
  "id": "13990413",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nToday we have Andrew Chan and he is the founder of Procure Asset Management.\nAndrew has a ton of experience in the ETF industry, and today we talked about his two\nproducts that he has brought to market UFO, which is a space exploration ETF\nin invest in the industries which make space in space travel in space technology.\nAll possible even as simple as me delivering this podcast to you over the internet.\nWe also talk about his other ETF fixed FIXT, which is a disaster restoration ETF.\nI really enjoyed my conversation with Andrew.\nI think you will too, so without further ado, please welcome Mr. Andrew Chanon.\nAndrew, welcome to the show.\nThanks for having me.\nSo before we get started, it's always helpful if I can tell everybody a little bit about your\nbackground and how you eventually came to found Procure Asset Management.\nWonderful, so some time in college I realized I wanted to be in the financial industry,\nand had a focus on finance for my major at Tulane University, and actually showed up at an\ninterview for an interview that I didn't have.\nIt was right on Broadway, downtown New York City, a couple of blocks from the New York Stock Exchange,\nand it was for a position to work at a company called Kelliger, who at the time had the largest\nETF specialist trading unit on the floor of the American Stock Exchange, where essentially you are\nmost of all the ETFs were being listed at the time, and ended up getting the job out of all the\npeople that actually did have the interview lined up, and it became fully immersed in the world of\nETFs, and so starting off as a clerk on the floor, working my way up, to becoming our lead market\nmaker for international and global equity ETFs on NYSE ARCA Exchange, as ETF started transitioning\nto ARCA, started trading those upstairs for the company, eventually was poached by another firm\nthat also especially was trading business, but was actually looking to build out prep trading\ndesk, and they had no experience in ETFs, and they brought me on to help build out the ETF\nprep trading capabilities. From there, made a lot of relationships with various players in the ETF\nspace, across the issuance side, as well as just your various service providers, and eventually\nhelped create a company called SureShare's, which went on to sponsor 10 first-to-market ETFs.\nLater on, I ended up meeting up with industry legend and veteran Robert Tall, where we decided\nwe wanted to build something where we could own and operate our own infrastructure, not only bring\nout our own ETF ideas that we had, but also potentially helped third-party is also looking to\nbring their 30 ETFs out to market, and what better way to create a flagship fund for a company\nthan coming out with something first-to-market that we believed was very relevant timing-wise,\nand if something that we thought we were still in the very early days of that industry,\nand that brought us to bring out our first product being our UFO career space ETF.\nI want to come back on that, because there's some things I want to ask you about\nwith regards to why you decided to build your own infrastructure, but before I get too serious with\nthese, I always like to ask, what do you like to do outside of work, any hobbies, any interest,\nwhat do you do when you're not behind the desk? Family is certainly important. They're going to spend\ntime with family, and friends is wonderful having grown up in the New Jersey area, and having\na lot of friends that have stuck around, that's wonderful getting to stay connected with them,\nbut just certainly love shooting hoops, whether it's playing horse or just shooting around\nin the driveway, getting back into tennis, such as it's been a lot of fun, and if you're not\nall my local sports teams, it's certainly passion as well. Yeah, that's great. I won't be shooting\nhoops with you. I think I would shoot like 5% from the free throw line. As a former hockey player,\nthere's no worse basketball players in the world than hockey players, so I had my fair share\nof us talking and playing in a roller hockey league as well, so it's certainly starting to grow\nup. So let's go back to starting your own infrastructure. When we came to market about a year ago,\nwe obviously had a plethora of opportunities to kind of work with a lot of the white labelers.\nWhat was your reasoning behind going your own route? It definitely takes longer. It's definitely\nmore expensive, but for somebody with so much experience in the ETF business, why did you think\nthat that was just a better route? So there is a lengthy, federal rolling in Southern District of\nNew York related to my experience as a white label client. Unfortunately, the judge ruled that\nessentially our products were stolen from us. The risks of that, the learning experiences from\nworking, not saying that every platform is going necessarily do that, but having had the experience\nhappen to me was something that I couldn't look back and put myself in the same position and being\nable to build our own infrastructure. Certainly we do outsourced the Ovarious roles portfolio\nmanagement and others, but being able to have the time exempt of relief, having our own separate\ntrusts was something that was really important to me and having someone as experience as Bob\nTall, which helped build what was essentially the predecessor to I shares as well as having launched\nETFs, numerous countries around the world working with Barriers, regulators and exchanges to\nhelp them build up their own capabilities to open up their markets for the ETF industry. We had\nall the skills that we had all the knowledge needed to be able to do it on our own and it really\nmade sense, especially given the first experience I had. Sorry to hear about that. We thought\na lot of the same things as well as we wanted ownership over the firm and the brand and the\ninfrastructure. I think it goes a long way, especially for somebody who wants to get additional\nproducts out to market quickly and own that process. Let's talk about procure. Is the firm\nsolely an ETF issuer? Is that what you're doing? You're also going to try and get into helping\nothers launch their own ETFs. In our early days, we actually did have a separate trust. One\nthing that we thought was important for us was delineating between partner products and proprietary\nproducts. The first to go at it, we had a fully separate trust where we helped a third party\nbring their idea to market. Fortunately, they didn't want to continue supporting the product\nin under a year having after having launched it. We ended up winding that product down, but we also\nhave our own proprietary trusts where we launched our own procure branded products off of. That's\nwhere we have currently our first procure branded ETFs. Having that delineation is something\nthat also provides you a partner with a certain level of trusting confidence as well.\nAnd not all providers do something like that. I think we were kind of in a fairly unique spot\nthat would give in a pretty vast experience as what they will clients. My partner Bob told\nit actually do one of the individuals that helped build that platform that our company and\nfirst company ended up sponsoring products on. But you have certainly there are risks to everything.\nWhether you go at it alone, you know, certainly you'll hear people talk about the time\ntakes to get to market the costs associated with it. The knowledge that's needed experience\nexpertise. You know, it's not for the faint of heart. It's not for someone that just wakes up\none day and says, hey, I've got an idea. I want to build this out. But when you truly have the idea\nof being able to, you know, hey, this is what we want to do. This is where we want to be in, you know,\nX amount of years. It's not just a one-off idea concept that we want to see out there and see if\nit succeeds. But if we want to build a business around this, that said, you know, procure AM,\nwhich is our RAA, where we assure ETFs through is one of the wholly own subsidiaries. We need\nthe procure holdings on Braille. So we also do things beyond that, including IP as well as consultant.\nOkay. Great. It's good to know. So let's pivot to the procure branded ETFs.\nTalk about UFO first. First of all, great ticker. You know, at a high level, can you talk about\nwhat that ETF is, what it does, and what it's trying to accomplish. Absolutely. So as mentioned,\nyou know, when you're bringing out, you know, a new company, a new brand, a new identity into the\nmarket, it's important to be able to differentiate yourself. And one way I've been able to do that\nhistorically is bringing out concepts that are first to market. And, you know, in most cases,\nthese have fallen in the vein of thematic ETFs. The first, you know, I'd say large scale success\nI had was back in the piercers days sponsoring the world's first cybersecurity ETF. It's seeing\nhow that became a major theme that many providers now have at these days. And so UFO was an idea\nthat, you know, we are in the early days of the space industry. There are now many,\npublicly pure play as well as diversified space companies that are accessible in the markets.\nBut also some of these transformational changes that were occurring simultaneously in the industry.\nMost notably the advent of reusable rockets. And although SpaceX isn't a publicly traded company,\nthe idea that launch costs can be driven down significantly with something that was\nopening up the space industry for all different types of players, whether that be customers,\ntechnology, inventors, governments, militaries companies looking to do R&D, it opened up the\nplaying field. And expanded, you know, the use cases, capabilities and costs of accessing space.\nSo for us, it was an opportunity that had finally matured to the point where people could get\ndiversified exposure to many different companies that were doing things across the industry.\nAnd understand that the industry is, you know, inherently risky.\nYou know, it's a tough industry. Not every time you launch something, is it successful.\nYour companies can have setbacks. But it's also a very, you know, important and critical\nindustry these days. So governmental line, militaries rely on companies rely on it.\nAnd it's something that is ubiquitous in our everyday lives. You know, anyone walking around\nwith a smartphone is relying on space technologies and capabilities. This interview that we're doing\nright now wouldn't be happening without space capabilities. So I was telling that, you know,\nI think people were starting to wake up to how important space was. And we wanted to be there\nwith specifically fund utilizing the syntax. And that was, you know, a pond meeting the team behind\nthe index was something that gave us your truly the confidence that this industry and that this\nproduct was ready for its debut. Yeah. So the, the ETF isn't just holding, you know,\ncompanies that are sending people to Mars or the Moon, right? So there's a lot of industries\nin companies that are needed to effectively, you know, make space exploration and make\nservices like this available to us. Can you talk about some of the different types of\nindustries or even companies specifically that, you know, are in the space and how they are,\nand the types of services that they're providing to make these things possible? Right. So,\nyou know, there are many different companies, companies from around the world, very few companies,\nyou know, compete identically to other companies out there. You know, it's not, you know, many\ncompanies don't just have one singular focus with space. You know, maybe starts off that way,\nthey branch beyond that. For the index, which I think it's important to mention the,\none of the co-creators of the index and individual by the name of Michael Walter Range\nwas a former director at the Space Foundation. While he was there, he helped develop the model\nthat is probably the most widely used in, and looked at model for determining the size and\ngrowth of the space industry utilized by people around the world. And so that is your part of\nwhat drives the, um, the space report from, from the nonprofit space foundation, and they still\nuse the other various inputs that he developed for that model today. So, um, you're being able\nto work with a space expert background after physics and space policy, having just worked heavily\nin the industry for years, um, and truly understood the industries, the technologies, the players,\nthe policies, the, you know, highest level to the lowest level on the industry was really important.\nAnd, um, in order to be able to call the fund, you know, based on the names role and whatnot,\nfor your space ETF, you know, one thing that had to be demonstrated was that at rebound,\nat least 80% of the portfolio was folks on companies driving a majority of their revenues from space.\nSo, that is one of the critical drivers for companies that can go in and out of this index.\nSo, certainly certain market cat minimums daily liquidity, daily value traded,\nour metrics that are in there, but really at the core is looking at companies on mature stock exchanges,\nat derive a majority of the revenue from space related to business entities, activities,\nservices. But also realizing that when you look at the broad global space industry,\nyou have these major players that are, you know, more diversified, think you're, you know,\ndiversified aerospace and defense names, um, you know, lots of times they're referred to as\nyour primes and the industry, um, realizing that they are major players in the industry,\nit didn't necessarily make sense to exclude them, but it also didn't make sense to have necessarily,\nyou know, a market cap weighted play because in some cases, you know, it's less than 50%,\nbut, you know, greater than 20%. So, it made sense for them to have, you know, a position\nin placement in the index, but only up to 20% at rebalance of the underlying index can be\nin these more diversified space names. So, ones that are still generating significant revenues from\nspace, but maybe that's not the majority focus of their business. So, what you're left with are, you know,\ncompanies that are launch companies, satellite manufacturers, satellite operators, um,\ncompanies that help with, you know, connectivity communications, and it's actually a pretty wide range\nof companies and people don't necessarily realize all the different, you know, components,\nplayers and whatnot that go on to the industry. But, you know, also there's some more, you know,\nconsumer focused, um, types of names. So, you know, companies that are providing, um,\nyes, satellite, radio, satellite, television, and other types of communications also have\na potential ability to be able to, um, make it into the font. Got it. So, as a general question,\nyou know, we've talked about what SpaceX has done and making, you know, reusable rockets possible,\nand that's obviously going to lead to cost savings. But what milestones does the industry need\nto hit from a high level do you think to see significant growth in this industry?\nUm, meaning do we need just to SpaceX need to be launching more rockets? Do we need another SpaceX?\nLike what needs to happen in order for this to become really more of a mainstream, um,\ntype industry that's, that is growing and consistently, um, you know, providing\nbenefits to us on like a daily basis because it's very expensive to do these things. And so is it just\npure cost savings? Is it innovation? What, what does that look like? I believe that cost savings\nis possibly the biggest innovation for the industry. So, you know, before when it costs, you know,\nhundreds of thousands of millions of dollars to send you a kilograms worth of material space,\nit's not that, uh, you know, affordable for many people to utilize it. But if you get launch costs\ndown to, you know, the, the hundreds to, to thousands of dollars, um, you know, range,\nit truly opens up the market. And in the early days of the space industry, it was primarily\ngovernment's government agencies that were funding us. You think of the space race and\nthe early space program and, you know, the government's in government agencies and military's\nwere, were the major drivers. Uh, over time that's changed to, you know, roughly, you know, only 20\npercent is coming from government's government agencies around the world. Now, what we're seeing\nis a, a ramp up in this modern-day space race. And if you're paying attention to the news, um,\nyou know, it's impossible to ignore how, uh, intertwine space technology is with modern warfare. And\nspace is viewed as the, the strategic high ground for, for modern, global conflict. And so any company\nthat's looking, or any country that's looking to have, you know, a major presence in the geopolitical\nsphere needs to take space seriously. And many countries haven't put enough resources into it\nwhere they'd be relying on their own. So your space with, you know, this predicament of,\ndo I spend an astronomical amount of money in order to build out my, my space capability,\nso I don't have to rely on third parties. Do I find a contingency where either I lead that group\nbecause I have the most technologies and the most resources and allow other players that I feel\ncomfortable with to work alongside us? Um, do I not have that capability and I need to be completely\nrelying upon others to help us achieve our space, uh, endeavors and desires? Um, and that's,\nyou know, or do you just throw your hands up in the air and say, this is something that we can't do\nand get left behind. So, you know, there aren't a ton of options. Um, but what we're realizing is\nthe countries that are saying today, hey, we need, we see where things are moving. We need to have\na major presence. They're going to be forced to spend a tremendous amount of money. So where, you know,\nyou currently have this roughly 80, 20 split, um, you know, the government, you know, side is starting\nto pick up around the, the world on what they're spending. It's, it was not something where\nRepublicans are saying, no, we need to spend more, Democrats are saying, no, we need to spend\nmore space. It's pretty much, um, you know, agreed consensus, um, you know, on all sides of the\naisle that this is something that needs to be driven forward. And what's really pushing it is that\nadversarial nations are making tremendous strides forward. So you see what Russia is doing, um,\nyou know, their ability to, to launch, um, you know, having held hostage British, uh, satellites\nat the back of nowhere launch base and Kazakhstan at the start of the, uh, Russian Ukrainian war,\nwas you a one major sign pushing us in this direction that, hey, maybe you need to be more cautious\nabout who you rely on, uh, through your space capabilities. And certainly China has been making\nsome tremendous efforts forward, creating their own, uh, space station that is you're currently\nin operation, um, you know, allowing others as they see fit to be able to utilize them. But the next\nbig push beyond space stations that we're seeing is a race for the moon. And no one really knows\nhow countries will or won't operate once they get there. But once they get there, they will start\ndoing things. And so there's a, a new land grab, the moon is extremely strategic and they call this\nopportunity, the CIS lunar economy. And that's something that you look at what China's saying,\nthey see this, which is a multi-trillion dollar, um, industry over the next couple of decades.\nAnd that's just, you know, the CIS lunar economy alone. And so I think, you know, we saw\ngovernment and government agencies open up the door saying, hey, we're willing to allow\ncommercial players to really drive this because we don't need to own operate and be everything\nfor this industry. We can find companies that have the capabilities to allow us to achieve our\ngoals. And that's something that SpaceX has done. Um, so I think, you know, what we're seeing\nnow is government's really starting to ramp up and understanding the importance of this new space race.\nAnd whether it is riding alongside an ally or going at it yourself, uh, you know, the, the\ngrowing list of companies that are countries that have ambitions for the moon and beyond seem to be\ngrowing, you know, every month. And, you know, their timelines are very ambitious of as far as\nwhen they want to, um, go to or return to the moon. So I think, you know, it's very exciting. And that's\nfor that thing a lot of opportunities, a lot of contracting opportunities for commercial companies as\nwell. Um, but the more we can lower the cost of launch, the more potential clients that better out there.\nThat's really, I mean, it's really fascinating. I never put two and two together. How close space,\ntechnology was intertwined with defense until I recently heard Elon Musk say, you know, I could,\nI could pick a point on the map and I can land a rocket there, right? And you just think space is\nabout, you know, scientific discovery or, you know, exploration or navigation, but you don't really\nput two and two together that, you know, you could turn these rockets into, you know, some, some pretty\ndevastating things and, and use them in pretty extreme ways and that technology can be utilized.\nAnd so I actually didn't put that together until recently until I heard him say that. And so it's a lot\nof the spending, from just piggybacking off what you just laid out is, is it mostly commercial or\nyou seeing it mostly being defense? So, so most of, you know, the space economy for the last\ncouple of decades had been, you know, commercial. But it does appear that governments are looking\nto ramp up their spending. And you know, even if solely for the purpose of not wanting to,\nto be second place, you know, hypersonics, you know, an area that has, you know, use cases for space\nas well as, you know, terrestrial benefits. It's something that we're starting to see, you know,\ndecimated spending towards, you know, it's been, you know, claimed by, by many experts in,\nin the US defense department that China and Russia have leap from US hypersonic capabilities.\nAnd one of the best ways to catch up is to spend more, you know, do more research, do more testing,\nand, you know, create something better. You know, that's something that, you know, could, could unlock\ntremendous opportunities here on Earth. You talk about solar energy, being something that people are\nexcited about here on Earth. But, you know, the idea of capturing solar energy in space and beaming\nit, you know, microwaves down to areas down Earth, might end up in the long run, be, you know,\nthe cheapest way of doing it. But, you know, again, you know, until you get launch costs down until you\nget the technologies, you know, really, you know, firing and all cylinders, you know, it doesn't\nnecessarily make sense. But, these are, you know, longer-term plans that, you know, companies today\nare working on. So, I think, you know, the more we build out space infrastructure, whether that be,\nyou know, on the moon, or whether that be the space stations, you know, there are a lot of opportunities.\nI think that's what makes space so exciting. It's, you know, not, you know, no one company is identical\nto any other company out there. And, you know, governments are spending companies are spending,\nyou know, consumers are, you know, now able to access space if you want to, you know, spend a\nlot of money to do some space tourism. So, you know, I did the early days of space. We're very\nego-driven. Look at, look at what we can do, we're first, and now it's, you know, real applications\nwith, with real impact. And, you know, I think another important thing is when we talk about government\nspending money, typically people always, your folks on the waste, and, you know, that the money\ndoesn't necessarily get what you're hoping it does with space. You know, it's been shown, you know,\nmany times that, you know, space investment by NASA, you know, in many cases drives a lot of innovation\nand things that actually help us benefit us here on Earth, even if that wasn't the initial\nintention for why NASA is going off and doing something. So, we actually do, in many cases,\nwe plot a rewards beyond what the initial goal was for achieving some type of space, space accomplishment.\nWell, yeah, this is fascinating. I could talk to you about this for a while, but let's get back\nto nuts and bolts real quick on the ETF. When you're, so when the index is being constructed,\nI know you have 80% must, you know, have 80% of their revenues directed towards space or\ntheir spending directed towards space. Is that, are you just running a fundamental screen to find\nthese companies? How, how is the index, you know, kind of being constructed? Yes, so the index\nteam, you know, there's an index committee, they, you know, this individual, Michael Walter range is\nyou're constantly going through a database of companies that are out there, public trading companies,\nthey're sifting through the companies, the documents that determine revenues, you know, where they're\nbeing generated from if they're space related or non-space related, just a clarification, the\n80% rule is at least 80% of the weight of the fund has a majority of the revenue. So over 50%\nof the revenues coming from space. And then, so about how many companies are going to be,\nand it's a quarterly rebalance and a semi-annual reconstitution. There's been anywhere from\ncall it the low 30s, amount of companies in the fund to high 40s or possibly beyond at\ngiven time, but as we've seen some consolidation, as we've seen some companies get, you know,\ngo private or no longer beat barriers, liquidity threshold or market threshold. Some of them have\nalso been removed, but it's, you know, it's a living breeding index that's, you know,\nalways looking for, you know, companies that fit the qualifications that add and removing companies\nthat no longer need those qualifications to remove. Got it. So that all makes sense to me,\na number of holdings makes sense to me. How are you going about the weighting logic\nwhen the index is constructed? It's, as you said, you can't really do it market weighted or\nyou're doing it. Equal weighted is there's some active component to it. How are you waiting?\nIt's a modified market cap. So it does look at market cap. It has these two classes of\ndiversified or pure play. And the pure play ones are, you're looking at the market cap as well.\nI was the representative rank news drive from space to to meet those calculations.\nAnd so last on the CTF, when you're, you know, talking with investors or an advisor,\nwhere do you see this kind of fitting in a holistic model portfolio construction? Are you kind of\nbolting this on in a growth sleeve? Or, you know, kind of where would you recommend when someone's\nlooking at, maybe allocating to this fund where where it would kind of fit a holistic diversified\nportfolio? Yeah, no pun intended. I think for a lot of people, you know, viewed as a satellite exposure.\nSatellite actual satellite exposure. Selling that, you know, people have very limited exposure, too.\nAnd, you know, when I look at, you know, the theme of space, when you think about satellites\nconnectivity and communications, you know, I look at other industries that, you know, people are\nreally excited about that. They're, you know, whether it's a pure play TF that they're, you know,\ninvesting in or individual companies. And if some of these industries are things like, you know,\ncloud computing, 5G, internet of things, it connected devices, big data, AI, even in case\nblockchain and crypto currencies, there's a common thread. And that common thread is data.\nAnd that data goes from point A to point B. And, you know, many people don't realize that your space\nis this connective tissue. This, it's the, the toll operator on the digital data super highway.\nAnd so it is an absolutely critical industry that many people don't have exposure to.\nAnd when you do a comparison of other, you know, sectors or industries, you know, and funds\nand whatnot, you do a, you know, an overlap analysis, there's very little overlap with other\nfunds out there. So if you're looking to get the versified exposure to it, an industry that's\nabsolutely critical. And one that, you know, governments and militaries around the world have\nacknowledged that, you know, this, this industry, these capabilities are only becoming more important\nfor them as time goes on. You know, it seems like an interesting sleeve, whether it's, you know,\nan innovation sleeve, whether it's, you know, a very specific, you know, part of aerospace and defense,\nthis, you know, just a space part of it, which, you know, doesn't necessarily get covered as much\nby, you know, existing aerospace and defense funds. You know, when you're talking about building\nout the major infrastructure, you know, over this next decade that is going to potentially\nhelp pick the winners and losers on a, on a global scale over the next several decades, this, you know,\nlooks to, to be a really interesting, you know, industry that I think people, you know,\nmay want exposure to and, you know, by being able to play with diversification, um, you don't necessarily\nhave to put all your eggs in one company's basket. Sure. No, that's great. Let's, uh,\na fascinating product. Um, let's pick it real quick. You have one more ETF with, uh,\nticker F-I-X-T, if which is a disaster recovery ETF, really high level, can you explain what that\nfund does and, and, and the type of sort of industries and companies that are comprising it?\nAbsolutely. So, when, you know, you look at, you know, call it climate change ETFs. You know, a lot\nof them are, you know, tweets, uh, you know, renewable energy funds, or their low carbon funds,\nor their carbon credit funds, or Paris, or the line funds, but very few of them actually look at,\nyou know, the impact from natural disasters, or saying, hey, if we utilize these technologies,\nyou know, climate change may be reduced so we can save it planet. Well, that might not happen.\nWe might implement all these technologies and we're still going to have hurricane. We're still\ngoing to have earthquakes, volcanoes, you name. And this, I believe is the first fund out that\nreally looks at, you know, the devastating impacts and consequences for natural disasters,\nwhich we've seen the economic toll from natural disasters has, you know, uh, you know, over the years,\nit seems to be getting, you know, works. And, you know, there are things that you could do before\nnatural disasters. So there's construction, consulting, engineering companies that help you better\nbuild out new, new development in a way that's going to take into account, you know, different\nmodels, different, you know, risks of types of natural disasters, so you can build more hard and\ninfrastructure. Um, you have companies that help, you know, alert you, prior to an natural disaster\ncoming saying, hey, this is, this is going to be an issue. This is what, you know, you should be\ndoing. You have companies that during an natural disaster are helping in, you know, providing, um,\nyou know, data recovery of tracking and monitoring of companies that are helping actually put out,\nyou know, wildfires via helicopters or tracking the spread of wildfires. Um, so there, you know,\nor they're making the equipment that firefighters are using to help put out fires and things like that.\nAnd then ultimately after an natural disaster, you know, debates, you're trying to figure out\nhow do we rebuild? And so, you know, a lot of those construction consulting engineering companies\nare coming back in and helping rebuild. And, you know, this is something that, you know, I believe\nare really important, you know, industries, you know, when you think of natural disasters or\nmaking money, you know, when they're natural disasters, many people think of, you know, opportunity,\nopportunistic, um, price gouging, things like that. You know, what we see is, you know, this is a\nreally interesting basket of, you know, those companies are helping us in our deepest darkest times in need.\nSo, you know, you even have them, you know, the retail focus side, you have, you know, your companies,\nlike Home Depot, Lowe's West Farmers that are helping you, whether it's buying the ply with the\nput up over your windows before hurricane comes or you're buying paint and tiles and everything to\nrebuild your home. You know, it takes a lot of different companies that help us and these are\ncompanies that I think should be championed, you know, when these events happen. But, you know,\nyou also have the ability, you know, you know, similar to, you know, what they talk about in medicine and\nother areas that, you know, in ounce of preventions worth a pound of cure, you know, there are\nsteps that can be taken to help minimize the effects of natural disasters. You're seeing it with, you know,\nbuilding of, you know, canals and flood walls, things like that to help better protect, you know,\nvarious parts of infrastructure or developments and hopefully saving human life in the process.\nSo to me, it's a really important industry. It's one that I don't think people have necessarily\nconsidered as much, but as you see, you know, devastating tolls of natural disasters and also\nman made a man accelerated disasters. Some of these companies are helping there and saw the,\nyou're not too far from where you reside, the East Palace, the entrain derail,\nmen in Ohio. You know, there were companies that were called on with, you know, hazardous waste removal\nand things like that that are really important for natural disasters as well. You look at, you know,\ncountries that are going through, you know, attack and, you know, having their infrastructure\ndestroyed, you need major companies, you know, global companies, multinationals coming in and helping\nin those age recovery efforts as well. And, you know, in a lot of cases, companies within FIXT\nare ones that are being called went before disaster strikes in the middle disasters and after\nthe disaster's large stroke. Well, Andrew, both of these products, as you kind of point\nout are very kind of thematic and almost niche. I'm curious, someone with this much experience\nin the ETF space is you, you know, how do you view kind of marketing in the distribution of of these,\nyou know, what are the kind of steps you guys are taking to get eyeballs on you as a firm\nand these products individually? No, you know, huge effort is your opportunity such as the one\nthat that you presented us with today where we get to talk to, you know, individuals as well as,\nyou know, their audience about these unique products and where they may fit in and people's\nportfolios, why or how they may want to use them, you know, is, you know, for an animal opportunity,\nwe also on our website have different materials that individuals can look at, they come to our\nwebsite, sign up, we put out, you know, monthly newsletter on each of our products, and keep them\ninformed of any updates that come out regarding the company or the funds, they're certainly\nreaching out to advisors, you know, it's really important, but, you know, probably one of the best ways\nis, you know, these public appearance opportunities where we get to, you know, share this information\nand people let them know that these products are there and hopefully when they're ready for them,\nthey'll consider us. And so, you know, it takes a lot of different types of efforts, whether it's digital,\nwhether it's, you know, conferences, whether it's sponsorship, you name it, you know, all of them\nneed to be considered, but, you know, you never know which one's going to work, and I think\nmany cases, the other best opportunities, you know, letting individuals know that these funds are\nout there when they're ready, sometimes the media themselves, you know, pick up on these opportunities,\nthey say, hey, by the way, there actually is a space ETF, or, wow, you know, generators are really\nimportant, what kind of fund would you have generator companies and their fund, and yeah, you have\nsomething that's there waiting for them. And so, you know, sometimes early, I had the first, you know,\nAI fund, which was the big data analytics focused ETF that was launched back in 2015, and\nno one understood how important necessarily that opportunity may be. And now there's numerous AI\nfunds that are out there. So, sometimes, you know, we're on the early stage, and it takes people\nyou know, time to realize, you know, how important these themes are. Sometimes, you know, you have\nan event like where you have the first cybersecurity ETF, and two weeks later, the Sony\nbridge happens, and cybersecurity is all everyone's talking about. So, you know, we like to\nposition ourselves, you know, first-to-market ideas in, you know, ways providing very interesting\nexposures that people aren't necessarily able to to get the existing options.\nWell, Andrew, this was great, and, and thank you so much for your time, and before I let you go,\nyou mentioned your newsletter, where can people go, or, you know, articles and things,\nwhere can people go to learn more about you, your funds, and the companies all. So,\nProcureETFS.com, you can come, and you can see everything that we're working on at Procure AM.\nAnd, you know, if you want to reach out to us as well, it's got our contact information,\nyou know, shoot us a note, give us a call. I mean, we're always happy to talk to people that\nare interested in what we're working on. It really, again, I appreciate the opportunity,\nand what you're doing to educate individuals with what's going on in the space that it's\none that I've, you know, believed in for years, and, you know, it's incredible seeing the amount\nof innovation coming out of the exchange shared product world with this.\nWell, again, Andrew, thank you so much. I enjoyed spending my time with you, and hope to talk to you soon.\nThank you.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}