{
  "id": "14072045",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for educational\nand entertainment purposes only.\nWelcome to Behind the Ticker.\nToday we have on Matt Barry, he is the head of Capital Markets at Touchstone Investments, and\nas Matt puts it, they are distinctively active.\nThey have a handful of mutual funds as well as ETFs, all of which are actively managed.\nSo we talk about the explosion of active ETFs over the last couple of years.\nWe also talk about their manager due diligence process.\nEverything they do is sub-advised, so they have a very thorough manager due diligence process.\nWe talk a little bit about distribution, and then we talk about two of their ETFs, specifically\nheat, which is a climate transition ETF, and T-Sec, T-S-E-C, the Touchstone Securitized\nIncome ETF.\nSo without further ado, please welcome Mr. Matt Barry.\nHey, Matt, welcome to the show.\nHey, Brad, thanks for having me.\nBefore we get started, could you tell us a little bit about your background and how you got\ninto the position that you are today?\nYeah, so I'm Matt Barry.\nI run product management and ETF capital markets for Touchstone Investments.\nI've been with Touchstone, and also our parent company before that, for combined about 10\nyears now, joined after business school, and then Touchstone is about a $25 billion mutual fund\nmanager.\nSo historically, that's been our business as part of my time running product here.\nWe saw the writing on the wall as far as ETFs and continued growth of active ETFs.\nAnd really, that's where the pop was going, where we wanted to skate to.\nAnd so over the past few years, a big part of what I've been working on is building up the ETF\nplatform that we launched about a year and a half ago with our initial ETFs.\nThat's where the ETF capital markets came in as well for me.\nBefore we get into Touchstone and a little bit about what you guys do over there,\nI always like to ask any hobbies.\nWhat do you like to do when you're not sitting behind the desk?\nYeah, so I like getting outside a lot, trying to play out more golf this year,\nlike to travel outdoorsy stuff, or if I had to kill in a jar a few years ago.\nSo I was probably the coolest one of those trips we've done.\nAnd then next year, we're going to do a little trip to Switzerland to do tonight.\nOh, that sounds great. Well, your golf season is over if you're in Cincinnati.\nI'm seeing snow at my window as we speak.\nYeah, I had the last time I played this about a week ago, and it was in the 40s, and now it's like 20 years.\nSo that thinks change quickly. It's like, it's all just a piece of hair, it's all switched to that.\nYeah, season is season is over. So why don't you tell us a little bit more about\nTouchstone's business, kind of the whole breadth of product and services and kind of what the whole business is about?\nYeah, so our Touchstone, we are distinctively active. That's our module.\nEverything we do is very active. If you look at our strategies that will typically look\nvery different from the benchmark, because we believe that to be able to beat the benchmark,\na prerequisite is you have to look different from the benchmark.\nSo you'll typically see a high conviction and the best idea is portfolios with the relatively higher\ntracking error. We are fully sub-advised. So we have 15 different sub-advisors that we go out\nand hire to run in a particular asset class. And it's really finding best in breed institutional\ncaliber asset managers to run our strategies on the mutual fund side. And then over the last year and\nhalf on the ETF side as well in our suite of active ETFs. So what is it about active specifically?\nIs it that you guys want to focus on it solely, right? Is it trying to provide that\ndifferentiation? Is it risk management? Is it alpha generation? What is it about\nactive that you guys really like? And why you focus in that area specifically?\nYeah, so I think when you take a look at the universe of investing overall, but within active\nmanagers in particular, you'll see a lot of strategies that have a few ailments that make it\nhard to generate alpha managers that are so big, have 10 or hundreds of billions of dollars in\nand are by almost definition forced to look a lot like the benchmark. And so that makes it very\ndifficult for them to be able to beat the benchmark. So the niche that we're trying to fill there\nis more of a specialist manager, more cognizant of the capacity of our strategies who are to\nmanage that, are some advisors continued off of the ability to add really strong alpha through\nrisk to adjust your returns, also protect on the downside. And what that looks like varies a little\nbit depending on strategy, where some managers might be higher on the upside, others might focus\nmore on the downside. It really varies in terms of managers across the breadth of our roster.\nSo having that many sub advisors and doing kind of manager due diligence, what in your mind\nmakes a good active management team and a good sub advisor?\nYeah, so we have our framework. We call it spider. It's spelled the kind of goofy way to the SPID\nIR. That's basically our version of the piece, people process performance, where we look at\nthe organizational stability, personnel infrastructure, investment discipline, and results.\nSo that's kind of our framework for evaluating our managers. One of the things we do is,\nwe're not testing with our clients money. We're hiring managers that have demonstrated\ntrack record performance, we repeatable investment process. And something that we think is\nreally differentiable when we look at the competitive landscape. We do a lot of work looking at the\ncompetitors before we bring strategies to market and making sure that we have a lot of\nconviction in the managers that be hired, their ability to continue doing what they've demonstrated\nin the past and that they're set up for future success as well. So with touchstone specifically,\nwhat comes first? Are you guys doing manager due diligence and finding managers\nto launch strategies that you guys might want to bring to market or managers coming to you?\nLike, how does the ETF creation process a touchstone work? Is it the strategy first or the\nidea first and then a manager builds it? Or are you finding an existing strategy that you're\nbringing to market? Some of both. It depends on the circumstance. So I start out by saying,\nwe take a lot of meetings. Our stance in general is trying to take as many as possible,\nyou know, called constantly from institutional asset managers that are looking for new avenues\nto grow their strategies, open up a retail market with our 50 plus person distribution team,\nthat targets the advisor, intermediate channel that's not necessarily the bread and butter\nfrom a distribution standpoint of those institutional asset managers. So we have several hundred\nmeetings a year with asset managers across asset classes. Sometimes at times in the past, we've had\na particular search. Some of the mutual funds side a few years ago, an example of that, we looked\nin the liquid-alt space, ended up hiring a rescapable that to run our credit opportunity strategy\nconsists of high yield bank loan CLOs in the below-investment grade space. That was an example.\nSometimes we had a very specific search and we're really happy with that measure and how they've\nperformed there. We've also had circumstances where it was more opportunistic. So our heat ETF is a great\nexample of that. It's our climate transition ETF we launched earlier this year. That was one where\nwe weren't necessarily saying what we really want to have a climate transition ETF, but we were\nopen minded and a really intriguing manager came across our desk. We continued the conversation\nthat was really differentiable. They've run a lot of money over in Europe. I think it's a timely\nstrategy and something that was reacted to that and something we brought to market this year.\nYeah, I have a handful of questions specifically for heat. Let's get back to that here in a couple\nof minutes. Before we do that, the active ETF landscape is a whole. We've seen a massive explosion\nand an active ETFs over the last couple of years. What do you think attributes to the growth\nin that space and why we're seeing so many managers and issuers come to market with active ETFs?\nYeah, so I think there's a couple of things. One on just some of the structural benefits of the vehicle\nthan investors did to me. So we're seeing a lot of demand for the types of active strategies we've\nalways offered, but the ability to also wrap those in a vehicle that offers the tax efficiency,\nthe liquidity, the transparency, the benefits that ETFs have always been known for.\nSo that's key reason why investors are becoming more and more interested in active ETFs.\nThe other key thing that happened as a few years ago is the ETF rule. So once the SEC adopted\nrule 6C11, it just made it a lot easier for active managers to come to the market. So instead of\nfiling an incentive relief for each individual strategy, you can rely on that to rule and make\na much less cumbersome process and also allow the tools like custom baskets, tools that are\nkind of the inner workings of ETFs that work widely available before. Now active managers are able\nto fully utilize tools like that and it would really level the playing field.\nAll right, so let's talk about heat. Let's talk about a couple of your ETFs.\nThis is the climate transition ETF that you already alluded to. Can you give me a very high\nlevel overview of what the strategy is and what it's trying to accomplish?\nYeah, so it's managed by the Lombard ODA. They're a Swiss firm that's several hundred billion\ndollars of assets staying back to the 1700s. They're extremely long. Kind of read tenure there.\nHave to read that a few times initially. That was typo. So they've been around a while.\nThey're really in the forefront of sustainable investing that it's raised over a billion dollars\nin Europe and this strategy. They're looking to invest in companies that are going to\nbenefit from the transition and climate environment. So one of those buckets is a there's three\ndifferent buckets. One of them is a clean energy solutions providers buckets that's probably\nmost similar to some of the other competitors that you'll see out there that really focus on\nyour solar companies and your wind companies. But the thing that makes heat really unique is that\ngot a couple of other types of companies that are targeting as well. One is the transition\nleaders. So companies that are more carbon intensive, so it can be something like a steel company\nthat you might not expect to be in a climate transition environment, but they're still companies that's\nkind of on the forefront of becoming more sustainable over time. And they also look at companies\nthat are going to benefit from the adaptation to a warmer environment. The reality is that\nthe world is getting warmer behind on some of the goals on climate change. So things like air\nconditioning companies that can make really efficient air conditioning equipment to help us\nadapt and live in a warmer environment should benefit from that environment. So long bars are\nreally trying to take advantage of all these factors that we think are going to be in a really big\nmega trend over the next decade, multiple decades type of time period and find companies that\nare best positioned to benefit from that. So as much as you can speak on it, do you know how the\nfund is really screening and finding these opportunities? Yeah, so they've got a very robust team\npartner with Oxford for some of the academic research over there. It's an all active. So they're\nlooking at their sustainability team and their investment team looking at kind of bottom-up\nfundamental research based on those three buckets and trying to find the best ideas from across\nthe world. It's a global portfolio. It's around 60% of it is in the US right now and the other\n40 internationally. So a team with dozens of people kind of scouring the world to find those\n40 to 50 best ideas there. So it's a pretty highly convicted portfolio and how are they\nwaiting those names inside of the portfolio? Is it equal weight? Is it market cap? Are they doing\nit or are they making, you know, bets based on fundamentals of the company? Like how are they\nwaiting? How are they waiting the TF? Yeah, so it is a very high conviction that study is portfolio.\nThere, it's not equal weighted. They're looking at from a risk management perspective. So a\nrisk management team is in it as well, looking at exposure to different countries, different factors.\nAnd then waiting at based on conviction, so the best ideas are overweighted there. And is it\nis everything done kind of on the fly or are they doing kind of a weekly, monthly, quarterly,\nannual rebounds or reconstitution or is it, you know, a real pure active type strategy where,\nyou know, they can make decisions day to day. Yeah, so in the ETF vehicle, we're looking at it on\nmonthly basis. So for SMA, they might rebound to a little more frequently, but it is active\nit's not on a set cadence that's quarterly or annually. We're looking at it monthly and being\nable to utilize some of the tools like custom baskets as we rebounds that to make sure we do get the\ntax efficiency and the benefits of the ETF vehicles number four. So if your distribution team is\nreally talking to an investment advisor about heat, where would you kind of sleeve this in an\noverall model portfolio construction? Yeah, so we've had a lot of conversations around that\nbecause the mathematics have really emerged over the last years, kind of much bigger slice of the\ninvestment, you know, first. I think the interesting thing about heat is it's more\nbroad based than some of the other sustainable clean energy things that are really high-baked\nand have got really beat up so far this year. So it doesn't make it good compliment to kind of\nlike global international global equity portion of an investor, investors portfolio. So what we've\nseen a lot of advisors doing is kind of taking that core exposure and then use heat as a\nsatellite to pair with it to get an investor exposure to a theme that they might be\nmight be passionate about. Sure, so it's okay with you. I'd like to pivot.\nI quickly want to talk about T-SAC, the touchdown, secure ties income ETF. We're going to go through\nthe same exercise here. You know, what is the fun looking to do? What's it trying to accomplish?\nWhat's in it? Can you just talk at a high level about the fun?\nYeah, so I'll talk, I'll kind of pair two and together, T-SAC and then T-SAC run by the same\nteam at Fort Washington. We launched TUC, that was one of our first four ETFs, is the touchdown\nultra short income ETF. So it's been an out for about a year and a half now, it's launched last summer.\nFort Washington's short duration team really emphasizes secure ties investments.\nSo TUC will have some corporate in there, but overworked secure ties investments.\nWhen we think secure ties investments, residential, mortgage-backed securities, commercial\nmortgage-backed securities, asset-backed securities, collateralized loan obligations,\nas kind of a key building blocks of that strategy. Historically secure ties investments have been a\nreally interesting place to be from a risk return for a file perspective, rather something\nlike the investment grade corporates or high-yield corporates. The team at Fort Washington has run\nultra short-term, mutual fund for, well over a decade now. The team's been together for over\n20 years, actually, it's a very stable team with a lot of experience, running short duration\ninvestments, specifically in secure ties. So we launched TUC about a year and a half ago and then we\nlaunched T-SAC, which is somewhat similar a few months ago. So it's our most recent\nactive ETF. T-SAC is the tension of secure ties and come ETF. It is fully secure ties. So\nwe're a TUC who will invest some in corporates. T-SAC does not as pretty much all secure ties.\nThe same Fort building blocks that I mentioned as far as mortgage is asset-backed and CLOs.\nThe key differences are ultra short, it's in the ultra short category. T-SAC is going to be\nin the short duration. So think kind of a two-to-three-year kind of duration instead of\nunder a year for a double-ter short ETF. And then it's also targeting a little more aggressive type\ninvestment for risk return profile perspective. TUC is almost all investment grade by perspective.\nIt's at least 85% in reality. It's significant higher than that. T-SAC is going to be at least\n50% investment grade. So it's going to, you know, opt to 50% and can dip down to higher\nsecure ties fixed income. So it's targeting a high yield based on just where they're seeing\ninvestment value there. So does that portfolio have any mandated kind of waiting requirements around\nthe type or amount of paper it holds or is it kind of go anywhere? I know you've mentioned,\nyou know, 50% of it has to be investment grade. But as far as the different types of paper\nis there any guardrails on that or is it kind of go anywhere? Could you get, I guess my question is\ncan you get concentrated in one section over and other? In terms of those Fort buckets,\nthey do have strategic kind of guardrails that they try to adhere to. So coming out, they've run\nthe strategy for T-SAC and SMA format for over a decade. It really started after the financial crisis.\nAnd at the time it was mostly residential and more expectories. That's where they saw the most\nrelative value. That's involved over the past 10 years or so where it's become much more\nevenly dispersed between those buckets. I think going forward, you'll see it continue to be\nwithin their strategic guard lines that you have 10 to 40% kind of give or take in any of those\nbuckets. But it hasn't been as concentrated one bucket in the number of years now.\nYeah, so do you have any insight on kind of how the portfolio trading decisions are made and how\nthey're moving around those buckets? Is it more of a fundamental or quantitative approach, you know,\nhow are they making decisions or portfolio waiting decisions in real time? Yeah, so it's based on\nthe relative value that they're seeing across each one of those buckets and probably the bottom\nup analysis on a particular issue. The team at Fort Washington over the last 20 something years\nthat it really developed very robust risk monitoring techniques, surveillance techniques.\nOne of the key things about secure tax income is it is really critical just to understand\nthe underlying assets and what that collateral looks like being able to stress test it.\nI'll see if it's a recessionary scenario. What do we think cash flow profile will look like?\nAnd so they're running daily reports to look at, to like when's the rates, what those cash flows\nlook like. And then making relative value decisions based on kind of what they're seeing\nfrom the bottom up analysis. So the same same question here as we had with he like where\nwhere would advisor, where would an advisor put this, you know, in their overall model portfolio\nconstruction? Yeah, so I'll I'll talk about two C Antisex a two C on the ultra shore. I think we're\nseeing a lot of interest there from investors that just want to earn a little bit more on their cash\nsleeping the portfolio. So the team at Fort Washington describes as kind of your insight out\ninvestors or your outside investors. Your insight out investors would be the ones that have a cash\ncash segment of their strategy. Maybe want to segment it to carve off a slice of that cash state.\nI'm willing to take a little more price volatility risk. Want to maintain a really high quality\nlow duration profile and just juice up the yield a little bit or a little bit more carry on that\ncash that might not need for the next six to 12 18 months. Teasex on the other hand is a little bit\ndifferent. I think probably the largest use case we've seen for it so far is getting a\nyou know, a compliment to the high yield portion of an investor's portfolio. Historically,\nthe strategy is offered a similar yields to high yield corporate bonds but a much lower volatility\nprofile. It's in the short-term bond category. So you're not taking a lot of interest rate risk there.\nFor it's a pretty pretty compelling risk return profile on the pair with something like\nyour high yield corporate bond portfolio. Yeah, no, that makes a ton of sense to me.\nBefore I let you go, you had mentioned earlier that you've got a distribution team of about\n50 and you guys have been around for a long time, a very robust mutual fund business.\nHow are you viewing a couple of questions here, really? Is there a difference between how you\ndistribute traditionally a mutual fund and how you're going about distributing, you know,\nthese ETFs and are there, I'm sure there are some similarities but what differences have\nyou and the team kind of picked up, you know, over the course of trying to get these to market?\nYeah, so I think in general, our advisor population is pretty similar between mutual funds and\nETS. The same advisors that historically we've sold mutual funds too. In reality, most of them are\nusing mutual funds and they're using ETS and maybe they're using SMIs and they're using all\nthose types of vehicles together. So it's a similar population of advisors. We have had to make some\nstrides as far as our sales team and the ETF vehicles specific parts of the conversation. We brought\non an ETF specialist who has a couple decades of ETF sales experience helped train our team.\nJust so when they're talking to advisors, talking about benefits of using limit orders and\nabout all the different ETF characteristics that our sales team hasn't had to deal with those\ncharacteristics. So we've been bringing them up the curve really for probably a year before we even\nentered the game to make sure that they're able to really add value to their advisors through that\nsort of knowledge that a couple years ago they probably didn't have internally. Yeah, and that makes\na lot of sense to me and it would seem to me maybe I'm making an assumption here but just thinking is\nwe're talking that buying a mutual fund seems a lot stickier than buying an ETF and a lot of\ninstances just because of the liquidity and sometimes how active managers can use them or incorporate\nthem in a portfolio. Is there anything that you've learned about that over the period of time\njust that you guys have been in the ETF businesses? Is it a different discussion or again,\nis it just the same advisors and just a different vehicle for them to be able to use?\nSo I think what we've seen so far is there might be some higher level of turnover from advisors\ngoing into and out of the strategy because it is very liquid and tradeable. But I do think we're\ngoing to see a different experience for our types of strategies than maybe your your passive\ngiant ETFs they're using are very tactical nature and venues. A lot of ETFs strategists are\nmaking the call is going into and out of a very short-term basis for those ETFs historically.\nI do think a lot of our users will use it a little more strategically where they're able to\nget in and out when they need but something like a two-tier T-sec or a heat to be able to maintain\nthat exposure for a year to a multiple years because they do like the benefits that the\nactive management that strategies they will provide. Yeah well Matt again, thank you so much for your\ntime. Before I let you go, where can people learn more about you? Where can people learn more about\nthe touchstone and the variety of different funds that you guys have to offer?\nYeah so the first place is touchstoneinvestments.com or website. We've also got a linked-in\npage where we're posting a lot of good content so please feel free to give us a follow-up there.\nWell Matt again, thank you for your time. I really enjoyed this and I hope in the future you and I have\na chance to meet face to face and talk in person. All right, thanks Brad.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}