{
  "id": "14384503",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nIt feels good to be back, and we start off season two with a big one.\nWe have Todd Rosenbluth.\nHe is from Vettify, and we are talking all things.\nThe exchange ETF conference down in Miami.\nThere are a handful of wonderful sessions, great speakers.\nWe talk about the ETF community as a whole.\nTodd is very dialed in on all things ETF.\nSo I hope that you all find this episode insightful, and if you are listening to this,\nprior to the exchange ETF conference, I look forward to seeing a lot of you down there.\nWithout further ado, Mr. Todd Rosenbluth.\nHey Todd, welcome to the show.\nIt is my pleasure to be here.\nThanks for having me, Brad.\nBefore we get started, can you just give everybody a little bit about your background on how\nyou eventually ended up in Vettify in your current role?\nSure.\nI guess I'm a 20 plus year industry veteran.\nI started my career as a financial advisor at Morgan Stanley.\nThen went to go do research at Value Line initially, and then went to what is now S&P Global.\nS&P I was on the non-index non-credit rating side of the business, covering individual stocks.\nAnd an opportunity came about to move into ETF and mutual fund research and build a research platform.\nWhich I did over 10 years ago, and while it was there, the business I was a part of got sold\nto an independent research company called CFRA.\nAnd then just over, actually, just under two years ago, in March of 2022, I joined what is now\nVettify at the time it was ETF trends and ETF database, but was about to be renamed as Vettify.\nAnd as I'm sure some of your listeners know, but if not, Vettify actually just got acquired\nby the TMX group, a global firm that's based in Canada, so we are now at TMX to Vettify.\nYeah, and I saw that.\nCongratulations, I'm sure that opens you guys up for to do bigger and better things,\neven though you guys already have a great business over there.\nAnd we'll talk about some of the products offerings that you have over there.\nBut before we get into the nitty gritty, I always like to ask,\nyou know, when you're not working, what kind of hobbies do you have?\nWhat do you do for fun when you're not at your desk?\nYeah, I'm a big sports fan, I'm a University of Michigan graduate,\ngo blue, they just won the football national championship.\nAnd but I'm big into other sports as well.\nI place sports and coach my son's little team, and we are sports enthusiasts,\nsick family base here in New York, so lots of things related to that.\nAnd I have a four year old dog named Coco that is a good chunk of my\nexercise with her and she might run into the room at some point for the listeners to get the\nhero she is, but so try to stay rounded outside of work and balance work and life and\nvery much a big believer in that.\nYeah, no, that's great.\nCongratulations on the win.\nI was actually rooting for four Michigan, so I mean, we don't have any good team.\nI'm in Pittsburgh, we don't have any good college football teams.\nPit hasn't been relevant for a very long time, so I got to choose to root for others,\nbut congratulations on that.\nAnd again, before we get into it, I have to ask personally, how relieved are you the\ndespite Bitcoin race is now over?\nI know you were as well as others are kind of front and center on breaking all that news.\nIt kind of felt like an NFL trade deadline, so are you happy that you've slowed down from\nthat a little bit?\nI am. I'm happy that we're able to talk about things beyond win and whether or not\nit will be approved. And then what will happen when it gets approved?\nAnd I know we're going to talk about the exchange conference, but for the last few months,\nwhen the tea leaves were lined up that this felt like it was going to happen, I kept pointing to\nwe expected this by February. We'd have multiple products that were trading by February.\nWe were, I guess, slightly less realistic that all of these products would come out days after,\nactually the day after the SEC approved, but it's, and it's great. It's great for the industry.\nIt's a sign that the ETFs remain a go-to vehicle to get exposure and we're seeing great trading\nand great flows, but there are 3,000 other products that people should be paying attention to.\nIn some cases are paying attention to, and it's in the best interest of my readers and my content\nthat I write about something else besides a Bitcoin ETF, because at the most, it's going to make\nup reasonably a couple of basis points. I'm sorry, a couple of percentage points of their portfolio\nand there's other products to consider. Yeah, no, it was, I was following everything on Twitter\nand it just seemed like it was a roller coaster ride. So if I were in your shoes, I'd probably\nbe relieved that it's over and stop having to write about it all day every day or tweet about it all\nday every day, so. But anyways, let's pivot over to verify. Can you talk about\nVettify's business specifically around how they can help and how they assist ETF issuers\nand the types of products and services they have? Yeah, so we, we like to refer to ourselves as\nin ETF services company. So our goal is to educate the financial advisors as part of a community\nand our efforts to do so include webcasts that I help to moderate some of, we do a handful of\nwebcasts each week. So in the case of helping an asset manager, it's helping them to educate\nadvisors, bring advisors to come hear their story and we help to moderate the conversation and\ndiscussion and do and bring an audience, but bring an educated and engaged audience for folks\nso listen to we also have lots of content that's educational on our website at ETF trends and ETF\ndatabase and we have some partnerships where we help educate about the lineup of products from\nan objective independent perspective, but we're writing about individual strategies, whether it's\nactively managed products or it's fixed income products or smart beta products or various\nthematic products overall and then we also have lots of data. We're well aware of who's visiting\nour platform on ETF trends and ETF database, we're well aware who attends our webcasts and we've\nconnected to dots so we can help an asset manager understand that the from a top down perspective\nthe trends that we're seeing on our platform is to what is topical and what is not topical\nin terms of marketing and product development efforts but also on a bottom-up basis we we have\nan understanding of after somebody went to one of our virtual events our webcasts what did they do\ndid they go look at your product or did they go look at a competing product because they got\na speed on the trend but they went to the biggest player in this space or the cheapest player\nin this space or your product which might likely not be that and then the fourth leg of that\nso just going back to a virtual events content data the fourth one is the exchange conference where\nwe're going to have more than a hundred asset manager partners down in Miami Florida with us in\nabout a month's time three weeks time excuse me sorry right so so let's let's talk about exchange\nthen you know like we're it's coming here in a few short weeks and I want to say quite honestly\nit's the best conference of the year I was there last year and you guys did an exceptional job\nreally bringing everybody together it's extremely well run so congratulations on that but\nyou know what was the original idea around exchange and how do you go kind of fulfilling the mission\nof what exchanges trying to accomplish yeah so we're again going back to what vetifies over\nour goal is to transform financial services into a community one of the best ways of doing that\nis to bring people together all in one place in about two thousand of them we expect for this\nexchange conference and let them share ideas to so they will at this upcoming conference get to\nhere from industry experts from macro perspective from a what's going on in the markets perspective\nwe are in the election year and what's happening what what the outlook is for the election\nboth at the national level and and going further down but we've also brought in we've added more\nto the to the conference to to meet advisors objectives which is best practices we bring in\nCarson coaching which is going to have three hours of training for financial advisors we've got up to\nten hours of continuing education credit on part of some of that we've got professionals that\nare more qualified to talk about certain trends in terms of leadership and then of course\nyou know I'm an ETF guy you're an ETF guy there'll be lots of ETF content as well\nwe've got some key partners that'll be up on stage talking about various trends in the marketplace\nfixed income equity and yes we'll even have a spot Bitcoin conversation as well because\nit's still the topic of the first quarter of the year so I'm really excited about it I'm excited\nyou're going to be there and I'm confident many of our listeners are going to do so as well\nso just staying on that point in terms of trend you know what do you think is kind of the next\nbig thing coming to the ETF marketplace in 2024s are we going to continue to see or do you believe\nwe're continue to see this trend towards active or you know SMA conversions into ETF what is on\nyour radar for the next kind of advance of the ETF industry? So yes I do expect that we're going to\nsee continued growth of actively managing ETFs it was it was a great year for actively managing\nETFs in terms of flows in 2023 I think it was roughly a quarter of the overall money that came in\nit certainly was from a product development standpoint I think depending upon how you classify any\nETF more than half in fact I think close to three quarters of the new ETFs that came to market\nare actively managed and there's some caveats there these the buffer oriented ETFs that are\ndefined outcome that keep coming out on a monthly basis or variations of those those are\nactively managed because of the use of options but we're really excited what we're seeing\nMorgan Stanley is going to be expanding their lineup this year we've seen success out of firms\nlike Tiro price and capital group in 2023 with their lineup expansion dimensional funds and\nJP Morgan are the leaders in active management so I think the established providers are enter\nof the mutual fund world are further going to focus on the ETF marketplace and then yes we had a big\nconversion last week and SMA converted I think it was over $700 million of money into an ETF I\nthink that trend is going to continue ETFs are the vehicle of choice just much more tax efficient\nto run such a strategy and and so I think that's one of the trends to keep watching on in 2024\nyeah that's great and so back to exchange I believe you said there's going to be about 2,000\npeople there it was definitely busy and everybody who was you know in the industry and around\nthe industry and advisors were there you know if you're an advisor attending exchange you know\nwhat what do you think they should be doing to kind of make the most and best use of their time while\nthey're there yeah well first of all if you're an advisor that that is registered if you're not\nif you're an advisor that's not yet registered for exchange we very much encourage you to do so obviously\nthat's that's part of what it is but it's actually quite affordable for advisors they are\nyou know the goal for us is to educate them and we've got partners to help support the effort\nour agenda is up on our website of course take a look at it and see what sessions that you find\ninteresting we're going to be running a couple two tracks part of the time sometimes it's going to\nbe just one main stage speaker in some cases it's going to be two tracks one of those is going to be\nmore advisor focused and best practices oriented whereas the other stage is going to have more\nindustry expertise to help folks think more about the marketplace but we've also left a lot of time\nfor networking there's a lot longer than I think most conferences have this I think an hour and a\nhalf to two hours for lunch each day so that people can set up their own meetings they can\ngo visit the booths and get time with the asset managers that they want to or hang out with\na network with their peers if they want to we've also tried to make this a more engaging conference\nit's not just indoors in a conference so we're doing two community service events one on Monday\nand one on Tuesday the second one on Tuesday is a is a walk for breast cancer with the the\nColeman Foundation that I'm excited to be a part of and encourage people to sign up for\nbut honestly this should be the most productive three business days for people in the industry\nthat's our goal for what it is and three days starting on Sunday ahead of this Super Bowl we'll\nhave some educational content as well I find it I'm refreshed and exhausted after these conference\nbecause you make the most of the time that's there and so if you're not busy that's intentional\nbecause you've chosen to carve out time but there's anybody that's connected in the ETF industry\nor within the advisor community that you want to get some advice from and expertise from\nis likely to be there yeah no that's definitely the case they've almost everybody who's in the\nindustry is is sending somebody to to be down there and so you mentioned a couple of the community\nservice events I think those are really great as far as the sessions go you know what sessions\nare you most excited about to be offering this year anything on the agenda that is going to be a\nmust watch or must attend so at the risk of giving a plug from my own session I'm excited that\non Sunday again a couple an hour and a half to two hours before the Super Bowl will be taking\nplace so people should still have a time and a mindset for it we're doing in an ETF study hall\nit's actually a four hour event the first two hours is for ethics training but I'm excited\nfor folks that are wanting to get up speed I've got Elizabeth Cashner of facts said\nan Eric Boutchewness of Bloomberg and nature AC of the ETF store joining me to do some\ndue diligence tips we're going to have some information about how to build portfolios using ETFs\nwe're going to have some trading expertise and then I'm running a game show that's going to take\nplace on Sunday afternoon testing knowledge of some of my colleagues in experts so I'm excited about\nthat and being a part of that event but I think we've got some great speakers Dr David Kelly\nof JP Morgan is going to be there we've got well still we have him I think we have Jeff Gunlock\nI'm sorry about that I was trying to remember we have Jeff Gunlock of double line\nslated to be speaking and then I'm excited because we've got we're going to have a session again\nmy friend Eric Boutchewness is going to run a Bitcoin session and we've got Galaxy and Gray\nScale and Bitwise on stage together to talk about the trends in the topics but also as folks\nmay know Eric Boutchewness he doesn't shy away from asking a tough question and so that should be great\nand I'm leaving out some of the key sessions that are with Asim and Jepartner but we've got\nVanguard talking about fixed income we've got in Vesco and Ishers talking about thematic ETFs\nwe've got state street doing model portfolios we've got to your reprise and Morgan Stanley talking\nabout active management there's lots of great ETF oriented sessions to attend to.\nSo you know we said there's going to be about 2,000 people here did you ever\nthink about the people or the hotel guests that are just staying there on vacation and then you've\ngot about 75 cabanas of the pool what do you think there is going on in their heads when they\nare actually you know trying to get some sun and there's a bunch of suits out there and their\ncabanas I think I think they probably feel bad for us that those people that are in\ntraditional suits and not bathing suits by the pool that are missing out on the enjoyment\nI know the conferences in Miami Florida I try every day to take at least a 5 or 10 minute pause\noutside and just breathe the sunshine and the fresh air and remind myself where I am but yes we\nstick out notably at the conference and because we take out a good it's a huge conference\nI'm a huge hotel the fountain blue but you could they actually area is going to be blocked off so\nyou can't walk through because their sessions that are going on so hotel guests have to walk around\npart of where we are I'm sure they love that they extra steps that they get in while they see\nus there it's Miami yeah I remember a couple of years ago where somebody at the hotel asked me\nfor information about the hotel they were regular guests they were dressed in a bathing suit\nI was dressed in the suit I knew nothing about the hotel I knew where to go at the conference and I was\nvery much reminded of how out of place I looked compared to how they did for a Monday\nMonday afternoon in Miami so just a couple more questions about the event itself it is as you\nmentioned a monstrous event there are a lot of people there about how long do you need to be planning\nfor this event in order to make it go off like a hit like are we are you already working on\nexchange twenty twenty five's the team already thinking about that no I didn't know not yet\nbut so what would what happened last years is here to go from what will work we did the event in\nFebruary twenty twenty three I think we we as a team decompressed we got some feedback from from our\npartners who were who were there as to what they liked and didn't like what they wanted to see\nagain and what they didn't and we were aimed to be responsive we got together a team of advisors\nthat were willing to talk to us about what they thought worked and what they'd like to see done\ndifferently they formed or many of them formed an advisor council that we had for exchange and you\ncan go on to our website at exchangeetept.com to see who those folks are I confident I'm going to\nleave out a name or two and so I don't want to do that but they helped us and then we started I would\nsay in April May to start to build the framework for the conference starts to talk to partners\nabout coming back to the conference to see what they would like to be able to do and and how they\ncan help us to build it and then we started reaching out to potential speakers because if\nyour goal is to get prominent speakers then you got a line up and lock in their calendar earlier\nI mean I'm available if somebody wants to talk to me much faster but Amy Walter who's the editor\nand chief of cook political report is probably somebody who's much busier than on a day they\nbasis to talk at an ETF conference or an advisor conference that I am so yeah and if and if folks\nhave feedback they would so first of all I hope everyone that's listening can attend is able to\nattend please let us know what you think share that feedback with us it'll help us make the better\nconference for 2025 and there will be one in 2025 so well we're still in the conference if you're\nthinking about attending you you haven't bought tickets yet it really is it really is a great conference\nwhere can people go to learn more about the conference see the agenda see the speakers buy tickets\nand and do everything that they need to do so all of that is at a website that's exchange\nETF dot com so ex c a n g e t f dot com uh you can register you can certainly see the agenda\nI'm looking right now through the wall of speakers and I'm even more impressed because we've\nadded people's pictures and names that I didn't realize were confirmed and someone who's last\nname is Rosenbluth I'm towards the bottom of the list alphabetically so I have to scroll quite a bit\nto be able to see all of the great folks that are here and I'm excited with you know that it's a\ndiverse lineup of speakers that was something we were conscious of to not have I know this is an\naudio medium and not a video one but that there are more people on stage that that don't look like me\nuh is a good thing for the community of we're trying to bring together so uh shout out to\npeople who look like uh anybody uh within this space because every voice should be heard and so\nI'm really excited about that you can only have so much control of that but I'm excited as I look\nthrough this wall of of the verse of relative diversity from my perspective that's great so before I\nlet you go just cover more you know ETF related questions and you've you had mentioned you know\ntrying to bring this community together and and there seems to be at least from my perspective\na pretty big sense of community around the ETF industry I mean everybody seems to be really\nwonderful people um and they facilitate a lot of collaboration with one another what do you think it is\nabout the ETF community in general that kind of fosters this level of collaboration and it seems\nto be uh people really want to help each other and are able to offer each other advice or recommendations\nyou know what is it about this community is taking your facilitates that yeah so first of all let me\nwholeheartedly echo uh this sentiment that's there I'm a I'm a recovering stock analyst back in the\nday I covered tech and telecom stocks uh for 15 years I would barely say hello and then more\nimportant people would barely say hello to me that were other analysts covering uh AT&T and Cisco\nand other re and Verizon uh it just was not a community you just didn't talk to people you didn't show\nup early before an event and and expect to get much out of that because everything seemed to be so\nproprietary so it was enlightening to me when I came over uh over 10 years ago to the ETF space and\nrealized this was collaborative at the pie uh grows when everybody is so not everybody has to support\none another but it isn't necessarily uh a doggy dog world and and zero some game uh and we've\nseen that identify we yeah I mentioned you know we talked about uh crypto and these products launched um\nthe day after these products launched uh we were fortunate enough to host a virtual\nsymposium uh crypto currency symposium we had eight different asset managers joined us on various\npanels so there were two folks and it was extremely collaborative their goal was to educate about\nin that case crypto uh in other cases it's been other topics as opposed to selling against one\nanother's products and so that was enlightening to me and so we're gonna find that out exchange as\nwell we're gonna have two different asset managers often on stage talking uh and collaborating with\none another why was the original question you have I think it's the people uh that are part of it\nI think it's the structure that's set up that we're continuing to grow uh I know you've had I mean\nyou're you're an ETF community and you have guests that on a regular basis that offer other ETFs\nbecause your goal is to help educate uh the listener about the products that are out there uh I find\nthat once we get people embracing ETFs people being investors embracing ETFs they're more likely\nto buy a second and a third and a fourth and a fifth ETF uh and so we all win when when\nis greater education in the community you got me at a good spot so that's a question before\nlet you go yeah no great I mean it's it's true right you I went to um when I went to the exchange\nconference last year right the the the charity aspect and I think one day you guys are uh there's\nlike a beach cleanup right and people go and they want to socialize in there and they're super\nfriendly and they're they're not there to um kind of posture they're they're really there because\nthey want to make a difference and and they've made friends with people and um and it is it is a\nreally nice uh community and so I think events like this really help push that forward um but before before\nI let you go you have seen you've been in the industry for a very long time uh you're in a\nunique position you see a lot of new issuers you see things work you see things don't work\nas you mentioned I talk to a lot of niche new issuers on the show just giving them a medium\nin which to tell their story their backstory and and talk about their strategy and I know they\nwould welcome uh in hearing um you know any tips or advice from you if you're a new issuer coming\nto market what should they be doing to make sure um that the launch not only it goes successfully\nwe have enough people in the industry that really make launches go successfully so make the products\nsuccessful um you know what advice would you give them to um get their get their word out there\nand and get distribution really which is the hardest part of this game um and and get investors\nin their products I guess I have two answers one uh that is that is hopefully doesn't sound self-serving\nbut verify that to our goal is to do our audience is primarily registered investment advisors\nso we're more than happy to to have listeners that are out of wirehouse brokerage firm\nfor the realities they've got home office uh access and they also have uh you know models that\nthey're often tapping into as opposed to building it themselves so I very much encourage uh asset\nmanagers that have launched or planning on launching a product to come talk to us again see if there's\nsomething we can do to help you get the word out uh from our content from uh webcast that we do\nfrom virtual events from the data that we have now obviously this is a business and so it may not\nwork out from a monetary basis initially but maybe it does over time and just talk to us\nlet's see if we can help but I will come I will piggyback on what it is that you said the focus\ntends to be on the launch and getting word out there on the day of the launch and that's what\ncoverage happens and then there's less effort to engage the community to get the word out there\non ongoing basis so I'm a writer of ETF content that isn't necessarily partner oriented I have to\nknow about your ETF to decide that I want to write about your ETF and included in the conversation\nor included on on camera included in the session like this included in the article we've got\n3,000 plus ETF children to mind and be aware I remember some of their names not all of them\nhelp us help you by by staying in front of the people that are talking about ETFs on a regular basis\nbecause the more we know the greater the likelihood that we're going to incorporate you in our efforts\nwell Todd I really appreciate your insight I wish you guys all the best of luck with exchange\nI know you don't need it you guys have done a great job in the past I know you're going to do a\ngreat job this year I'm excited to be there before I let you go though where can people learn more\nabout thatify and also follow your insights and get the information that you're putting out there on a\nyou know a daily basis so I publish research on ETF trends.com we advise I have a website\nVETTAFI.com again the exchange ETF conference as website is exchange ETF and I'm on LinkedIn\nmore than I am on whatever we're calling Twitter these days but I'm there and if you want to\nreach out to me or see the content that we're putting out there please please engage us we're\nmore than happy to have a conversation well again Todd thank you so much for your time I'll see\nin my Emmy in a few weeks I can't wait I'll look forward to taking your hand in person",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}