{
  "id": "14427475",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nToday we have on Adam Carran, he is the founder of the God Bless America ETF, Ticker y'all,\nY-A-L-L is a fund that focuses on US equities, however, has a filter and screen to eliminate\nthose that are involved in political agendas and activism.\nHe believes that businesses should be focused on doing business, rather than getting involved\nin public conversation around politics, and so he wants to only invest in those companies\nthat he believes aligns with his core values of businesses staying involved in only business\nand focusing on the task at hand, which is delivering shareholder value.\nWe have a lengthy discussion about the objective of the fund.\nWe also talk about marketing strategy and a little bit about his background in upbringing\nand how he got involved in the business.\nSo, without further ado, please welcome Mr. Adam Carran.\nHey, Adam, welcome to the show.\nFor having me, so before we get started, I always like to ask everybody to tell us a little bit\nabout your background and how you eventually got to current financial.\nWell, yeah, I would be remiss if I didn't talk about my background and talk about my mother being\na clown growing up, you know, I saw that on your list.\nLike, you know, a good conversation starter.\nAs I grew up in Connecticut, my dad was a self-taught mechanical engineer.\nI don't think he ever made more than $60,000 in one year.\nAnd because of the nature of his work, he was always on the chopping block.\nHe was basically living and sleeping and eating and breathing based on what piece of legislation\ngot passed.\nAnd if the state of Connecticut got some pork for a defense bill, so because of the level of uncertainty\nwith his job, my mom hung her shingle and started her own little business as a professional\nclown. So, I grew up in a household where we'd answer our phone, sparkles the clown.\nHow can I help you? And quite frankly, it caused me to just be enamored with money, right?\nBecause I'd see my mom come home after a long weekend at work and, you know, she would\nshe'd be, you know, I don't know either grieving or just talking about how the kids were\nbrats, but the parent gave her a tip. And dad was constantly focused on his company stock price\nand also worried about his job security at the same time. So, money was always the topic of\nconversation at my kitchen table. And I knew I needed to bring money to my kitchen table to have\nsome relevance there too. So, you know, I just started working at a young age, doing everything I\ncan to make a buck. And then I accumulated a little bit of wealth. My dad took me under his\nshoulder under his wing and said, hey, let me show you what wealthy people do with their money.\nAnd he took me to a stockbrokers office. This is before the discount brokerage revolution occurred.\nSo, you had to pay 50 bucks, a hundred bucks to make a stock trade. So, walked into this\nguy's office and I don't even know if he made eye contact with me. He told me to put all my\nmoney in shockful of nuts, heavenly coffee stock. I was like 12. I never had a cup of coffee\nand put all my money in shockful of nuts and would open up the newspaper every week and see\nthat stock drop lower and lower and lower. And watched half of my wealth disappear, investing in\na crappy coffee stock. So, I made a commitment at that point. I said, I'm never, ever, ever\nmaking an investment without doing a little research on my own and just started tracking the\ncapital markets. And I was hooked like so many of us in this industry. I just fell in love with\ntold that story about my mother being a clown to the administrators of Red Drexel University.\nI got a really nice scholarship to go to Drexel. Fell in love with Drexel because it's right\ndown the street from the Philadelphia Stock Exchange. If you ever been to downtown Philadelphia.\nSo, as soon as I got admitted to Drexel, I started going to the Philadelphia Stock Exchange\ntrading floor and I was bothering guys as they left the floor. And as you know, Brad, you\ncan pick them out real easy because they work goofy vests and stuff. And I would say, guys, give me\na job. I'll fetch coffee. I'll shine your shoes. I'll do whatever you ask me to do. And eventually\ncompany finally, I think, gave me a job. Just so I'd stop bothering all their traders. So I\nworked at Suscojana. And there are of course, a big specialist market maker, options traders.\nAnd I was there for a few years. And then got an opportunity to work at, you didn't know I was\ngoing to give you this whole board. This is awesome. Keep going. So yeah, so I kind of bore witness\nto the electronic trading revolution, the statistical arbitrage. You know, where I started to see,\nyou know, some of those early traders there were making just gobs and gobs of money because\nthere was, you know, there was still arbitrage to be had. But as soon as all the computers came in,\nI just kind of read the T leaves and said, I don't know if this is going to be, you know,\nnow granted, there's still people there making lots of money. But it's certainly the spreads\nweren't nearly as big as they once were. So I had an opportunity to work at a big hedge fund.\nAnd the hedge fund I worked at, individuals had to have $20 million to invest with the firm.\nAnd not many people had 21. Most people had hundreds of millions of dollars and\nkind of surreal to to think someone with a hundred million dollars is asking the son of a\nclown for advice on what they should do with their money. What do they say about Wall Street?\nWall Street see only place people drive to in limousines to get advice from people who took the\nsubway. That's right. So anyways, that's my professional walk. And then I had this, this\nitch that needed scratching. You know, as much as it's fun to make fun of mom being a clown,\nshe was a little business woman. She was an entrepreneur. And I knew I always wanted to start my\nown company. I wanted to dictate my own destiny. I didn't want to be on the chopping block like Dad.\nSo I started my own financial planning company, a kitchen table financial planning company with the\ngoal of bringing planning concepts that the wealthiest people in this country have access to\nto middle class millionaires like my mom and dad, people who peddled up hill,\nclipped coupons, drove cars to the wheels fell off. I believe they need and deserve the same\nlevel of financial sophistication and and tender loving care that the wealthiest Americans in our\ncountry get to experience. So we created our little financial planning firm 800 miles away\nfrom New York down here in Charleston, South Carolina. And our small but mighty American dream is\nhaving a little impact on the world. I like to thank man. Yeah, no, I love it. It's it's fun. My mom\nwas not a clown. But our backgrounds are similar where once you catch the itch and it needs scratch,\nshe'll chase everybody down to get that first job on Wall Street or near it or in my case on trading\ndesk. And I loved every second of it. And I too, you know, had that entrepreneurial itch and it\nneeded scratch and and I'm glad I did it. It's it's it's as I always like to say it's like crawling\nthrough glass, but it's it's worth every every step you take in it or every you know, every knee\nneck that you get, but it's definitely it's definitely something that's that's necessary to\nhelp the type of people that you want to help. Absolutely, man. Yeah, I'd have it no other way.\nSo before we get too deep into the ETF, I always again like to ask what do you like to do when\nyou're not behind the desk? What hobbies? What keeps you busy after hours? Make children and then\nwrangle the children after they leave the birth canal. I have that's four kids. I have four kids.\nI used to say five and under because my my five year old just turned six, but basically four kids\nfive and under. So hobbies don't exist for me any longer. That's something that's kind of\ncompletely skirted that question, but that's just the truth of it. That's a very popular answer.\nIt's either that or taxi driver, unpaid taxi driver. So we're kind of all in the on the on the\ngauntlet of of young kids. So with with your financial firm before we get into the ETF. So it's\nit's heavy planning, investment management. I mean, are you running it kind of family office style?\nYou know, can you just talk a little bit about the firm itself? Yeah, yeah, the goal is to kind of have more\nof a family office feel to it. Boy, it's awfully hard, though. It seems like the the tax preparation\ncomponent of a family office. It seems like that industry is just broken. You know, because no one wants\nto file an extension. The IRS wants to change the rules three months before filing date. So\nwe pretty much have every component, but that piece, but we have kind of a stable of tax\nprepares that work with us and arms length away. But yeah, certainly be proud ourselves on planning,\nright? So in particular for retirees. So if you look at any of our branding, it's always retire,\ny'all retire. And the premise is just I think middle America is getting taken for a ride by our industry.\nI mean, when you look at the financial planning industry as a whole, now it's improving dramatically,\nbut you know, the old model was like higher 10 guys make them doorknock or bother their friends\nand relatives for, you know, their list of 100, no darn well that like nine out of the 10 aren't\ngoing to make it. Take the orphaned accounts from the nine because you know the other nine are\ngoing to take on an account or two. It's so gross, man. And luckily, I never experienced it because\nI told you how I kind of came into this industry, but there are so many individuals I've met in\nthis industry who talk about, you talk about like, you know, crawling through glass, like it's\nit's even grosser than that to a certain degree. So it go figure the people who make it in that\nenvironment are the type of people I don't want to hang out with, like the guy who gives their\nbusiness card out at the cocktail party, like, ugh. So we've got an industry that for decades\nupon decades was ruled by that guy. The commission breath, annuity, hookster, selling everyone cash\nvalue, life insurance, doesn't understand tax code, all hat, no cattle. And, you know, now it's\nstarting to get, there's a slightly higher level of sophistication, but at first that sophistication\nwas kind of deviating towards the wealthy of people, right? And, you know, I was born on the other\nside of the tracks and I'm proud of it and even though I might be banished from polite society\nsometimes because of that, I just think that people, there's a mass affluent society that needs\nquality investment advice and Lord knows we're not the only ones doing it, but I do think we're\nin the minority because that old guard of selling people stuff is still heavily, heavily prevalent.\nSo we pride ourselves around here on getting, we get paid for talking about stuff that doesn't\nget us paid. So I like to think our advisors are very prolific and proficient when it comes to\nthe progressive income tax system. We understand how health care works, whether you're under 65 or\nhow Medicare and Part A and Part B works, alternatives to long-term care, all of that stuff\nneeds to be put in good order before you even consider talking about the investments. So I think\ngood financial planners know more about that stuff and the investments are kind of the easier,\neasier part of this whole game. Yeah, you said a lot there that I agree with and have also witnessed,\nyou're going to make me pause this interview and get my all-hat, no cattle hat because that's my\ntend to wear that on the weekends around. I didn't know many people had that saying in their arsenal\nand I don't know if you saw me chuckle when you said it, but it's something we use in our house all the\ntime. But let's, let's transition. Brad, how old are you, man? I'm 35. Okay, so\nI was just rifted with a dude in my office about this. It seems like some 41 around the same age.\nGone are the days when individual, you know, you like, where'd you grow up, which town all that?\nI grew up in a small town outside of Pittsburgh, Pennsylvania, I called late robe. So, okay,\noh, I know about the trip. That's where rolling rock is made. Rolling rock used to be made. They're\nnow they make energy drinks. We're, we're famous for two things, Arnold Palmer and the invention\nof the banana split. Okay, that's, I'll take that. Yeah, my hometown was known for like pouring\nchemicals in the, in the river. So Arnold Palmer and a banana split, but anyways, no, I could tell you\nmy people. So, so, um, as rifted with some of my office, young people and I'm talking people\nare age. I guess we're millennials, I feel like I'm on the tail end, but, you know,\ngo out of the days when the mechanic down the street, he, his brand, his name, his word,\nhis bond, like that is what was of tremendous value to him. His work ethic, his output,\nhis final product, right? Now young people want to work as little as possible and make his\nmuch money as possible. And to a certain degree, I don't blame him, right? I want to work as\nlittle as possible and make his much money as possible, but you have to recognize something's\ngood as suffer if we're all doing that. Right. And what suffers is the work in the output\nand the customers. So this all hat no cattle phenomenon. I don't know, you use it with your family.\nLike, don't be all hat no cattle. Is that, is that how you use it? We use it in that context and\nwe also use it in the context where I'm trying to teach my young kids, I have a seven-year-old daughter\nand materialism is not a great thing. And sometimes people tend to spend money on things to make it\nlook like they've got it all going on, went under the hood. It's riddled with debt and, you know,\nthose aren't the types of things to make it happy. And so we use it in kind of both contexts.\nI love it. I love it. I live in the land of the yuppies here in Charleston, too. Like, the little wealthy\nzip code. And I wish I would. I wish I didn't know so much about this industry. And I know your\nmath guy, I find it's guy too. Like, you can kind of just do the math in your head when you\nwitness someone who's all at no cattle. Even if they're like a doctor and the husbands a lawyer,\nyou're kind of like, you start mathematically looking at what their after tax income is and\ncalculating things. But, you know, you shouldn't account another person's wallet.\nYeah, and I like mine's there. Yeah, you know, you you hit the nail on the head where you kind of see\nyou see profession. You've seen so many different planning clients. You kind of know where things fall.\nAnd you're like, I wonder how they're affording that. But anyways, I digress. Let's talk about\ny'all. First of all, I love the ticker. Great ticker. So it's the god bless America ETF.\nCan you talk kind of at a high level? What the funds objective is and the types of companies\nthat you're investing in? Yeah. So I could kind of tell you how the idea was brought to life. I was\nhaving tons of conversations with clients. And of course, you know, we serve the mass affluent. These\nare not rich fat cats. This is kitchen table financial planning. And I just kept hearing the same\nkind of mindset. And that was like, hey, the stock market's been really good to me. I got a million\nbucks because I've been putting money in my 401k and in mutual funds. And the market's been good.\nI believe the American dream is alive and well. I'm living breathing proof of it. And I love the stock\nmarket. But I am really sick and tired of investing my money in companies that seem to be going\nout of their way to make comments and make activist statements. That trounce on my beliefs and\nmy values. And one conversation in particular comes to mind. Because I'm kind of a bogal head like\nthrow it in Vanguard and just kind of, you know, I love Vanguard. I think that that company is probably\nbeen the greatest, you know, asset manager for the little guy I ever invented, right? So so\na guy said to me one time he goes, I would be okay. If my investments trailed the S&P by one or two\npercent periodically, if I know I wasn't supporting these companies. And like a big light bulb\nwent off. I said, oh, like, this isn't a commoditized because as you know, as someone who launched\nNETF, you can't compete with BlackRock or Vanguard. Like the race is to the bottom. It's a\ncommoditized product where heck, I talked to the guy who manages the the pension fund for the\nstate of South Carolina and he's like, BlackRock pays us to use their funds. You know, so I don't want\nto be in in games like that. Because naturally the the fee structures just get to go to zero and\nI don't even feel like I'm earning my fee to a certain degree. So I had this aha moment where I\nsaid, this isn't a commoditized product this guy is looking for. This is a movement. This is almost\nlike a religion. This is a group of God fearing flag waving conservative people that are sick and\ntired of seeing their money invested in companies that are trouncing on their values and their beliefs.\nBut they still want to invest in the stock market. So I said, someone's got to create this thing\nand when I went and searched the market for products that would kind of here against scratch that\nitch, there was some conservative funds. There was some like biblical responsible funds,\nbut the conservative funds were like just a bunch of crusty industrials and oil and gas companies.\nAnd I was like, well, all the growth from the markets have been coming out of the tech sector.\nWe can't just put everyone's money and oil and gas and tell them to hang in there. They'll go\nup sooner or later. And then even some of the biblically responsible funds and funds that were a\nlittle bit more, I don't know, call them anti-woke. They were investing in companies that I'm\nlooking at going, this company is not in line with my values whatsoever. So we created the fund.\nI lived down here in Charleston. So we say y'all in the New York Times, anointed y'all the\nmost inclusive of all pronouns. So I wanted to be inclusive because we're all about diversity,\nequity and inclusion around here. So we gave it the ticker y'all and why the heck not call it the\nGod bless America ETF. God bless America is actually a wonderful bundle of words because I truly\nbelieve that. And also it acts as like a self-segregation tool because oddly enough, there's a large\nswath of society that gets triggered by the words God bless America. People want to add an\nasterisk and go like sometimes God bless America. Good, you know, kick rocks. If you don't love\nour country, if you don't recognize that this country offers a chassis for upward economic bill,\nmobility, unlike any other place on the face of the earth, don't invest in the fund. You\nweren't good invested in it anyways. So the idea makes sense to me. And now I want to figure out\nhow you're putting it together. So how do you, how do you put a, I'm going to call it wokeness screen\nif that's fair to say on the companies that you're putting in the fund? Yeah, so here's what we did\nright off the rip, right? We wanted it to smell like the S&P 500, right? So we wanted to have the same\nsector waiting, right? So the technology is 24%, we want to have a 24% waiting in technology. And then\nif energy is 2%, we want to have a 2% waiting. And so we broke it into 11 sectors, 13 sectors, I think\nnow. And when did the other two sectors come? I think real estate was not about a year or two ago.\nSo we broke it into those, those sectors. And then we waited the stocks accordingly. Now,\nhow do we come up with the stocks? What were the screens? Well, it wasn't all that hard. It was\none of those moments man where I opened up a spreadsheet. And I just pulled up the 510 companies\nwithin the S&P. Although it's not just the S&P because ultimately we have a 1 billion market cap.\nSo you can get some mid cap names in there as well. But there's been a number of hot button issues\nthat have crossed the news wire over the last 5 years, okay? One of them was Georgia's\nelection reform bill, okay? So that was immediately labeled Jim Crow 2.0 by the media.\nAnd two days after it's passing, there was a two-page article taken out in the Washington\nPost and I believe the New York Times called The We Stand For Democracy Pledge.\nAnd it had kind of this altruistic copy about We Stand For Democracy. We believe that\nasking people to present a identification of owner ID and not allowing ballot harvesting\nis Jim Crow 2.0. Now, so any company publicly traded company that signed the We Stand For\nDemocracy Pledge, we believe was participating in activism. Now, why do we believe that, right?\nBecause some of you were kind of like, well, yeah, what Georgia did wasn't right?\nWell, if what Georgia did wasn't right, why was there a record voter turnout in their most recent\nelection cycle? Why was there a record minority voter turnout in their most recent election cycle?\nWould Jim Crow 2.0 see that to happen? No. So if you stand the sign that we stand for\nDemocracy Pledge, even though that that has been proven to be incorrect, you were participating\nin political activism. You weren't focused on returning shareholder value. You weren't focused on\nthe lighting customers separating them from their money, growing their customer base,\ngrowing your business. You were participating in activism. That's one example. The other big one was\nFlorida's parental rights and education. You want to believe the number of publicly traded\ncompanies that decided to call that, that don't say gay bill. The number of publicly traded\ncompanies that thought educating kids under third grade about sexuality sexual preference was a\nsmart idea. And if you don't think that was a smart idea, you're a homophobic. So I'm sorry.\nYou might not have wanted me as a guest right now. But this is the number of companies that\nused their social media handle. The number of companies that that did press releases,\nsaying that they disagreed with Florida's parental rights and education bill. Here again,\nif you make widgets in Seattle, or have a social media platform, or you make shoes in China,\nbut you sell them here in America, why are you making a statement about Florida's parental rights\nand education bill? Why are you some go-gung-ho about teaching first graders about sexual\npreferences? You have a seven-year-old. Do you think that's prudent? Hi, honey. I don't even want to\ngo there because it's creepy, right? So if a company made a statement about that, we believe that\nthey they lost track. They got lost. They forgot that their job was to delight customers,\nseparate them from their money, grow their client base, return shareholder value. They started\nparticipating in activism. Another big one was the business roundtable stakeholder capital pledge.\nThis was one of the biggest ones, right? And a lot of people point to this as the Trojan horse of ESG,\nokay? So a lot of people call our fund an anti-ESG fund. I don't even care about ESG. I don't know\nwhat an ESG. There's so many companies out there issuing ESG scores. It's meaningless to me.\nI don't, and I think, I think someone David in my office did a report and he like our fund actually\nhas like an OK ESG score somehow. It doesn't matter. It's such a play stupid games when stupid\nprizes type thing. But the business roundtable stakeholder capital pledge, a bunch of companies\nsigned this pledge to the old business roundtable pledge was to return shareholder value. Do business\nin an honest way, help thy customer. Like it was like, what a business is supposed to do, right?\nBut the new business roundtable capital pledge was to stick up for your stakeholders, right?\nYour stakeholders. Now, your stakeholders are not just your customer, are not just your employees.\nThey're also your community. They're also your environment. They're, you know, they're your employees.\nBut the employees starts to creep into this thing. Well, if you really want to stick up for your\nemployees, you should have a diverse workforce. It's an all of a sudden we have, you know, publicly\ntraded companies with pie charts on their website, keeping track of how much melanin their workforce\nhas in their skin. You know, I say that out loud, I, you know, you think I'm like a Ku Klux\nclan member, is that not Zany? You have a pie chart on your website, keeping track of how much\nmelanin your employees have in their skin. This all came with the stakeholder capital pledge.\nIt also talks about the environment, right? So, so it's like, oh, if you're a good stakeholder,\nyou are good to do idiotic things like fly around in private jets, but chest eyes people for,\nyou know, driving an SUV. So, and I'm doing a terrible job of unpacking that quite frankly,\nbut ESG was Trojan Horst into corporate vernacular through the state, the stakeholder capital\npledge. Couple that with all of the publicly traded companies that felt fit to make comments about\nthe Rovey Wade ruling recently. And look, I get it. Some of these things that I'm talking about\nare nuanced. I have an opinion on them, too, and you might have a different opinion, and who's to say\nwho's opinions right or wrong? Where I'm drawing a hard line in the sand, and the purpose of our\nETF is to say, business is should focus on business. And as soon as you start making comments on\npolitical and social activist items, you're automatically alienating 49 to 51% of your potential\ncustomers and employees and shareholders. And by you doing that, your business, I don't want\nmy investors to have their money in. So, with that being said, and I think you did a very good job\nof articulating it, and it sounds like to me, you're looking at certain events that occur certain\nyou know, activism type environments, and then kind of screening out those who are participating,\nbut from that, once you have that screen done, I understand that your market cap waiting\nthe holdings inside of the portfolio do a line with the S&P. How are then, let's just use\ntechnology as an example, how are you waiting within those companies within just your technology\nsleeve? Are you making decisions and betting on certain companies you think might do better,\nor you market cap waiting those as well within that sleeve? No, yeah, there is a little bit\nof, you know, it's an actively managed fund, so there is some active management there,\nbut I'll say two things. One, when I, you know, it's one of these moments, I think I said it\nearlier, but I'll say it again, it's one of these moments where I sat down behind a spreadsheet,\nand then I picked my head up and it was like 12 hours later, right? I was just, and I was like,\nwell, this is something I must be fascinated in, like I lost track a time and I just sat here and\ngeeked out and researched every single company and just saw if they signed to these different\npledges, saw if there are social media handles made comments on on these different hot button issues,\nbut you know, I told some people what I was doing, and the common response was Adam,\nthere's going to be no company's left. They all gone woke. They all make comments. And I was\npleasantly surprised to see, um, only about 200 of the S&P 500 companies,\nwere boycotted, right? So, no, that is 40%, so it is a little bit disheartening, but 60% of\ncompanies are not doing this, 60% of companies are staying in their lane and focused on business.\nSo, that's one thing. Now, I will say this though, almost all of the technology companies are doing\nthis, especially the mega caps. I don't even need to say them out loud, right? The mega cap\ntechnology companies are the ones who are the loudest with their comments about social and political\nactive issues. Now, there were a few left, right? If you look at our holdings, you can see them.\nSo, we look for quality, right? We look at PE ratios, another thing that we do, which is a little\nunique, so if there's a tie, and I know this probably flies in the face of of what a stock picker\nshould do, because human capital is the most expensive line item on a P&L statement.\nBut if there's a tie, we're going to elect the company that creates more American jobs.\nWhy? Because my dad was on the chopping block, and my mom was a clown.\nAnd I recognize that an American job, even if it's a $50,000 a year job, creates stability in\nAmerica and gives someone confidence that they can save it to a 401k paid out in their mortgage,\nput a kid through college and all that. So, we waited according to the sector, of course,\nand our fund basically likes to keep only about 40 stocks, right? So, in essence, if it's a,\nif it's a large sector like technology or health care or financials, we'll sometimes pick four\nstocks in those sectors, five stocks in those sectors. But if it's a smaller sector, like energy\nor materials, we'll pick one or two sectors in those areas. The biggest challenge I have quite\nfrankly is finding quality tech names. Because if you were to look at my investment universe\nthat I have at my disposal in the tech sector, it's kind of slim pick-ins. So, we've had to make\nsome concessions there where, look at Tesla, for instance, Tesla's technically not a tech company,\ntechnically. Sure, smells like a tech company to me. The whole point of that company is to gather\ndata, of course, make vehicles that drive with electric. But when you look at the valuation of\nthat stock and the reason that some people look at it and go, man, they've only done like one\ntenth of the cars that Ford made. But when you try to justify, you know, you talked about PE ratios,\nwhen you try to justify the PE ratio of Tesla, you have to look at that company as a disruptor\nin the insurance industry, as a disruptor in the battery industry. It's a disruptor in all sorts\nof other industries. So if you start to kind of, you know, blend it into those different areas where\nit can make cash flows into the future, we look at it as a tech company, right? So I think that\nanswer your question, right? Yeah, it answers my question up. You know, to see me might have some\nissues in financials as well. Some of the larger financial companies as well as in, but it's for\nus. I'll be enough my industry, right? Like, yeah, most every company that's in my industry is as\nwoke as well can be, unfortunately. Yeah. But you'd be surprised, you know what, no, it breaks\nmy heart the most, Brad, when, when there's a company who I like, and it's like, I like in\nbecause, you know, I think their quality, I like, you know, just my family uses it, something is\nsimple as that. And then I got a boycott, and I'm like, ah, you know, that's the challenge I have\nrunning this thing. So when you, you make your, oh, one more thing, one more thing Brad, I'm sorry,\nI mean, so far, so far. Here's a trend I've seen recently, right? And I know, I think you said\nbe careful about using tickers and stuff. That, that baby is my, I already have been thrown out\nthe window at the bath water. So more and more companies now, were as five years ago, they would\nhave the pie chart with their workforces, you know, race and sexual identity on on the website.\nDude, I'm not kidding about that. Oh, I know, how many companies keep track of their workforces\nsexual identity in the name of being virtuous and pious, like it's freaking creepy. But anyways,\nmore and more companies now are coming out, Costco, I think of, uh, Charles Schwab have come out\nand they go, hey, we're not going to make comments on political and social activist statements.\nWe're not going to give money to political candidates. Like, so they're making this statement now.\nAnd this is a relatively new phenomenon. And Lord knows it's not because of my little rinky\ndinky TF, but maybe my ETF had a little bit to do with it. Um, so that is an encouraging\nphenomenon that's happened just recently. More companies are going, okay, we went a little too far.\nMaybe our marketing department didn't need to make a social media post about the, uh, piece of\nlegislation that was passed and Florida about teaching second graders about sexual identity.\nSo more companies are now coming out there and saying like, we're going to stay in our land.\nWe're going to focus on business. So anyways, sorry, man. No, that's what I was, I was going to ask.\nIt was, um, was, would there be, would there be a point where you rerun the screen, uh, like\nif there's a leadership change or, you know, a change in in culture and attitude where you might say,\nhey, come on back into the screen. Let's, let's take another look. Yeah, the CEO would have to walk\nthrough the streets of Charleston, naked with a shame bell and we would throw a slap on them.\nUm, no, I'm just kidding. Uh, so how do you atone, right?\nYou truth be told? Uh, I don't know what that looks like quite yet. Uh, I, I actually, we've had\nconversations behind closed doors where we've seen some of that. I just gave you a couple of\nexamples of companies that that in our opinion are moving in the right direction. Um, and here, the,\nthe waves of that, I just said that it's a, it's a phenomenon that's happening for more often,\nbut it's still a phenomenon, right? It's not like it's not like a wave more, more likely than\nnot we're seeing, you know, companies initiate DEI initiatives, um, you know, at the expense of their\nshareholders. So, uh, I, I haven't really put my finger on the moment you go, hey, you used to be\nwoke, but you're not anymore, right? Um, you know, is, is Budweiser not woke anymore, because they\ndid an advertisement with a, you know, a soldier riding a Clydesdale horse? I don't know, you know,\nI can't put my finger on that quite frankly. So let's transition just, I guess I'm supposed to\nput my finger on it, though. Yeah. I'm supposed to have like the actual like line and like,\nthis is what makes them, you know, inherently I hold grudges. So, uh, if you do something that bothers us,\nthat'll follow you for two generations. Okay. So it'll be someone else's problem.\nUm, it'll be their, the CEO's grandchildren. Right. Right. So I'm going to transition here a little bit,\nand I don't want to, I don't want to talk about actual performance numbers because, um,\nI don't want you to get in trouble with your compliance department, but performance has been really\ngood. Um, what do you attribute to that? And, and how do you plan on kind of capitalizing on that\nfrom a marketing perspective as we head into 2024? Oh, good question, man. So, um, two things. One,\nI'm not so naive. I've been, you know, I've been managing money long enough. I've, I've had a\nlot of experience in this industry that, you know, you have to attribute some of the picks we\nmade in the timing of those picks. There's a luck in this, right? The goal of the fund is to mirror\nthe S&P 500. Now, if you look at our, our performance in your one, you'll notice it didn't do that.\nIt didn't do that for the better. Thankfully. But I know that there will be a reversion to the\nmeans, right? So periodically, we might have periods of time where we underperform, but my goal,\nI will be a happy camper. If 10 years from now, I look back and I see two line graphs that look\nsomewhat synonymous. That was the goal of the fund. So, um, what do I attribute some of the, the\nperformance to, though? We read the T leaves, uh, two things. One, I'm starting to drink my own\ncool aid, man. I'm starting to be like, yeah, maybe not being, like, maybe focusing on business\nis a recipe for out performance. Because that's all the funds done. Maybe not making political and\nsocial activist statements is not a good decision to do business-wise. You should focus on customers\nand money and your P&L and all that. So, that's one thing. But the other thing that we did is there's\na couple of moments in time this year where we saw what we believed to be quality stocks,\ngrossly undervalued. And we do a quarterly rebalance. Every now and again, we'll do another,\nyou know, balance. Like, we're not active. If you look at the turnover of our fund, it's very, very low.\nBut we just kind of said, hey, that's a good company with good strong leadership and the\nmarkets being unfair to it. Let's back up the trucks. And sure enough, when we did do that,\nof course, keeping them with a lot in line, it paned out really, really well for us. And I mean,\nthat's, that's what's attributable to the alpha I would say. As far as how we're marketing it,\ndude, I could say this to you because you got your own ETF too. I, that has been the most\ndisappointing thing I've experienced in the last year and a half. Like, I'm an RIA, so I'm not\nreally in bed with Finra. You know, so the RIA rule book is like, don't make forward looking statements.\nDon't say performance data. But when you start marketing at ETF, you have the Finra rule book,\nwhich is, you know, 100 times bigger. So, I'm inherently kind of, I liken myself to a marketer,\nlike, I believe I'm kind of a carnival-barking marketer if you haven't noticed. So, I was really,\nreally excited to launch this thing because I wanted to start carnival-bark and I want to start\nit beating the drum. Very quickly, the nerds and compliance took all the wins out of my sales.\nVery quickly, when I started to see the fees, I was racking up in order to get a one-line tweet\napproved through, you know, the compliance overlords. I was just kind of like, I don't even want\nto market the thing anymore. It's just, it's, it's, and as you know, launching an ETF is not like,\nsome of my friends are like, wow, you got $50 million and you're at 65 basis points. You must be\ngetting rich and I'm like, not really, you know, quite frankly, death by a thousand cuts for the first\nyear. So, our bread and butter is helping people like kitchen tables, live a abundant retirement.\nAnd I never, ever, ever want to get knocked off track there. Happy to have the ETF out there,\nhappy people are engaging with it. It acts as a wonderful billboard for my company. So, when people are\nlike, okay, or these types of people we want to work with, or these not the type of people we\nwant to work with, which is even better for us, like, learn it early that this is how we see the\nworld. And if you don't share our value set, we might not be the advisor for you. And I hope you,\nI wish you well. I hope you find someone, you know, who holds themselves to the standard that we\nhold ourselves to. But as far as marketing the thing, I'm doing it right now, I'm on a podcast, you know,\nwe've, we've almost compliance has taken the wind out of our sales quite frankly. I had a PR\nperson representing me. And we did a bunch of TV. And that was cool. But that's gross, too,\nto a certain degree. Like, I don't like being at the mercy of some TV channel. Like,\nhey, Adam, I need five minute comment from you at 220 on the CPI reading. Like,\nI got four freaking kids, dude. Yeah. That's one. That's one of the reasons why I wanted to\nshow, I mean, quite honestly is because, you know, our fund is isn't, or I should say the way that\nwe manage money in general isn't, we don't care about necessarily the CPI reporter data or make\na comment on how you think Apple's earnings are, right? And so we did some of that as well. And\nand you're right, marketing, I think is the number one challenge. It's a shame because this is your\nyear. If I'm, like, if I'm looking at a product that had really good performance last year,\nand you're entering an election year. Like, this is when you, you could just start beating down\nthe door. And this would be, this would be the asset growth year. You know, after a stellar\n2023, an election year in 2024, when all we're going to see on mainstream media is, you know,\npolitics 2024. So, you know, I wish you luck there. And hopefully you can get some things through\ncompliance because when, you know, well, rift with me, dude, because I agree with you,\none part of me taking the foot off the marketing gas pedal was, let's get a year at data in there,\nright? Well, we got that year at data. It's good, it's good data, too. And I agree with you.\nIt's an election year. People are going to be as gross as ever. And conservatives are going to\nbe as disgusted as ever. So, it, it is, it is the, how would you market it? Oh, geez, you know,\nI, I would be doing a lot of these types of things with, you know, whether they're industry\npeople, but also the outlets in which listen to the message in which you're trying to get out there,\nwhich is, hey, look, let's, let's make, let's make rational decisions when it comes to\nwhat types of companies were invested in, are in, that align with our values. And there's definitely\nshows and substax and podcast galore that might not be financial services related,\nbut are going to reach the audience that you're going to reach. But, I mean, as you know, as\nwell as I, and you set it great, where it's going to, everything's going to get really gross here\nin the next 11 months, 10 months. And this is when all of these things are going to boil up to the\nsurface. And this is the time, the opportunity time for, you know, you to get that story out.\nAnd even on top of that, you, earlier in the show, you said, there are some other funds that\ndo something similar, but they're not as, you know, focused in on what I would deem, you know,\nyou're conservative values and investment stance on those values. And so you do have a unique\nproduct. And yeah, it's, it's definitely a challenge, but trying to find those outlets would be\nwould be number one. And because, as you know, as well as I do, trying to put something on social\nmedia or on LinkedIn, or it is a challenge, and if it's not worded correctly, or if the\nfonts too bigger too small, you're not going to be able to put it there. Yeah. And, and, you know,\nI didn't mention, we, I, like, the whole marketing engine for our company is radio. So I do a bunch\nof radio. So we got our radio show 15 different channels here in South Carolina. So, you know,\nI'm perfectly okay being a big fish in a small pond. But I agree with you. We just had a\nwonderful year. It's a, it's a year to gather assets. I'm a capitalist pig on apologetically.\nI want more assets in the fun. If not for anything, because I want to start supporting companies that\nare focused on business. So yeah, it's, it's maybe you just motivated me, Brad. Maybe you just\nmotivated me to do more, to do more stuff like that. Well, good. You know, and I, I wish you a ton\nof luck. And I have, I have two more, I have two more final questions that everybody gets,\nwhich is when you're talking to another investment in about your product, where would you\nrecommend they put it as far as our overall model portfolio construction? From what I'm hearing\nfrom you, it's probably a compliment to our large cap equity exposure with that be fair.\nYeah, it's a core holding, man. It's, it's, it's an index fund in our eyes that boycotts\nworld companies. So, if you look at it on a morning star sector rating, it's a large cap,\nit's a large cap blended fund. So, where, you know, before I let you go, where can people\nlearn more about you? You mentioned you do a radio show, where can they learn about the fund,\nand where can they learn about, you know, your financial planning firm?\nYes. So, everything has y'all in it. So, if you want to come and learn more about our firm,\nmy radio show, my podcast, it's retireyall.com. And if you want to learn more about the ETF,\nguess what the, guess what the, the website is there? Y'all ETF, y'all, ETF, y'all. Okay.\nHere you go. Here you go. You got to mix up ETF y'all.com. We're going to the god bless America ETF,\nand you could find it right there. But I appreciate it. Brad, I appreciate you shining a light on my\nlittle rinky dick American dream. And hopefully someone's still tuning into this and listening to this.\nAnd if you are, you know, send up a flare and let us know that you hate my gut. Please, I love\nhate mail. I got a whole drawer of it. Or send up a flare and you motivate me more so than the\ncompliments. For every ten compliments I get, one piece of hate mail really gets me out of bed\nwith a little bit more pep in my step. So, or let us know that, you know, you listen to the interview\nand you're intrigued by it. Yeah. Well, Adam, thank you so much for your time. Congratulations,\nyou know, on your first year and good luck in the future. And again, thanks for your time.\nYeah, Brad, thanks for having me, man.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}