{
  "id": "14516737",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nWe bring you our special live from the Exchange ETF Conference series.\nWe did a number of interviews live from the lobby of the Exchange ETF Conference.\nIf you are an ETFs in any capacity or thinking about launching ETFs, it is the conference\nto be at, in my opinion, such a wonderful time.\nWe are excited to bring our first live-in-person interview to all of you with Carrie\nRimer and Hazel Doyle from K&L Gates.\nThey are two wonderful attorneys.\nCarrie is a specialist here in the US.\nWe talk all things about getting an ETF to market from a legal perspective, and then Hazel\nis an expert in the European side.\nThe ETF market has been growing steadily over in Europe, so she talks about the nuances\nand intricacies of getting an ETF to market over on that side of the pond, so I think\nyou are really going to enjoy this conversation with Carrie Rimer and Hazel Doyle.\nCarrie and Hazel, welcome to the show.\nThank you, Brad.\nWe are so happy to be here.\nSo as I just, we were talking before, as I just said, this is the first live edition\nin-person interview behind the Ticker, so it is good to actually talk to somebody face\nto face rather than over the computer.\nYeah, we like being your experimental bunnies, so we'll see how this goes.\nIt'll be fine, so let's start with your background, Carrie.\nSo can you tell me a little bit about your background, how you kind of got started and\nwhere the position you are today?\nYes, absolutely.\nSo it's kind of funny.\nI started off just doing general corporate law for about a year, and then never really\nknew much about this specialty of like the investment company active 1940, and was asked\nto work with someone who, you know, he kind of asked me to work with his group, and I never\nreally knew why it was he asked me to do it.\nHe said later that he knew that I was detail oriented and hardworking, and that was kind\nof how people would be in, and so I've been doing this ever since, and I won't tell you\nhow long that's been, because that's kind of embarrassing.\nBut it's been a little while, and I've spent most of my career at law firms.\nI also spent a few years in house at JP Morgan asked that management, which was great, and\nthen also spent time with a regulator, and so immediately before joining K&L Gates, which\nis law firm, I'm at now, I was at the SEC, working in the division of investment management\nand chief council office, so that's how I ended up, and you know, started doing ETFs,\nit's just part of the asset management practice, and it's been great.\nAwesome.\nSo Hazel, can you give me a little bit about your background?\nYeah, sure.\nSo thanks for helping us.\nSo I might start by saying, I'm Irish, and I'm part of the K&L Gates Dublin office, so we\njust opened the Dublin office at the beginning of last year, and I joined at the end of last\nyear.\nSo I've kind of done that back to front, but I didn't go down the traditional law school route\nthat you probably, you might do in the States, but a lot of people would do laws, they're\ntraditional kind of degree in Ireland, and then they do law exams, and then they become\nlawyers.\nShe did Irish and geography, so Irish being the Gaelic, Gaelic, the language, so geography\nand Irish weren't what used to me when I was doing my law exams, but when I was doing\nthem, so I had kind of got into funds, and I was working in Bank of Ireland security services,\nthey were later both by Northern Trust, and I was working on the reception there, and I knew\nthat they had a legal department, and I thought, right, I need to get talking to the lady\nin the legal department, not knowing what funds were or anything.\nSo I got talking to her in the lift one day, and she said, they were looking for a paralegal,\nand a week later I had a job as a paralegal in the legal department, and from there, the\nfirst ETF I worked on was source, and they were subsequently bought by Investko in 2017 when\nInvestko entered the market, so I onboard its source in Bank of Ireland, and then I went to work\nin Maple's and Colder, where I did all sources work, and then I did a succumb and for a\nbetter year to source, and again I won't give the dates like Harry, because it was a long\ntime ago, but there was about 25 people in the office at the time, so it was quite a small office,\nso I've always kind of worked on ETF, so I do all sorts of regulated funds, but ETFs are a\nbig part of the work that I do, and then as I said, I joined K&L, then because they were kind of\ngrowing either ETF practice, and now we have capabilities kind of in Europe, and we have Australia,\nand the US, so that's kind of... And it's really exciting for me to have here, it's all because\nI know we're going to talk a little bit later about the growth of ETFs, but what's nice is we're\ngoing to have the opportunity to work more together as a lot of US ETFs expand into Europe, so\nit's really nice for us to be able to do this together as kind of a symbol of the collaboration,\nI think, between the US and Europe and the ETF world. Yeah, and we're definitely going to talk\nabout the explosion of the US market and ETFs, we're going to talk about the international\nexplosion in ETFs, but you're both attorneys, so what specifically do attorneys do for those\nof us who are in the ETF industry? Like, I'm an ETF issuer. I know like generally when I asked\nto start an ETF, a bunch of things happen behind the scenes, so can you kind of talk about the legal\nprocess specifically in the US that needs to occur in order to get an ETF to market? Yeah,\nand it's a really good question. I think for an issuer for an advisor thinking about starting an\nETF, it's important to have a really good partner that's your law firm, and so you want your\nlaw firm to kind of be a trusted advisor. They're the one to, along with some other service providers,\nbut I think kind of the first point of contact when you're just starting this is probably going\nto be a law firm, and I think it's helpful to get a firm that that has like a deep experience\nwith ETFs or at least investment companies because they're the ones we're going to walk you through\nthe complexities of the investment company active 1940, which is the statute that's really going to\ndrive a lot of the portfolio management restrictions or requirements. It imposes a lot of different\ndifferent requirements on managers that they might not have in another genre, such as the\nprivate funds or mutual funds. So law firms like us are a first full service firm, so we are\nalways not only in the asset management practice, but other areas like tax, or risks,\nthin-tapped other areas that might touch on what an ETF manager might need some input on.\nSo we would help you not only with the formation, the registration, even if you're managing\na fully transparent, passively managed ETF, and you don't have to get an incentive relief anymore\nfrom the SEC, you still need to get an effective registration statement. So your law firm will help\nyou get that registration statement, get through the whole SEC approval process. They'll help you\nnegotiate your service provider agreements, so I'll help you with index provider agreements,\nlicensing agreements, the authorized participant agreements, all of that kind of stuff. To the extent\nyou want to do a conversion or a restructuring, if you want to acquire another fund,\nthis is a means of growth that'll help you with all of that M&A process, the negotiations there,\nkind of getting all of that through any kind of approval process. And then they'll just help you,\nyou know, on a day-to-day basis, trying to figure out, I want to make this trade, I want to do\nthis strategy, how does this fit? We got this question, you know, there's always the women\nprospect out there of an SEC exam, whether it's just a routine exam or not, your firm will\nhelp you through that process, whether it's coming up with like responses to just, you know, a general\ngeneral questions that they're asking, or if something heaven forbid leads to any kind of like\nformal inquiry or an enforcement, your firm should be able to help you with that. So really,\nI'd like to think of law firms, it's like a very trusted advisor, a good partner with you as\nyou grow, and also in terms of growth, help you, whether it's like product development or thinking\nabout how you can grow, whether it's saying, hey, you know, there's these other options,\nlike we were saying earlier about US, US moving into Europe, here's another option for you,\nso if you want to grow assets, like there's these, and try to help you think about and be a good\npartner for you in terms of achieving your growth objectives. So before we get into like the growth\nof the ETF in the US and that whole industry is exploded, if I am an asset manager today,\nand I'm thinking about launching an ETF, and I'm picking up with the phone and I'm calling you\nabout how long do you think it would take me to get something to market? I'm sorry,\nI'm just thinking about initiating an ETF, and I'm calling you, okay, and I'll get you some\nstarting, just thinking about the process. How long are we talking about to maybe get something\nlisted and going? So I think it depends on what route you're going to do, so you could either do,\nif you're going to form your own complex, and it's not going to be part of an already existing\nseries trust or like a white label trust, that could be a little longer, so you want like\nyou'll be forming all of your documents from scratch, so it could be anything that you also\nhave to go through the registration process, the approval process could be three to five months,\ndepending depending on your strategy too, so do you need to get exempted relief like because you're\nnot going to be a fully transparent ETF, that too can tack on some time. If, however, you're just\ngoing to be more of a plain vanilla ETF, and especially if you're going to do, just become a series\nof an existing series trust, then it's much faster because you don't have to go through,\nyou don't have to jump through all the hoops, so then it could be closer to like two to three months,\nso much. Yeah, and the reason I ask is because right into the growth of the ETF industry,\nwe know, I think one of the big themes this year is going to be a lot of these model portfolio\nproviders or OCIOs, creating their own ETF strategies, obviously to get that tax efficiency.\nSo let's talk about the growth of the ETF industry. It's obviously becoming big business.\nWhat do you think is driving that growth and how are those trends evolving? Yeah, so I mean, I can speak\nto the US in particular, and so I mean, well globally, I think it's 11 trillion, I think assets\nand ETFs at the end of 2023, and within the US, I think it's 8 trillion assets at the end of 2023,\nand part of that I think is a reflection of assets going into a select group of ETFs.\nSo if you start ETF that's not guaranteed that because it's grown so much, you're automatically\ngoing to get tons of assets from day one. But the benefits that ETFs have has since day one,\nwhich is tax efficiency, relatively lower cost for investors, that's continued to grow since\nday one. I think there's been demands for AIAs to offer more ETF products to the clients.\nWe're also seeing growth in the form of conversions where mutual funds are converting, hedge funds\nmight be converting, separately manage accounts. So it's exciting, I think, to be part of an\nindustry where there's growth as opposed to slowdown. But at the same time, it's important to\nnot be tricked into thinking, okay, this means success for everybody because it still is competitive,\nit still is a challenging environment. Well, as an issue, I could speak to the competitiveness of it.\nI mean, it is tough. And I've talked to so many issuers thinking that if we just start or put a strategy\nout as an ETF, assets are just going to flow in. Right. Really, you're just getting started on\nlaunch day. I mean, all the work that goes into getting it there is nothing in comparison to actually\ngathering assets and keeping it sustainable business. And so last question for you, Kerry, as for now,\nyes. What do people get wrong about starting an ETF? What are the things that they come in with that\njust, you know, isn't really a reality? So I don't know if they get it wrong necessarily,\nas opposed to maybe not realize all of the complexities involved. So first, I think, if you're,\nthis is your first registered investment company, understanding that you have to deal with the\ninvestment company out of 1940, which is a very different statute. It's not a disclosure statute.\nIt is, it's, you know, so that you have to do certain things. It's not okay to do it. And then,\nand then just disclose it and everything's okay. There are certain things that you actually have to\ndo. So sort of understanding that understanding how your investment mandate may have to change compared\nto what you've been doing in the past in order to comply with the statute and the rules at the\nSEC's past under the statute. So that's part of it. The other thing is the cost. It can be pretty\ncostly. It's not just your legal fees, your other service provider fees. There's exchange fees.\nThere's, you know, there's no distinct fees. There's fees associated with the index.\nThere's fees that are going to be associated with running your mandate. You can't just do it on\nlike $5. You need to have some substantial amount of assets under management in order to deal\nwhat you're telling people you're going to do. There's market expectation. So, you know, the cost\ninvolved. And it's not just startup. It's ongoing, too. So those are some of the things that I think\nare important to keep in mind. I mean, you might think just thinking about what your budget should be.\nYou know, it also kind of depends on the structure. Like, are you going to do a series\ntrust, which might be less expensive, because you already have some infrastructure in play.\nYou don't have to go through the registration statement from scratch. That might help bring\nyour costs down a little bit. Also, if you're going to do the type of ETF that doesn't require\nexemplably, that too can try to keep your costs down. But I think just generally speaking,\nthe budget you might want to think about is like 1.5 to 5 million just in terms of like\ngetting going and having someone longevity. So that might be something that people don't\nfully appreciate when they're thinking about it, especially because you hear all this stuff about\nhow there's so much growth and assets coming in. And it's eager to think that, you know,\nit's just going to happen and to kind of loose loose side of that. The other thing is the competition.\nThere's so much competition. And part of the reasons why investors like it is because they tend\nto be lower costs than other types of options. But that then means lower advisory fees. And also\nbecause of the competition, a lot of advisors are entering into expense limitation agreements,\nwhether a green either wave part of their fees or reimburse fund expenses to try to maintain\ncompetition with other funds. The marketing aspect of it, you're really going to have to let\npeople know that you're out there having relationships with your authorized, with people that are\nable to kind of go in and out that the APs, the market makers. So I think kind of understanding that\nthat sort of overlay is important to think about before you actually just like jump right into it.\nIf you're used to managing private funds, it's going to be a bit of a different piece. It's\ndoable, especially if you have the right partners, if you have a good, like I mentioned, like\nyou have a good lost law firm behind you, if you have good service providers. There's people\nthey do this all day long. And this is the only thing they do. So they should be able to help you\nkind of get a hold of all of that. But you do want to be prepared that this is something you're\ngoing to have to undertake. Yeah, absolutely. And you know, you don't realize, you know,\nyou need to have a runaway of ongoing expense to be able to carry this thing forward because\nif you're only going to give yourself six months or a year, it's going to take three to five\nyears to even get your name out there to start attracting assets. So I agree with you that, you know,\nit's very important to make sure you understand the cost, the expense and everything here. So at this\npoint, I'm going to bring Hazel into the conversation. I'm very excited to talk to you. You know,\nit's exciting to hear the growth and popularity of the international market. So our listeners probably\naren't familiar with what's going on in Europe and the ETF space. So I'm excited for them to\nto get to hear from you. So can you talk about the ETF market as a whole in Europe?\nYeah, sure. And so each you have to have been around in Europe for since 2020, since 2020,\nsorry, 2000, sorry. The first ETFs were launched by Merrill Lynch on the Deutsche Borsa. And\nETFs kind of really started to take off say, probably from 20 to from 2008 in terms of AOM.\nAnd at the moment, there's about 1.5 trillion under management in Europe. And so while we're small\ncompared to the US, you know, we're catching up. I think Carrie said there's what 8, 8 trillion\nunder management in the US. So we work, we're getting there. And Ireland actually is the largest\ndomicile for ETFs in Europe. We surpassed the one trillion work this summer. So we're really\nexcited about that. And Luxembourg kind of follows behind us, what about 300 million under\nmanagement. And then the rest of Europe is the remaining kind of assets. And in terms of like\nmarket trends and what we see in the regulatory space, we kind of do look a lot back to the US\nto see what's happening in the US and trends. They might not come kind of within like 1, 2, 3 months.\nIt could be five years before the trends kind of pass over. So central bank kind of look to\nwhat the SEC is doing on the regulatory side. And then managers that are in Ireland look to see\nwhat trends are coming from from the US on that side. And I don't think we'll be seeing a\nspot Bitcoin ETF anytime soon in Europe. But but watch the space for that. And then the trends\nthat we are seeing are kind of like fixed income. Seeing a lot of that everywhere. And the\nthematic ETFs kind of more on that the AI side might be coming out now because that's quite\ntried trendy at the moment. And then we're seeing a lot of ESG as well. That's obviously big\nin Europe. So a lot of managers are launching us a article age. Maybe not so much article nine\nat the moment but a lot of article eight funds kind of coming out. And that kind of just really depends\non your investor base and what your investors are looking for. Are they looking for that kind of\nESG or overlay on their on the funds? And then traditional passive equity funds. They're still\nbig. And so we can't we can't rule them out there. Obviously the biggest launches that are kind\nof happening. And then everything else falls into the into the other spaces. And then one of the\nthings that is quite topical is whether people are launching active funds or passive funds. So I think\nin the US you're kind of launching a lot of active funds. But again, still passive funds being\nreally, really big. So in our land you're required to publish your full transparency of your\nholdings. So all of your holdings need to be published on a daily basis. So managers were quite\nscared of that initiative. I think and they told people we're going to steal their like secret\nsource. But I think managers are kind of getting over that now. And we're seeing the likes of\ndimensional. They're obviously publishing all of their holdings and bigger managers like Axa and\nFranklin Templeton. They're publishing their holdings in our land as well. So I think it's kind of a\nbit of a bit of a move away from possible. But obviously possible. Our still are still the biggest.\nAnd then. Yeah. So if I'm in US based issuer and I'm thinking about breaking into the European\nmarket, I want to get an ETF launch there. You know, how would a US issuer legally? How would they\nget that done? So we get that's a question we got asked a lot. So a lot of US issuers will think,\nyou know, there's strategy in the US has been really, really successful. And they think,\nokay, I want to move this into Europe. But you have to think first, will that strategy work in Europe?\nIs that what the investors in Europe want? And also doesn't work from a regulatory perspective.\nBecause obviously in in Ireland, most ETFs are launched as usets, which are quite regulated products.\nAnd so you need to see if they will fit within the investment limits, the investment restrictions,\nthe borrowing and leverage limits within within those. So might not always work to directly move\nyour strategy in, but you might get new parts of this strategy. And if you're like,\nand if you're looking at that, and you're kind of firstly looking at your market entry options.\nSo what are you going to do? Are you going to build your own? Are you going to buy or are you going\nto rent? So probably similar to the US. And we don't have as many white label platforms in Ireland.\nAnd so I think you have a lot of, you have a lot of those in the US. And then the considerations\nobviously for each of those three are like costs, speech to market, do you have them capital\nmarket capabilities? Or are you going to rent them from somewhere else? Your distribution strategy\nand how much control you want as well. Because obviously if you're, if you're not building\nyour own, you're relying on the service providers that your, um, that your why label has picked\nor the directors that they have put in place. And then you also need to think of the type of\nvehicle that you're going to have. So in Ireland since 2015, most of our vehicles are launched\nas Icav's. So Irish collective asset management vehicles, another acronym for everyone.\nThis whole industry is acronym soup. We were having dinner last night. And I was having a conversation\nwith a trader. And he said, I talked to somebody on the phone the other day and just said like nine\nletters in a row and he understood me and it didn't make any sense. So no, go ahead, please.\nSo they'll throw another one in there for you. I have lots of them. And so the Icav is a dedicated\ncorporate vehicle that was set up for specifically with investment funds in mind. So it's like an\ninvestment fund legislation. It's worked really, really well since 2015. And it can be set up as\nstandalone or it can set up as an umbrella structure. So having different, like sub funds,\nwith different investment objectives and policies, different share classes sitting under it.\nAnd each of those have segregated liabilities. So the assets from one can't be obviously taken by\nthe other. So there are kind of structures. And then service providers. So again, a lot of similarities\nbetween Ireland and the US. So but the main difference being on the service provider side is\nyou require to appoint a management company. So an Irish, or sorry, an EU management company.\nAnd they're responsible for the day-to-day management of the fund. So while you're the promoter\ncoming in and it's your fund and you're going to do the investment manager, you still need to appoint\nthis company. And then they will appoint you as the investment manager. So that's kind of something\nthat's hard to kind of think you're giving up your everything to this company. They're responsible for\nthe for the risk and the portfolio management, but they delegate the portfolio management to the\ninvestment manager. And so that's why we the main difference on the service provider side and everything\nelse is kind of you know your market maker is your APs or depository or your administrator. So that's\na whistle at the top store. So it sounds complex. So what additional complexities launching\ninternationally over top of US do you have over there? So one of the biggest things is probably\non the distribution side. And Ireland has, sorry, not Ireland. The Europe has 25 plus exchanges.\nAnd so if you're thinking about distribution, you're kind of thinking, okay, where am I going to sell\nthese products? Who am I going to sell them to? Am I launching on three, four exchanges in and\nacross Europe? You might do Deutsche Boris. I might do Boris Italiana. Now you might do the London\nStock Exchange. Each of those stock exchanges have their own rules. Some of them have different currencies.\nThere's language requirements. So it's a bit fragmented in Ireland and across Europe in terms\nin terms of that. That's probably one of them. One of the biggest things that people that people\nthink of. And then your or type of sales people you're going to have are they going to be on the\nground and those countries. And or you're going to sell through kind of like a distribution\nkind of platform like all funds or something like that. So like there's a lot of cost obviously\ninvolved in that. That's one of the biggest ones. And then just kind of understanding, I suppose.\nYeah, the market. Yeah. Well, I did. I saw Matrix one time of the, you know, the US exchanges\nversus European exchanges. And it's kind of a cobweb of difficulty. Yeah. And sorry,\nmight add, we've no consolidated tape in there. Yeah. Yeah. It's definitely a little bit\nmore confusing. So last question. Well, second of last question for you. What does growing a fund\nand compliance look like in Europe versus the US? And what you need to obviously think of the\nand the use it's overlay. And so you're going to be subject to the use it's regulations. And\nthe use it's are highly regulated investment products. And you have portfolio and the thing\nbut your portfolio transparency requirements. We've got the benchmark regulations. So benchmark\nadministrators are subject to make sure that their indexes are compliant with them certain rules.\nSo if you're bringing, you want to use an index that's in the, the US, you need to think whether\nyou can use that index kind of in Europe or else you have to use an EU benchmark and for your\ncomparison purposes, et cetera, et cetera. And then if you are using a, so obviously you've got\nactive funds and you've got your, your possible funds. So if you are using and if you're a\npossible, and you're using an index that index needs to be also in compliance with them\ncertain exposures to certain companies. So we've got our kind of party exposure limits. So you need\nto be aware of those as well. And then yeah, that's there, there probably be the main, the, the, the\nmain thing. Yeah. So before I let you both go, this questions for both of you. Hey,\nas we'll send you out of the mic, I'll pose it to you first. You see a lot of issues. A lot of\npeople trying to launch funds. What separates those from being successful and getting a launch\nout there and having longevity versus kind of fizzling out in the first 24 months?\nYes. So there's like, there's a lot of new issuers coming to the market. And as Kerry was saying,\nit's not as easy as just thinking, you know, this will work because it's working for everybody else.\nAnd so I think what we're, we're seeing a people who are innovative. So thinking a little bit\noutside the box. I know that's easier. That's easier said than done everyone wants to think\noutside the box. But in terms of thinking in terms of your distribution strategy and our funds\nin Europe are predominantly so to institutional investors. So there's not a huge retail base.\nBut I think that is going to change over time. So how are you going to manage that distribution?\nAnd Germany's going to be a big market for that. And educating investors as well on ETF. So\nif retail investors are going to be coming into the European space, educating those retail\ninvestors, those people are buying on their phone and using other sources. Yeah. So I think the\nreal winner is just those who innovate, differentiate themselves. And then obviously have super returns.\nYeah. Kerry anything to add. Thank you, Hazel. No, just have a couple of things. My observation\nto my own, my own experience. I think having patients, especially from the get-go,\npays off and trying to like think at the very beginning to do a lot of legwork in the beginning\nbefore you even start to like draft documents might will really come in handy in same time\nin the in the long run. I think, you know, knowing that you have a window, let's say three months,\njust to get SEC approval for your new product, trying to be patient through that, not get frustrated.\nI think just mentally, you'll be better off. But I agree with his. I mean, trying to do something\nthat's different, that separates you, having the relationships, having the support, the institutional\nsupport, having a relationship to brokers with people who are going to sell the product. I think\nall of that really, that that pays off. But it's, you know, it's hard. It's a competitive industry.\nSo anything you can do to kind of differentiate yourself. But also know that it might take time.\nWell, you know, we'll help. So first of all, thank you both for doing this. Oh, Brad,\nwe were so excited. Yeah. This is fun. It's our first podcast. Now you're officially unsponified.\nYou can listen to yourself in the car. We're going to be signing autographs in the rest of the day.\nSo where can people learn more about you, Carrie, and where can, you know, they learn about the\nservices of KNO Gates? Oh, sure. So we have a website, which I think is Kail Gates.com. I'm\nI'm a LinkedIn. I also have Instagram where you can follow me traveling. It is my handle's\nlight pack or frequent traveler. But that's, that's, that's not ETF related. Yeah. I think we have\na, we've quite active ETFs. Sorry, LinkedIn accounts, both at KNL and our own accounts. So yeah,\nyou'll find you find a lot of information that is there as well. Well, again, thank you,\nthose very, very much. And we are down here in exchange. So I hope you enjoy the rest of your time\nin Miami. Thanks.\nyou",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}