{
  "id": "14560794",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nWe are continuing our live from the Exchange ETF Conference series.\nToday we have on David LaVal.\nHe is with gray scale.\nThey are the largest Bitcoin ETF in the world.\nTicker, G, B, T, C.\nHe was kind enough to go through all of the intricacies of what it took to get these products\nto market all the conversations and back and forth that they had to have with the\nSEC in order to make this a reality and all the hard work that was done by the industry as a\nwhole to make this happen.\nIt's been an exciting time.\nWe talk about the competition in the space.\nWe talk about all the other things that gray scale does outside of just G, B, T, C.\nAnd I think you will find this to be very interesting and fascinating interview.\nSo without further ado, please welcome Mr. David LaVal.\nHey, David, welcome to the show.\nHey, thanks for having me. I'm really excited to be here.\nSo before we get started, I always like to ask, please give me a little bit about your background\nand how you eventually got into the position you aren't today.\nYeah, sure. So look, I like to say a guy who is sat in every leg of the ETF stool.\nI started my career on the floors of the stock exchanges, trading abroad, range of products\nstarting with small to mid-cap equities and the large cap equities,\nlisted derivatives, structured notes, and ultimately we were the largest ETF.\nExcuse me, large ETF market maker on the floor of the American stock exchange.\nAfter selling that business, I went to NASDAQ and ran NASDAQ's ETF listing and trading business\nbefore going to state street where I ran a segment of the business and the U.S.\nfolks on cap markets and prior to joining gray scale was the CEO of a global indexing firm.\nSo I've kind of sat in every leg of the ETF stool as I mentioned and I'm a kind of an ETF guy\nthrough and through. So I had the opportunity. I got cold-called by our CEO and he was like, hey,\nwe're going to build out an ETF franchise. You're got the perfect experience to do it.\nAnd at first, I kind of chuckled and said, that's cute. But as I learned more about the\nopportunity, it was something I had to dive into and it was really an opportunity to, you know,\nreally marry, you know, two incredible innovations of finance, the ETF in terms of an investment\nproduct and, you know, crypto or more broadly digital assets coming together. So it's been great.\nYeah. No. It's that's exciting and a really, you know, perfect background for this show.\nBefore we get into gray scale, before we get into GBTC, I want to just ask and I ask everybody,\nany hobbies, what do you like to do when you're not working? Oh, man. You know what people would\ntell me? I had a nickname that I'm the the concierge. So people in the ETF industry and people that\nI've worked with will reach out to me and say, hey, I'm going to be in St. Louis, where should I go?\nAnd I'll be like, you know, you know, your papies for ribs or, you know, where should I go?\nI'm in Dallas and I want coffee and I'll be like, go to weekend coffee. So I'm a passion about food, coffee,\nand I don't join time my friends and working out and running and, I don't know, I get a bunch of stuff\nthat I do. Yeah. So I'm going to have to get your number because I've been traveling more and I would take the\nrecommendations. So anytime you wouldn't be the only person I promised the concierge. That's I'm going to be calling\nSo we all know Grayscale. It's, it's a household name at this point. It's been popularized for\nGBTC, which is the Bitcoin ETF. However, you have many other products. Can you talk about all the\nthings Grayscale does for clients? Yeah. Look, we're the largest digital currency asset manager in the\nworld. Our flagship product is absolutely GBTC, which is the largest Bitcoin ETF. Now in the world,\nwe used to say the largest Bitcoin fund in the world. It's the largest Bitcoin ETF in the world.\nAnd we're really, really proud about that. But I think if you like take a step back and look more\nholistically at Grayscale, what we've done for the market, it's not about tokenizing the world.\nAnd you know, changing the way that everybody does everything and using crypto to do that. It's really\ntaking a look at how can we bring access to the broadest range of investors and deliver these, deliver\nthese crypto opportunities to them. And it's really about taking a look at the regulatory framework\nand utilizing the regulatory framework to really bring products to market that makes sense for\ninvestors. It's about education. And look, 2013 was when this product was created with the\nexpressive promise to turn it into an ETF. And we finally did it. It took 10 years. But we have\nbeen on journey to bring a number of different exposures and a number of different digital assets\nto market utilizing the same exact process that we utilize for GBTC. And we like to\nboast a four phase life cycle. So we have 17 digital asset products that have come to market.\nAnd they start as private placements. They season under rule 144. After a year or so, we\napply for them to be quoted on the OTC markets. After they're on the OTC markets being quoted\nand traded, that allows anybody to buy and sell them. So seeking liquidity in those products,\nwe have the opportunity to make them SEC reporting companies, which would be phase three.\nAnd then ultimately phase four is turning them into an ETF. So we have 17 digital asset products\nthat are living in one of those four phases. Some of them are single asset products like GBTC\nrepresenting Bitcoin. So ETHE for Ethereum and GSOL for Yosolana. And some of them are index based\nin nature. So our digital large cap fund, which is an index based product that holds a number\nof different tokens. So those are some products that we have in market. That's probably\nless exciting because people know about that stuff. The more exciting stuff is what's the\nproduct we're going to launch or think about launching today that's in our product development\ncycles. That's the GBTC of 2013 that the marketplace probably isn't necessarily yet ready for.\nBut we know is going to be something that's going to be in demand in five or ten years from now.\nAnd we've partnered with footsy on developing the crypto sectors. So we have all sorts of\nvery interesting innovative ideas. So it's about innovation. It's about utilizing the regulatory\nframework. It's about delivering exposure of crypto to our investors and really being that\ncrypto specialist for the market. Yeah, no. And it's definitely an exciting time. I think to be\na great scale. It seems like a lot of really cool things happening. Before we get into products\nand some of the regulatory framework and everything that just happened to get this Bitcoin ETF\nto market. I think it's important because I've talked to a lot of advisors. You talked to a lot of\nadvisors. I think the biggest hurdle for mass adoption in the wealth space is just basically education.\nYeah. Really agree. Yeah. So can we do just what is Bitcoin? And why should advisors be looking\nat this asset class? Yeah. So and it's core Bitcoin was developed with a purpose in mind.\nAnd that purpose was to be a peer-to-peer payment system and to be decentralized. And totally\ndecentralized and off the rails of anything that we are currently utilizing for our own banking\nor for our own ability to transfer the out currency. And I think part of the problem with the\nadvice community and with people in the US is that they're relatively pretty happy with their\npayment system that currently exists. And so you're absolutely right that it takes a bit of education\nin facing off with not even the skeptics, but people that just don't understand the utility of\nthis innovation. And the conversations that we have had, and listen, when I joined Gray Scale\nMike, my parents asked me the question, Mike, you know, ants asked me the question, Mike,\nkids asked me the question. And I think I also needed to be educated on it. And through that\neducation, there's real world utility. And the question that we get asked mostly, although it's\nstarted to dissipate from the advisors is why would I ever use Bitcoin to buy a coffee in the morning\nwhen I get up? And the answer is you probably wouldn't if you're in the US market. And that's where\nthe conversation starts and that's where the education starts. And then it leads to a really\nfruitful discussion about how advisors can think about Bitcoin, how advisors can think about\ndigital assets more broadly. And then how they can think about incorporating it into their portfolios\nand their clients portfolios. And it's been really, really rewarding to be that educator and to be\nthat source of education. We created a Bitcoin book. And the Gray Scale Bitcoin book is an actual\nphysical book that talks through exactly what Bitcoin is. And it's meant to be an education source\nfor advisors to keep on their desk to utilize as a resource. And then to also share with their clients.\nSo look, if any of you listeners want to get a Bitcoin book, info at GrayScale.com\nand ask for it and tell them that, you know, you heard about it on your podcast.\nYeah, tell them the David sent you. Exactly. Exactly. So I would buy Bitcoin. All right,\nI would buy coffee with Bitcoin if I got my airline points right as long as it goes.\nAs long as I get my reward points, maybe we can work that into the system. If Satoshi is listening,\nyou're not, you're not that far off. So, you know, stay tuned. Who knows what we'll\ninnovate with. So the race to spot Bitcoin approval was a bit to me like a soap opera. I watched it\nfrom afar on Twitter. Can you talk about everything that had to happen to really make this\na reality? Like when did you start thinking it seems like a long time ago that we were going to\nget this in an ETF? Can you talk about some of the hurdles that you had to jump through in order\nto get this product actually approved as a spot Bitcoin problem? How long we got?\nWe got as much time as you want. So, first of all, I never thought of it as a soap opera. I think\nmaybe I would have, if I was going to use a TV analogy, it might be more like a reality show.\nSo, but, and we'll have to, let the think on that's a good one. I like analogies. Look,\nwe had tremendous, tremendous conviction that we were going to deliver on the promise that we\noffered our investors that we were going to deliver Bitcoin in an ETF rapper. And in 2013,\nwhen this product was built, and it predates me, but it was built to mimic GLD's construct, a 33\nact, Delor Grantor Trust, that was going to be a building block for clients in their portfolios.\nAnd it was going to be an allocation that they were going to want, just like it's an allocation\nthat they have for gold or for S&P 500 exposure or or other commodities. And so, that conviction\nwas held very tightly by the entirety of our firm and upon joining, there was kind of a very\ninteresting opportunity that presented where whereby Chair Gensler made some comments in\nQ3 of 2021, where he said the SEC was ready to entertain the opportunity for Bitcoin futures\nETF. So, that's an ETF that holds Bitcoin futures. And, you know, we thought, wow, that's\ninteresting. If you're good with futures, you should be good with Spot. It seems to me,\nI think Eric Bell Tunis once said, you know, that's kind of like saying, we're okay with the\nrated R movie, but we're not okay with the PG13 movie, you know, to another analogy. And so, we,\nyou know, we were ready to go. And on the first day of trading in October that those Bitcoin\nfutures ETFs traded, we filed to Uplis, GBTC from being a publicly quoted over the counter\nprivate placement to become an ETF listed and traded on NYC ARCA. And, you know, as I think you\nprobably know, and your listeners probably know, there's a regulatory review process. We respect\nthe regulatory review process was about 240 days. And in, you know, late June of 2022, we were,\nwe were denied by the SEC. And on that day that we were denied, we, you know, challenged that decision\nultimately in the DC Circuit Court of Appeals under the Administrative Criceders Act. And we\nbasically said, listen, we've been treating unfairly, we're being treated in an arbitrary and\ncapricious manner. If you're good with Bitcoin futures, you should be good with Bitcoin's pot.\nAnd as a regulator, as a government regulator, you need to treat like pieces of business alike.\nAnd we challenged that decision. And ultimately in late August of 2023, we got a unanimous decision\nfrom the DC Circuit Court of Appeals. And they agreed with us. And they said that the SEC\nbehaved in an impromiscible way under the Administrative Procedures Act. And they could not\ndeny us on those grounds. And that set off a 45 day period where there was a little bit\ntense at times at Grayscale. We were wondering if the SEC was going to appeal that decision. We\ndidn't think they had a strong case to appeal. But they had the right to appeal. And after those\n45 days expired, the SEC decided not to appeal. And that, you know, put us on a path to have\nsome really constructive dialogue with the SEC. And ultimately, on January 11th, get to a place where\nwe were listing and trading on the NYSE exchange. You know, between that denial and the decision\nby the SEC to not appeal, there was a tremendous amount of work by the industry that largely\ngoes unspoken about. But everybody showed up. Obviously, the issuers were interested in launching\nthe products. But you had administrators, you had custodians, you had authorized participants,\nyou had market makers, you had exchanges that all really needed to show up. And in the two weeks\nbefore Christmas and the two weeks after the Christmas holidays, leading into that January 11th\ndate, it was quite a bit of gymnastics that the industry kind of went through. I've been quoted\nas saying, you know, we were all pretty much twisted up into a pretzel to make this thing happen.\nAnd the beauty of it is everybody showed up and it worked. And these products are behaving as\ndesigned and it's an incredible, incredible commitment by the industry to have shown up. And given\nthe ETF investors, what they wanted, which was a big coin spot ETF. What just had a curiosity,\nwhat was, you know, the major hurdle and or two that the SEC was pushing back on to make it difficult.\nYeah, so they essentially made three comments. One was that 40 act products have\ngreater protections for investors than 33 act products. So let's pause there for a second.\nI'm not a securities attorney. And I'm going to oversimplify this for your listeners. But\n40 act essentially governs products that hold securities, stocks, bonds, futures. And so\nthe Bitcoin futures products came to market under the 40 act. And the SEC said the 40 act\nhas greater protections than the 33 act. 33 act. Again, broad strokes, governs commodity-based\nproducts, gold, silver, platinum, palladium, Bitcoin. And so our products were coming to market\nunder the 33 act. So that was number one. The issue with that concern that they had is\nshortly after the initial wave of approvals for Bitcoin futures products under the 40 act,\nthey had approved a product that was brought to market by 2c, which was the Bitcoin futures\nproduct under the 33 act. So we said, oh, I guess the 33 act and the 40 act are both\npermissible. So that kind of hurt their argument there. They also said that the underlying\nBitcoin market is susceptible to fraud manipulation. And the underlying Bitcoin market does not\nhave the appropriate surveillance in place to ensure that fraud manipulation can be kind of governed.\nAnd those two arguments we appreciated. However, if they were good with Bitcoin futures,\nthey were essentially saying that Bitcoin futures market has appropriate level of surveillance.\nAnd if Bitcoin futures are based on Bitcoin spot, then implicitly they're comfortable with\nsurveillance that's going on the underlying Bitcoin markets. And ultimately, when we kind of\nfast forward and we go through the written briefs and we get into the courtroom, the judges right\nfully focused on the SEC's decision, which said many times that Bitcoin futures are different\nthan Bitcoin spot. And the Bitcoin futures market is different than the Bitcoin spot market.\nBut the judge is very rightly asked, very directly to the SEC. You've said a number of times in\nyour written briefs, so these are different. But you haven't said why. So tell us why. And ultimately,\nyou know, the SEC didn't have a strong enough answer to that question.\nWell, no, I appreciate you sharing all that. It was, again, I was watching from afar and didn't\nreally know all the inner workings. I'm sure those who are interested in the product and\ninterested in these spot Bitcoin products are going to appreciate that as well. So we talk about\nthe changes that needed to be made to GVTC once this approval was made. So the structure or, you know,\nhow you had to probably underlying swap underlying holdings, like how did that all work? Yeah,\nstructurally. Yeah, it seems like a, you know, a sexier question that it actually is.\nGiven that in 2013, when we built this product that we had an ETF in mind, we built it exactly\nfor that purpose. And so the product didn't change. Two things changed. Number one, the listing\nvenue change. So it went from being, you know, traded and quoted on the OTC markets to being\ntraded and quoted on NYC ARCA. So think of that as like a corporate action and a listing venue\nchange. Very simple happens all the time. And the second is the permission to have simultaneous\ncreation and redemption, which is the hallmark and kind of the bedrock of how an ETF works.\nIn the previous structure under the private placement construct, you could either have creations\nor you could have redemptions. And the problem was redemptions weren't permitted in the current\nconstruct. And so we were really kind of stuck in this, you know, limbo where, you know, we really\nwanted to uplist the product to become an ETF to allow for simultaneous creation redemption,\nwhich would allow for our product to, you know, much more closely track the underlying value\nof the assets. And in the absence of that, you know, simultaneous creation redemption,\nour product was somewhat behaving like a closed-end fund and wasn't doing a really efficient\njob of tracking the underlying asset. So it was at times trading at a premium and then at times\ntrading at a discount. And we wanted to deliver better for our investors. So that was really the driver\nof us creating, you know, this ETF and uplisting it to become an ETF. But it was really just a\ncorporate action for an uplisting and then simultaneous creation redemption. I think a lot of\nadvisors to or curious, you know, how the fund or how the ETF actually custities this asset\nand trades it. Like, because it's a typical from going through an exchange like Nizi, right, where\nyou're trading equities or, you know, you're trading fixed income. You know, this is a different type of\nasset class. Can you just talk structurally about about that? Yeah. So it was incredibly innovative in\nsome ways and the same old story in other ways. So if you're an ETF geek like I am, I'm proudly\nan ETF geek, we leveraged a lot of what we had already seen in the past. And when GLD came to market,\nit was also a bit of a conundrum in the sense that you had an administrator that was responsible\nfor managing the creation of redemption of ETF shares. You know, those firms are like, you know,\nback in New York or state street or JP Morgan or US Bank or Northern Trust. But typically with ETFs,\nthat administrator is also the custodian. And those, you know, providers of administrative\nservices for ETFs, you know, didn't have the ability to custody the actual gold. I mean,\nthere are rocks, I always used to say they're, you know, GLDs are pretty simple product. It's rocks\nin a box. But they didn't have the box to hold. They didn't have the vaults. And so you had this,\nyou know, strange situation where HSBC was going to be the custodian of the gold. But, you know,\nBank of New York in that case was going to be the custodian, excuse me, the administrator of the ETF shares.\nAnd so you have this kind of divorced situation where the administration and the custody of the\nproduct are separate. It's the same exact thing that we have seen with these big coin spot products coming\nto market. Now, fortunate for us with a 10 year track record and having a strong relationship with\nCoinbase and actually understanding how to strike an ad for our product and already having\nBank of New York is our administrator. You know, we actually understood exactly how this was going\nto work. And we were really proud about that. And we were preparing for that because we knew we\nultimately wanted to have an ETF in market. But it wasn't actually that complex to be honest for\nfor others who are not digitally native. Perhaps it was something that was a little bit more\ndifficult for them. But for us, honestly, we already had a relationship with Coinbase and at launch,\nwe had $28 billion in assets that were custody there. And we already had a relationship with\nBank of New York who was striking our nav's on a daily basis in doing the administration administrative\nfunctions for GBTC in the current form before it was an ETF. So it's actually a lot less sophisticated\nin kind of, you know, curious than you might think it was. So this was kind of, this was the first time\nat least in my career since I've been in the ETF space that we watched a bunch of horses at the\ngate at the same time in the whistle blew off. Now you have, you know, competition in similar products.\nHow was grade scale viewing, competing in the space? Obviously you're the oldest. But how are\nyou viewing competing and growing in the space? I mean, we just got off the finish line.\nYeah, yeah. Listen, we're happy to have everybody competing with us candidly.\nWe showed up with $28 billion in assets and a million investors and a 10-year track record.\nI mean, this is not new game for us. And we're affirmed that really understands how the ETF market\nworks as well. And by the way, I say that respectfully. And we are big, big believers in investor\nchoice. So I know we talked about Bitcoin futures and the Bitcoin futures products. We're not an\ntype of Bitcoin futures product. So it was about investor choice. Like, there are people that are\ngoing to utilize that for their Bitcoin exposure. Great. But we showed up with a tremendous amount of\nexpertise. And it is unprecedented to have 10 products kick off on the on the same day. That was\nsomething to really, really watch. But I think more importantly, it was watching the industry show\nup and support all those products. Nothing broke. Everything worked as designed. You know,\nday one, we had, I think, $4.3 billion of national trading volume. That is insane.\nGBTC traded with GBTC was the ninth most actively traded ETF out of the 3500 ETFs in market\nwith the likes of the Qs and spy and IWM. And that's incredible. So this thing all kind of worked\nas designed. Investors are going to have choice that comes with the responsibility. And I know\nthere's going to be advisors that are listening that need to understand, you know, not every ETF\nissuer is critical. He and not every ETF is critical. And that's something that I have been saying\nfor the 15 years. I've been, you know, pedaling ETFs. I'm a huge believer in ETFs. But you have to do\nyour homework. And you have to know who you're partnering with. And you have to understand, you know,\nexplicit costs and the implicit costs and and how to best make a decision for you and your clients\nportfolios. So now that this product has been approved, where do you see the evolution from here?\nI see leverage products already in the market. I'm sure we're going to get active. So where do you\nkind of see the evolution now that you've got the first spot approved? You know, it was like a race to the\nstart line as opposed to a race to the finish line. It's, I don't know if any of your listeners\nran track, but you're looking across and you're like, oh my gosh, I'm running the 400 and everyone\nis lining up. And I'm across the infield. And so you do a dead sprint diagonal across the, you know,\nthat football field. And you're ripping your tracksuit off and hopping in line sweaty. And then you\nhave to run the 400. That's the way it feels, right? We sprinted to the start line with everybody else.\nAnd now we actually have a real race to run. And I think there's two components to the evolution.\nI think you were alluding to, you know, what's going to come next from a product perspective.\nThere is absolutely going to be a whole ecosystem of products that are in and around, you know,\njust a spot Bitcoin exposure. You mentioned levered. You mentioned in verse,\nyou know, there's going to be an options market that's going to be established. And there's going to be\ntarget outcome products and buffered products. And there's going to be covered call products. We filed\nfor one. There's also going to be, you know, other traditional overlays. You could see a,\nyou know, lowball Bitcoin ETF. You could see, you know, something that targets a certain growth\nor looks at other factors. You might see some that are, you know, bringing and incorporating\nfactors that are really only, you know, in the crypto market that are going to now be incorporated\ninto the traditional ETF market. That's kind of one side of it. But then the other side of it is\nall about access. We haven't even like scratched the surface on access. So the story here is that\nETFs have long democratized investing for investors and bringing asset classes that were\navailable to a subset of the market and made available to everybody. And I know we talk about\nSPY being the first ETF in market and we talk about that being, you know, a very plain vanilla\nexposure. S&P 500 exposure with a market cap weight. Well, let's be honest, in 1993, that was an\nexotic institutional exposure that was brought, you know, to the masses. And then we saw international\nequities and fixed income and subsectors of fixed income and commodities and currency and currency\nhedge. Like this is just another, you know, example of an asset class or an exposure. It was\navailable to a subset of the market that now is available to the masses. And when I say the masses,\nI mean the advised market. We are big believers in partnering with our advisors. Sure, there are\ngoing to be individual investors who are going to buy on their, you know, self directed accounts.\nBut this is really about partnering with the advised market, partnering with advisors, educating\nadvisors, educating the client base. And that's going to take on boarding at all these platforms.\nThe wirehouse platforms, the independent platforms and going through due diligence exercises at\nall of these, you know, houses that are going to look to incorporate, you know, Bitcoin into their\nclients portfolios historically before the ETF didn't really fit. And these wealth management\nplatforms were saying this is not for us. We are not waiting into the digital asset market.\nNow that they have it in the form Bitcoin in the form of an ETF, it kind of fits into the\ndue diligence process. And they can no longer really avoid the question.\nAdvisors tell me their clients are asking about it. Advisors tell me that they need to be as\neducated or more educated on this topic than their clients are. And we're here to do that.\nSo it's about new product exposures and it's about access. Yeah. And it's interesting.\nYou know, Bitcoin is probably the first asset class where the client may no more than the\nadvisor, right? And they bring that to the advisor. They bring the idea to the advisor.\nThe million dollar question and you and you walked right into this, which would be,\nif you're sitting down with an advisor, where does GBTC kind of fit in the role model portfolio\nconstruction in your opinion? So Bitcoin means different things to different people. And that makes\nit fascinating for like an asset allocation conversation. But let's actually, let's actually mimic\nthat conversation because the advisor's first going to say, I wouldn't use Bitcoin to buy\nmy coffee in the morning. And I'm like, you're right, because you're in the U.S. market,\nyou're trust your financial system. But maybe you were in a country that had 40%\nannualized inflation, you would want something that has a little bit more stability to it.\nAnd by the way, we're not saying that Bitcoin isn't a volatile asset. It absolutely is.\nIt's going to go up. It's going to go down. And we've seen that even since the launch.\nBut I would say, you know, the use case for Bitcoin is something that is in the ILO\nthey be holder. And if you are someone who needs to transact cross-border and you need to\nmaybe get money to your family in another country that doesn't have, you know, strong payment\nrails. And you're going to rely on a 50 year old, you know, process of very slow, very expensive,\nyou know, wire transfers cross-border. You might really find it attractive to have a 24-7\npayment rail that's very cheap and lightning fast. And so we'll talk about that use case. But for\nthat advisor and the use case that they need is like, no, how does it fit into my portfolio and\nmy client's portfolio? There's really two things. One, it's a digital store value and has properties\nthat are much like gold and quite frankly even better than gold. And so, you know, you might\ntrim back your gold allocation and put a Bitcoin allocation in. But for me, the strongest reception\nthat I've had is this is a transformational technology. And for the demographic of the traditional\nadvisor, you know, which is not much different than myself, we've lived through a couple of very\ndisruptive technologies. And the first disruptive technology that I experienced was in\nprobably late nineties. I'm on the floor of the American Stock Exchange, you know, making\njokes about Jeff Bezos like why in the world would I use the internet to like buy a book. There's\ntwo borders across the street and two Barnes and Noble down the block. Like I would never do that.\nAnd it's expensive to ship stuff. And I was a knucklehead. I was young and I didn't appreciate\nthat there was going to be an application of this disruptive technology, the internet that went beyond\ncommunication. Chat rooms and email. I was like, I get it. I'm using it. I'm never buying anything\nover the internet. I was young. I was silly. I was dumb. The second disruptive technology in our\nlifetime for me was a smartphone. And I was so excited about having my first smartphone because,\nyou know, I didn't have to carry around some sort of MP3 player and a phone. I didn't have my\nfirst smartphone and complain that it didn't have GPS and able technology. And I didn't have a, you\nknow, the ability to have, you know, a black car come out in front of my, you know, my apartment\nto pick me up. So those are two disruptive technologies that the first application was really,\nreally useful for me. And then it permeated the rest of my life, the smartphone and the internet.\nThe issue here is we have another disruptive technology upon us. The first use case is kind of\nuseless to many people in the US market. And I remind them it's a disruptive technology. And this is\ngoing to have the properties of growth tech. And so you should think about it is a disruptive technology\nand to have an allocation in your portfolio that has a field of growth tech, volatile,\nhigh returns. And, you know, we've done a bunch of research on this in terms of, you know,\n60, 40 portfolios and what does it fit in and what the allocation should be in our research on our\nwebsite, which you know, I encourage your listeners to check out is that a 5% allocation is really\na sweet spot of having like, you know, great risk adjusted returns and high quality sharp ratios\nand the likes. So that's the way that I have the conversation and it resonates and puts in, in, in, in\nreal world terms for the advisors out there. Well, David, I can't thank you enough for joining me.\nThis was education on site full fund conversation before I let you go. Where can people learn more about\nyou? Where can people learn more about grain scale? You can learn more about me hanging around ETF\nconferences. It's like we are here. But GraceKale.com is much more interesting for your listeners. We\nhave a tremendous amount of research and a tremendous amount of resource to educate our advisors\nand our clients and potential investors. So we welcome you to do that. Well, again, thank you so much for\njoining me. Thank you so much.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}