{
  "id": "14607775",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the ticker uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nWe are continuing our live from the exchange ETF conference series with Weldon Rice.\nHe is with Craft AI.\nThey are Korean asset manager and tech company.\nWe talk about all the things AI is doing to help manage investments, as well as some of the\nthings we might be seeing on the frontier of AI.\nBut more importantly, we want to talk about a couple of their ETFs.\nTheir first their US large cap ETF, ticker QRFT, and their large cap Momentum ETF, ticker\nAMO M.\nSo without further ado, please enjoy this episode with Mr. Weldon Rice.\nHey Weldon, welcome to the show.\nI think so much is great to be here.\nSo before we get started, can you tell everybody a little bit about your background and how\nyou ended up in your role at Craft?\nAbsolutely, so my name is Weldon Rice.\nHead of AI ETFs at Craft Technologies.\nI think probably a little bit of my background.\nI think the uncommon would be the sort of progression of my career and life.\nProbably the biggest theme.\nI started out actually not in the finance industry.\nI worked a little bit in higher education and I moved the broad whenever I write out a college.\nSo I've been in Asia, living in Asia for a bit over 12 years.\nAnd then I ended up studying in finance while I was there in Korea.\nI studied under some quant hedge fund managers and some really big players in Korea,\nlike Goldman Sachs had there and really really fell in love with finance,\nespecially quantitative approaches to finance.\nSo yeah, I got an opportunity to come on board with craft technologies.\nAnd I know we'll talk a little bit more about what we do on a moment.\nBut yeah, I started out in sort of some marketing and then now heading up in the ETFs.\nIt's definitely exciting time to be not only any ETFs, but also in quant AI driven ETFs.\nBut before we get into the nitty gritty of all that, I always like to ask,\nwhat are some hobbies?\nWhat are some things you like to do outside the office?\nWell, right now I have a six month old and a three month old.\nSo I'd say my hobbies are going out to the park and you know, watching a\nmystery show on YouTube with my daughter and yeah, those sorts of things.\nBut outside of that, I've always been a big sports fan, played lots of sports in high school.\nAnd I just love watching. So it was great, you know, as at time of recording,\nwe just watched a phenomenal, super bowl last night.\nIt was incredible. So it was great to be in town in the U.S. here actually watching it.\nYeah, it was fun. It was a great game. And look, I don't envy you a minute for having to\nwatch a mystery show. I went through that. I'm out of mystery show. So hopefully it doesn't\nlast too much longer for you. Yeah. So let's talk about craft. I know you're an AI driven\nmanager. We'll definitely get into all that. But let's talk about, can you talk about the breadth\nof services that craft offers just outside of ETFs in general? Absolutely. So as you mentioned,\nETFs is just one part of what we do. And we were actually founded in 2016. And we're\nfounded as an investment technology company. So outside of just the ETFs, we also do\nmodel portfolios. We've run different sort of vehicles. So we're really a B2B solution\nproviders. We work with, we're based out of Seoul, Korea. And we work with a lot of largest financial\ninstitutions in Korea starting out. A lot of that was model portfolios or portfolio construction\nhelping them to launch AI power products their own products. And then we also do a bit\nwe've helped them build some robot advisors and other such things like that. So we have a bit\nin some of the tech side too. Have a little bit of footprint. But our bread and butter is really\nconstructing portfolios. Whether that be, you know, security selection, mainly in US equities or\nit could be multi asset, mainly using ETFs for exposure and and adjusting, you know, from a top-down\nperspective to the asset allocation as well. So yeah, we've really expanded our breadth of what we do\nover the years. And in two years ago, we received investment from Sochbank, about $140 million.\nSo that was a, that was a big change for our firm and really changed a lot for where we're going.\nSo I actually had a question about that. What is an investment like that due to help kind of jump\nstart? The company is a whole, I mean, it probably gives you the ability to do a lot more marketing.\nI mean, I see you guys everywhere. You guys are doing a fantastic job of being anywhere. Can you talk\nabout how that's really helped take you guys from maybe a smaller company to, you know, a very\ninstitutionalized name today? Absolutely. So when I joined the firm, pre-investment, we had about 40\npeople in the firm and, you know, we're really, we have a lot of engineers in our company. Actually,\nthe majority of our employees are the researchers or developers. And, you know, we built our AI models\nall in-house, all vertically integrated. So we source the data, we clean the data.\nEverything is done in-house in our firm. So, you know, what that investment did for us was the\nability to want to expand our capabilities in terms of expanding into different asset classes,\nthen able to expand even into into different jurisdictions. For example, we, we mainly start out\nin US markets, but we've expanded to other Asian markets as well. And on top of that, we, you know,\nwe were able to also change a bit of the frequency. So, in terms of frequency of our strategies,\nwe're looking at anywhere from interday strategies to all the way up to about one month. So,\nwe don't really get past, uh, doing predictions more than about one month out. But, uh,\nyeah, we were able to expand some of our capabilities and, and that ended up doing some a little\nbit more, you know, institutionalized strategies such as long-short and other things like that\nthat we've, we've been able to launch in recent days. Yeah, it's exciting and congratulations to you,\nguys. And so, let's talk about AI, um, and kind of quantitative processes a whole, uh,\nI know AI is thrown around and there's a lot of different things that go into what actually AI is.\nAnd in a high level, you don't, you don't really have to get into specifics here. But,\nwhat, what types of AI, or, or how are you utilizing AI? Are you looking at pattern recognition,\nand sentiment, news, all of that, none of it. I mean, at a high level, what is the firm\nin pulling in terms of trying to make these types of predictions? Absolutely, absolutely. So,\nwhat it comes to, our official intelligence, um, you know, we've just seen a huge explosion,\nespecially with CHATCBT. Um, and that brings with it a lot of, uh, really great, you know, just\nsort of adoption and people's understanding of what it is, especially when I first joined the company.\nBut at the same time, it also can bring a bit confusion on sort of what people are doing with\nartificial intelligence, and especially in financial markets and how we're using that.\nUh, even in the ETF space, we usually start out with, you know, telling people that we're not\nan AI-thematic fund. We're a fund that uses AI to pick the stocks in the fund. So that's usually\nthe first point. Uh, but then, you know, you can really drill down AI into about two different categories.\nThis sort of analytical AI, which is looking more at pattern recognition, looking at what is\ntermed in the AI industry structure data, basically new miracle data. So we're looking at, you know,\nprice, we're looking at different market data, uh, different ratios. Uh, and then there's the\ngenerative AI or, you know, AI that's looking at more things like texts or images and other things\nlike that. So from our perspective, craft originally started more from the analytical side. We're\nvery much from a quantitative background. Sometimes we color ourselves like a quant 2.0 in a certain\nsense, because what we do is we take a lot of those academically researched factors and\nand sort of things from a lot from the quant space that that have been around for years.\nAnd what we're trying to do is use AI to bring a more robust exposure to those factors.\nWe're trying to look at more like risk adjusted returns, especially when we're looking at\nsecurity selection in that space. In terms of what we do with the large language models,\nwe don't employ as much on the on sort of textual and sentiment data. But we do have some\ncapabilities there, and especially, you know, recently we just launched a new ETF with LGI research.\nAnd one of the reasons why we partnered with them was because they have really great capabilities\nin the large language models. And so that that fund actually has the ability to look at\nsentiment data from news and incorporate that into the prediction that comes out for the fund.\nSo yeah, we're we're using trying to use both technologies. And we really try to say at the\nforefront and try to innovate and push the boundaries of what we can do with AI in the space.\nWhile at the same time, making sure it makes sense. Yeah, you know, we don't just use AI\nso we can put it in the marketing materials. I mean, I'm more in the marketing side and I totally,\nyou know, get that it's great to put AI in everything. But, you know, we don't, we just try not to\nput AI in there just just because. Yeah, and you actually led kind of right into my next question,\nwhich is, you know, how often is your process kind of building on itself? Is it using machine learning?\nAnd all and basically the question is, you're not just letting it run wild. Do you have some\nguardrails on it? But I'm sure you're implementing some some evolution over time.\nAbsolutely. So you mentioned a few things in there in terms of, you know, development of the,\nof the AI. So, you know, we are constantly updating and researching. We have a lot of researchers\nthat are looking at different ways we could, you know, employ different metrics or different\ndata into what we do. And so, sorry, kiddo, go back. I got hung up on that second question.\nWell, the original question basically is, are you allowing the process to, are you implementing\nmachine learning? Yes. And is that changing your process over time? Right. So that's actually the\npoint I wanted to make. I remember you mentioned machine learning and that's also a bit of an interesting\ntopic in it of self. AI, machine learning, deep learning. All these things were, you know,\nbefore I sort of got into this sort of AI industry were a bit foreign to me. And I think for most\npeople, you might get confused on what the difference are between those. You know, they're really\nAI is really a broad term for both of those machine learning and deep learning. We actually implore\nboth machine learning and deep learning in what we do. And the way you can think about it is this\nin terms of, you know, traditional financial models were built on, you know, this sort of linear\nmodels of sort of regression and sort of regressing back to the mean. And what we're trying to do\nwith machine learning AI is to build a non-linear model because we know that markets aren't linear.\nAll right. So we know that. So that's what we're really trying to do. And when it comes to machine\nlearning and deep learning, just think of these as sort of like a scale. And as you slide along\nthe scale, you start with machine learning, which are a bit more, you know, simpler models.\nI mean, simpler in terms of their less complex, a little bit easier. You can build, see, a little\nmore insights. But they have less linear, non-linearity to them, whereas deep learning, which is what\nwe also use in our, in our models. You know, that is a bit more non-linear. Also a bit harder to,\nyou know, dig down deeper into what actually, you know, was the driving force for the decision.\nAnd so yeah, our models are constantly learning on updated data as it comes in and learning\nas the markets change, which is quite interesting to see. So before we get into your ETFs,\nI want to talk about two of them. Does the, I just had done an interview last week with an attorney\nwho was setting up ETFs in Europe? Is there an ETF market in Asia? Oh, absolutely. Absolutely.\nThere's an ETF market in Asia. There are many ETFs in Korea. In fact,\nMere Asset, one of the largest SM managers in Korea, actually owns Skullblex ETFs. Several other\nETFs around the globe. So they have their own locally ETFs that they have. So Asia has a pretty\ndecent ETF market. I would say. Yeah. And my actually, my boss and sort of mentor in this industry,\nthe ETF Francis O, who has spearhead a lot of what we've done in our ETF industry, has spent,\nyou know, his whole career almost 12 years working in the ETF industry in Asia for Vanguard\nDirection and now craft the AI, which is, I always find such an interesting career trajectory\nto go from Vanguard to AI, especially making a stop with direction on the way. So yeah,\ngood market there in Asia as well. So let's talk about a couple of your products. You've got,\nI'm just going to say craft the QRFT, the US large-cap ETF from one I gathered,\nobviously it's AI driven, but you also include in there with human intuition. Can you explain the\nstrategy, you know, as a whole and how you combine those two things? Absolutely. So what what we mean by\nhuman intuition is that and you mentioned this a bit earlier in terms of looking at guard rails\nand portfolio construction. You know, there is human intuition in terms of how we look at\nportfolio construction for the AI. So, you know, for example, you know, the universe that we start with,\nthat's chosen by humans, right? And, and sort of the factors and things that go into the model\nare chosen by humans, the data that goes into the models, chosen by humans, but that's about\nwhether the human process stops. We let the AI then learn the data and we, you know, fully trust\nthe prediction that comes out from the model. So we don't alter that. We don't go, you know,\noh, we're in this stock this month, really? I don't think so. We better, we better, you know, dial\nthat down a bit. We don't do that. We let we trust the process, but at the same time you mentioned\nthis a bit earlier that we do have guard rails in terms of, you know, in terms of how much\nconcentration we can get into different sectors. And so, yeah, we definitely do and we have some,\nyou know, risk controls within the models to help, you know, help that out as well. So, yeah,\nwe, we really try to follow some, the investment process of, you know, human managers,\nbut we're trying to let AI have a different look at what the data is telling us and really bring\na new approach, I think, to, to portfolio. So you're investing in, in, in large cap U.S. securities,\nor large cap U.S. equities only, um, about how many names can be in the portfolio at any given time.\nSo, for QRFT, that can be about 300 to 320 around there. So, that fund is a really a well-diversified\nfund. And we, we made that really to be an enhancement on sort of a traditional large cap\npassive exposure. You know, we're really trying to, we kind of call it, like, say that we're long-term\ninvestors, but at the same time, we have a short-term, you know, view. So, we really try to make\nadjustments in the short-term on a monthly basis, uh, trying to, you know, find sort of patterns in\nthe market to find little inefficiencies here and there. And then over the long-term build-up,\na really robust risk adjusted return. And hopefully, you know, we believe that's going to be,\nyou know, bring out for over time. So, with 320 names, how does the portfolio waiting work\nis that a machine-driven process to kind of pick out, you know, and rank maybe the best ideas\nor can you just talk about portfolio waiting? Absolutely. So, the first part of the process is a bit\nmore looking at our factors. So, we use traditional academic factors as well as some of our own proprietary\nfactors. And then we, you know, score the securities based on that. And then we also have a model that\ndoes the waiting process as well. So, we, we, we look at, okay, here are the, here are the scores\nfrom the factors and we look at, put that in another model with other market data as well as some\nof the fundamental data from the securities. And that will give sort of its prediction for\nwhat's the best stocks that we feel over the next four weeks have the best price appreciation.\nSo, how, how's the portfolio rebalanced or traded? Is that a monthly rebalanced? Did I hear that?\nYes, that's right. Yeah. So, we do monthly rebalance. And we, yep, refer to that from.\nSo, I know being active. We run an active strategy. You guys are running an active strategy.\nCan this, can QRFT get defensive based on your signals? Or does it always kind of\nstay fully invested? Or does the, the defensiveness of your seeing weakness in the market,\nkind of direct in which assets it may be going to? Yeah, I mean, because as equities, there's\na only a certain amount of defensiveness you can, you can get. But, well, because we're looking at\ndifferent factors in the market. For example, when the market does get a bit more defensive,\nwe see that, you know, value factors and quality factors tend to be the, the factors driving the\nmodel a little bit more whereas, you know, when the market's really growing, we start to see a\nbit more on momentum and some of these other growth factors that come in. So, it can't get a bit\nmore defensive and it really adjusts itself over over time. So, speaking of momentum, you also have\nAMOM, which is your large cap momentum ETF. So, what is the biggest difference between the U.S.\nequity large cap and this one, which is the momentum version? Right. So, in this case, we're sort of\nseeing going out one factor. The momentum factor, where is QRFT, it's looking at multiple factors\nacross, you know, as many of the factors there. So, that's one key difference. The other is the\nnumber of holdings. So, QRFT is very well diversified, you know, I call it kind of a slow mover,\nbecause, you know, it's got a lot of a lot of holdings in there. AMOM is a much more, we like to say\nQRFT from Korea, we like spicy food. AMOM is a lot more spicy. We only have 50 holdings there.\nWe can get some pretty high concentrations in sectors and in stocks. I mean, we have some\nguardrails there, but we can go up to 50% in a sector and we can get somewhere on 9 to 10% in a\nholding at some point. And I think recent market conditions have sort of, you know, been\nreally interesting to see, because, you know, the market is very concentrated right now. And so,\nwe're actually seeing our momentum fund, you know, really gets some pretty, you know, pretty\nbig concentration in some of these holdings. It's interesting. So, is it also just to compare\nthe two again, is it also traded on a monthly basis? Yes, yes, it is also just like QRFT on a\nmonthly basis. Interesting. So, I know you guys have a lot of other products and I'm going to have\nyou or somebody else from your team back on, because I know you're going to keep launching ETFs,\nbut let's talk broadly as we kind of close out. How should advisors, if you're a registered\ninvestment advisor, how should they be thinking about implementing AI driven strategies inside\ntheir portfolio? Like, do you see them as a holistic solution or more of like a satellite exposure?\nThey should be tagging or adding along maybe some more traditional passive holdings? Yeah, absolutely.\nI think, you know, our view is that, you know, AI is, we definitely believe in the technology.\nWe believe in what we're doing. But at the same time, we understand that, you know, AI is not perfect.\nAnd so, you know, we believe that AI is a great compliment. You know, when you think about\nwhat artificial intelligence is doing with the data, it's really taking a very different view\nof the market and data than a human manager would. So, we believe this provides a very interesting\ndiversification effect for, you know, advisors to look at. And this really compliments a lot of\neither, you know, QRFT. I think could be a good compliment to maybe a more of a core exposure,\na passive exposure. If you're looking for a little bit of active enhancement to a more of a\npassive exposure, to sort of a large cap, I think it's a great compliment to be sort of a sleeve\nthere to give an active data-driven systematic but flexible approach. And then AMOM is a bit more\nof a satellite stylistic fund that's going to give you, you know, an ability to be a bit more like\ntrend following of the market. So, instead of just taking that long-term view that, okay, the market's\ngoing to go up over time, let's take some, you know, bets on the market of what we're looking\nat currently and follow some of the trends that are going on in the market. So, kind of last question\nand it's, it's AI-driven again. I agree with you and I have the same sentiment as you that AI is\ninteresting, it can do a lot of things but it can't do everything. You have a lot of engineers on\nyour team. At what point do you think, in total prediction, nobody's going to hold you to this?\nYou think that maybe the human side is going to take a step and maybe sit in the back seat a little\nbit and just let AI make all of the decisions. That's, I mean, we believe that that future is\nvery possible, maybe not for every, but we definitely see that this is really, I think, the future\nof where a lot of profilish construction is going to happen going forward. But at the same time,\nthere are so many different reasons why people invest in different themes that they might want to\nwant to cover. So, AI is not going to cover every single thing but we believe that\nmajority of, you know, portfolio construction and things going forward is actually going to be\nhave some part in AI. Whether it be, you know, the AI actually making the stock selection,\nor whether it be, you know, analysts or teams using AI for their research and coming up with\nsome ideas on their universe or their investment thesis, we definitely see AI as a huge part\nof that going forward. Well, Weldon, I can't thank you enough for joining us. I really appreciate it.\nBefore I let you go, where can people learn more about you and learn more about craft technologies?\nAbsolutely. Well, you can always find me on LinkedIn. I'm craft technologies. You can check out\ncraftaeth.com or crafttech.com. And by the way, craft is with a queue, not a sea. And actually,\ncraft distance for quantitative craftsmanship. If you, if you curious about that, so crafttech.com or\ncraftaeth.com, you can find us, we'll always have it to reach out. Well, again, thanks for being here.\nI hope you enjoy the rest of your week. Appreciate it. Thank you very much.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}