{
  "id": "14653028",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nWe are still live from the exchange ETF conference.\nAnd today we are joined by Johan Gran.\nHe is with all the aunts, and they have a big suite of buffered ETF products.\nThis was the first time getting education.\nFor me, at least on buffered products, and I thought Johan did a great job of explaining them.\nThere are many different use cases.\nI think you will be able to find for these products inside of your overall model portfolio\nconstruction, or even as a standalone.\nSo without further ado, please welcome Mr. Johan Gran.\nHey Johan, welcome to the show.\nThanks for having me, it's about pleasure.\nSo can you tell us a little bit about your background and how you ended up in the position you\nare today?\nSure, yeah, it's a longer backdrop perhaps, but I've been in the investment asset\nmanagement side of the business for a good 20 years.\nSo a lot of what I've been doing has to do with portfolio and management and asset allocation\nand mixing and matching and building different types of risk profiles.\nAnd I've been doing that in different capacities, started out after college working for a\nuniversity endowment fund.\nAnd it was very fortunate to be closely aligned with the consulting firm at that time.\nThose helping us to turn the whole thing around from where it was.\nBut I saw basically a complete duo over of a $250 million portfolio getting across, you know,\nequity, fixed income, hedge funds, real estate, timber, the whole thing.\nSo that was my, like, kind of where I cut my teeth on this industry.\nAnd after that, I joined a consulting firm.\nSo that was kind of a natural progression for me.\nAnd then I helped other endowments and fundations and pension plans to build and manage\ntheir asset portfolios, manage your selection and the whole thing.\nAnd my next step in the natural progression, if you will, also now I ended up building\nportfolios for a big insurance company based out in New York.\nAnd we put together, you know, all kinds of risk management type of strategies.\nAnd I got to work with asset managers, you know, some of the best in the world over the already\nboth in the US and some of them in Europe, to construct, you know, some of this was volatility\ndriven management.\nAnd some of it was risk parity based, momentum based, rate overlays, you name it.\nThey got pretty complicated at the end of the day.\nGreat experience.\nThose have learned a lot about how to, like, squeeze the most amount of return\nthat you can out of the least amount of risk that you take, right?\nAnd I'm only mentioning all of this because it's going to lead into where we're at today\nin the position that I have working with ETFs for Aliens investment management.\nWe launched a series of buffered ETFs or defined alchemy ETFs.\nAnd it's a very clean way to get exposure to a risk managed product in a very transparent way\nthat can help you build confidence into what you do on the investment side.\nSo maybe a bit of a long story there, but that's kind of the backdrop to why I love what I do\ntoday, but you know, it's all fits really nicely into how you can manage money.\nYeah, you and I are very similar in the fact that trying to squeeze the most possible return out of\nthe least amount of risk, we can probably talk about it a little bit later about, you know,\nthat the benefits of low volatility and what that can do over the long term.\nBut before we get too deep into the business stuff, I always like to ask,\nwhat are some of the hobbies you have or things you like to do outside the office when you're not working?\nYeah, so it's changed over the years, as you can imagine.\nSo like many on your show, I have kids and right now, well, right now, there's three full stop.\nBut they're on his sports, you know, ranging from 11 to 14 and 15 year old.\nSo I spend a lot of time outside of work, you know, going to soccer games and volleyball,\nand you know, that kind of stuff and the weekends are kind of packed up.\nSo I love that part of it, but the, on a personal level, I have a couple of hobbies, you know,\none is evolving smoking, smoking meat that is. So I have a thousand pound smokeer custom built,\nyou know, and I spend a lot of time on that when I can, it's kind of the backyard,\nkind of, you know, everybody knows that is home, you know, he's busy with the smokeer,\nkind of builds the whole family around that one thing.\nAnd I've also started to get back into to nature in a different way than I,\nthan I have been able to over many years. And I like to go out and do back country, backpacking.\nSo I take, you know, between four and six days, kind of cut out, rely on my GPS signal to\nfor communication purposes and spend some time in environments where I get to think more about,\nyou know, the next step and have a different viewpoint and clear out my head.\nAfter, you know, busy, busy, busy, busy days in the office or to speak. So I love that.\nAnd look for that challenge where I tell my wife, it's a 50, 50, I'll make it, but it doesn't mean\nthat it's a 50, 50, I'm gonna make it back home. It's just like, you know, trying to find that next\nchallenge. Yeah, and that's, I mean, especially when I were just joking, you're, you're a two\nphoneer, I used to be a two phoneer and it's like, you need those days. Like, you need to go out and\njust clear your mind and like reset a little bit and I'm sure that's helpful and also I'm deep into\nthe sports as well. I spend more time thinking about use seven girls soccer than I probably should,\nbut it's fun. I enjoy it. But let's talk about Aliens. So long standing company, many different\nproduct channels. Can you talk about the firm as a whole and how they're out there helping clients?\nYeah, so it's fully focused on risk management and it's the way that the firm has been built.\nSo Aliens investment management is wholly owned by Aliens life based on a Minneapolis\nand as an organization, Aliens investment management has been managing the risk that comes with\nissuing insurance types of products. So we've been making promises to people for many decades\nand to deliver on those promises, you know, you have to manage risk accordingly. So everything that\nthe team has been built to do is to make sure that whatever outcome or guarantee that we've been\npromising people were delivering on. So the whole trading desk, the portfolio managers, the\nthey've all been trained to deliver different outcomes. But this is, of course, before we went into\nthe TF space. So we've been in the TF space now since the mid 2020. And so we're relatively new\nto the TF space, but what we're doing under the hood, so to speak, is something we've done for a\nvery long time. And it fits very nicely with the the value proposition that we have as an\norganization. It fits really nicely with the long term strategy. We speak the same language across\nmultiple disciplines. So it's a, it's a very natural progression of what we've done for a\nlong time, just now in a liquid wrapper in the TF wrapper. Sure. Yeah. And before we get into the\nsuite, I read on the website and I agree, I agree with this opinion, is that investor risk appetite\nis decreasing. And what is it about the market over the last, I mean, 20 years or last 15 years\nit has brought about this decreased level of risk appetite or being nervous about volatility.\nSo I mean, I think there might be a few things going on. I mean, first of all, you have an aging\npopulation. So you have a natural drift towards, you know, being less aggressive with your money.\nYou have 10 or 11,000 people every day that are retiring. And that many people thinking about,\nyou know, what does it this mean for my investments and the money that I've made, I would like to\nkeep it, you know, and how do I keep it, you know, maybe maybe not by going all the way out\non the risk spectrum, but maybe by dialing back. And these are also individuals that have been\nliving through for the majority of their time. It really, really good place for the bond market.\nWhen it comes to both income and total return, that obviously was washed away with the fed\ncutting rates a few years back. And even though there is some a little bit more juice on the fixed\nincome side right now, there's not a ton. Let's be like rates at 5% you still have to pay\ntaxes on the income and so on and so forth. So it's not a ton of juice on the fixed income side.\nAnd that comes to my third point, which is as you have in the past, it's been very simple to move\nassets from equities to bonds as you become more conservative. Now you have more people, again,\nas I mentioned, you know, retiring. And that will continue for quite some time. They're now asking\nthemselves whether it makes sense to move from equities to fixed income or something different.\nSo there's a big conversation around that topic alone. So I would say more people retiring,\nthe market environment has changed, but the problems are the same. So it requires a different type of\nsolution-minded set to to figure that out, I think. Yeah. And also, I think investors in my opinion,\nI work with a lot of investment advisors. I'm sure you talk to a lot of RIAs or financial advisors\nand investors want to beat the S&P, but as soon as volatility starts to rear, it's ugly.\nThey want to hit the cell button. And so I think, as we start to talk about your Buffered ETFs,\nyou know, I think they're going to do a really great job of providing a solution that\ncan give them some defined outcome. So let's talk about Buffered ETFs. First, what are they trying\nto accomplish at like a very high level? Yeah. So very high level, I just use an example. Let's say\nyou put a million dollars into one of our ETFs and it comes with a 10% buffer over a 12-month\nout-comp period. So if the market is down by 10% or less, you still keep your million dollars\nat the end of this out-comp period net of fees. If the market is up, well, it can only, the\nthe buffer isn't free. So what we do, we have a cap in terms of how much you can make over that same\n12-month out-comp period. And if that cap is, you know, 17 or 18% and the market is up, 18% you get\nto keep all of that. So you get to participate in those returns. If the market is up 30,\nyou still get the cap out at 18, let's say. Same thing is true. If the market goes down,\nif it's down by 10% or less, you get to keep the million dollars. But if the market is down,\nlet's say 11% or 12% and you lose one or two. So anything after that 10% buffer is depleted,\nyou start participating in the downside. So that's one of the products. And we have a 20%\nbuffer that works exactly the same way, deeper buffer lower cap. And then we have a six-month\nproduct with a 10% buffer works exactly the same way. The only difference is that it's over six\nmonths. Instead of 12, finally, we just launched a floor product works the same way, also over six\nmonths as the six-month product. But instead of having a buffer, it's a floor. So you can lose no\nmore than 5% over that six-month period. And then you have a cap in terms of how much you can\nmake on the upside. So it provides a very specific defined outcome. Hence the name around what\nyou can expect from that investment. Yeah, I want to get into the series and how to navigate the series.\nAnd but before we do that, how do they operate to achieve the investment objectives? Like what\nholdings can investors anticipate inside of one of these funds to achieve the goal? Sure. Yeah.\nIt can be a long complicated conversation or it can be a simple one. But effectively, we're buying\nan options package to structure this, which is why we know exactly what to expect from these ETFs\nover the course of the outcome period. By the way, when the outcome period ends, we just reset it.\nSo that if the market is up, you get to reset at a higher level and get the buffer to actually\nratchet up with you. But in terms of the underlying, it's an options package. You have a put spread.\nThat sets the the the the buffer itself. Technically, or more specifically, you buy a put\nat the money and you sell one out of the money, a 10% or 20%. And then to fund that buffer,\nyou sell a cap on the upside. That's effectively what's creating that. And if you take it one\nlayer down into the tech spec, we're using flex options. So more specifically Delta adjusted\nflex options, which gives us the specificity that we need. They're custom exchange traded\noptions contract fully liquid that we use to execute the the actual options package, if you\nwill. So does that so does the options package have to be traded at all during the term or\nare you setting trades with the expected outcome? Let's say it's a six month. You're setting\nthe trades and letting them sit or it's is a work that needs to be done in between the period.\nSo it's that that's part of the beauty of this, right? So the the options contracts that we put\nin place are the same. So we don't we buy more or less of them. So if we have create activity or\nredeem activity in the TF, we're buying the same options package. The beauty for the investor,\none of the really cool things is that we buy it on day one, but you ask an investor, you can buy it\non day two, three, 16 or 48, whatever day whatever day that looks attractive to you because it's\ndaily trading. So if you compare it to an ill-equal structure that has also been around for, well,\nthose structures have been around for decades. If you're not in a today one, you're not getting in a\nday two. And if you're in a day one, you're not getting out on day six to three, you're waiting till\nthe very end. This is a free look into a structure that you can buy and sell whenever it fits your\nprofile, your risk profile. Yeah. So if you're if you're buying it on, let's say day 50, does your\ncap and floor change? Are your buffer changes at a moving target or if I'm if I'm getting in like\nlike I said, if I'm getting on day 50, does my floor change at all or is it still, let's say it's\na 10% floor. Yeah. So the price of the TF will move. So it's easier to think about day one and that\nfast forward, I think. So day one, let's say you put the $100 in and your buffer is 10%.\nWell, the buffer is then at $90 is when the buffer runs out. And let's say the cap for simple math is 20%.\nThat's high right, but you can make up to $120, right? Day 50, things may have shifted.\nThe price of the TF might be closer to the cap because the market's gone up. So maybe it's\nalready up by 5%. That means you can lose 5%. If the market goes down before you hit that buffer\nbecause the buffer is at 100. Got it. So that that makes it ton of sense. So let's talk about the line\nup as a whole. There's a different series, there's different types and there's different outcomes,\nright? And you also kind of went into like the difference between a buffer and a floor. Can you kind of\nwalk through, I know you did it briefly, but you can, can you kind of walk through the entire series,\nthe different types of ETFs that you guys are offering? Yeah, so we have the the 10% and the\n20% buffer with 12 month-out computers. And it's on the S&P 500. I don't think I mentioned that before,\nbut it's on the S&P 500. The spy ETF is their underlying reference asset more specifically.\nSo we have those two series and we have the six month series with the 10% buffer. And we have a\nsix month series coming out. We just started launching this with a floor and the 5% floor, which is\na hard floor. So if the market's down 5%, you lose the whole 5, but if the market is down 10,\nyou lose 5, if the market is down 60, you only lose 5. So you know, you can sleep pretty well at night,\nif you're if you're riskiverse and and you like that trade-off. That's at a high level. And then we\nhave of each one of these series, we're building it out so that you can have an ETF,\nyou can access an ETF when you need it. And what what I mean is that for the 10% buffer, for example,\nover a 12 month out-comp period, we have 12 versions of it. So one for each month of the year.\nSo if you want to invest in March or April or in October, there is an ETF for you to get into.\nIf you want those starting parameters, the day one parameters, and it also gives you an opportunity\nto diversify across different time periods. So think about it more conservative investors.\nLet's say, I like the 20% buffer, let's say. It gives me protection on the downside to the\ntune of 20%. So the market has to be down by 20% or more before you lose any money. It happens.\nIt doesn't happen very often, but when it does, you know, you start losing if it's down 22,\nyou lost two. Now if you want to be even building in even more of a safety, so to speak,\nand it portfolio like that, you might buy four of those ETFs. Now you have diversification\nacross four different time periods. And the odds of the market being down by 20% or more across\nfour different annualized time periods is even smaller. And if it is down in one of those periods,\nyou're actually, as an unfamiliar level point of view, it's only a quarter instead of the full\ndefault portfolio, so to speak, that's down. So does it, does an investor need to understand\nwhen to roll these products? I mean, just making it simple. If I buy January buffer,\nit'll automatically reset next January or do they need to roll it into a new product.\nNo, it resets automatically. So you can hold them indefinitely like any ETF. And that's part of\nthe beauty. So one of the cool things is that if you buy a buffery TF and the market goes up,\nmostly it does. So give or take seven out of ten times on an annualized basis. The market's up.\nIt's an odd story. You're going to have some gains in your portfolio. But since it's an ETF,\nyou don't have to realize the gains. You don't have to pay taxes on them unless you sell the ETF, right?\nSo when you, when the ETF reaches the end of the out-computer, let's say you made ten percent.\nYour million dollars is now worth 1.1 million. It rolls in to the next out-comperiod.\nYou get a new cap and the cap will vary depending on the market environments. But let's say that you can\nif the market goes up another ten percent. Let's say you get to keep that too. You know, the following\nyear. But the neat thing, too, is that the buffer underneath of your investment is also going up.\nThat's the account value is going up. So if I'm an RIA and I've got a regular client list and\nI'm building model portfolios. How are you using these ETFs? Are you using them?\nIs part of an overall model portfolio? Are you complimenting? Are you adding it to maybe your\nlarge cap equity exposure? Is it a little bit of a satellite? Or, I mean, I can see instances where\nsomebody might want to use holistically. Yeah. Yeah. And you're right. I mean, the spectrum of\nopportunity for how to use these types of ETFs is extraordinary. I don't think there's any other\nway to put it because you can decide if you want to just shave a little bit of risk away from your equity,\nyour pure equity position. Ask your becoming a little bit more conservative. You can say,\nyou know what? I'm going to take 10% of that 60 or 70% allocation and move it into a buffer ETF.\nYou've taken some risk off the table. That's fine. On the other side, you can say, I want to add\nrisk to my portfolio. And I have all this fixed income in my portfolio. That's not giving me\nreally what I'm looking for. So you can take a chunk of that and put that into a buffer ETF.\nWe see a lot of assets coming from fixed income into our 20% buffer, for example. You can also\nlook at this and say, you know what? Those alternatives that I have in my portfolio for diversification\nbenefits that may or may not come true. But if I replace them with the buffer, I know exactly what\nto expect. And the really neat thing here that we, I don't think we're talking enough about this. But\nif you're thinking about why you are diversifying a portfolio to begin with, why do you have fixed\nincome in there? 6040, everybody, you know, everybody, quote unquote, right? 6040, that seems to be\nthe going rate, right? Like 6040, 70, 30, 80, 20, either one of those allocations, the best 80, 90%\nof the risk is coming from equities. That's your risk, no matter what the other half of the\nportfolio is. So right now, if you think equities and fixed income, okay, fixed income, it may\nor may not give you that buffer that you're looking for from it. But you don't need it unless\nthe equity markets are going down. There's no real, strong reason to own a sliver of income stream\nif you can't rely on the diversification benefits from that, sleep to fixed income. So if you're\nlooking for diversification, you have an opportunity to build in a buffer ETF. And what happens here is that\nnow you have two things going on. Three, actually, three. Number one, you have exposure to the equity\nmarkets because over the long run, they tend to go up. So assuming you still think that the economy is\ngoing to do all right over the longer term, let's say you have a 10 year investment horizon\nor 20 years, you want to have exposure to the equity risk premium. If you like the volatility\naspects of fixed income, for example, a 20% buffer will give you lower volatility, but it will\nalso give you positive correlation when markets go up. So when you don't need that free lunch\ncorrelation that everybody's been reading about and the MPT stats and the Monte Carlo simulations\nand every textbook about finance and investing, you don't really need the correlation benefits\nunless the markets are working against you. Mostly they don't work against you. Mostly they work\nfor you. In a buffer ETF, you have positive correlation when that is the case. And then as markets\nstart coming down, equity markets start coming down, you are decreasing the correlation in the buffer\nallocation closer and closer to zero. If you're in the floor product, once you hit the floor,\nyou have zero correlation exactly when you want it. You can think about it in so many different ways,\nbut to answer your question, how do we see this being implemented? It is literally all over the place.\nAnd what I mentioned, or some of the use cases, then it can get into the technical aspects\nand it's all over the place. I would even think sitting here, this could completely\nalmost delete the entire variable annuity market as well. I mean, people like the guaranteed\nincome stream, but it's the same idea. And this is a liquid investment that doesn't have\nlock up periods. I can see many, many use cases. Are you seeing any advisors that are using these\nin lieu of maybe somebody wanting an annuity and telling that story instead? So as we were launching\nthese, or getting ready to launch buffer ETFs, coming from an insurance shop with the new\ndays, do you have to take my word for this? We looked at that very, very, very carefully to find out\nif there was any type of cannibalization and to make a very long story, a very long painful\nexploration story short for you, the venn diagram of the use cases between those investors and\nadvisors that either buy or use annuities, and those that look at the wealth management side\nand buy ETFs in this case, the venn diagram of the overlap where the decision is questionable as to\nwhether you would want to buy an annuity or a buffer ETF, very small, very, very little overlap.\nBut intuitively, it makes sense to go down that path that you just did. And there's been\narticles written about this in the past too that frankly, it's been just proven over time.\nIt's not a replacement. The thing that you can do on the insurance side that you can't do in a\nliquid wrapper is the fact that you have assets coming in that you can invest on the back end.\nAnd as long as you have a long enough period to invest, you can always create more attractive\noutcomes over time. But there are different in terms of liquidity and longevity and fees,\nand a few other things, right? But the use cases remain different.\nAnd I'm sure you guys are working really hard on this. But how are you looking and getting these\nimplemented inside of the 401k in retirement space? This seems like a retiree's dream.\nYes, I'll steal a quote that I heard from somebody else in the media space that they called it\nretirement retiree candy, I think. Which I thought was clever because it makes a lot of sense.\nNow, is it available broadly enough to just be popped into a 401k?\nNo, is that something that we're curious about and are looking into for sure? Yeah.\nYeah. So this was awesome and very interesting. I'm really excited that we had you on. I think\npeople are going to find it interesting. But before I let you go, we're going to people learn\nof more about you and the Alleyons buffer ETF lineup. So you can go to buffered ETFs.com or you can go to\nAlleyons.im.com. Alleyons.im.com. And I think one of the, there's some, some information on the website\nto short video, a couple of pamphlets that you can read if you want to read. There's also a product\ntable that I would encourage anyone to look at and you can click on any of the ticker as you can\nsort by caps and buffers time periods. And when you click on a ticker, you get to if it's scrolled\ndown, you can see a graph for exactly how that fund is trading relative to the cap and buffer.\nAnd that gives you a really nice visual of what you can expect when you're buying it as well or selling.\nWell, again, thank you so much for joining me and I hope you enjoy the rest of your week.\nThank you so much. My pleasure. Thank you.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}