{
  "id": "14695784",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nWe continue our live from the Exchange ETF Conference series today with Sal, Esposito.\nHe is from Zax, and we are going to talk about two of their ETFs today.\nZECP, which is an earnings consistent portfolio, and Smith's a small midcap core ETF\nticker SMIZ.\nWe talk about Zax business as a whole, as well as a really unique product offering that they\noffer, advisors called Zax plus, I think if you are an advisor listening to this,\nthis would be an interesting thing for you to take a look at for you and your clients.\nI think it is well put together, and Sal does a great job explaining how it works.\nSo without further ado, please enjoy this episode with Mr. Sal Esposito.\nHey, Sal, welcome to the show.\nHey, thanks for having me.\nSo before we get started, can you talk about your background and how you eventually\nended up in your current role today?\nYeah, sure.\nWell, I started my career right at a college.\nI joined UBS, believe it or not, I was a client service associate.\nI have a very unique, I've weaved my way through UBS in a unique way,\nwent from client service associate to fixing come sales and trading assistant for four years.\nThen I actually moved over to become a product manager, and I helped build out the\nRobo advisor offering at UBS.\nI got kind of into selling that product, they needed somebody to kind of sell the product a\nlittle bit, and that kind of led me to my role prior to coming to Zax, which was more of a portfolio\nconsultant.\nSo I would help advisors, you know, put portfolios together using, separately managed accounts,\nmutual funds, change traded funds from every third party provider, right?\nBecause we were focused at UBS on moving assets into advisory, and that's kind of our team\nwas helping advisors kind of do that on a daily basis.\nThe opportunity to get into the ETF space kind of came out of, it was kind of came out of left\nfield.\nIt was too good of an opportunity to kind of pass up because it was something where I was building\nsomething from the ground up, and I knew that that's something I wanted to do to go from a 50,000\nperson company to 100 person company was a big jump, but I knew that I would never have that opportunity\nto kind of take something and kind of make it my own and build it from the ground up.\nSo that's kind of how I ended up at Zax, and it's been two years, it's been a great two years,\ndefinitely learned a lot.\nI think I became an ETF expert in like three weeks.\nI think, you know, I knew a good amount of about ETFs, but once you kind of get into CTF\nworld, you're kind of like, now you're like, I don't really want to leave this world, right?\nI think we were really focused on SMAs, and the SMA business at UBS, and then like when I\njoined, you know, became an ETF person, it's just now I don't see why anybody would use in SMA,\nunless they were using an index based tax managed fund.\nYeah, I mean, once you get sucked in the University of ETFs, we're just kind of, you're just kind of\nin it and all in it. So I want to talk about, you know,\nyou ETF lineup, I want to talk about Zax as a whole, but before we do that, what do you like to\ndo when you're not working any hobbies? Yeah, so I'm a hockey player, I played hockey in college,\nyou played hockey my entire life. I have a two year old daughter who kind of takes up a lot of my\ntime now. I'm going to have a son here in the next the next month. So, you know, kids, kids have\nbeen the band of my existence here for the last few years. I have a golden doodle who's six and\nonly seems to be getting younger. So having him with my toddler running around all day is probably\nwhile working from home has been a fun adventure. And really like I also like to, you know,\nwork out and, you know, kind of keep my body moving at all times. So you and I have way more in\ncommon than so we're both in the ETF space. We both played hockey all over lives, and in college,\nI had a daughter first in a son's second and we have a golden doodle. So, man, that's a little weird,\nbut yeah, do you still play hockey at all? Yeah, when I put the skates up, I was done.\nYeah, so I am playing now. I actually, it's just for fun, really, because my one brother, I\nput my one brother played hockey, he didn't play in college, but he's still fairly like competitive\nhockey player. But my youngest brother never really played hockey. He was a football across guy,\nand he's playing now. So we play all three of us play on the same men's league team. So it's really\njust kind of like a fun thing for me, but it's fun to watch my youngest brother kind of like,\nhe thinks he can like, oh, if I just do this, I was like, you're never going to be like,\nadd thought like, you have to hockey's one of those sports where you got to commit, you know,\nyour entire life to being better, to better and better, because skating is, you know, people don't\nrealize it's skating is every other sport you're on your feet. Right. Yeah, it's a great sport.\nAnd I'm happy that I chose that. And it's fun. Like I said, when I put him up, I put him up and then\nI played maybe one adult league game and was like, is this really worth it? I don't want to get my\nself hurt, but it is a great job. Well, that's yeah, every every game I go into, I was like,\nall right, I'm just going to kind of, now that I'm, you know, getting up there 35, like I don't want to,\nyou know, got a stretch before I start skating or else, you never know what's going to happen,\nbut let less beers, more stretching. Right. So let's talk about Zax as a whole. What type of\nproducts and services across the gamut other than just ETFs to Zax provided clients? Yeah, I mean,\nso we actually our parent company is the Axe Investment Research. We started in 1978.\nLens Zax started the company. He has, you know, PhD from MIT, crafted this model where that\nlooks at earnings estimate revisions, sell side earnings analyst and their earning surprises.\nRight. The foundation of it is the Zax rank. Right. Zax rank is kind of our research side of the\nbusiness. And what we did in 92 is we started our investment management firm, which kind of takes\nthe principles of our research, takes our research and kind of craft strategies. So we started\nour investment management in 1992. We primarily built our business on SMAs, about 16 billion in assets\nas of January 1st. Large majority of it is in our SMA business. We do have three mutual funds and,\nand now we have two ETFs and growing. Yeah. So from looking at both of the ETFs in your lineup,\nthere seems to be this theme of resilience and times of volatility. So why is managing risk and\nvolatility so important? Meaning like what can minimizing volatility or standard deviation mean\nto an investor over the long term? Yeah. I mean, I think it's just positioning your positioning\nyourself for times of turmoil. Right. And Zax has built, we built our business on quality company\nnames. If you hear our CEO talk about, you know, our portfolios. If you hear our client portfolio\nmanager talk about our portfolios, everything revolves around quality and consistency of the\ncompanies that we're investing in. So we're not owning the entire market. We're looking at a\nsubspecies of companies that are quality, know how to manage their balance sheets and know how to\nkind of manage money and their bottom lines in times of turmoil. Right. And that's where like,\nyou know, ZECP specifically, right. That's kind of what it's focused. That's the whole core competency\nof the fund. The Smith's portfolio is a little bit different. Right. It's small and mid caps, you know,\nyou kind of have to be a little bit more nimble when it comes to names. Yeah. So let's talk about\nZECP. You have two of them. We're going to talk about both. So ZECP is the earnings consistent\nportfolio. Can you talk about what the portfolio really is trying to accomplish at its highest level?\nYeah. So really first and foremost, it's meant to be a core piece of any portfolio, right?\nIt's it's large cap core. It's actively traded. But it's really kind of meant to sit at the core\nor hard of a port of any client or, you know, advisors, portfolios that they put together.\nIt's not going to give you those home runs, right? But really what it's trying to do is put you in\na number of company names that are consistent quality. Managed their balance sheets effectively\nthroughout market, multiple market cycles and times of turmoil. So you don't have to worry about\nthat volatility that we were talking about, right? It's keeping the volatility to a minimum.\nAnd it's about 50 to 65 names. So how is the fund screening for opportunities that are\nmeeting this criteria of being fairly recession resilient? Yeah. So really, like, so I can just\nexplain the process from the from the top down top 750 largest most liquid names that's the\nuniverse we're looking at. First piece of the screen, we're looking at a 15 year company operating\nhistory. The next piece of it we're looking for consistent or growing earnings through that\noperating history and multiple market cycles. And the final piece of it is we're looking at\ncell side analysts earnings estimates for this year and next year. What that kind of leads to is\nthat 50 to 65 name portfolio, that's obviously we have it's it's a quant qualt, you know,\nwe we run qualt quantitative screens and then our portfolio management team also kind of looks at\nlooks at the portfolio outcome from the quant and effectively kind of tweaks and and makes\ndaily daily oversight over it. So what is so important about stability of historic and\nforecasted EPS? Like, why is that so important when screening and looking for a company?\nYeah, I just think that I mean, you can't ever predict the future, but you can certainly\nknow what a lot about a company by looking at, you know, it's earnings per share and it's balance sheet.\nYou know, there's a lot of companies out there that are trading, you know, and we've seen it,\nyou know, this market is kind of abnormal, right? We have a lot of companies trading, like,\nyou know, their peas are a lot higher than they probably should be. And how many people are actually\nlooking under the hood when they're putting their portfolios together specific stocks, right?\nYou want to work with a manager that want that that kind of does that, you know, as they're bread and butter,\nand that's kind of how, you know, like I said, all of our portfolio, all of our portfolio,\nthe construction and all of our, our, our SMAs and our funds kind of start with that quality piece.\nSo when we put together these 50 or 60 names, how are the waiting decision happen?\nWhen you start to put these holdings together inside the ETF portfolio, are they market cap weighted,\nor are they based on rank, or is it equal weight, how are you waiting in it?\nYeah, so they're fairly, they're fairly, we're trying to keep the correlation fairly close to,\nyou know, the S&P, right? If you look at the holdings, right, you know, Apple,\nis the top holding, because it fits the criteria of the portfolio.\nIt's a little underweight versus the the S&P 500. Hence, hence, you know, that just kind of gives you an\nidea of how we position our, our names in our portfolios because we're not trying to kind of\nmove with the markets, right? We're trying to stay close to the market, but we're also trying to\nmake sure that the companies were invested in aren't overly, you know, we're not taking an overly\nbig bet on them, in case, you know, the market does, that that particular company doesn't, you know,\nperform, right? So how often then are you looking at a rebalance schedule? Is it active portfolio,\nwhere it can rebalance at any time, or is there like a more consistent rebalance schedule?\nYeah, so I mean, it is actively managed. So we try to keep the portfolio turn over in this\nparticular portfolio around 20% on an annual basis. I would say that we probably trade it\nevery two weeks, if not two weeks a month, like at the end of the month, got it. So let's, let's hit on\nSmith's while we're here, SMIZ. So it's basically similar, I think, in wording, but the objective is\ndifferent. So can you talk about the objective of Smith's? Yeah. So our small and midcap ETF is,\nis kind of a little bit different in the fact that, you know, we're not screening for earnings\nconsistency, but we're still looking at earnings estimate revisions and market anomalies, right?\nSo small and midcap space, I think provides a massive opportunity for active management in the fact that\nthere are a lot of small cap companies that aren't profitable. There are a lot of small cap companies,\nmidcap companies that are in the indexes that really are dragging them down, right? I mean,\nobviously this year with the Mac 7, you can make the argument for large cap 2, but with small and\nmidcap companies, there's also a lot of opportunity for market anomalies. And I think,\nsince that's what Zax has focused on for, you know, the better part of 50 years across even just,\nyou know, both, you know, our parent company and Zax investment management, it provides opportunities\nbeing in an ETF, right? We do have SMAs that are similar. We have a small and midcap SMA.\nWe kind of got together, looked at our portfolios, kind of said, these are great portfolios. They\nhave a hundred percent turnover in them. A lot of advisors push back on a hundred percent turnover\non a separately managed account. We came to the conclusion that, you know, ETFs tax efficient\nwrapper can kind of turn over the portfolio as much as we want. I mean, we're not trading the trade,\nbut we certainly, you know, in the small and midcap space that the opportunities come fast and\nfurious versus the large cap because they're not covered. They're not as covered. So what is the\ndifference in the number of names in Smith's versus the other portfolio? So Smith's has about\nright now a hundred and ninety eight names in it. So it's fairly, it's not concentrated, which\nreally kind of puts you at a, I think at an advantage to, you know, because you're not running into\na capacity constraints because some of these companies are small, right? I mean, I've worked in\nthe past with funds that, you know, run into that capacity constraint because they're investing\nin companies that really, you know, can't, you know, you're pushing them up at asset class,\nyou know, a couple billion dollars pushes them up at different asset class. So there's not really\nany holdings in the portfolio that are above two to 2.1 percent, right? So it's fairly,\nevenly distributed. So let's talk, I want to talk about Zax Plus. Can you just say what it is?\nAnd then really how it works. Yeah. So Zax Plus is, is a model portfolio solution that actually\ntakes ETFs and separately managed accounts and wraps them into one holistic solution for,\nfor an advisor or a client, right? So think Core ETFs make up the core of the portfolio. So most of\nthe, you know, active ETFs since we, we have active ETFs that we offer, those are the core of the\nportfolio. So most of your trading is done inside of the ETFs, which right off the bat makes the\ntax efficient. We've created SMAs around these these ETFs to kind of pair with them that give you\naccess to single stock securities. So most a lot of clients, a lot of advisors I talk to clients,\nstill want to have that conversation around the water cooler with their friends about who they\nhold, what they hold. So that kind of solves that problem because you're getting that, you know,\nyou're getting that single stock security exposure. But the third piece of this is that their\nmodel portfolios. So you can go up and down the risk spectrum. We have fixed income. We leverage\nthird party bond ETFs for fixed income to give your client or, you know, if you're an advisor,\ngive you an opportunity to scale your business, but also for a little bit more sophisticated client\nwho's looking for a little bit extra compared to just to run in the mill ETF model.\nYeah, no, you and I were talking before we got on. I think it's a brilliant idea. So if I'm an\nadvisor who wants to utilize XX plus, how do I go about not only finding information about it,\nbut how do I actually utilize it in an implementant and how were the, you know, SMAs\nand the model portfolios delivered? Sure. Yeah. So I mean, we're available at all on, you know,\non Schwab, you know, Schwab and Fidelity. We can definitely run portfolios through there.\nWe can have a conversation. We, we are capable of doing model delivery as well for advisors\nthat something we, we make ourselves available to, because ultimately the one piece of this that I didn't\nmention is that we aren't charging a strategist fee for these, these as well. So effectively,\nyou're getting, you know, a XXUMA for no, no manager fee or no model strategy's fee. So the capabilities\nof delivering the model is something we, we are capable of doing. And yeah, I mean, generally,\nwe would run the discretion on the portfolios, you know, as an SMA, but, you know, we're happy to\nhappy to do it model delivery as well. No, again, a great idea. Last question I have on the,\nI think you just hit on this, but I want to just make it clear. So if you're wrapping\nyour, your core ETF holdings, right? You're wrapping these tilted sleeves. I think is what\nyou call them around them. So are you actively managing, managing the tilted sleeves or those\nkind of passive in nature? Yes. So the model. So we, we actually run this as two distinct\nproducts. So we have seven, seven models that we've funded and composites running on them. And then\nwe also have a custom solution where advisors can come to us and tell us, hey, we have a client or we have\nsubset of clients. We want to create something for, you put something together for us. So we do\nhave the custom capability as well. And that kind of gives us right, that gives you a couple\ndifferent avenues for an advisor. And, and I think that the way you want to think about these\nif you're a financial advisor is that I have, I have model portfolios, ETF model portfolios,\nthat I'm kind of familiar with. I understand, right, I know how I'm scaling my business with them.\nThis is almost, and that's kind of why I call it plus. It's kind of taking a step to a little\nbit more sophistication for a client that might want to have exposure to single stock securities.\nAnd you don't have to go down the road of pulling in three or four different managers doing\nthree or four different things, right? We, we are primarily a domestic equity shop. I mean, most of the,\nmost of the tilts are run that have single stock exposures are domestic equity, right?\nOur international sleeve is a, is a model comprised of third party country specific ETFs.\nSo we know our bread and butter is domestic equities. And that's how we're running our SMA\nsleeves as well. And those, they're concentrated SMAs. So we're not giving you exposure to 700\nnames, the portfolios, the model portfolios range from about 47 holdings to 120.\nNo, so last question here, if you're not using XX plus, right, and I'm an RIA, I've already\nhave my model portfolio set and you're just selling the opportunity to add ZCP or Smiths into\na portfolio, where are you putting these in an overall model portfolio construction? I just assume\nZCP is probably in a line with large cap equity exposure. Yeah, I think that ZCP and I've kind of,\nyou know, we're going to be coming up on a three-year track record here in August. I think the\nplace for ZCP can coexist with the spy. It's just giving you a little bit more of a hedge on the\ndownside protection. I believe, you know, the ETF itself is performed better when the market has\nbeen down. I'm by no means a bear, but certainly I know the fund acts and is positioned better\nfor the downside because of the quality names and the portfolio. So it could be a large cap\nsleeve or a core holding in someone's portfolio, but it can also exist coexist with, you know,\nan index-based ETF like a spy and kind of give you that a little bit of a hedge down on the downside.\nAnd would Smiths be a little bit different where you might just want to hold it as your midcap,\nsmall to midcap exposure instead of maybe pairing it against or pairing it with, like a VO or VB?\nYeah, I think that, and I kind of say this a lot. I think that portfolio construction\nwhen it comes to small and midcaps is a little bit, I think a lot of people don't really kind\nof go past the indexes. When the reality of the fact is that's where the most opportunity for\nalpha exists is in small and midcaps, right? The large cap spaces covered to Wazoo, right? There's\nso many analysts, but the anomalies occur in the small and midcap companies and having a portfolio\nthat's active and a portfolio team that is looking at this daily and trading it, you know,\nthroughout the year gives you a little bit more of an advantage versus just putting, you know,\nputting your clients in a small and midcap index-based fund. Well, so I really appreciate you joining\nme today, but before I let you go, where can people learn more about you, where can people learn\nmore about Zax and Zax ETF products? Yeah, I mean, you can visit zaxetf.com or reach out to\nETF products at zax.com. That's the best way to reach me in my team. We're happy to have a conversation.\nWe have wholesalers located throughout the entire country as well, but if you reach out to our email address,\nETF products at zax.com, that would be the first place to start. Well, again, so thanks again.\nThank you so much for having me.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}