{
  "id": "14754333",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nWe are continuing our live from the Exchange ETF Conference series with Mr. Dodd, Kitsley.\nHe is with Davis Funds.\nThey are a long-standing staple in a household name and investment management.\nThey've done a fantastic job and a variety of different strategies.\nThey have an extensive mutual fund and ETF lineup.\nHowever, today, we are going to focus on DUSA, the Select U.S. Equity ETF, as well as DWLD,\nthe Davis Select Worldwide ETF.\nFirst of all, Dodd has an absolute wonderful guy.\nI enjoyed the little bit of time that I did spend with him.\nHe has a wealth of knowledge that has been in the industry for a very long time.\nSo without further ado, please welcome Mr. Dodd, Kitsley.\nHey, Dodd, welcome to the show.\nThanks so much for having me.\nSo before we get started, can you tell everybody a little bit about your background and how you\nended up in the position that you are today?\nI'd be happy to.\nI've been incredibly fortunate in my career to have stumbled on ETFs back in the late 90s,\na time where there were 32 products less than $40 billion in assets and people didn't know\nthe difference between an ETF and an EFT and an Exchange Funds.\nSo I was really fortunate to be doing independent kind of third-party research at Morgan Stanley\nand helped launch one of the first ETF research teams on Wall Street.\nAnd that just afforded me so many different vantage points of this industry that's really\nchanged the way people invest in our industry at large.\nSo from there, I was able to work at some of the largest asset managers in the ETF space\nbecause I had such an interest in how these things work and had such an interest in being\nin evangelists for a product that was driving down costs, increasing transparency.\nAnd I know it's overused a lot, but really democratizing investing in making strategies\nexposures that were previously only available to a select few of size\nbe available to pretty much anybody that so desired those exposures.\nSo it's interesting, I mean, being one of the originals in the ETF industry and we are at\nan Exchange ETF and I know that this is going to come out later, but could you see this business\nexploding into what it is today?\nNo word near where we are today.\nI don't think anyone else did.\nI mean, we saw the promise of this, and to be clear, I mean, I was definitely not at the\nfirst inning of this, but probably the second inning, right, in the late nineties.\nAnd I give so much credit to folks like, they post and those that really helped design and\nbring spider and the first ETFs to market, but that was really a serendipitous event.\nI mean, it was really designed to be an alternative to futures and derivatives and program\ntrading, more of an institutional tool, if you will.\nAnd I don't think the really the market recognized that this could be something that was\nfor everybody, for the retail investor, the individual investor.\nUntil Isher's really gotten the business in 2000 and, you know, Lee Cranfus took a real\nrisk, and I don't think it was really popular at BGI at the time, and I was fortunate to\njoin BGI afterwards after the training to left the station, but still, you know, was really able\nto do a lot of education. I think once the education takes place and people realize the features,\nrealize the benefits, vis-a-vis what they were using, whether it be individual stocks,\nmutual funds, other types of vehicles, that's when the promise of ETFs became really real and\nthe growth became kind of obvious to. Well, it's definitely an exciting industry to be in now.\nI mean, we're seeing new products launch every single day, but before we start to geek out more\non ETFs, always like to ask, what are some hobbies that you have? What are things you like to\ndo when you're not working? Oh, boy. I love spending time with with my boys and my wife,\nwe do a lot of gardening around the house. We've got a historic house in a wonderful town outside\nNew York City called Pleasantville of All Names. When my kids were not in college, which they are\nright now, we built an ice rink in our backyard every year, which was something that we\nare able to share with the entire community, a lot of fun there, and I'm a big sports fan. So stuff\nI get to share with my boys, which is a lot of fun. That's great. So let's pivot over into the business\nthat is Davis. So you guys have been around, you know, a very long time. Can you just talk about\nDavis as a whole and what they do for clients? Absolutely. So Davis was founded in 1969 and also a\nvery serendipitous type of type and event of how we came to be. Davis's three generations of\namazing investors starting with Shelby Davis who essentially made a fortune investing exclusively\ninequities primarily financial stocks. His son, also named Shelby, was legendary institutional\ninvestor and you know, when they people approached him and said, well, why don't you offer\nwhat you do for institutions in a mutual fund? And his initial reaction was, you know, not surprising.\nIt's like, well, we don't do that. We're an institutional shop. We're not a mutual fund provider.\nBut he thought about that. And that was that was the genesis of Davis advisors. Fast forward to the\n2000s we got in the SMA business to provide choice. But on the same investment discipline, the same\nstrategies, the same type of exposures that we did in mutual funds. And then in 2017, we got in the\nETF business. And that was driven by the same questions from our clients. You know, why don't you have ETFs\nto offer the same exposures your mutual funds in SMAs do? But we were really founded,\nbased on partnerships with financial advisors, recognizing that they're two parts of the equation\nfor success and investing, the first is, you know, how you do and what you own. The second is how\nyou behave. And financial advisors, wealth advisors today, add in immense amount of value\nby helping people control their emotions, making good long-term decisions and not getting caught\nup in human nature, where it often trips us up, where, you know, we're attracted to things that have\ngone up a lot recently. And we're averse to things that have sold off. And in that creates\na lot of havoc in portfolios and it doesn't help us realize our full potential.\nYeah, and that it is the biggest mistake we all make or two emotional animals to really play\nthis game well sometimes. But you guys have had a very long history and long standing in the mutual\nfund business, a lot of success in the mutual fund business. So what are some of the advantage of keeping\na mutual fund line up when the ETF industry is exploded the way that it has? Yeah, it's a great\nquestion. And, you know, we, like to say, we're, we're delivering vehicle agnostic and the reason\nwe offer mutual funds SMAs and ETFs is solely to offer choice. And at the end of the day,\nwhat really drives is one's preference for a wrapper or vehicle to get the exposures in our\nportfolio is, is, is personal preference. For some, you know, they may be tax sensitive in the ETF\nor the SMA can be incredibly compelling. Mutual funds offer advantages that I think people sometimes\ndiscard. And that's, you know, you can dollar cost average very easily into that. Mutual funds\ndon't disclose, you know, holding. So it allows you the ability to kind of own less liquid\nsecurities. And for some people, it's back to a motion that we were talking about. You know,\nsome folks don't have the kind of emotion or where we're with all to see their holdings every single\nday because it drives them crazy. So there are whole host of reasons why to offer all,\nyou know, and that's, that's why we do it to offer choice. So let's talk about Dusa.\nIt is your select US equity ETF. Can you talk about the fund as a whole and what it's trying to accomplish?\nYeah, Dusa, I love you. I love that you call it Dusa. Do you say, it did take on that kind of\nname after a while, which, which makes a lot of sense. So it's, it's really the epitome of what we do,\nright? It's, it's, it's, it's creating a best ideas portfolio that is incredibly selective. We believe\nthat what you don't own is as important as what you do own particularly in this environment where\nmoney isn't free anymore interest rates are more normal in selectivity really matters. So Dusa\nhas 22 to 23 holdings right now. And what we look for in that portfolio is stocks that are\nundervalued mispriced in the marketplace that are durable have very well capable management teams\nthat can allocate capital well right cultures companies with competitive modes. In those that are\ngenerating free cash flow that are generating earnings that's sustainable and that can grow over time.\nSo a lot of folks think of us as a value manager. I think we're more Garpy than anything else.\nAnd we see growth in value kind of joined at the hip where our portfolio like do some well-owned\nmeta, but at the same time own JP Morgan and other quintessential value names.\nSo can we dive a little bit deeper in the portfolio construction? Because as you said, it's extremely,\nI should say extremely. It's pretty highly concentrated. 22 names I think are in there as we sit here\ntoday. So can you talk about the actual process of dwindling down from such a large universe\ninto 22? And I'm assuming you guys are probably pretty hands-on in talking with management and\neverything with those names that you've selected. Yes, 100%. So we are a research driven from first and\nforemost. And as our Chairman Chris Davis loves to say, we want to be in the top desial of knowledge\nof companies that we own in industries that they participate in before even thinking about investing\na single dollar. We knew Google years before it went public. And because of that, because of those kind\nof knowledge, an intimate knowledge of kind of the inner workings of these companies,\nI think it gives us a real edge that can't be captured in a stock screen. So that's, I think\nreally where the case for active is, right? We have a process where certainly we'll screen for\ncompanies that are viable, but without knowledge of their management team, their competitors,\ntheir customers, their sustainable advantages, we wouldn't invest in this. So how are the portfolio\nwaiting decisions made? Is that, you know, conviction by your management team or is there\nsome other thing behind it to keep it more market cap-weighted? How are those waiting decisions\ncome about? It's such a great question because for some, looking at the portfolio, sector\nwaiting's holding, it could be a bit of a headscratcher. But as you point out, it is 100% conviction\nweighted 100% conviction driven in terms of the, the holdings we have. We often will say we're\nbenchmark agnostic and it's not to mean we don't care about our bogear, the benchmark or the\nopportunity set we're looking at, but we will never true up say a sector that we don't own. In fact,\nwe don't own three, four sectors in the S&P 500 in, in Dusa because we don't see as much\nopportunity there as we see in, say, financials or communication services or even health care\nright now. So I know that the fund is active, but is there a regular, we don't need to call it a\nrebalance schedule, but is there a regular re-screening for new opportunities or, I guess, is the decision\nmade on the fly as to whether or not to replace one of these companies inside the portfolio?\nEvery single day we're looking at our holdings, we're looking at our weightings and making decisions\nthere of, you don't see a lot of turnover in our portfolios, and that's by design because\nA we do our homework ahead of time, and we're looking for companies that aren't necessarily\ngoing to kill earnings next next quarter. We're looking at companies that are going to be long-term\ncompounders that are going to generate wealth over a very, very long period of time. So that's\nreally what's what's driving it. It's it's research, it's understanding the, the company's really\nwell, and reflecting that into best ideas portfolio. So let's talk briefly about DWLD. Doesn't\nroll off like do so. When I look at, I want to say D wild, but DWLD, which is the Davis Select\nWorldwide ETF, is this basically the same idea is do so only kind of go anywhere? It is.\nIt is our most unconstrained ETF portfolio. It's a analog to the Davis Global Fund that's been around\nfor a couple decades now. And yeah, it's, it's both US and international. So no constraints\non the portfolio manager with respect to geography. Currently, it's, it's about 50% US, 50%\ninternational, but that can fluctuate where we see opportunities overall. And we're seeing people\nattracted to DWLD because it's a way to get exposure to non-US, which we know has been on\npopular, which hasn't really worked out recently, but there's some wonderful businesses outside\nour borders, some of the best businesses in the world. So DWLD is a viable option for folks that are\nlooking for our best ideas. And that's fairly concentrated as well about how many holdings\nis DWLD have at any given time? Yeah, we're about 35 holdings. It depends on the time and\nour level of conviction, but it tends to have a few more holdings than some of our other ETFs,\njust because it is the widest opportunity set, but we really haven't seen it go over 35 or so.\nWell, Dodd, I really appreciate our time together. Before I let you go, I got to get people the\nopportunity to learn where can they learn more about you, where can they learn more about Davis\nand all the things you guys do? Yeah, thank you. It's been a pleasure being here. For more\ninformation, first our website, DavisETFs.com, DavisAdvisors.com is where you can find information on\nall three of our delivery vehicles. And we have such a great relationship management team,\nwe call them regional directors. So you'd certainly call our 800 number, which is on the website\nand get to know folks that are really wanting to build partnerships with financial advisors and\nyour teams and help grow together. Well, again, thank you so much for your time and I really hope\nyou have a great week. You as well. Thanks so much.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}