{
  "id": "14791937",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nToday is the last addition of the live from the ETF conference series.\nWe have Simian Hyman, he is from ProShares.\nThey obviously have an extensive lineup of ETF products.\nHowever, we are going to be talking about one specific product today, which is I Spy.\nIt is their cover call ETF.\nIt is different in the fact that it uses daily options rather than traditional monthly\noptions, and Simian is extremely concise and clear on how these products should be utilized,\nhow there works, and so without further ado, please enjoy this episode with Mr. Simian Hyman.\nHey, Simian, welcome to the show.\nThanks for having me.\nBefore we get started, can you tell me a bit about your background and how you ended up\nyear at ProShares?\nSure, I've been in the asset and wealth management business for about 30 years, and I've been\nat ProShares over a decade, ProShares is a leading ETF provider.\nWe've got about $65 billion in funds across a range of solutions, and I just love the opportunity\nto be part of 21st century solutions at an innovative firm.\nSo what about outside of work?\nI always like to ask, what do you like to do when you're not at the desk you're running around?\nAny hobbies?\nI do play a little guitar, my son thinks I'm not good enough, but I will try to keep up with\nand a little bit of running and swimming and biking and maybe a little skiing if there's snow on the\nground.\nI'm from the Northeast, we're trying to ski, but it just seems like winter doesn't happen anymore.\nAt least they can make snow if it's cold enough.\nLet's true.\nSo let's talk about ProShares as a whole.\nCan you just talk what the company does at a very high level for clients?\nWe're an ETF firm.\nWe manage, as I said, about $65 billion of funds in the ETF structure,\nand we have a range of solutions.\nSome may be familiar with our leverage and inverse funds that are very valuable for folks who are\nlooking to either hedge their portfolio as they get particular exposures.\nAnd then we also have a very important, more classic buy and hold business.\nAmong the flagships, there are a suite of dividend growth ETFs, including\nticker and OBL, the S&P 500 dividend aristocrats that some of your listeners may have heard of.\nSo let's kind of talk about, I want to talk about I spy today, the cover call ETF, but let's\nlet's talk about the lineup a little bit because the lineup is very unique.\nIt's innovative, there's a lot of different things on it.\nWhat are you kind of excited about over the next maybe 12 to 24 months that you think\nare going to kind of gain some market share and some popularity among investors?\nSure.\nOn the leverage in the other side, we're just happy to have a very broad range of those solutions\nfor portfolio construction and hedging purposes.\nThat's there for folks to avail themselves of and that's been a proven valuable solution for folks.\nAnd on our strategic or buy and hold side, we think those dividend growers are important\nwhen you look back at the last couple of years at the 493 stocks that have been left behind.\nYou kind of want to think about those that haven't been left behind for good reason.\nAnd we think those classic dividend growers are certainly a place where people are returning\ntheir attention to.\nYeah, I would agree. I mean, it was kind of a weird year over the last two years.\nEqual weight has been left behind. A lot of different places in the market.\nLike value have also been left behind.\nSo I agree with you. I think that that could be a place where investors start to be looking\nand it putting some some of their asset allocation dollars.\nBut let's talk about ice buy. Cover calls or cover call ETFs are hot right now.\nCan you explain at a very high level what a covered call ETF actually is?\nA covered call is an investment strategy where you own a stock or a bunch of stocks.\nAnd then you sell a call option. You sell the upside, the right to participate in the\nappreciation of stocks to somebody else.\nIt's covered because you own it. So you you're simply capped out of your games.\nYou don't have unlimited exposure. So that's where they're called a covered call.\nAnd that's been a popular income generating strategy for folks because you get money for selling\nthis call option. But many folks, I think have forgotten about the other piece.\nYou're selling away the upside. And so it's it is a yield play. What type of yield can\ninvest investor expect to generate with a product like yours? So let me first start with the\ntraditional strategy. A traditional monthly covered cover call strategy writes a call once a month.\nAnd the challenge there is let's say you sell away the right for the upside of your stock.\nAnd it goes up at the beginning of the month. For the next 27, 28 days you've got no more upside\nleft. There's an index for a traditional monthly strategy. It's the BXM, the CBO monthly\nbuy right index. Last year in 2023 the S&P was up 26% but a traditional monthly strategy that\nindex was only up 11 less than half the upside. That is what we're solving with ice buy.\nAnd so let's get into the mechanics of that right. So the biggest difference between\nice buy and the others is this is a daily right. Is that correct? Ice buys the first ETF powered\nby a daily covered call strategy. This is new stuff. You could only have done this to daily options\nonly about 18 months old. And indeed the key here is that by writing or selling writing and selling\nis kind of this is the same thing people use both words. By selling that option every day,\nyou get another little nibble at that upside every morning. And so you can generate the income\nthat covered call strategies are known for. But you can also target the full return of\nin this case CS and P500 and solve for that trade-off that the classic strategies have left\nwhere they've left profit behind. So when you're generating this income, when is ice buy\nkicking off a distribution? Is it a monthly distribution? Weekly. What's the frequency of\ndistribution? It's a monthly distribution. We just had our first one. The annualized distribution\nwould be a little over 11% which is very competitive with classic covered call strategies.\nSo you would expect to see that on a monthly basis. So what are the risks? Because it could be\nconfusing for maybe a retail investor. Someone who doesn't necessarily understand options. So\nif I'm buying this product, what is my overall risk? Is it just the risk of the S&P 500? That's\nexactly the risk. So by writing these on a daily basis, the S&P 500. And this is an index strategy.\nI know wake up in the morning and decide how to do this. This is the S&P 500 daily covered call\nindex that we track in ice buy. But it indeed has risk similar to the S&P 500. And look,\nthe 10 year treasury is now at 4%. If stocks go down, they're likely going to go down because\nthere's a recession. In which case, we are likely to finally have bonds do their diversifying job.\nSo I think among the interesting things over the last 15 years when bonds were depressed in\ntheir yield by things like quantitative easing, they couldn't do their diversifying job. So people\nlook for kind of lower volatility equity solutions. In this environment, we suggest you stay\nwith strategies like ice buy that off a real equity exposure. And if you're a little worried\nabout the equity markets, buy some bonds. Right. So how is the ETF constructed under the hood? So\nif I'm looking at the underlying holdings, in order to achieve this result, what is the\nfun doing on a daily basis? You own the 500 stocks. And then this call that you're selling\nevery day is executed by swap. So every day, it's much more efficient to do that to actually\nbuy the individual options. But the economics is precisely the same as writing a covered call\nevery day. So how would an investor use an ETF like this inside of an overall model portfolio?\nWhere would this sit? Well, the beauty of this is it sits right in the equity portfolio. The\ntraditional monthly strategies are kind of an never, never land halfway between stocks and bonds.\nHere, ice buy delivers targets the full return over time of the S&T 500. So it behaves really\nnicely in your core equity portfolio, while generating the income that you need, whether it's for\nexpenses for RMDs and a rollover account, whatever you need that income for. So could you see a\nsituation where maybe yields come back down? Let's say we do enter a recession.\nyields come back down. So fixed income is going to do its job again. But we all know at some point\nrates are going to have to come back up. And we're going to have a situation where fixed income\ndid what it did in 2022. Could you see an ETF like this that's spitting out yield being an option\nfor almost a fixed income sleeve that it's some point? I don't want to call it fixed income\nbecause it's equity risk. Right. So yeah, an empire lies. I was cheap investment off of a trust company.\nThis is equity risk. But 100% to your point, the five and change money markets are going to be\nancient history soon. The two year treasury is already has a almost 1% lower yield than it did\nthree or four months ago. People do need income and ice buy can be an important contributor to that\nsolution. So how do you see this cover call ETF market kind of expanding? You're doing it with the\nS&P 500. We're starting to see it in some other places. Do you see this as a people start to\neven do single stock cover call strategy? I mean, how do you see the evolution of this market\nthere's a long history of folks doing single stock covered calls. We're more interested in the\nbroadberry approach that we have in ice buy and we're an innovative form. So we're always looking at\nnew opportunities to apply covered call strategies or a range of other solutions as well.\nSo I really appreciate your time this week. Before I let you go, where can people learn more about\nyou? Where can people learn about the entire pro shares lineup in ice buy? Pro shares.com.\nKeep it simple. All right. Well again, thank you very much for joining me. I appreciate it.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}