{
  "id": "14877292",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nToday, I have on Kim Mayer, he is a portfolio strategist over at GMO, and we're here to talk\nabout their newly released Quality ETF, Ticker QLTY.\nIt is a US-focused, active ETF that is looking for obviously quality, as well as attractive\nvaluations.\nThey've been running a similar strategy for many years in a mutual fund wrapper, and this\nis their first ETF over at GMO.\nWe talk about the difference between quality and other quality ETFs that are more indexed\nfocused.\nI think you'll find the security selection process and the make-up of this ETF rather\ninteresting.\nSo without further ado, please welcome Mr. Kim Mayer.\nHey, Kim, welcome to the show.\nThanks, Brad.\nGood to be here.\nSo before we get started, would you do everybody the pleasure of kind of giving your\nbackground who you are and your current role over at GMO?\nYeah, so I've been rattling around the finance industry for a long time.\nI spent the first half of my professional life on the sell side at Morgan Stanley.\nDoing a bunch of stuff, I started out in investment banking, ended up in capital markets,\nand then made the shift over to the buy side about, well back in 2006,\nso about 18 years ago now, so I've been at GMO for quite a while.\nMy first responsibilities at GMO were on the client side, and then about 15 years ago,\nor so I jumped over to one of our equity teams, and I work on the focus equity team now at GMO.\nThat's the team that manages the QLTY ETF, it's the team that manages our quality strategies.\nAnd it's a pretty small team.\nWe all tend to wear more than one hat on the team, so my two hats that I wear,\nnumber one, I am a portfolio strategist, that involves primarily communication,\nadvocacy, that type of thing, but I'm doing now, but I also cover some stocks in the portfolio.\nI guess you would say my area of expertise, generally speaking, is frivolity.\nI cover beer and spirits, I cover luxury goods, I cover TJX, and I cover catering.\nSo that's what they figured out, I'm good at.\nThat's great, so yeah, I can relate to wearing multiple hats with trying to sell,\nand do some portfolio strategy work as well, but I always like to ask everybody this question before\nwe get too deep into the mechanics of the portfolio, is what do you like to do outside of work?\nAny hobbies when you're not sit behind the desk?\nYeah, I would say, so GMO is based up in Boston, so we're in New England.\nI moved up here from New York about 20 years ago.\nSo we're lucky to be in a good spot to be on the water, so I love to spend time on the water\nwith my family, frozen water, and then winter, so skiing, and then sailing, doing whatever we can\nin the summer, my kids are getting a little bit more far flung, but we're able to lure them back\nfor fun activities, so that's probably my favorite activity.\nYeah, it's funny, we've done probably 35, 40 of these episodes now, and you're the first person,\nor I'm sorry, the fourth or fifth person that's really into boating.\nI mean, there's must be something with ETFs in boating.\nWe'll have to dig into that.\nYeah, so, you know, can you just talk about GMO as a whole?\nYou guys do a lot of things.\nSo, you know, what all does GMO do, kind of at a high level to help clients and how you serve in clients?\nYeah, and so GMO, you know, we're not the biggest shop in the world.\nYou know, I think what we're well known for is a very thoughtful approach to investing in public\nsecurities, so we have a pretty good equities business.\nWe have a pretty good fixed income business, and we have a pretty good asset allocation business,\nas well, that's one thing, you know, a lot of folks in the wealth channel do know us for.\nJeremy Grant, them founded the business about 45 years ago.\nA lot of people do know Jeremy, they know him as a value manager, and certainly value valuation\nis an important part of our heritage.\nSo, I would say, we're long-term investors, we're valuation oriented, and we're really focused\non our clients in the early days.\nOur clients were all institutional, but we've sort of gotten a little wiser over the years and have\nbeen able to broaden our availability to, you know, a wider range of clients' types.\nI'd say that's been an important part of our growth over the course of the last seven or eight years.\nYeah, so you guys recently, you know, fairly recently, 2000 to 23, got into the ETF business,\nright, with the launch of quality, which we're going to talk about in depth, what kind of\nmade GMO make that jump from, you know, it's core business to sticking its head into the Thunderdome\nof, yeah, I can't feel like a Thunderdome sometimes.\nI think, you know, we certainly are not pioneers in the ETF landscape.\nYou know, we've been looking at it from afar for quite some time.\nWe wanted to choose the right time to get involved.\nWe don't try to, you know, we certainly don't aren't the type of investment,\nshop the tries to flood the market.\nWe want to come in with the right opportunity, the right strategy at the right time.\nAnd I think it's kind of a natural evolution from, you know, if I think back to when I started at GMO\nin 2006, if you wanted to access the quality strategy, which we ran, we had been running\na quality strategy for 20 years now at GMO, but the minimum buy-in when I started was $10 million.\nAnd then the next step was we, you know, we started coming up with more vehicles that were,\nyou know, we're more user friendly for the wealth channel, so getting on platforms, etc.\nAnd but that still meant, you know, utilizing the mutual fund structure.\nSo it wasn't the perfect fit for the taxable, for the taxable clientele.\nAnd so, you know, it was sort of the natural next step, right?\nAnd so we waited until there was, you know, critical mass around active ETFs, because that's\ncertainly the route that we wanted to take. We very much are active investors. That's all that we do.\nAnd so now I think about, you know, looking back to when I started when I was a $10 million\nbuy-in, you can buy a share of the QLTI ETF today for $29 and change. So it's, it's, you know,\nbroadening that availability, I think is the main reason we wanted to take that step.\nSo was quality a, was it a mutual fund conversion or these all new assets?\nSo it's not exactly a mutual fund conversion. So as I mentioned, we've been managing a quality\nstrategy at GMO for 20 years. You know, to the extent people know anything about GMO,\nthey tend to think of GMO as, as kind of a value shop. But I could argue that, you know,\nthat that quality is every bit a part of our DNA as well. When Jeremy Grant then was,\nin the process of putting GMO together with his partners, he was sort of struggling with that\nidea that he could never own these quality businesses as a classic value manager,\njust because they always traded a significant premium to the market.\nBut he came up with some good identifiers and initially GMO used that in our equity practices\nby practicing a form of quality adjusted value. We launched this strategy 20 years ago\nand have kept that focus on valuation. I think that's an important differentiator because there's\nplenty of different ways to get quality into a portfolio today. But to get back to your original\nquestion, it's not a clone of the existing strategy. So the flagship quality strategy,\nwhich is still a mutual fund and separately managed accounts, is a global opportunity set.\nSo on average, we have 80% in companies domiciled in the US about 20% outside of the US.\nWe made the decision when we launched QLTY to make that a US-only opportunity set.\nAnd the reason we did that was because we have heard a pretty steady drum beat of demand over the\nyears for a US-only version of the strategy and a lot of that, a lot of that demand was coming\nfrom the wealth channel. So we were kind of able to kill two birds with one stone,\nwith this launch. Yeah, and this is a great time to be talking about quality, right? I mean,\nwe've had such a push over the last handful of years into growth. We all know what happened last\nyear growth just absolutely dominated, well, really, any or every F. So I think it's a great\ntime to be talking about quality. So again, the ticker is QLTY. It's the GMO US quality ETF.\nAnd we talked about it a little bit, but can you just really give a high level of what the\nfund is really trying to accomplish? Yeah, so first and foremost, we're not going to own a company\nin this strategy if we don't believe it to be very, very high quality. I think we have a good\nhandle on what that means. And one of the interesting things about the way we manage this portfolio\nconstruct this portfolios, you wouldn't describe this as purely a quantitative or purely a\nfundamental strategy. We try to bring the best of both of those sort of techniques as we\nas we manage this portfolio. So the first job is we just need to build the best quality universe that\nwe can. We're going to start with a quantum model as a screener, but then do a lot of fundamental\nwork on top of that to sort of solve the problems that even the best quantum models are going to have.\nThey will occasionally kick out a false positive, sometimes a false negative. So we vet that\nprocess fundamentally. And then job two is to select stocks within that quality universe. And we're\ngoing to look at a bunch of things, but we're going to focus mostly on valuation as we do that\nprocess. And so what we seek to deliver is a company is a portfolio that's comprised of the very\nhighest quality companies, but screening out those companies that are trading at unrealistic valuations.\nBecause I think even with quality companies, people will tell you that quality wins over time,\nbut what our research shows you is you can do substantially better in terms of delivering\nreturns across periods and can actually pretty significantly increase that downside protection\nand return signature as well by combining quality and valuation. So ever since we started this\nwith the flagship strategy 20 years ago, and it's very much true with QLTY today,\nit is that combination of quality and valuation that I think is the most significant differentiator\nin terms of what we do versus other quality practitioners. So when you're constructing the ETF\nand you go through your quantum screen, you go through your fundamental screen, does the portfolio get\nfairly concentrated, or is there a number of holdings that you're targeting? What can investors\nkind of expect as a holding profile? Yeah, and so I would tell you that the way most of our investors\nutilize this strategy within their overall equity portfolio is as a core equity holding. And\nwhat this portfolio gives you, we do, and we absolutely manage this portfolio in a benchmark\ndiagnostic fashion. In other words, we're happy to develop sector concentrations in those sectors\nwhere we find a lot of well valued high quality companies. We're equally happy to have a little\nor no way in those sectors where we don't. And so I think that sort of means that it's an inherently\nless risky portfolio because you're going to be less exposed to those riskier parts of a benchmark.\nI think we've attracted a lot of attention over the last few years, and we've had a lot of early\nuptake with QLTY as well. I think active management has become a little bit more back in\nVogue as people sort of grapple with concentration risk and narrow markets, evaluation risk,\nand narrow markets quality has sort of is in a little bit brighter light today as well. Just because\nI think people are concerned generally with the overall risks that equity investors face today,\nand quality has shown to be a good defensive way to get equity exposure over time. And finally,\nI think, you know, it is our focus on valuation that means that we're not dependent on a growth\nregime being in place to be able to deliver strong performance or a value regime being in place.\nThe last couple of years have shown that very nicely, you know, 2022, very much a value\ndriven year, 2023, very much a growth driven year. And in the flagship strategy, we were able to deliver\nstrong performance in versus the SAP and both of those environments.\nYeah, so again, like when you finish going through your screen and you're actually physically\nconstructing the portfolio, right? What does I understand kind of what goes in it, but is there\ndo you concentrate the work like are you looking at 30 names, 50 names, 100 names, what is the\nprofile holding profile look like? Yeah, so, you know, once we've gone through that sort of step one\nof the process, we've got to, you know, what we think of is kind of a vetted quality\nuniverse of round numbers about 100 names. We do that valuation work. We're going to narrow that\ndown a little bit further to, you know, 60 to 70 names or so. We're going to do some, you know,\nsome risk adjusting on top of that around liquidity, diversification sort of policy risks that\nwe're underwriting throughout the portfolio. At the end of the day, it's a pretty concentrated portfolio\nround numbers about 40 names. So it's not, you know, a 10 or 15 name purely fundamental portfolio,\nnor is it a, you know, 100 plus name purely quantitative portfolio. Kind of fits the profile of\nhow we're building this portfolio. Yeah, I love that. And then as far as waiting is concerned,\nwhen I went in and looked at everything's, you know, it's not equal, you're not equal waiting\nthese 40 names. So is there a conviction, are you, you know, how are you going about the waiting\ndecisions? And then on top of that, you know, once you've come to those waiting decisions,\nI know the portfolio is active, but is there kind of a schedule in which you're revisiting those\nwaiting decisions? So two great questions. I'll try to tackle them in order. So we follow a pretty\nsimple position sizing, heuristic. And that's quality times value equals position sizes. So\nwe're not, we try to keep this simple. We try not to make our process overly complex. So your\nmaximum of position size is determined by how high quality you are. And then we just use valuation\nas a dial to figure out where within that range of maximum position size that you that you end up.\nSo if you're a top tier quality company and you're very attractively valued, you can be a time\nof purchase a 6% position. If you're mid tier quality, your maximum position size is 3% and you\ncan sort of follow that logic through. So as you observed, you know, looking at our top 10 weights,\nwe only have one position north of 6% today and overall our top 10 positions are on average around\n40% of the overall portfolio weight. So again, it's decently concentrated, high conviction portfolio.\nAnd then how often are you kind of revisiting that? And yeah, a daily look weekly monthly,\nyou know. So we don't follow a rigorous, you know, sort of systematic trading pattern with this\nportfolio, we tend to trade this portfolio win. And if necessary, it is a low turnover portfolio\non average. I think we're lucky that we we have that advantage of operating within a quality\nopportunity set. And that's a pretty sticky group, right? It's hard to become a quality company.\nIt's almost equally hard to unbecome a quality company. Usually the way you do that is you make\nsome bad capital allocation decisions. And that's going to sort of kick us. That's the most likely\nway to get kicked out of our quality universe. But it's a pretty sticky group. So that name\nturnover is apt to be pretty light. So most of the turnover that we do deliver in any given year\nis just rebalancing around that valuation opportunity set. And that's driven by just what our\nbottom up stock level analysis is showing us. So that direction of travel over the last\nlast few years meant that because we sort of were skating through 20 and 21, we were seeing some of\nwhat had become very consensusy quality growth tech champions, the fangs, thangams, the precursors\nto the Magnificent 7. Some of those companies were getting pretty fully valued. So we were\ntrimming from those that growth your end of quality, moving that more toward what we think of\nas poor quality and quality value. And that set us up pretty well for how 2022 played out.\nYou know, a lot of quality managers ended up being a little too overloaded with expensive growth\nwithin quality and that hurt them in 2022. Then that direction of travel sort of shifted midway\nthrough 2022. We found some valuation opportunities opening back up within some of those same\nnames. We spent the prior couple of years trimming. We started to shift weight back in that direction.\nAnd that in turn set us up for what you've already described that remarkable\nresurgence of growth that happened in 2023. And then I guess most recently, guess what? Some of\nthose names have started to become expensive again. So we've been sort of dialing back down from growth\nover the course of the last six months or so. So it's a pretty simple process, but it's effective.\nAnd I think it is, you know, again, sort of speaks to, you know, why we are most often used as a\nas poor equity or exposure. Yeah. So when just one kind of side question on that, when you're\nlooking at quality, people tend to think only, you know, the massive mega cap names are going\nit. Is it, is that generally the case in this portfolio, you kind of finding some opportunities\nin some other sub sectors of the market? So, you know, quality companies tend to be around for a\nlong time. They're successful. They tend to grow. We don't think of size being a term in terms\nof determining whether or not you are high quality, but this company is, you know, the vast majority\nof the companies in this portfolio are, you know, fall squarely within the mega cap category.\nAnd now that's not to say that you can't find some high quality targets down in, yes, mid cap,\neven in small cap. We actually GMO, my group actually launched about 18 months ago or so,\na small cap quality strategy. It is not at this point in time available in the ETF format.\nWe still have just the one. I think, you know, we do hope to build out that suite of active ETFs\na little bit further when, you know, when the time is right and when we feel like we have the right\nstrategy. But it's a good question. It, you know, certainly it is in all cap opportunity set,\nbut most of the really successful quality companies over time tend to be mega cap.\nYeah. So, I talk to a lot of model portfolio for that, that help advisors construct model portfolios.\nWhen you see that quality sleeve or that value sleeve, you tend to see kind of like a VTV or a\nQual in their QAL, right? Yeah. So, those are obviously their passive opportunities. Yeah.\nI'm a big believer in active. So, what benefits do you think quality, QLTY kind of, right, provides\nover your more traditional I shares Qual? Yeah. So, and I think that's a great comparison to make.\nAnd those are, I think those are good ways of getting passive exposure. But I think, you know,\nto your point, you can make a pretty solid case for, for pulling an active manager fee. And so,\nwe're kind of starting the same place. Qual QLTY, they start in the same place. We're running a\nquant screen, the factors that we're looking for look pretty similar to each other.\nBut then that Qual portfolio, what does it do next? It does some market cap, you know, adjusting\nthere's your portfolio. What do we do on top of that? We spend a lot of time obsessing about whether\nor not our quant model is kicking out a few false positives or a few false negatives. So, adjusting\nfor that, that's step one. Step two, we're doing that valuation work, protecting you,\nyou know, giving you a little bit of a margin of safety around paying too much for any particular\nquality asset. Step three would be, or I guess, difference three would be around portfolio\nconstruction. So, Qual, SPHQ, they're not willing to look that different from the benchmark. And so,\nthey're going to be constructed in a venture, in a sector neutral standpoint. So, that means they're\nforced to own the highest quality real estate company, the highest quality materials company.\nWe don't think that they're already. So, we don't own those. And so, you know, those\ncontend to be riskier areas of the market. Where that differentiation from a return pattern\nis most likely to show up is in those periods of intense volatility. You know, when there\nintense volatility tends to breed flights to quality. And that's when we tend to look\nmost different in terms of in a good way from a return standpoint versus those portfolios.\nSo, you'd mention a couple times, you know, this is kind of a core equity position. But ideally,\nif you're sitting down with, you know, an institution or an advisor, somebody who has a\nmodel portfolio, diversified model portfolio geared for their clients, you know, how would you\nideally put quality inside of that portfolio? And how would you help supplement maybe\nlarge-cap equity with it? Yeah, and so, you know, I think so a lot of people choose to use\npassive for accessing large-cap equities, right? It's been hard to beat the S&P 500 over the course\nof the last couple of decades. We've managed to. But it's tough. And so, you know, so, but I think\npeople are beginning to realize, again, we touched on this subject a couple of moments ago,\nkind of the riskiness of those broad markets around concentration, valuation, etc. And so,\na substitution for that passive way of getting broad market exposure. And so, we've been able to\npretty successfully make the case that this is a lower risk way of getting, you know, large-cap\nexposure, core exposure, what have you? And that shows up in the numbers. If you compare our\nreturns versus volatility on average over the 20 years that we've been managing a quality strategy,\nwe've, you know, we've beaten the S&P 500 by a bit. But we've done so with, you know, while\nexposing you to significantly less risk, if you think of annualized vial as a pretty decent proxy\nfor risk, we're a couple of points lower. So, those risk adjusted returns, the flight path of\nthose returns has been really attractive to a bunch of our investors. Well, Kim, I really appreciate\nyou taking some time with me today. You know, I, congratulations on the success of this product\nearly, like I said, it launched in 2023. You guys have started off with a bang, but, you know,\nbefore I let you go, where can people learn more about GMO, where can people learn more about the\nquality ETF? Yeah. So, if you go to, I think the easiest way to access information is just to go to\nGMO.com, and the landing page has a big banner talking about QLTY. We're excited about it here at GMO,\nas well. But Brad has been a pleasure talking to you. Thanks for, thanks for spending the time with me\ntoday. Yeah, Kim, again, thanks for joining us. And we'll hopefully, you know, see you soon.\nAnd one of the, before we were on, we were talking about conferences, so maybe I'll run into you next\nYeah, I hope so.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}