{
  "id": "14928654",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nToday we have Greg Reed from Westwood.\nHe is a president of Real Assets over there, and today we are talking about the launch of the Westwood\nenhanced midstream income ETF, Ticker MDST, the CTF combines an income focus approach with\ncover call writing, and also consists of 20 to 22 high yielding midstream energy stocks based\nall on their longstanding research over at Westwood.\nThis is a one of a kind fund.\nIt is first to market, combining high yielding and energy play with a covered call strategy,\nhoping to give double digit yield to investors.\nSo I think you'll find this product unique.\nI also think you'll find the conversation interesting.\nSo without further ado, please welcome Mr. Greg Reed.\nHey, Greg, welcome to the show.\nThanks, Brad, appreciate it.\nSo before we get started, can you just tell all the listeners kind of who you are, your background,\nand kind of your current role over there at Westwood?\nSure.\nSure, my name is Greg Reed.\nI'm basically the president of Real Assets at Westwood.\nWestwood is a public company based in Dallas.\nAsh had been public about 20 years Westwood's 40 years old overall.\nI run the energy team in Houston, which is a six-person team managing about 2.3 billion\nin assets, been in the investment business now since 1987.\nSo quite a long time, most of my career down here in Texas got a group in Dallas.\nSo I've worked in real estate, investment business, and now the energy business.\nFriends, we focused on income, generating real assets that investors want to own for inflation\nprotection and, you know, total return.\nWell, to soon being in Dallas, your whole life, you must be a cowboy's fan.\nYou know, it's funny, okay.\nSo I grew up in Dallas, and I am a cowboy's fan, but I've lived in Houston for 30 years.\nSo I'm still a cowboy's fan.\nI like the Texans too.\nWe're finally kind of putting it together, this receiver, showing up.\nThis is going to be really terrific for the next season, I think.\nWell, you know, I went to a game at Jerry's World, and it ruined going to Hinesfield for me.\nIt was like being a Disney World.\nReally cool place to watch a game.\nYeah, it's pretty crazy up there.\nSo outside of outside of work, I always like to ask people,\nwhat do you like to do when you're not behind the desk?\nWell, I'm golfing late this afternoon, so that's nice.\nIt's 80 degrees down here.\nSome good at playing nine holes.\nI was skiing last weekend, up in Colorado, getting the last week of snow in.\nIt's no date inches, so it's nice.\nI got to outdoor things, mainly golfing and skiing and traveling.\nThat's the thing I have to do.\nYeah, well, you and I would get along because it's skiing here in the winter and golf in the\nsummer. I'm getting out this afternoon, hitting hits and balls with my wife.\nShe's trying to pick up the game, and I'm trying to be patient.\nOh, good.\nYeah, that's great.\nSo before we jump into the ETF, can you talk about Westwood's affirm?\nI know you guys do a lot of things.\nSo can you tell us what Westwood does for clients as a whole?\nSure.\nWestwood is primarily an asset management firm.\nI've said then, public about 20 years, the historical strength of the firm has been\nvalue equities.\nWe have a large value team in Dallas, the small caps, midcap, midcap, large cap.\nAnd about $8 billion of our 16 is in value.\nSo that's the core of the franchise.\nWestwood acquired salient about a year and a half ago.\nSalient was based in Houston.\nWe had four billion and I've been around the energy team for 15 years.\nSo they bought us as a addition to their platform.\nAnd energy fits in great into the value DNA of the firm.\nYou know, energy stocks are cheap, high dividend yield,\nour portfolio yields about 6%.\nAnd we have a tactical asset allocation business called broad mark.\nThat was part of salient.\nAnd then Westwood has a multi-asset class business that's run by\nmy partner, Adrian Helford, that does a variety of things\nin both fixed income and equities.\nAnd so that's, you know, I think a very helpful strategy.\nSo if we also have a small wealth management business\nabout $3 billion that's in Dallas and Houston.\nSo kind of Texas focused that is a trust company business.\nSo with all of those different things you guys do,\nyou know, what made Westwood or particularly you running the strategy,\njump into the ETF game.\nYou know, what was appealing as I joked with the guests last week,\nwhat made you jump into the ETF terror dome?\nBecause there's so many of us and so many products.\nSo what was attractive for getting this product to market\nin a, you know, in an ETF wrapper?\nWell, okay, so our history started the business in O7.\nWe started the separate accounts.\nWe then built, built, co-mingled LP private funds.\nWe launched closed end funds, I think, in 2012.\nTwo of them, actually, two IPOs.\nAnd then we launched our open end fund in 2012.\nSo this is a natural evolution.\nThe world is really moving in the direction of transparency,\nliquidity and lower fees, ETFs are really the future.\nAnd so we want, you know, we've been thinking about how do we do this\nfor a number of years.\nAnd we wanted, we didn't want to be at me too product though.\nYou know, there's a lot of ETFs out there.\nWe are the first to market with an energy ETF with covered calls.\nAnd we have noticed, as others have, there's been a lot of AOM growth\nin covered call writing, investors obviously like it.\nAnd so we thought, marrying our 6% yielding portfolio and mid-stream\nwith covered call writing can get us to a double digit dividend yield,\nwhich we are going to deliver.\nAnd so we actually seeded the strategy a year ago to prove out of work.\nAgain, filing our, the first thing we did here at Westwood,\nwhen we got here in November of 2022, was beginning planning for the ETF.\nSo we're thrilled to, you know, took us 18 months to kind of figure out how to do it,\nhire the right, you know, providers and get this thing launched and seeded.\nBut here we are, and we're excited to find and have it out here.\nAnd to be first to market is really good.\nThere are a lot of long, only MLP or mid-stream funds out there.\nBut no one is really layering that in there with covered call writing,\nwhich kind of doubles the distributive income, which is, you know, it's pretty amazing.\nYou think about, you know, taking the yield, doubling the potential yield from work is so long,\nonly portfolio, and also lowers the risk.\nAnd when you write covered calls, the beta, you know, gets reduced by 10 to 15%.\nAnd so that a combination of lower risk and higher yield is very attractive for many investors.\nYeah, no, I couldn't agree more.\nBefore we get into the product, which is MDST, which is the Westwood enhanced\nmid-stream income ETF, you know, you guys recently launched everything is still fresh.\nCan you talk about the process of kind of getting this fund to market?\nSome of the key decisions you made along the way, and even go into, you know,\nsome of the service providers you partnered with.\nSure, well, we, you know, we talked to several people about who could partner with Westwood to help us launch\nnot just one, but this is a major decision for the firm, you know, to afford your old firm,\nthanks about things carefully, and, you know, lots out the strategies.\nThis is a major decision.\nWe wanted to hire, you know, top quartile service providers and great partners.\nWe have plans to launch two energy funds, one in a month, energy ETF.\nSo we've got two on the drawing board, we're going to launch, and I think we'll launch several\nmore, you know, over time. So this is only a strategic decision for the firm.\nYou know, we ultimately picked partners that we thought had, you know,\nbest in class knowledge, and could help us build a real ETF franchise.\nYou know, we of course have a large distribution team that covers the wire houses and RIAs and\ninstitutions, and so we wanted to marry up, you know, our existing resources at Westwood with\n16 billion assets with kind of this new ETF technology. And then cover call running is, you know,\npretty specialized. We wanted to make sure we have good traders there that can help us, you know,\nexecute on extracting. We call it harvesting. We're harvesting the volatility from the option\nmarket and we're harvesting the income from midstream. And it turns out, you know, we're looking\nat 6% from both pieces. And so that, you know, those two numbers kind of let us deliver a double\ndigit dividend yield to our ETF investors. So let's talk about the strategy. I mean, we've\ntalked about the strategy at a high level. Cover call strategy. Cover call ETFs as you said\nare becoming very popular. They're very popular on the equity side. And people are trying to do it\nin many different ways. And like you said, this is the first one. I actually looked this, you know,\nthis is one of the only ones that I've seen. You said it's the only one. So can you\ntalk about in a little bit more detail exactly what the strategy is, is doing underneath the hood\nin order to accomplish, you know, a double digit yield? Sure. Absolutely. And I'll mention our\nexisting mutual fund because it's a starting place. You know, it's, it's now 12 years old. We've\nbeen doing this a long time. SMLPX is our existing mutual fund. It's $968 million of assets today.\nAnd they're where we use the same benchmark AMEI, the Alarian midstream energy select index.\nSo SMLPX is a total return focus fund, meaning we're looking at the yield plus the dividend\ngrowth and appreciation are objective. And today yields about 5.3%. In the ETF, we're targeting an\nincome approach first and foremost and then tell return second. So what we do is we basically\nown similar stocks in the two strategies. However, we naturally have a bias to pick higher yielding\nstocks in the ETF. So we're overweight, some of the 7 and 8% yielders. There are a couple\nstocks in the midstream market like Scheneer, LNG, that only yields 1%. Well, that's not a great\nfit, you know, for an income product or a target two and a half percent. So we might underweight those\nand overweight, you know, TC energy at 7% yield and average at 7.5, that makes a lot more sense.\nSo once we build the portfolio and the portfolio yield today is 6.3%. Before fee. So the\ngross yield is 6.3. We actually can get a little bit more yield than when you're getting an SMLPX,\njust by tweaking our stocks selection or an active image ETF. We're professional stock picker.\nWe have a 6% team been doing this 17 years. Then what we do is say, okay, we have what we think\nis the optimal portfolio for return. Let's layer on top one month or two month covered calls.\nAnd so what we do there is we look at this strut and we look at the listed option market,\nyou know, no private options, no no flex options, just listed options that are liquid\nprice every day. And we basically try to sell options about 5% out of the money. So we don't\nwant to cap our upside two close. We want to give ourselves, you know, attractive one month upside\nand at the same time we want to bring in some premium by harvesting that volatility. So essentially\nand we just built the portfolio three days ago, we basically made about 65 basis points on option\nyield in 39 days. And we add 5% upside on average across the 25 stocks we own. So when you\nanalyze that 65 basis points, that's a pretty solid return. Now we have to assume, you know,\na couple stocks might get call of advice. You might not make the whole option premium. We expect\na lot of those calls will expire worthless, but some may be in the money we have to roll them.\nAnd so every month what we're going to do and we use may options, okay. So we're typically\nselling 31 days or longer. We want to have some duration there to get paid for the volatility.\nIf we earn 80% or more of the time premium, we certainly, you know, are motivated to close\nthem out early and book that game and that becomes just true to our investor. And then we're\ngoing to sell new calls. So this portfolio will be probably 90 to 95% covered as a systematic strategy.\nAnd what we know about capital markets is they go up and they go down. And if you systematically\napply this principle, we're going to make a fair number of games on the options and that'll\nbasically allow us to distribute that out to our investors. And then we'll go into the tax\ntreatment a second, but the ETF structure is obviously the best structure for being tax efficient.\nWay better than SMAs or mutual funds. So we can actually do tax loss harvesting and we can do\nbasket creations to get rid of low basis shares that might be called in the future. And so we\ncan be very tax efficient, ETF wrapper. But frankly, it's not as easy to do in an SMA or a mutual\nfund. So getting the ETF done for a covered call product, I think is really important. It'd be hard\nto do in another structure. Yeah, no, I couldn't agree more. And you touched on this briefly.\nIt's one of the questions I had is, so how are you filtering down to kind of build the underlying\nholdings of the fund? And how concentrated is the fund in terms of number of holdings? I think you\nmentioned about 25 names, but of course you're looking for yield. You kind of talk about the\nsecurity selection process of what gets included in this portfolio. Sure, so the product is just\nway to describe it. Everybody can follow is we look at the anti-index, which is well-known published\nevery day. So it has basically 25 constituents. It is a whole energy, food chain has been\nconsolidating, there's been a lot of MNA, Chevron, Axon, and Oxiobot companies. That's happened\nin midstream too. So we see it a pretty solid consolidation. I think that's really good news for\ninvestors because there are fewer companies that are stronger. They have better balance sheets and\nfrankly are those survivors. We're dealing with the best of the best now. So within that 25\nstock universe, we have research models in-house. We have three analysts that follow just\nsee, you know, there's 25 in the index but about 40 total midstream companies. We have proprietary\nin-house models. We have strong opinions about the next 12 months and next three are returns for\neach stock. So naturally we want to pick the ones that we have, you know, that we did most\npositive view on. And we want to avoid, you know, there could be a few dogs and cats in that index\nso we don't want to buy those stocks or a weaker performer. So our fully valued stocks might\nnot be a dog but just a fully valued company that we don't want to own. So we go through our\nbottom-up stock research and we build the portfolio. We have about 20 to 22 names in the portfolio.\nSo we don't own every single one. We skip some that we think, you know, our fully valued or\nhave less upside. And then it comes down to a waiting decision. I think that there's more\nalpha generated by the weight that we choose rather than owning the stock or not. For example,\nyou know, energy transfers 9.7% of the index. We think that's a phenomenal company.\nOne of the cheapest MLPs. So we're, we are going to have the large position possible and we're\nreally effectively capital 10% in the mutual funds. So that we're going to have fully, you know,\nbuilt down the portfolio. Whereas the bottom end of the food chain, you know, there's a stock\ntelerian at 28 cents. Well, that company's probably not, you know, you know, one of the best\ncompanies in the universe. It's, there's not much value there. So we're not going to have that one,\nfor example. So we can skip some of these smaller ones at the bottom of the food chain that might,\nyou know, might not be the best long-term investment. And kind of focus more on investment-grade\nhigh-quality companies that we think are winners. And then if you marry up a 6-day percent yielding\ncompany and write a covered call for 50 or 60 basis points a month and do that 12 times.\nYou're bringing in 6-7 or 8% a year in option yield on top of the 6-day percent dividend yield.\nThat's the winning formula right there. And, cannily, we don't need lots of appreciation\nin the company to make our target return. We can, you know, deliver a 10 to 11-12 percent\ndividend yield and still have portfolio upside. So that's how we think about it.\nYeah, no, that's a great way to think about it. One more question on portfolio construction\nand you touched on it again briefly, which would be, so you've got 20 to 22 names\nand from what I noticed is they're not all equally weighted. So there's some conviction\nbias in weighting. So how are those weighting decisions made? Is it based off of your proprietary\nmodels of who you think's going to be, you know, your biggest winner? I'm sure there's some\ndecisions around what the yield is because again, this is a yielding. This is a high yield product.\nSo you talk about, you know, how the weighting decisions are made at that individual equity level.\nYeah, absolutely. So we have, being basically of a spreadsheet of all the stocks in our\nuniverse and the index, we have our own view of the next 12 months return, which we included\nany yield in that, you know, next we'll never return. Then we have the street consensus. So we look at\nwhat is our team or analyst thing? Who we trust? What are all the sell side analysts thing?\nMary, those up and try to say, okay, it seems like we're seeing the same things something\nanalysts are seeing. Look for outliers there. And then we naturally, you know, probably have a\nleaning to not on a couple of low yielding niches because they don't provide a lot of dividend\nyield for an income strategy, not as attractive there. But those stocks tend to be more volatile.\nSo you can, you can earn more on the option yield. And then in a rig fund, we're a rig fund,\nwhich means we have to cap the MLP ownership at 25%. So we really can't overweight MLPs here,\nstructurally. We, we don't, we don't want to be taxes a C court mutual fund. That, that's a huge\nburden. You could be talking about two to 400 basis points of extra expense if we tried to\nwrap a C court wrapper around it. So we live below 25%. We're actually 24.9. Right at the limit.\nAnd basically, we also have to abide by this bad asset test, which means we can't go over 50%.\nSo really, there's, there's a lot of skill in kind of getting the stocks up to the 49.8,\n49.9 bad asset test and maximizing the MLP exposure at 24.9. And that's why you find a lot of\nstocks are right around 4.9. We might have preferred to be at six and we had to be 4.9 just because\nwe can't cross over on bad assets. We're right now about 49% bad assets and 24.8% MLP by design.\nAnd the beauty is every month, every, every day, we can tweak that. We can easily manage the\ntwo exposures to be compliant every quarter. That's no problem. We did that for 12 years. So\nthat's easy. So it kind of comes down to optimizing the returns of the stocks, the weights.\nAnd then we have to look at the listed option market and look at May and Jude calls and say,\nokay, for this company, are we better off selling a one month call or a two month call?\nHow much upside do we see as a money manager? Let's not cap our upside too much. Let's give\nourselves most of the upside while still, you know, breaking in an option premium. And that's where\nthe skill and kind of special sauce comes from. So literally it's a moving target. Every day\nwe're building the model and we're tweaking the option strike and what the weight is on each\nstock. So literally every day we're tweaking the model because we're getting flows every day.\nAnd we want to have a fresh model. So literally you could argue it's being rebalanced.\nThe model is changing every day because the stocks move around a lot. But we're trying to be\nvery tax efficient on the portfolio. So we're not selling the stocks. We're buying and holding\nhim. And we want to get long term capital gains treatment. So I look at it as a very active\nadvantage. But it's long term in nature and very tax efficient and strategy.\nSo being as you are a new fund, I mean, you launched what a couple of weeks, we could go two weeks\nthree days ago. Yeah. All right. Well, when this comes out of a few two weeks,\nyou know, you think that the hard part of this is all in the structure and you guys are doing\nextremely unique things in terms of the strategy. Right. How are you going about thinking about\nmarketing the fund from this stage going forward and kind of the target audience for this product?\nBecause to me, what you're doing is extremely sophisticated and unique. So I would think that you're\ntarget is probably more institutional or investment advisors rather than retail. So if you guys put\nthought, I'm sure you've put thought into how you're going to be kind of getting the word out there\nand starting to get flows into this product. Sure. You know, because it's an income focus product,\nI think naturally it's going to appeal to retail or high net worth investors that are core.\nI don't think a lot of institutions necessarily want to target the income as much. They, they,\nover time, you know, as the fund gets larger, we'll certainly talk to institutions. But I think\ninitially it's going to be high net worth and RIA type oriented people. There are so many people\nthat are retired that are running balance portfolio 64 to your 50 50. And we can literally\ntake our basic mutual fund, which has a 5.3% yield and double it. When you can do that,\ngive someone a 10 to 11% yield and still have upside and lower their beta. That all of a sudden\nin my mind becomes an income solution, not an energy solution. This could be a great IRA vehicle.\nYou could actually trim some of your high yield bonds and your public equities and make this kind of\na hybrid solution in the middle of, you know, it's an equity product, but it's less risky because\nthe cover call piece, it basically shifts the beta from a one beta to the index to about a point\neight five. So we're actually less risk higher yield, more steady return because that dividend\nis going to be paid monthly. So I think that becomes more of an income solution. And I think\nthat could broaden the number of people that want to apply it. We don't have to just cater to\nenergy investors. This could be, you know, a real asset investment within an income portfolio. And so\nI think this will end up appealing to a lot more people than just our standard mutual fund.\nWell, so and continuing on that path would be if you were sitting down with a registered investment\nadvisor who has a model portfolio put together for his clients and you're you're carving out a\na seat for yourself inside of that model portfolio. You know, where would you like to see this\ninside of that was it again more of a fixed income alternative? Would you peel from a little bit of\nboth and almost put it in an alt sleeve, you know, how are you thinking about that?\nA great question. And we try to, you know, tailor everything to the RIA advisor or, you know,\na large platform of a property or platform. I'd probably say, you know, to them, do you have a\ndo you have a real asset sleeve that includes rates and energy and inflation protection\ninvestments? It certainly belongs there. This is ultimately a value equity. So it's part of the\nequity portfolio for sure. Many of these stocks are in the S&P 500. Williams, Kinder Morgan,\netc. They're S&P names. So this can be a less of less, less market sense of lower beta equity\nsolution for someone that's perhaps, you know, in their 60s or 70s retire, who wants to take less\nrisk and get the return of equities. And then, I wouldn't say it's a substitute for fixed income\nas much, but you could, you could make room for this, you know, three to five percent and take\nsome out of high yield riskier bonds and some out of, you know, S&P 500 and equities, which only\nhave a 1.3 percent yield. You could take some out of that and plug this into a 10 or 11 yield\nand feel like you're adding value to the client's portfolio because you're picking up that guaranteed\nincome while lowering the beta. And so I think it could be in the alternative bucket.\nThese are all public stocks. So it's probably more likely to be in the equity bucket,\nbut an income value add. And there's so many, you know, so I mean, the market, it's had a good rally.\nSo S&P 20 yields 1.3. That's not really much income for anybody. AGG, big bond,\ndoesn't have much income either. So other people are always searching for how do they\nhow do they solve for the retiree income? And you don't be retired to one income. I want\nto income on my portfolio to spend for travel and fun things like that. AGG yield 3.6 percent.\nSo when you, if you do 60, 40, S&P 1.3 and 40 it, it's a 3.6. I mean, you're at 2.2 percent.\nRight. You better apply money. That's not, you know, much income on your portfolio. So I think\nour solution, you know, really stands out as, is being a value out of the portfolio.\nWell, Greg, it's a very unique and interesting product. There's a lot of merit to it.\nI think you guys are going to have a lot of success in this space. But before I let you go,\nfirst of all, thank you for your time. And I appreciate you doing this and spending some time with us.\nBut secondly, where can people learn more about Westwood and MDST?\nThank you. Sractor our website. You can just Google MDST and that'll pop up. But then Westwood ETS\nis our website. So brand new, you know, is our first ETF. So we've got a lot of materials on there.\nAbout ETFs and about energy. Our team's been managing billions of dollars in energy now since 2007.\nWe started, but billions since around 2012. So, you know, 14 years of being a boutique\nenergy money manager. I'm thrilled that we're first to market with a covered call product.\nBecause there's a lot of covered call products out there. And this is the only one in energy.\nSo the market leader, hopefully, you know, gets, gets the worm first and gets most of the flows.\nI did the math on the 6040. So if you do 60 SPY and 40 AGG, you have a whopping 2.2%\ndividend yield before you pay the advisor fees. That's not giving your client much income.\nWe're going to be 10 plus. Well, again. Very, very attractive, very compelling.\nSeason team. So again, Greg, I really appreciate your time.\nThanks for joining us today. Thanks, Brad. Appreciate it.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}