{
  "id": "14960359",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nMy name is Ellery Roth.\nBrad Roth starter.\nI hope you enjoy this episode with Mr. Json Shoe.\nWelcome to Behind the Ticker.\nThank you, Ellery.\nShe has been begging me to do the introduction.\nShe would love to hear her voice on Spotify.\nSo we slipped her in a quick introduction there for Mr. Json Shoe.\nHe is from Moralient.\nThey just launched their Japan Equity ETF Ticker R.A. Y.J.\nIt's a concentrated portfolio of 30 growth names.\nThey use a fundamental as well as quantitative approach to build the portfolio.\nI think it's a unique story.\nI think it's a great timing with international being so depressed in terms of valuation versus\nthe U.S. from a historical basis.\nSo we talk about the firm, we talk about the product,\nand we talk kind of briefly, they have a handful of other ETFs.\nSo without further ado, I think you'll enjoy this conversation with Mr. Json Shoe.\nHey, Jason, welcome to the show.\nHi, Brad.\nGlad to be on the show.\nSo can you give everybody kind of your background and how you got into the position where you are today?\nYou're absolutely.\nWell, I actually started out as an academic in the university, but thought, hey,\nall these things that we're teaching do they actually work?\nAnd so I actually build a very successful institutional distance around\nquantitative research that we've developed in academia and, you know, since then,\nI've taken the institutional business and also created retail vehicles.\nSo now all of our strategies are available in the active ETFs.\nSo I always like to ask before we get into the business.\nWhat kind of hobbies you like to get into when you're outside of work and you're not,\nyou know, behind the desk?\nI guess, you know, my hobby is watching basketball games.\nI actually played in high school and played a little bit in college.\nI went to Caltech, so it's not hard to play Kalish basketball at Caltech.\nAnd basically, if you had legs, you could play.\nBut I love basketball grew up on, you know, the Lakers versus the Celtics, right?\nDays of Magic Johnson and Larry Bird.\nSo that's that's my passion.\nYeah, that's great.\nThat's what we were just talking before we were on the show, basketball and hockey.\nWell, did basketball play off start yet?\nOr is it just hockey right now?\nNo, it's it's game two already.\nOkay, yeah, happens fast.\nWe do that.\nSo I'm in Pittsburgh.\nWe don't have a basketball team, but at least we have the rest of the sports.\nSo I guess we'll, yeah, we have the penguins.\nSo let's talk about Rayland, right?\nWe know you have a handful of ETFs.\nWe're going to talk about a few of those today.\nBut can you talk about some of the other things you do and how you're helping clients\nkind of holistically other than just in the ETF space?\nWell, absolutely.\nSo as I mentioned, we are primarily institutional.\nSo we run money forward at government's up.\nJapan, Taiwan, Canada, we run pension funds as well as sovereign wealth funds.\nSo that's kind of our primary client segment up until recently.\nAnd so in the in the wealth space and kind of the retail financial advisor space.\nWe now offer model portfolios containing ETFs or direct stocks in the model portfolios.\nAnd of course, we also manufacture the tools, which are some of the ETFs.\nAnd that aren't as available in terms of the universe of ETFs.\nSo you'll see that we are coming to markets with, you know, sort of,\nniche year, active ETFs in emerging markets, emerging ex China, China, and now Japan.\nYeah, so you started the business.\nIf I read it read correctly in 2016, you guys have a significant amount of AUA.\nI'm assuming a lot of that's driven by your institutional work.\nYou have a lot of different channels.\nCan you talk about really what made you start the business?\nI know you came from academia and eventually how you kind of scaled it to where you got it today.\nYeah, so we actually spun out of a larger organization.\nSo when I first, you know, spun out of academia and launched my funds management business.\nMy first startup is research affiliates.\nI co-founded that firm with Rob or not, build out this franchise, the Rafi or Fundamental Index\nfranchise.\nAnd then had my second spin out in 2016, basically spun out of research affiliates and kind of\nover what was research affiliates Asia and kind of from that platform started offering institutional\nservices primarily in this year markets, like emerging markets, like emerging Asia and single\ncountry, I would say Asian economies, and then, you know, I think, broadening that out since then.\nYeah, so I saw the word Continental a lot on the website.\nI'm a big fan of this type of investing.\nWe have a lot of financial advisors that listen to the show.\nSo can you talk about what that means to your firm in particular and how you're implementing it?\nSure. So I would say, even though I am quantitative in my DNA, it doesn't mean black box, right?\nI have tremendous amount of respect for stock pickers for people who are qualitative,\nfundamental, but really deep dive stock pickers. And in fact, a lot of what we're trying to do\nusing the quantitative methods is what can we model what a really experienced stock market\nactually do, day in day out basis, just do it systematically, take out the human emotions and human\nbiases. And of course, with machines, you can broadly apply the same methodology to, you know,\na universe of 10,000, 20,000 global stocks. So that's kind of how I think about the\nright way to do quantitative analysis is to really use systematic computers or sites methodology\nto, as much as possible, replicate what a human portfolio manager and human analyst can do.\nBut of course, we also want to, you know, hire, experience human portfolio managers.\nWe then would look at the output of the computer and I just blindly trust the machine,\nbut make sure that there's a layer of sandy check or layer of risk management, especially\nrisk managing against events that don't currently live in the data, right? Because there're just\na lot of new events that we're facing right now. And you can't honestly say, oh, that's happened\nhistorically. So we have some data to guide us. Yeah. And so you kind of answered my next\nquestion, which is how much human interaction goes in it. I mean, we run a systematic and quantitative\nportfolio. We don't put a lot of human overlay on it, other than some guardrails for it. So it sounds\nlike to me, I mean, please correct me if I'm wrong. If you're kind of having humans,\nalmost fact check the model in a way that you kind of know what's coming on the horizon\nand whether or not a certain investment or a certain amount of risk may or may not be necessary.\nI think guardrails is the perfect word for it. Because what you don't want is you don't want the\nhuman to come in and say, oh, you know, I disagree with the machine. I have some other insights\non the implement, right? Yes. You know, the thesis is we believe in the human insight and the human\nframework. And we have done as much as we can using models to replicate that. So I think the humans\nroll in this case and say, look, if the human insights live there, and that's make sure the output\nmatches that insight that you don't have unexplainable trades or large concentrated positions\nthat you can't really map back to that intuition. Yeah. So let's talk about, you know, you have\nfour ETFs that I've seen come to market. We want to talk about RageA, which is RA, RA YJ,\nwhich is your Japan equity ETF. So if you could, can you please just explain the strategy\nat a very high level and what it's trying to accomplish? Sure. And then, you know, obviously\nRageA is, you know, Raleigh and Japan sounds like very good James. It's actually in collaboration\nwith one of the largest financial institutions in Japan. So it's in collaboration with the\nSUNY TOMO group. Of course, there's the, you know, largest insurance banking investment management\nconglomerate in Japan. So partnering with them is really what I think the ideal combination\nof taking the quantitative science and the fundamental. Because they're a big stock picker,\nshop, they obviously been in business for as long as I think that Japanese stock markets\nbeen available. And so we are working with their portfolio managers to take what we think is\na more interesting segment of Japan that people don't talk about. It's really the small mid-cap segment.\nNow, occasionally we'll have larger cabinet, but primarily we'll focus in the small mid-cap\nsegment. They offer their deep fundamental research and we give to them the quantitative scoring\nof the stocks. And it's really the combination of two that then results in the final portfolio.\nSo it's a very unique data, right? Most people think of Japan as buying things that's in the\ndecay or buying things that are the Toyota as the, you know, SUNY TOMO than the more us.\nInstead, we're looking at a segment where you kind of really come into contact with the smaller\nnames. They just aren't globally covered by analysts. Yeah. So I definitely want to talk about\nkind of that screening process. I see the fund is fairly concentrated. So I looked at the fact\nshe at least the last fact she shows about 30 names in the portfolio. Can you talk about that\nscreening process? I know you touched on it there a little bit, but maybe how you're getting\nto those 30 names. And then afterwards we'll talk about kind of how you make waiting decisions\naround those names. Yeah. So the screens that we apply broadly fall into, I would say,\nthree distinct categories. And within each category, they're sort of, you know,\nseveral dimensions. So the three distinct categories is we clearly focus on the fundamental.\nSo we care a lot about, you know, so healthy, high quality, fundamental growth, or any\nfundamental. There's another category that's really about what the corporate insiders are doing,\nwhat you can infer from that. So it's think of it as the governance structure. Think of it,\nas sort of insiders buying, think of it, has it been evidence of insider manipulating,\nmanaging earnings aggressively. So those who could all be sort of negative and positive signals\nare coming to it that comes from analyzing the insiders. And then the final piece is really\nunderstanding the market sentiment. And the, you know, the Japanese market is actually still very\nretail oriented. About 30, 35% of their trades is retail. So it's a fairly retail influence market.\nSo we want to understand the, you know, what flows is conducted by the institutions, what flows\nconducted by retail. We've got tens of loops over time. So we certainly don't want to be trade\ntrading in the same direction. We want to understand what a sentiment certainly more positive\nnegative. So again, if there's a cheap value stock, you don't want to be catching a falling knife\nwith negative sentiment this is strong. And you want to wait and see the sort of catalyst around\nparticular theme where it's written. So these are the three distinct screening dimensions.\nAnd I would say on the fundamental side, what's a particular importance in a growth as a\nkey, I would say quality screen that we look at. Because we were less interested in just buying\na big dividend pair. We're interested in really accessing growth, especially we think, you know,\nJapanese recovery is for real. We don't want to have, you know, the growth exposure, the higher\nbeta exposure. So quality as a screen, the variations of screen are cheap. We want to buy growth\nat a reasonable price. And then you overlap on top of that sentiment to make sure that you're,\nkind of the right part of the growth curve. You don't have to wait years before the growth\ncatalyst comes around. Right. No, I definitely want to talk about more about market sentiment\nand how you're analyzing that. But as far as, you know, now, in my opinion, if you kind of just\nlook at international historically compared to US equities, I mean, you'd have to be\nexcited about the growth projections and, you know, most sort of version to the mean in terms of\nvaluation and those sectors, you guys of the same belief? Absolutely. So, and then this is why\nwe actually like emerging markets a lot. And in this case, I almost would say, you know, Japan\nhas for a very long time behave like emerging markets. Always fairly cheap. You want the growth\nstory, but it seems much more cyclical than structurally growing. But if you now look at, I would say,\nyou know, for me, cyclical perspective, it's probably the cyclical drop. It's been cheap for a long\ntime. If you look at kind of the growth trajectory, there are a lot of callous to believe in a\nstructural recovery in Japan. And so this is why we really like Japan right now and are bringing\na product to market, right? It's cheap. It's a cyclical bottom. But the growth callous seems so obvious\nwith the really ultra cheap yen with final inflation coming back to that economy so they can\nnormalize your interest rate and households as a result of that are receiving a strong income\nto their, you know, bank deposit and to their, you know, network. So these are all really positive\ncallous for that market. Yeah, no, I would agree. So it's exciting time for to have this\nparticular product in the market. Let's go back to sentiment. Some interested, right? How are you,\nhow are you observing sentiment? Are you looking at flows? Are you using, and some, you know,\nI've talked to some managers that are using AI models to read sentiment on social. There's many\ndifferent ways. So primarily, how are you trying to uncover where that retail window or institutional\nsentiment is? Yes, I think sentiment is one area where the quantitative approach has an enormous\nadvantage because you could use AI to process text and from there to score what are, you know,\nmedia and headlines tends to be more growth oriented, more positive sentiment. Also, you could use\nthat to look at tick-by-tick data and understand what you're seeing, sort of, you know, retail\norder flows that tends to be sentiment chasing, that tends to react and amplify positive sentiments.\nAnd so, we're using, you know, data and the machine learning methodology to access sentiment measures\nacross all channels where there's data available. Yeah, so, with that, let's talk about waiting\ndecisions, right? It is a fairly concentrated portfolio. It's not running equal weight. So when you're\nrunning and looking at certain waiting decisions, is that primarily driven by that market sentiment?\nAre there other things that you're looking at to kind of derive the amount of risk you're\nwilling to take in any single one of those names? I would say the primary waiting decisions are\ndriven actually by the, you know, of the three buckets I talked about, it's primary driven by the\nfundamental bucket. That has the largest way. You know, let's say that actually has two-third\nof the weight because you want to anchor the portfolio in something you can't believe in that you\nwant the whole for the next five years and next ten years, right? We will never get into a company\nthat has poor fundamental just because of sentiment is positive because that's a bit of a\nPonzi scheme, right? You might trade perfectly and get out before things blow up. But that's,\nI think that's not how our investors want them, that's the certainly not how we want to invest.\nSo for us, it's about we want to buy companies that have the right fundamental characteristics\nwhen it comes to growth, when it comes to other sort of quality aspect to it. We want the sentiment\nto be there so that, you know, oftentimes, you know, you can be in a really good fundamental company\nthat remains undiscovered for years, right? And then that's just a poor user capital. So we do\nwant the sentiment to be there and there's a way to sort of ramp us up because they're generally\na lot of interesting companies that we would like the home. The one that has positive sentiment\nis one that's more likely to immediately generate return. So really, the anchor is the fundamental\nquality of the company and that would say the sentiments what the corporate insiders are doing\nbecomes countless that just predicts a faster return of capital. Got it. So how often are you\nrebalancing the underlying or is it is the fun purely active and you can kind of rebalance it\nat any time? I mean, how often are you, is there a, you know, a monthly quarterly weekly rebalance\nschedule? And on top of that, how often are you kind of rerunning the fundamentals and looking\nat the screen to add or delete any names that might be in the portfolio? The fun is truly active.\nSo there's not a sort of deterministic, like every month or every quarter, we do something\nas information comes through. You know, we'll be making, you know, rebalancing and making trades.\nNow, of course, a lot of the quantitative signals tend to be more, you know, on the cycle,\nright? Monthly cycle for some of the data, quarterly cycle for a lot of the sort of fundamental\nearnings related data. So there is a updating cycle that produces a new sort of screens and scores.\nBut then remember, that goes to the active managers in Japan who use that as part of the decision\ncriteria to put together a portfolio. And they have sort of ongoing monitoring of news\nreviewing with the actual company in terms of manager visits that they're not resolved in the final\nportfolio. So I would say trading can occur at any point in time. Some of the information is a bit\nmore, I would say chunky as they get release every quarter. So when, last question on kind of the underlying\nholdings and waiting, do you have any guardrails on sector exposure or can you really go anywhere\nin terms of, you know, the names that you want to put in here, like, do you have any guardrails around,\nyou need so much exposure to financials or information technology or, or can you really just take\nthis anywhere and find the best ideas? Yeah, we have some guardrails, but those guardrails are very\nloose because we do believe in, look, the underlying benchmark has the sector weights, now\ndo they make any sense that their reason why finances has to be 20 plus per cent for Japan\nsimply because they have these big old financial dinosaurs, right? So for us, we want to take active\ndeviations against what's in the cap weight of benchmark. I've always been a big believer in that,\nespecially in the market where you can, you know, say, well, the index, the passive index is\nperfectly efficient. So we do take quite a bit of deviation in the active Japan product, which\nis why it's more concentrated, reflecting the fact that it is also a more inefficient market,\nthe market where the underlying index is dominated by, I would say, firms that haven't grown\nand firms that probably aren't going to be the one that delivers future returns. Yeah, so as a,\nas a model portfolio builder yourself, or as someone that you're talking to,\nan advisor group that might have their own model portfolios, where would you put RAYJ as a\nallocation, kind of what bucket would you put it in, how would you wait it, you know, just kind of\nbest practices to use the fund? Yeah, so definitely this goes into your kind of international\ndeveloper bucket, and we've been telling a lot of clients, but, you know, within your\ne-fuck bucket, your international XUS bucket, frankly, when you look at what's available there\nin the thesis, you're probably not too excited, right? Is it the UK, which is still probably\nstruggling with the Brexit? And then I think, you know, the pound, the inflation, the inability\nto race rate like we did in the US to fight off inflation, you know, Eurozone isn't, I think any\nbetter versus the UK. So in some ways, if you're looking at international XUS, I actually like\nJapan more than anything else, right? It's cheaper, it's got the growth story, it's been,\nit loves inflation, wants inflation, right? And it's trying to fight out, it's been harmed by it.\nAnd so it has a almost opposite macro of the Brexit e-fuck. So I would underweight within my\ninternational portfolio, Europe, and meaningfully overweight Japan. That's that side would I will\nalmost make it 50-50, right? And that Japan might be, say, 20-8% maybe close to 30% of\ne-fuck, but I would definitely probably bring that up to closer to 50% and then downweight,\nEurope. Got it, makes sense to me. So as a new fund, or I should say, as a new issue,\nyou guys have out there. I always like to ask how you think about marketing the fund, right?\nIt's one thing to come up with the idea, put it, do all of the work and produce good results\nfor your clients and those who use it. But how are you guys thinking about marketing and getting\nRAYJ out there and people starting to implement it in their portfolios?\nWell, first of all, I'm going to go on every single podcast interview, wearing a Hello Kitty\nT-shirt. I mean, everyone knows Hello Kitty, right? We probably know Hello Kitty as much as we know,\nyou know, to Toyota Prius. But how do you access Toyota Prius? You buy Toyota, right? It's one of\nthe largest cap name, but how would you access Hello Kitty? You probably don't know the company\nL was the, you know, brand and licensing, right? And it's a fast growing, very interesting,\nyou know, mid-cap company in Japan. So now, what we're out there talking to all the advisors,\nwe are at different conferences, making sure people understand kind of our brand energy,\nwhat we're bringing to market, right, tends to be so niche, you're interesting growth markets,\nthat people don't talk about, that perhaps is more blue ocean red, than red ocean in terms of\ncompetition. And we do a lot of, I would say, investor education, advisor education, just helping\npeople to understand how does Japan makes sense, right? How does, say, China makes sense in your portfolio,\nhow does emerging? And the next China makes sense in your portfolio. So these are sort of\nniche year topics. One word isn't a lot of education, but one I think we excel in in terms of\nhelping advisors understand where to put this in a model portfolio. Yeah. Well, Jason, I really\nappreciate your time. This was a lot of fun. Before I let you go, where can people learn more about\nthis fun? Where can they learn more about your firm and get some of that information that you\nwere talking about? Absolutely. So first of all, please do find me on LinkedIn. That is the primary\nsocial media platform that I use in my firm use. So go on LinkedIn, find me and then add me\nas your connection and then add my newsletter, the bridge. And the idea is to bridge these\nless familiar markets with the US advisors. So you have a steady source of and both\nop-bed and research pieces coming from my firm. And then go to, you know, funds.railyand.com\nto get the perspectives for our different ETFs. Well, again, thank you so much. I hope to see you\non the conference trail. And I really appreciate your time and doing this. Thanks, Brad.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}