{
  "id": "15002973",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice and it is meant solely for educational\nand entertainment purposes only.\nWelcome to Behind the Ticker.\nToday we have on Matt Kaufman from Calamose, and we are here to talk about their newest\nissue, which just launched on May 1st, 2024, Ticker CPSM, the Calamose S&P 500 structured\nalt protection ETF.\nThis is a very interesting and I think high demand product.\nIt's got S&P 500 on this particular cap at 9.81% to the upside.\nNow offering zero downside participation.\nThis is one of 12 issues that are going to be coming out from Calamose over the next\nyear.\nI think there's going to be an extreme high demand for this product that is very interesting\nwith how it's structured.\nIt's actually very simple and Matt does a great job explaining the product, how it works,\nwhy it works, and where you should be putting it in your portfolio.\nWithout further ado, please enjoy this conversation with Mr. Matt Kaufman.\nHey, Matt.\nWelcome to the show.\nGreat.\nThanks for having me.\nBefore we get started, can you give everybody a bit of your background and how you\neventually ended up in your position over at Calamose?\nOh, sure.\nAgain, I think part of that story probably leads into the products that we're launching here\nas well.\nI've been in the ETF space a little over 20 years, started off at Power Shares in the early\ndays, building out the smart beta ETF space.\nYou had the privilege and honor working under a perspond there and learned a lot from\nhim and saw how innovation can change the ETF landscape until Power Shares.\nA lot of the products were all very passive index based, market cap weighted, and so we\nreally brought on a lot of smart beta type products.\nWe did FTSE Rafi and worked with research affiliates.\nWe did commodity type products, and so really pushed the envelope of what could be done\nin the ETF wrapper.\nSo I really appreciate it.\nAppreciate it with that time at Power Shares.\nAfter Power Shares sold to in Vesco, I went to an actual burial consulting firm, which\nmakes probably absolutely no sense.\nAnd so I was at Milliman, a financial risk management that was around 2010.\nThey wanted to build funds out of the hedging strategies that they were running on the\nbalance sheets of life insurance companies.\nIt was a fantastic opportunity looking back, learned to tremendous amount about the insurance\nworld, about hedging strategies, what works, what maybe doesn't work, and what we saw\nthere was largely rate-driven, a lot of insurance products are rate-driven, and so after\nthe financial crisis rates were extremely low, and it was very difficult to, from a investor's\nperspective, it was difficult to provide or get risk management or income from bonds.\nAnd so people were looking toward the equity markets to do that.\nThey were running equity risk management strategies, covered call strategies to generate\nincome.\nPeople were looking at the equity markets to generate risk management and income.\nAnd that worked very well.\nWe had built around 50, 55 funds, largely for life insurance companies, variable-newty\nsub-accounts, raised a significant amount of assets there.\nThe other thing that we noticed is it was difficult for life insurance companies to deliver\nmeaningful upside on their fixed index to newities, which for an ETF user may not be familiar\nwith that marketplace, but that delivers equity linked upside with no downside risk.\nSo principal protection over, you know, not compared those FIAs might be one year or\nthree years, five years, and so just some background there.\nBut it was difficult to give anybody any one meaningful upside on those types of products.\nAnd so the insurance space and the structure products space really too started moving\ntoward, you know, what we would call this risk sharing model, where you could deliver\nsomething less than principal protection.\nYou could deliver partial principal protection, where you would deliver 10% buffer or 20% buffer.\nAnd so that would allow you to deliver, you know, meaningful upside again.\nAnd so that we saw that space start to really take off the structure to newty market,\nthe buffered structured note space.\nAnd by 2016, I would say, you know, we were still at Milliman, and we noticed that you\ncould deliver that type of outcome very efficiently with options contracts.\nLike we could just take flex options, you know, equity listed flex options on broad liquid\nmarkets, package those together, make them all expire at the same time, customize the\nstrike prices, and then you could deliver that as an outcome via a package of options.\nAnd so because you can do it with options, those are securities.\nAnd so those securities can now sit inside of a wrapper like an exchange traded fund.\nSo I don't know too many folks who spent time in the ETF space and then also fortunate\nto be in the insurance space, but being able to merge those two worlds and think\nthrough the theory and the math and the construct of outcomes delivered by, you know,\nbalance sheet based products, like insurance products or structured notes, and then doing that\ninside of the tax efficient liquid, you know, low cost wrapper.\nSo the, you know, backstory, the head trader at Milliman and I, a few other folks work together\nto build this intellectual property and then deliver that into Innovator ETFs, you know,\nBruce comes coming back into the ETF space. They hired Milliman as the sub advisor for those\nproducts. So they were still a client of of Milliman that businesses growing strong and\nyou really set the stage for the Buffard ETF space. So, you know, obviously we need to\nto give Innovator credit for building those that, you know, products set out that ETF space out\nthat products that's going really strong. It's about $50 billion across them and, you know,\nother, other competitors as well. What we saw, you know, I've been at a calmos about year and a\nhalf and, you know, what we've been watching is the rate environment. And so as rates have come up,\nyou know, off of zero, say, call the lift of, you know, March 2022, as rates are approaching,\nyou know, two, three percent. You know, we're looking at that rate environment and watching flows\nin other spaces and, like, guess what? People are buying CDs again. They're buying money markets,\nagain. And the same was true in the structured note and the, you know, a newty world, people were\nbuying capital protected, structured notes. They were buying fixed index annuities again. And that's\nspace. The capital protected space we would call it outside of the ETF world is about four times\nthe size of the Buffard space. And so it's a massive industry that is really not been disrupted by\nthe ETF vehicle. And so that's what we're doing at Calamos. We're taking this brand,\nthey call it brand new to the ETF space. But it really couldn't have been developed when rates were,\nyou know, as below one two percent. But now that we're north of that, you know, we're at, you know,\nfive little over five percent now, we can deliver capital protection inside of an ETF wrapper.\nAnd so that's what we've launched today or filming this, you know, May 1st, we launched about an\nhour two hours ago, hour and a half ago. And, you know, the market is accepting this type of strategy.\nSo CPSM is the ticker symbol for the first of 12 ETFs that we're launching. So we have an ETF\ntoday that's CPSM that delivers 100 percent downside protection with upside exposure relative to the\nS&P 500. So there's caped upside here. You know, there's no free launch. But the upside is caped.\nBut because rates are at a point where they're higher than they used to be, we can, the cap that we\nstruck yesterday was 9.81 percent. So now investors can't have a choice. If you think about like\nwhat your choices are between a CD or between this, you know, you could choose your, you know,\nguaranteed five percent CD rate that you would get hold it for a year. And that would expire\nin a year. And then you would pay ordinary income tax on that, which here in the highest tax bracket\nthat turns into 3.2, 3.3 percent. Or you can turn in that guaranteed 3.2, 3.3 percent\nand get the chance to earn your upside of the market. So you get the, you can link your cash\nessentially to the equity markets, get upwards of 9.8 percent, and then have no greater downside\nrisk over that one year out compared. So again, it's for folks who want to buy in at the beginning,\nhold till the end, they get that out-comperiod performance. But there's also, you know, opportunities\nto buy in along the way. So right now the market's been open for an hour to the, the Nav is still\nhovering right around $25, so people are still buying in. We're seeing really strong volume\nright out of the gate, which is good to see. But anytime that net asset value crosses back over\nits starting point along the way is another good entry point, because now you can obtain that\n100 percent downside protection over and out-comperiod with, you know, a shorter time, time for\neyes and left. So I've spoken a lot. I'll stop there and, you know, we can just keep talking here.\nYeah, no, sure. And thanks for that. That was, I took a lot of notes as you were talking,\nbecause it's, it's a very interesting product, and I do want to get into it deeper how,\nhow it's structured where people can kind of put this in their portfolio. And I definitely want to\ntalk about buying it in different cycles of where Nav is or over that out-comperiod. So\nwe're going to get into all that before we do though, I always like to ask people, what do you\nlike to do for fun when you're not building ETFs and mad out there, Salina? It's a good question.\nI grew up playing a lot of volleyball. So I, I'd say I used to have Monday nights free to play\nvolleyball, and then since we've had a big brood of children, I've turned into the baseball\ncoach and observer. So we got a high school freshman on the baseball team so that keeps us busy.\nWe're watching him play, and then I'm coaching our eight-year-old son as well. So between all that,\nthat is fun, but that I would say that I have abandoned all personal fun efforts.\nOh, I get it. And the baseball parent, you know, I coach seven-year-old girl soccer,\nso it's like a twice a week commitment. It sounds like talking to baseball parents,\nthey're like playing four games a weekend, and that's a heavier lift. So you're weak at that.\nYeah, I, yeah, I love the volleyball matches, because you know, you can get in and out in,\nyou know, 40, 45 minutes, you know, a 30-game baseball season. That takes a long time together.\nSure does. Well, let's, let's talk broadly about Kalimos. If we could, just for a second,\nI know we're going to talk about the ETF. When you guys do a lot of other things,\nyou just talk about the business as a whole and how you guys are helping clients kind of along the\nspectrum. Yeah, the way that I position Kalimos is as one of the world's leading risk managers\nand alt providers. We run the second largest liquid alt mutual fund in the country,\nmarket neutral income fund. It's been around for a long time, and a lot of advisors use that\nmutual fund. We're also the largest user of convertible or manager of convertibles in the US.\nThat might be where people have heard of Kalimos's, our expertise in convertible bonds that really\nput us on the map. The firm was founded in the late 70s by John Kalimos Sr. He's still in the office,\ngreat guy, and you know, bounce ideas off of each other still, and he's, you know, he's running the firm\nstrong. We also have a great CEO and John Cadunis came on five, six years ago, and is really positioning\nthe firm for the future, I would say. We have private credit funds now, interval funds,\nworking on other ideas in that space, and then an ETF land, you know, really seeing the SEC,\nyou know, ETF rule come out, seeing the subsequent derivatives rule come out, and so Kalimos made\na strategic move to go into the active ETF space, which I think was, was the right call. Obviously,\nappreciative of the position here as well. I think there's massive amounts of assets that's going\nto move into active ETFs over, you know, the next decade or so. If you just track, you know,\nassets under management across passive and actively managed flows or say assets across mutual funds\nand across ETFs, they're pretty evenly split, about 13 trillion dollars is in passive products,\nand about 13 trillion dollars is in actively managed products. And on the passive side, that 13\ntrillion is split pretty evenly between mutual funds and ETFs. The trouble or the opportunity is\non the mutual fund side, that active bucket 13 trillion is almost exclusively in the mutual fund.\nAnd so we see a lot of that, you know, having opportunity to move over to the ETF side,\ngain that tax efficiency, the liquidity, and so that's a goal of Kalimos is to be a part of that\ngrowth over the next 10 years. Yeah, no, you guys got a lot going on and it's exciting place to be,\nbut again, we're here to talk about CPSM, which is the Kalimos S&P 500 structured\nall protection ETF. Again, it launched today. I don't know a ton about it. You gave us the high\nlevel of look, you're going to get right now, not at at cap, you're going to get about 9.8% of\nthe upside, 0% downside risk in that product. So, how is the fund structured from a holding\nperspective to accomplish this? Yes, so this is a package of three options positions. One way\nthat it, I find it's easier for people to follow along is if we just pretend like you had $100.\nSo, Brad, you have $100. One thing you could do with that $100 is go out and buy the S&P 500 ETF,\nand put your $100 in, you get shares of the ETF that would give you full upside exposure, full\ndownside exposure. Pretty simple. That's, you know, how any ETF works. When you construct a payoff\nor a defined protection or structured protection type product, what we're doing is we're buying\nan option package instead. So, we're taking your $100, and we're buying a zero strike call,\nor a deep in the money call, which is going to be near a zero strike. And so, that option\nleg is going to be pretty expensive. It's going to cost you around $98 of your $100. And so,\nnow we spent $98 and we've essentially replicated our full upside and downside exposure to the market\nwith a one-year expiration. So, that's option leg one. That's your exposure layer.\nThe second layer is your protection layer. So, we're going to buy and add the money put to give you\nfull downside protection. Let's just pretend that leg costs $5. So, now you've spent $103,\nbut you only had $100. So, you've busted your budget, you've overspent. And so, the way to bring\nyour $103 back to $100 is to sell and out of the money call. So, we're going to sell off\nsome of your upside exposure in order to collect or generate a $3 premium payment that will go\nback into your pocket to bring your $103 back to $100. So, we've bought a zero strike call for $98.\nWe've bought a put for $5 and now we're selling it out of the money call for $3. So, there's your\n$100 and the strike price of that out of the money call determines your upside cap. So, that price\nright now is 9.8% which means over the next 12 months. If you buy in today, you get upside of the S&P 500\nto 9.8% with your at the money put. So, with 100% downside protection and then any day after\nthat, anytime the market's open, you're going to know what your NAV price is, you're going to know\nwhat your ETF price is. And so, because you know that and you know where the S&P 500 is,\nyou'll always have an outcome that you'll be able to buy into. So, tomorrow, let's just\npretend like we're a month from now and the S&P 500 has run up, let's say, 5%. So, the S&P's up\n5% you're not going to be up exactly 5% because there's time value built into those options.\nYou might be up, you know, one or two percent, you still got 10 months to go. But if you bought in\nthat day, you would have instead of a 9.8% upside. If the market was up 5, let's say your ETF's up\n2%, so you would have a 7% cap because you've got a 7% left. And then you would have 2% of\ndownside risk left. Or, I said another way, you'd have 98% protection. It's still very strong\nprotection because the ETF price is up 2%. So, that might be difficult to follow just on audio,\nbut hopefully everybody's tracking there. Yeah, no, that's very helpful. And you answered my question.\nSo, the cap is really a moving target throughout the year. And the cap will likely,\nwell, let me ask the question a different way before I ask that. So, this product came out 5-1.\nSo, will reset again 5-1 with a new cap depending on the price of the options?\nYes, that's a great question. So, the ETF stays open and the options will conclude on April 30th\nof 2025. And then we'll enter into a new set of options positions where you'll get a fresh\n100% protection level, a new upside cap and a brand new out-comperiod. But your money will stay in\nthe fund. And that's important because when you think of that relative to our earlier conversation\nabout CDs or annuities or structure products, those all grow tax deferred, but then you pay ordinary\nincome rates on that money that you're forced to take. On the ETF, the money stays inside the fund.\nSo, it grows and compounds tax deferred. And then if you've held it for longer than a year\nwhen you go to sell, you're paying long-term capital gains rates. So, it's a huge tax alpha trade.\nSo, in what situation could you theoretically get more upset? Is there a way to get more\nupside than the cap? So, let's say if the market went down, 5% over the next month, right now,\nand 5-1 the cap said at 9.8. So, depending on the price, the option could your upside cap turn\ninto something like 11 or 12%. I think that's feasible. If you compare it to like the buffered space,\nyou know, those have partial principal protection. And so, you'd see the nav move further to the\ndownside. And so, anytime the NAV goes below, you're starting point. Your upside cap's going to increase\nbecause you just have further to appreciate till you get to your cap. The NAV won't depreciate that much\nin a structured protection or 100% protected product. What you might see is if the markets down\n5-10%, you might see that NAV go down one maybe 2%. And so, in that scenario, if the NAV's down\n1%, then your cap would go from 9.81 to 10.81. And you know that that minus 1 of your NAV is going to\nappreciate, at a minimum, appreciate back to 0. So, you're collecting almost a free 1% there\nand is how I think of it. Yeah, that makes a ton of sense. So, as far as like an investor expectation,\nif they own this product, getting back to the NAV, say the market runs up and you hit that cap.\nWell, the NAV just kind of stay stable with that cap and won't really fluctuate much.\nYeah, a couple of points there. As long as the market is well above the cap,\nyou'll start creeping up close to that cap. But you won't scrape the last penny of that cap\nuntil the last day of the out-comperiod car. So, there's, you know, 12 months of time value built into\nthese options. And so, like 2023 was a positive example for this type of strategy where the market,\nyou know, ran up pretty significantly. And so, the NAV just, you know, pretty steadily charged up\nfrom, you know, it's called $100 to about nine and a half percent would have been your cap over\n2023. And it's just a steady March forward and up toward that cap. But you wouldn't collect the\nfinal, you know, penny of that until the last day of the out-comperiod. But you get those.\nYeah, no, that makes a ton of sense. So, you've already explained to me how you could use this as a,\nyou know, a cash alternative. What are your thoughts on using it? Maybe in the fixed income space\nas well as an alternative? We saw what happened in 2022 where, you know, a 6040 investor in their\nquote-unquote safe bucket, you know, got hurt a lot. Could you see this also supplementing there as\nwell, or you feel more just kind of like a, I think so. Yeah, I think, but I think when there was,\nyeah, I make kick myself here, but I think when there was more risk called built into the\nfixed income markets than something like this made a lot of sense. Because we were at the\nforefront of that significant rate hike that ultimately, you know, occurred. So, if you think that\nrates are going to continue to go up, then I think something like this is a great idea because putting\nyour money and linking it to the equity market now with no greater downside risk or 100% protection\nhas a lot of implications, especially as it relates to what you might be trying to obtain from,\nfrom bonds, you know, now you can link that to the equity market growth. Now that rates are higher,\nI think we have opportunities to generate risk management and income from bonds again. And so,\nto the extent there's rate declines, I think that those bonds make perform well. So, we have some\nother ETFs that are focused on that type of approach as well. Can Q is one of those ETFs that we\nlaunched a couple months ago. One thing that we've seen advisors use these protection products for\nis just derisking equity exposure. So, one exercise we'll go through is, you know, Brad, how much equity\nyou know, market risk do you want to take off the table? You've run, run the equity markets up,\nwe're at, you know, near all-time highs. So, how much equity risk do you want to take off the table\ntoday? So, you can answer the question. Yeah. This is a visit of a question. So, just pick up first.\nLet's call it 10% of 10% of my overall, okay. So, if you take 10% of your equity exposure\nand move it into a protected product like this, then you've basically taken 10% of your risk off\nthe table, but that 0 to 9.8% upside doesn't get changed. Like, you still capture all of that.\nRight. So, you basically get, you know, you'll have 90% downside exposure in that instance.\nYou'll have all of the 0 to 9.8%. And then beyond that, you're not really kept out at the\nportfolio level. You're capturing 90% of that upside. And so, you know, or if you want to take\nhalf your risk off the table, now you can customize your exposure and create something that gives you,\nyou know, 50% downside risk. But then you're capturing 50% of the upside beyond that cap.\nAnd so, we've seen people use, use kind of those, if you view it as a payoff profile,\nuse those handles to kind of toggle your equity exposure. So, I think that's a very interesting\nway that people are starting to use these products. But then again, once you put, you know, 100%\nprotection on something, or even 98% protection, it really unlocks that cash bucket. And there's\nnine trillion dollars in CDs and money markets today. It's larger than the ETF space itself.\nIt's a massive, massive complex. And so, the giving somebody the liquid transparent ability and tax\nefficiency ability to link their cash to the equity markets in a single trade, I think it makes\na lot of sense. Yeah, no, I would agree. And I was going to ask where you thought this would go\nin an overall portfolio. I think we, we answered that. My question would be, and I haven't thought\nabout this deep enough. And you're, you have been in the space for a very long time. Do you see\na way to kind of combine this structured outcome, like 0% downside capture with buffers to maybe\ncreate really defined parameters of expectations for an investor, maybe building portfolios,\nencompassing both and really setting to find outcomes on both sides? Yeah, I think we're at the\nearly days of this space. If you look globally, a lot of families invest their money in a structured way.\nAnd they do it because a lot of them go through their banks in order to gain access to, you know,\nthese types of market exposures. And that makes sense because banks build structured products. There's\nyou're called 20 30,000 structured products around the world. In the U.S., it really wasn't that\nway. And I think it's because, you know, families use the financial advisor, the RAA, in order to\ninvest their money. And so, the buffer ETFs, the, there's income based, you know, outcome ETFs.\nAnd now there's capital protected based ETFs. And so, all of those are giving financial advisors\nin the RAAs, just really great new tools that allow them to deliver, you know, these types of\ncertainties to their clients. So, I think that we're at the beginning of this, you know, you view\nthat look at the target outcome kind of brand or structured ETF brand as an umbrella. And then\nunderneath, similar in the, you know, in the other structured note space underneath, you've got\ngrowth products, you've got income based products, you've got capital protection type products.\nAnd so, this capital protection category is the one that we have seen really not built yet.\nAnd it's something that we want to capture. So, I think there's a lot of ways to build portfolios\nusing these. Yeah. No, I would agree. You'd mention off the top, this is going to be one of 12.\nI don't know if you're able to talk about kind of the timeline or what's next, you know, or you\nable to kind of disclose the next lineup of products that are going to be hitting the market.\nYeah, happy to. So, we have the NASDAQ 100 coming in June. So, June 3rd is the first business\nday in June. S&P 500 version launched today. So, again, NASDAQ in June. And then we're on file\nfor Russell 2000 version in July. You know, from our analysis, we see that the\ncap actually stepping up a little bit for those two other two other reference assets. And so,\nthere we think there's going to be good opportunity in both of those. And for my perspective,\nit kind of changes your mindset when you have no downside risk. It's like, okay, if I'm,\nI normally would think of like my access points to NASDAQ or Russell, it's like, what kind of\nnumber is for war am I taking? But if there's truly no downside risk over a separate period,\nthen it changes your mindset a little bit. It's like, okay, well, what index do I actually want\nexposure to? And in that sense, like, which one do I think might grow well over the next 12 months?\nAnd so, I think one of the reasons that we were looking at Russell 2000 is I think that it's\nset up to do well over the next couple of years here. And so, those are the three\nreference assets we're bringing. And then we're going to repeat that cycle four times.\nSo, after the Russell plan to Russell and July, we'll go back to S&P in August and the NASDAQ.\nAnd until we have 12 of these in the market. And we didn't really want to, we didn't want to\nsaturate the market with 36 of these. I mean, they're very native. They're extremely popular,\nand advisors want them, then we'll bring them. But we just wanted to have one ETF available every\nmonth that people could get into and get, you know, 100% protection on.\nYeah, that makes it ton of sense. And I've looked at some of the other, like, buffered series where\nthey have ends up being like 300 products in the ETF lineup, because they're trying to\nraise every month of every difference. Yeah. And so, the more volatile the asset class out,\nI would assume the higher the cap. And I'm asking what is probably a silly question.\nBut do you ever foresee maybe doing this in the Bitcoin space?\nOh, that's a good question. I'd say there's a whole host of opportunities to put, you know,\ncapital protection on. So, we've explored a lot of different asset classes.\nYou know, there's some idiosyncrasies to doing that. There's some ETFs out there today,\nlike the futures based one. There's currently no options market on Bitcoin ETFs. And so,\nthat obviously there needs to be liquid options markets. So, yeah, it's all, those are all things\nthat we're exploring, but I wouldn't say for certain on any of that. Sure. No, I had to ask the\nquestion. But anyway, I know I get it. I get it. I really, you know, I really appreciate your time.\nBefore I let you go, where can people learn more about calomos and get information on CPSM?\nYou know, this, this issue that's out today as well as the rest of the ETFs are coming.\nYeah. So, you can go to our website, calomos.com. I go to our ETF tab and all the\ninformation is right there. The pricing tool is right there. You can, you know, buy in on day one,\nlike today. Sure, by the time this post will be past day one. And we'll be ready to, you know,\ngo with the June NASDAQ series on June 3rd. But the website's going to have all that information.\nAll right. Well, again, Matt. Thanks so much. This was really awesome. I appreciate you spending some time\nof it. Thanks, Brent.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}