{
  "id": "15045033",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for educational\nand entertainment purposes only.\nWelcome to Behind the Ticker.\nToday we have on Andrew Brear from DBI, and we are talking about their managed futures\nETF, DBMF, which seeps to replicate the managed futures hedge fund performance, wrapped\ninside of an ETF, and without the fees and the carry.\nWe talk about managed futures as a whole, how they could be viewed and should be used inside\nof a diversified model portfolio, and Andrew does a great job talking about investor and\nadvisor expectations for holding these types of funds.\nWithout further ado, please welcome Mr. Andrew Bear.\nAndrew, welcome to the show.\nThank you so much.\nGreat to be here.\nYes, so before we get started, I always like to ask if you can give everybody a little\nbit about your background and the position you are in today.\nSure, so I went to business school.\nWhen after I was, as I was getting ready to look for jobs at business school, I got\ntapped to go talk to the very very well known hedge fund manager, and I sort of went into\nthe hedge fund industry by accident, so about 30 years ago, believe it or not, and as I\nhad been working for this guy, and then kind of going off and doing things in my own,\nI started a couple of different hedge funds, but really what my partner and I spent the\npast 15 years doing is some of the stuff that hedge funds do is great, but it's inaccessible.\nIt's expensive, sometimes you think you found the star player who ends up blowing up\non you, so could we find ways to make investing, getting the benefits of hedge funds without\na lot of the headaches, could we do that in a comprehensive way?\nSo today we managed about two and a half billion dollars, which is entirely in ETFs and mutual\nfunds in the U.S., as well as their equivalents in Europe, and we're really focused on\nmost of the people that we talked to are wealth managers and people who build model portfolios\nwho are trying to figure out, we're going from 60, 40 to 50, 30, 20, or something like that,\nwhat do we do, what are the tools that we can do to help manage that transition?\nAnd so that's what I spend my waking hours doing.\nThat's great, and I want to talk about that kind of new model from 60, 40 here in a bit,\nbut before we kind of get into all that, I also like to ask any hobbies outside\nof when you're not kind of behind the screens, or if you were just talking, traveling around\nand seeing clients.\nSo I have one all-consuming hobby today who happens to be two and a half years old.\nSo I was married for a long time.\nI have two daughters and they're vitally 20s, and now to everyone's shock, I also have a two-and-a-half\nyear old boy.\nSo my days, I used to have hobbies, now I'm in a horse race with him to see who can learn\nfarm animals in Russian faster, and his mother's first language is Russian.\nSo my days are working 12 hours doing things like this, and then playing with cars.\nWell, you and I are in the same boat, I have a two-and-a-half year old as well, and it is like,\nit's like trying to stop water coming out of a fire hose, it seems at some point.\nThey're wild.\nThey're wild, and I absolutely adore raising my first daughters when they were young,\nand I've been very lucky.\nMy work schedule has always been very flexible in terms of time, but it's interesting\nhaving a son and being older.\nIt's sort of an everyday reminder of more seasoned and mature things that would have freaked\nme out many years ago, don't freak me out as much on the other hand, boy, it's tiring.\nWell, I think you, I think you slightly touched on this in your intro, but can you just\nkind of provide a high level of the firm itself?\nLike, what all you guys do?\nSure.\nI know you have a handful of products, and you do a many different things, so it'd be helpful\nto kind of just get an overview on the firm as a whole before we jump in at DVMF.\nYeah, so what we do is really simple at its core, which is we kind of look across the hedge fund\nworld and say, hey, what do hedge funds do that we like, and be can we copy a cheaply?\nThere are a lot of things that hedge funds do that we like, we cannot copy cheaply.\nAnd so, if you like that as well, then you have to go invest in real hedge funds,\nand you have to have a lot of money and do all sorts of other things.\nSo what we do is it's technically called a hedge fund replication, and it's one of these\ndisruptive ideas, because a lot of the people who were there during the growth of the hedge\nfund industry, probably get it all these myths about hedge funds, you know, like, oh my god,\nthis guy's the best, he's the next Warren Buffett.\nWell, there are a lot of guys who look like Warren Buffett 10 years ago who you don't even know about today.\nAnd so, you know, what we do only works in a few limited circumstances.\nAnd so we're very, very unusual in, and by the way, what we do the way we do is it's quantitative,\nright? So we use these risk models to take these complicated portfolios and basically\ndistill them down to something that's very simple and easy, investable. And if we can do that,\nthen we can deliver to you in a low cost ETF for mutual fund, et cetera.\nSo the way that we're set up in general is we like managing portfolios, we like doing research,\nI like doing stuff like this, and then in all of the products that we manage, we're managing\nit for another firm who's, you know, who's in the business of building these products, and\nand running distribution teams, et cetera. Yeah, that seems to be the hardest part about this\nis the distribution teams, but speaking about research, I read a really compelling piece on your\nwebsite about 60, 40 portfolios. I know we want to touch on this. I think advisors who listen to\nthis show would appreciate kind of learning about how that 60, 40 portfolio kind of coming out of\nthe great financial crisis with interest rates, it lows, and all time lows, how that was,\nand also volatility being lower, how that was kind of an abnormality for really good performance\nin 60, 40. And I kind of wanted to pick your brain about what you think, you know,\nasset allocation is going to look like now in an environment with rates being a little bit higher,\nif you've volatility being a little higher, bonds doing what they did in 2022. So\nyou kind of hinted at it, but what do you think asset allocation should look like kind of going forward?\nSure, well, so in very simplistic terms, I've thought of the U.S. wealth management industry\nhas been divided into two camps. One camp is the Vanguard Robo Advisor academics who look at it\nand basically say, do the simplest cheapest thing that you can, don't touch it, don't look at it,\nand go away. And then there's everybody else who says, you know, we think we could do better,\nyou know, we can bring, because, and again, going back to the core principles,\nevery asset manager has the same goal, every wealth manager has the same goal,\nwhich is you want your clients to be happy. Now, you know, and clients can look at us,\nand the funds collector can say, oh, we're happy, because you guys have done better than this\nor the other things, but I think when you're talking about the wealth management space,\nclients are happy when they feel like their money is going to grow, it's safe, they can sleep at night,\nyou know, the decisions, this impacts their lives. This isn't, you know, the spare billion on\nElon Musk's portfolio, that if things go down 20%, it has real world consequences for that.\nAnd so, so, you know, the irony was a lot of the most sophisticated guys in the space were\nout there building these more complicated portfolios for a long time. And the simple stuff was just\nbeating the pants off people for a long time. And, but that was unusual, because when you take a\nstep back, Warren Buffett has a great expression where they say, if you know, if you didn't\npurchase your pathway, what would you do with your money? And he said, well, but 95% into the\nS&P 500, I'm not going to try to imitate his voice, although I'm really tempted to, you know,\nbut 95% into the S&P 500, but 5% in cash, and basically then implicitly don't look at it,\nright? And, and, but when money matters to you in your lifestyle, having a 40 or 50% drawdown,\nyou know, is not something you don't aren't going to look at. So, you know, so all\nasset allocation is really designed around how do we bring down the risk without bring down\na returns as much? And that's where you get into verification. Now, on our website, to be what's\nfascinating is you can do, you can have a dividing line between 2000 through 2020,\nwhich is where most people in the wealth management business grew up. You know, this is where\nthis is the data that we look at, you know, post this is when data starts to get good and you\nbloom or get other things and you can access all sorts of different kinds of data. And, and during\nthat period of time, starting with stocks, as a diversify, starting with stocks and saying,\nwhat do I want to add next to stocks? Bonds were the superman of diversifiers. They, you know,\nthey, they, when stocks went up, you know, they might, they, which kind of beating, so they were\nnot correlated to stocks. They, they never really went down. The maximum drawdown, you know, during\na period where the S&P 500 dropped 50 percent, then 50 percent, then 20 percent, then 25 percent,\nthey never went down more than 4 percent. They were returning much better than cash, right,\nbecause if you just say, I'm taking money out of stocks and putting it to cash after inflation,\nthat's a really bad plan, under most circumstances. So, they were unbeatable for about 20 years.\nAnd what happens is, as this goes on and on, it reinforces the idea that, hey, we were right,\nright, we didn't add these other things to our portfolios and look, you know, 2018 goes by\nand we're better off for 2019, 2020, and then the world changed. And once inflation started to come back,\nit was like, it's like this earthquake across the, the wealth management space, because your,\nyou know, Superman has been basically buried in the pile of kryptonite. And, you know,\nnow you're, your max drawdown is no longer 3.8 percent, it's 17 percent plus. So, it's not safe anymore.\nYou know, they use these things used to never move, right, they have like a,\nsuch as fiscal terms, they have like a 4 percent volatility. And, and all of the sudden,\nthe volatility is doubled from there. The, and the returns have gone down, right, you've had almost\na decade of loss returns in the space. So, you know, so we say it's like these bubbles do make\npeople look like geniuses, but then when the bubble ends, which clearly has been the case in the\n2020s, you need a different set of different toolkit. So, so the, the presentation, it's on our website,\nwhich is dbi.co, which we don't have an M there, because if you go to dbi.com, then you end up with\nDavid Stridele, and you can go wedding to a shopping. And even though they've gone bankrupt a couple of\ntimes, they were the, what they wanted for dbi.com was out of our price point. But, but dbi.co,\nwhat it's called, the great 60 40 head fake. And it just kind of shows you how, how, you know,\nthis combination of 60 40 worked work perfectly. And dbi published it maybe a little less in a year ago.\nAnd now, again, you're seeing kind of the same thing happening. You know, last month, stocks and bonds,\nboth go down at the same time. So, so the evolution is that people now need to look for\ndifferent things. There's pressure on people to find things. The simplest portfolios aren't working\nwell anymore. And like, I did do the research myself, but you can go to great firms like AQR.\nThere's a guy named Dan Rasmussen, that a firm called Vardad, who, like me, is penalized by\nbeing a Harvard grad. But he has done some great research on, you know, what happens when inflation\nremains higher. And one of the conclusions is if inflation is above two and a half percent, stocks and\nbonds are moving together. So, you know, so your core diversifier is not going away. It's just,\nit's just not your perfect solution anymore. And so that's, so it's, you know, that's on the,\non the, you know, sort of the demand side, as people are saying, I need something else,\nwhat can I get? On the supply side, particularly if you're an ETF investor, it's been a\nveritable wasteland of good products outside of, you know, that bring kind of hedge fund kind of,\nhedge fund strategies. So, you know, our very self-interested commercial view of the world\nis that 60, 40 moves to 50, 30, 20. And within that 20, people are going to be looking for\nstraightforward ways of getting exposure to different asset classes. They can put in their models\nand, and, and hold for, you know, not two years, but a decade or two decades as part of their\nstrategic asset allocation. And, and, and we think it's, you know, sort of a green field opportunity.\nYeah, no, I would agree. And I actually will walk into DBMF right now, which is your managed\nfuture strategy. I've used, I use it in our model portfolios. And it is a great diversifier.\nAnd so, can you really explain at a high level, you know, what the fund itself is trying to accomplish,\nand then we'll kind of go into the impact that, you know, truly well-run managed future strategy\ncan have on overall volatility in return. Sure. So, let's start with what managed futures as a space\nis. And, and managed futures in a sense is interesting. It's a strategy that's been around 50\nfor 50 years with a marketing pitch that's 30 years old. Because, like, you know, back in my day,\nright, at, at business school, I almost wanted the private equity industry. These were, you know,\nleverage by-outs, barbarians at the gate. You know, that is not becoming an institutional asset\nclass. Now, there are captains of industry running private equity firms. Right? That's,\nthat feels better for a mentioned plan. You know, you know, asset-based lending was like this\nknuckle dragging, like, you know, brass knuckle business of, you know, kind of beating up people\nand taking their assets and stuff. Now, it's called private credit. And, and so,\nmany futures is peculiar, and that is all described, and it has these incredible diversification\nbenefits. But, but people are still talking like they're talking in, you know, in the engine room,\nto somebody else who's at that level of detail. And I think that, I think when you get into the\nbroader RA world, that doesn't make people feel like they're going to sleep better at night,\nwhen you talk by the way. So, but, but what is it that they do? So, it's a hedge fund category\nthat's been around for 20, I'm sorry, 50 years, basically. And in its infancy,\nthere were guys who would build these computer models back when, you know, not everybody had\ncomputers and, and certainly you couldn't find price data on something like crude oil or gold.\nAnd, and they would analyze this drugled data and say, do we think gold is going to keep going\nup or down, based upon that? And so, this, one of the people people talk about is trend following.\nNow, it's, it's proven to be a great diversify over time because it marches to the beat of its own\ndrum etc. And there are lots of, there's $300 billion of guys who run hedge funds who do this.\nAnd they charge hedge fund fees. It's, you know, one in 20, sometimes a little bit more than that.\nSo, you're like 2022, you know, you add up all those fees as you guys are making five or 600\nbasis points. And everyone's thrilled because they're still up 20 percent, but it's a lot of money.\nAnd they're hard to get into. So, um, so, but when you take a step back and say, how do I\ndescribe this to my sister? My sister is always the, the prototype because I was 25 minutes into\ndescribing what we do. And she she paused me and she said, what's an ETF and I was like, oh,\nwhat's, sorry. So, you know, it's, it's basically like we all read the paper. We see what's going on.\nAnd we hear about something like, you know, more in the Middle East can drive a crude oil prices.\nAnd that's going to affect people's driving in, in, over more everyday. Well, people are just\nlike, old macro trading. Those are opportunities for them. You know, if inflation is going to go\noff from here, or if the Fed's not going to cut rates, if, you know, if the dollar is going to be\nstrong, it's not about whether it's cheaper, better to go on a vacation in Europe or, or, or Japan,\nit's about, you know, can we make money for clients in that? So, that's what these guys do.\nAnd they just do it with computer models. And so, um, so what we really, we got into the space.\nWe were not managed futures guys. We were not insiders on the space, but we looked at it sitting\nfrom your side of the table and said, what do we really want? And what we really wanted was the\nreturns of the overall space, but without a lot of the issues associated with it. So what are the\nissues? High fees, right? Well, if we can copy what they do and not charge a lot, it's like going\nfrom an Asia class to an Asia class. You're just going to do better overtime. Now, it's not as\nstraightforward as that, but, um, you know, can we package it in the vehicle like an ETF? That means that,\nyou know, somebody can buy $25 with it or they can buy $100. And so, you know, our research\nbasically showed that actually this is one of those strategies. We're using these sophisticated\nrisk models. We can boil down what these very, very complicated portfolios are down to a handful of,\nyou know, we sort of call big trades or big opportunities. Um, and, and it's, it's, you know,\nit's not perfect. What we do is just the best way that we found of getting broad-based exposure\nto the space. So, can you talk about overall, um, the benefits of adding a managed future strategy\nto an allocation? We talked about the 50, 30, 20 model instead of 60, 40, but really, if you're an\ninvestment advisor putting this in a model inside their model portfolio or you're like, what is,\nwhat is the reasoning for that? What is it accomplishing for the overall risk and return\nmatrix of a portfolio? Sure. There's the, there's the statistical math side of it, right,\nwhich is, uh, Nobel laureate Paul Samuelson, great economist, said,\ndiversification is the one true free launch in finance, uh, which basically means that,\nif you can find things that do not look like stocks and bonds and other things over time and you\nadd it to your portfolio, in general, if you're looking at the next 20 years, your clients will\nhave a smoother ride. And if you pick a decent asset that does that, they should make as much\nor more money over time. So, in statistical jargon, you would say it will raise the sharp ratio\nof a portfolio. Now, the, when you look at, so for instance, if you look at since 2000, and you\nsaid, what I rather have had a 40% allocation to bonds or managed futures, the kind of stunning\nconclusions you'd rather have an allocation of managed futures over that period of time, you would have\nbeen unhappy with it for 20 years and do literally happy with it for 40 years. So, I'm a little bit\nof a rogue in this space, in that I think the appropriate allocation for people is much lower than\nthat, because I think people are dealing with the very human considerations of talking to clients\nin most circumstances. I mean, if you have a model portfolio and clients never look at the\nlight items, then you're very lucky. But for clients who have, for advisors of clients who\nstare at light items, I think the value of managed futures is like any diversifying asset class,\nis that there are times when it's going to do really disproportionately well. And it's just kind of\nevidence that you're doing something that's more sophisticated, that is more flexible, more nimble,\nthan the robo advisor down the street who's telling you everything should be for free, basically.\nAnd so, you know, when I talked to people about including this in their portfolios, part of it\nis about, yes, you can make a pitch. So, if you had an allocation to this in 2022, the overall\nspace is up 20, I don't think I'm allowed to talk about the performance of the ETF, but\nobviously we didn't have a bad 2220 or wouldn't be having this conversation. The, you know, part of\nit is basically, I think a lot of people from the statistical side will say, look, you know,\nin, you know, instead of having, if you had an 10% allocation to it, you would have done, you know,\ninstead of going that 18% you were down 16%. I don't think that's a warm and fuzzy client\nconversation with clients that you're down 200 basis points less than everything else. I think\npeople are panicked about everything in the news at that point is we're going to have gas rationing\nand Germany, you know, the lines are falling in Ukraine. You know, I mean, I mean, we thought\nthe world is going to explode basically. And so, but what it does do is it shows that this was\nat one of those periods of time where everything's going down at the same time and you have\nsomething that's different. And so, there will be periods of time when these assets are your\nfavorite investment, the thing that you want to point to. And there are also times when it's not\ngoing to be, right? If the SNP goes up like it does last year and manufacturers as a whole went down,\nthen, you know, then clients don't have to be fair. It's their money, they don't have to say,\nwell, thank you, you know, you did well and they can sit and say, well, great, I love donating\nin 22, what induced switch into the SNP last year when the SNP went up and so, so I thought,\nlike, I think, I think for any allocators looking at the space, there are two parts of this. One is\nit's, you know, from a statistical perspective, I think it's a no-brainer to have this in your\nportfolio, but as they say in the family office world, you know, you don't need sharper issues. So,\nyou've got to have a strategy for how you talk about this with clients in a way that fits into\nyour ethos of asset allocation, what you're trying to help them to achieve. You know, why, you know,\nin a year, when it underperforms, why they should still be okay with that and that usually is a sizing issue,\nyou know. Yeah, I mean, I'm sure you run into this question. Oh, yeah, no, I totally agree.\nI mean, it's, it's also bringing down variability of return and a lot of those different things,\nbut, you know, it's funny people tend to flood to manage futures after the fact and then get\ndisappointed in the return because when they should be buying it and adding to it is when things\nare really good because the likelihood of the managed futures outperforming during periods of,\nyou know, volatility and bad markets is there and then the event happens, managed futures has\ntheir year and then everybody floods in that just seems to be what I see is like investment\nadvisor strategy switching and, you know, and then it's a bit case to be really good.\nOh, no, I see, I don't see that really within our clients, right? Because I'm very, I'm very careful\non on how I talk about this. One is, and I will tell people, if you, if you think you can\ntime this, right, there are million better ways to time, if you think that you're basically saying,\nI think I can time when the S&P is going to go up or down, then for God's sake, just do that,\nright? Right. You know, like, I mean, it's, I mean, like, just do the S&P. You don't have to go\nin and out of managed futures if you can, if you can predict the future. I think, I think what's\ngoing to happen with this is a strategy. I think, and I think that was a mismarketing issue.\nYou know, even there was an expression people use about, you know, it delivers crisis alpha,\nright? But that implies that you want to, oh, there's a crisis around the corner and now I want\nto own it for today, right? This is not, like, this is, there's no crisis this year and it's\nthe strategy overall, it's having a staggeringly good year. It's, it's, it's, it's the ethos and the\ndescription of it. It has to be a strategic allocation because you can't get the timing right. Now,\nyou can do rebalancing like at the end of 2022 when this is gone up a lot and everything else is gone\ndown. Of course, you can rebalm sit back to some sort of a level. It's as people do with\ntheir portfolios with every asset class. But, um, but I think, I think, you know, if you tell\nyour clients, this is a short-term play on some expected move in the markets, they're going to be\nimpatient. Right. And so I think, I think it's, look, remember when we added REITs, you still have\nthem, right? They go through good and bad periods, you know, we added, remember, junk bonds were\ncalled high yield. We added those as well, you know, we've got, you know, many money markets,\nwhatever it is, these big decisions that go into adding different, putting different eros in,\nin the portfolio, quiver over time are, by definition, they're, they're, they're long-term in\nnature. And so what's interesting for us is, actually, we haven't had, we've had relatively flu,\nyeah, and we obviously had punctuated periods of a very good and bad performance. Most of our\nallocators are, are, are, are R, A's who have this mentality. And that's why, that's why most of\nmy conversations are with people, where I like the conversations like to have with people who build\nmodel portfolios, you know, because because I want to be people's allocation today, but in 10 years.\nRight. Yeah. I agree with, with everything you, you just said there, and I think it's, I guess\nthe, what I, the point I was trying to make is that the, the RIA needs to be having the front-end\nconversation with the client about the expectation of the managed futures holding, right?\nMeaning it's, it, it could, it could underperform during good periods. It could. Right.\nAnd then they want to unload it and, and strategy chase something that might be tilted more\ntowards just growth, you know, like we've saw over the last two years. And then they limit their\nmanaged futures allocation when they might need it the most. You talked about kind of,\ngood, good, good, good, good, good, good, good. Every, every other asset class, right, has a narrative\nfor why you should hold it long term. Right. And, and it's, it's usually tied to some fundamental\nmetric. Don't get out of equities at the bottom. Stocks for the long run, you know, like it's,\nyou know, I'm going to get my money back at par, as long as I hold it, I don't. So every other\nasset class has its narrative around it. Manufacturers doesn't fit that model well, because when\nthese guys lose money, they'll get out of the positions. They don't hold on, they're not\nKathy Wood holding on with a white knuckle grip, you know, hoping it comes back. They are,\nthey're, they're, you know, they're out, right. And so, and they're looking for the new\nopportunities. Think about this year, the performance this year, the very good performance of\nthis space this year was new opportunities that they weren't invested in four, five months ago.\nAnd as the markets got rocky in April, they're actually taking profits on some of those positions\nalready. And so, so the underlying dynamism with the strategy, the problem is, though, that that\nadvisors often want a simple story, like, you know, the average P is never been lower for this\nportfolio. We don't want to be the guys who get out of the bottom. And that's why I think the,\nthe messaging, as you say on the front end, is literally just has to be explicit. Like,\nthis is going to be a dynamic portfolio. We think it's going to be additive to your portfolio\ntoday, 10 years and in 20 years. And so, you should expect to see this every quarter that goes by.\nWe may not have it in exactly the same allocation, exactly the same size, your needs are going to\nchange, et cetera. But it's just, it's just one more leg of the asset allocation stool. And that's\nwhere I think they'll also sizing of the strategy ends up being important because you're going to have,\nyou know, I mean, as the world evolves, maybe you'll have some Bitcoin exposure. You'll have some\ndirect gold exposure, direct commodity exposure. You may have all these different different things that\nyou can add into that portfolio. And this should just be one of, one of those, one element with that.\nYeah. So let's, let's talk about the strategy as a whole. Can you talk about, you touch on\nit briefly, you're kind of using quantitative risk models, but can you talk about the drivers\nof how you're kind of making investment decisions and is that driver kind of fully systematic\nin nature? Yeah. So it is, it's 100% systematic. And, and what we do when we talk about the\ndiversification benefits of the space, it's, it's a little bit like saying, like, if you say the\nS&P 500, right, a consists of 500 stocks, you can look at each of the 500 stocks. But you're\nalways looking at the category. The category here is an index called the Soxgen CTA Hedge Fund index.\nAnd, and that goes back to 2000 with good data. And it's basically the average returns after\nall fees and expenses of the 20 largest guys each year. And so that's kind of the best way\nyou can say is a representation of it. It's not the magnificent seven. It's the magnificent\n20 in the space. And the, and so what we do is we basically take recent data, but I mean the\npast three or four weeks of data on that, on that index, just the reported returns. Because if this\nindex happens to be reported every day. And the first thing we do is we bump up the returns for\nwhat we estimate are the fees and expenses. You know, so through January, sorry, through March,\nI think the, the index was up between 9 and 10%. But it was really up 13 or 12 or 13 before\nthose fees and expenses. So, so anyway, we're aiming for the 12 or 13, not 10. And then what we do\nis we have risk models. And our risk models don't try to copy what these to I still say, like,\nyou know, do we think these guys are going to be owning more or less gold today than they were\na week ago, rather we, what the risk model does is says, okay, these guys have lots and lots of\ndifferent, you know, 20 different funds, each of which has lots and lots of different positions.\nOne of the really big drivers of performance. And, and the reason, and so what the model does is\nbasically, we have 10 big liquid instruments that we use. So gold, oil, dollar euro, dollar yen,\nwhich has been in the news a lot recently. Two year, 10 year, 30 year treasuries, three equity markets.\nAnd again, like them, it's all in future's contracts. But basically, but basically, what the\nmodel does is say, what, what portfolio of these is is, is our best approximation of how those\nguys are positioned on Monday afternoon. And, and we see changes. So, you know, if they've been\ndialing back their gold position, we'll usually see a dialing or, you know, dialing back their\nmetals or whatever positions. We'll see a dial back in our position. We'll rebalance the quarterly.\nSo, all we do is once a month, we look at this index data. We try to use a model totally\nsystematic to figure out the most accurate portfolio, invest in it, where do we can do it again?\nAnd, and the reason, um, and what we end up with is around 90 percent correlation to it. So,\nit's not perfect. Uh, we do go through, you know, periods of outperformance and underperformance.\nWe don't, we don't usually stray that far from it. And, um, and again, because we're aiming for\ntheir preview returns, we're doing more efficiently. We historically, you know, would expect it\nor have outperformed by 200, you know, 250 basis points over time. And, but it's a simple portfolio,\nand we can put it into an ETF. So, with, with daily position level transparency and, and attractive\nfees. Yeah, and, and liquidity. And so, you kind of touched on my next few questions, but what is,\nis there kind of, is there guardrails or, I'm sure there's guardrails on kind of max long and short\nposition and position sizes, um, you know, I kind of briefly looked at the holdings,\nyour, your long, some stuff, your short, some stuff, right? So, yeah, are there guardrails on that,\nor can you kind of go wherever the index is telling you to go? Or, um, mostly, we put in two,\nI don't want to say semi arbitrary guardrails at the beginning. So, anyway, what's unusual, we started\ndoing this strategy. ETF has been around since, May 2019. So, May 9th. So, if this comes out\nafter May 9th, you'll probably be sick of me already, talking about it. But, um, but we started\nthe strategy in mid 2016. We haven't changed the thing since we started, right? It's, it's the same\n10 instruments, it's the same, which is very unusual in Quantland. But, again, our view is,\nif you come up with a model that's working and continues work, um, don't change it. You're,\nyou kind of risk screwing up. Usually, when people are like, you know, oh, I mean, all these\ngreat changes to my models because something went wrong. Um, so, um, so, most of the things that you\nwould worry about, like, you know, are we too concentrated in this asset class versus that asset class,\net cetera? Um, it's kind of taken care of by the fact that you're looking at the average returns\nof these 20 guys, because each one of them has a million different guardrails in it. So, the\ntwo relatively, I don't say, arbitrary, but, but, but guardrails we put in, we didn't want to go\nmore than 20% longer short, either crude oil or gold. Um, and so those are just, you know, written\nin stone. And the other, the other positions, we have, we have caps on them, but they're not something\nthat we, we end up hitting. Um, and so, the, um, so basically, one of the things that was important\nto us when we were doing it is often when you're taking a hedge fund strategy, which has a\nresilient different bells and whistles and lots of complicated instruments, you know, and I\nmean to imagine in a normal hedge fund strategy if you have swaps and options and he'll liquid\nassets and other things. You try to do that in an ETF, forget about it. Yeah. Right. So, so there's\na, so part of our, our, our, our ethos of keeping it as simple and straightforward is also geared\naround the fact that we want to be able to offer this in an ETF. Now what it means is when you look\nat our holdings and you can see our holdings every day on the website, um, you're looking at\n10 futures contracts. And so you want to know how much, you know, we're a long, non-US, it develops\nstocks through an EFA futures contract. It's there. You can look at it in the morning. What you're\ngoing to do with that information, I'm not entirely sure, but, but you, you can certainly stare at it.\nYou know, our competitors who run matter, teachers, mutual funds, and you, for like, you can't\nsee what they're invested in every day. And then you look at their holdings and the end of the quarter,\nit's like a 1,200 positions. Right. It's 4,000 positions, 6,000 positions. I mean, this is a business\nthat just goes insane over complexity. And part of it is that, you know, there's a, there is a\nbuyer base for complexity. You know, a lot of it sounds really, really cool when you hear about it.\nI, you know, for me, having been in the head for an industry for a long time, like, the best\ntrades are not, it's like what Charlie Munger used to say. Like, you know, if you have to do a\ntwo-dustful places, don't do it. Right. It should be, the best stock should be obvious. Right.\nI think, I think Buffett said the same thing, but usually Munger says it first, and then, and then,\nBuffett said it more, more eloquently. But the, but so, you know, so for us, it was, it was,\nwe really, we can get to the right answer in a simplest and most straightforward way. That's what\nwe're going to do because if we want this to become a mainstream asset class, people have to be\ncomfortable with it. If you can't, you can't be selling them black boxes and trying to impress\nthem with, you know, how smart you are on all the complex things. It's got to be something that they\nfeel is, is, is, is more understandable, and therefore will infer that it's more, at least,\npredictable in terms of the outcome of trying to do what it's supposed to do, which is give you\nexposure to this, the strategy or asset class in an efficient way. Yeah. And I also saw on your, on your\nwebsite as well, the, you kind of do do this presentation where you show kind of how you can get\nthe exposure of the 200 or 300 different futures by just owning a handful. And that how they're all\nfairly correlated when certain, when certain instances happen, you know, a handful of different things\nare going to move in a certain direction. So you don't need all of them, you just kind of need one.\nAnd a lot of, I mean, a lot of instruments are also, you know, combinations of other instruments.\nAnd, and so yeah, it's a, it's a cool charm. I partored it. I had this, I was trying to\nhope the metaphors of this, and I came up with planets and, and, and moons and stuff like that,\nand he's like, no, no, no, that, sit down, son. Let me take care of this. And again, he did,\nhe's this great like correlation matrix. And what I chose, he was, you know, a lot of the things\nthat we think of as, I, the way that I simply thought about it is that when you know, when\nwe're looking at the recent history of these hundred instruments, there are the going up\ndown or, or flat, right? They're not going in a hundred different, if, in a hundred different\ndirections. But if you want to do it in a little bit more statistically subtle way, which is what\nhe did, is you can look at each of those hundred instruments and say, are they combinations\nof the ten big things that we trade? And when you look at it, it's about 90% over time. Right?\nUm, and so it was just, it was really designed to kind of break this, this argument that complexity\nis necessarily good, necessarily results in better returns, necessarily gives you different sources\nof returns. A lot of that is just, it just, you know, marketing nonsense.\nWell, Andrew, I really appreciate your time today. This was very insightful. Like I said, I use\nmanaged futures, and particularly your fund in a lot of our model portfolios. And this was very\ninsightful, and I appreciate your time. But before I let you go, can you please let everybody know\nwhere they can find some more information about your firm and also get information on the ETFs\nthemselves? Sure. Well, so by the way, I think just before I say that, I think you are at the Vanguard,\nbecause I think I think, you know, more and more people are just going to be looking at\nmanaged futures. It's not a, I guess it's expressions. Like it's, it's, it's,\nmanaged futures was, was, was optional for many, many years. Um, as the world changes, you know,\nhit, gave you, we're going to have this expression that when, you know, sometimes an asset class\ngoes from optional to essential. I think people, I think it'll just be essential. So I think,\nI think, I think, obviously, I agree without you saying I'm selfish to say that. Um, yeah, so we have\nwe have a website, which is dbi.co, as I mentioned, um, I am very available and accessible on LinkedIn.\nSo you can track me down, uh, on LinkedIn, uh, connect with me there, and you'll see this. I put\nout this stuff very out of this when we do new research. You'll see it there. I'm less active on Twitter.\nUm, I actually don't think I know my Twitter handle off of hand, but if you hang around the people\nwho are more popular, like the Cory Hofstein's and the Bob Bailey, it's you'll see me pop up occasionally.\nI think I've a picture of me in my dog on stage someplace. Um, you know, on the ETF side, uh,\nour partners, strategic partners launched dbmf. It's on their website. The easiest way to get to is is dbmf.com.\nWe'll direct you to it. And, you know, I think one of the things to get a feel for what we do is\nevery month, we put out these short, not just a series of slides on performance, but also\nI do voice overs of it. And, and the idea is really, you know, this is a, it's a, it's a quantitative\nstrategy. And if I send you a long description of whatever you position is doing, which says, it doesn't,\nit doesn't, it doesn't give you a feel of what it's like to own it and, and how to talk about it.\nAnd so, I've been doing now for over a year and I very surprisingly high percentage of our clients\nlisten to them every month, because it's really designed to be your coach for the next 10 years as to\nyou get on the phone with a client on a Friday afternoon or you're, you know, about to, about\njust when you golf club and he says, hey, what happened to that fund over there? You've got to be equipped\nand all those questions. And so, if I, I'd rather you get that information to you in the first\nweek of the month and talking through it so you can listen to it in the car or on, on the exercise\nbike, then have it show up in a PDF two weeks too late. So, all right. Well, again, Andrew, thank you\nso much. Congratulations on all the success. And I hope to, you know, have the opportunity to run\nIndia in the future. I'm sure you're doing the conferences and running around at certain events. So,\nmaybe I'll have the opportunity to meet in person in between playing with cars. So, thank you so much.\nIt was wonderful to be here and again very much appreciate. All right. Thanks, Andrew.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}