{
  "id": "15087917",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nToday we have on Bob Elliott from Unlimited, and we are talking about their multi-strategy\nreturn tracker ETF, Ticker HFND.\nIt takes all the different facets of hedge funds and combines them into a single index,\nand looks to track their return profiles, the use machine learning in order to build a\nprobabilistic asset allocation that will mirror multi-strategy hedge fund performance,\nand they package it all up in a nice cost-efficient way.\nSo I think you will find this conversation extremely interesting with Mr. Bob Elliott.\nHey Bob, welcome to the show.\nHey, thanks so much for having me.\nSo before we get started, can you tell everybody a little bit about your background,\nand then what eventually led you to start unlimited?\nYeah, for sure. I've been a systematic investor for about 20 years now.\nI started my career at Bridgewater Associates, which at the time that I left was the world's largest\nhedge fund, where I was developing systematic proprietary systematic investment strategies across\nall the major asset classes, and after I left, I also spent some time running $125 million\nventure fund that used big data to identify high potential early stage consumer opportunities.\nSo you can think about it like systematic investing, but the private side of 2020.\nAnd increasingly, my later years of Bridgewater, my time in the private side of the world of 2020,\nincreasingly realized that, you know, 2020 businesses are really good for the managers,\nand they're not that great for the investors, and that's because managers generate great returns,\nand they also charge high fees, which means that investors are not that much better off,\nthan they would be otherwise, particularly if they're taxable investors in the US.\nAnd so that got me to thinking about whether there was a way to bring the concepts of diversified\nlow cost indexing, which is obviously totally changed stock of bond investing for the better,\nand bringing to the world a two and twenty. Now, I think there's a lot of people who are trying\nto do access to alternatives. And the challenge with most of those approaches is that they're\noften adding to the fee problem, rather than increasing access and reducing the fee problem.\nAnd so our idea was instead of sort of creating even more niche to spoke products,\nuse our experience with modern machine learning technology to replicate how those managers\nare operating and investing and take that understanding and package it into products that are\navailable to wide variety of investors and that are structured in a way that they're more tax\nefficient, more liquid, more transparent than typical LP positions. So that's really the core\nconcept behind unlimited is that idea of low cost, diversified, 220 strategies for every investor.\nWell, before we geek out on machine learning and hedge fund replication strategies,\nI always like to ask, what do you like to do outside the office? Any hobbies, things you like to\nget into when you're not working? Well, one of the funny things about my background is actually\nI'm a trained botanist by academic training. And so, well, it's not my day-to-day job.\nI still keep at it in the garden where I find principles of diversification to be as applicable\nin the investment management space as they are in the world of gardening. So,\nyesterday was the frost free date here where I live, which means I get to put plants in the ground,\nwhich is pretty exciting over the next couple of weeks. Yeah, I just started our garden\nlast week. So, I'm hit or miss. You know, I'm an amateur. You could probably help me and provide some advice there.\nEveryone is hit or miss when it comes to gardening, right? Mother Nature is fickle. And part of the\npart of the joy you have to find in gardening is the process of the gardening rather than the\nparticulars of the output. And that's why I've found at least in my years of gardening that much\nmuch better to plant a whole bunch of different stuff and see what comes and take joy in that\nand not stress too much about, you know, hoping to get one particular plant or one particular crop to\ncome out the way you'd like. Well, that's great. And yeah, I'm hoping to get some peppers this year. We'll see.\nI'm trying for the first time, but we'll see. I'm going to do those hovers. I'm going to try my best.\nSo, let's talk about unlimited as a whole, right? I know you guys have the ETF strategy,\nwhich we're going to talk about in depth. Do you guys do anything else to kind of service clients\nor is that your single focus business line? Yeah, what we've done, if you think about it,\nas we've built a technology, we'd call our return replication technology, which allows us to look\nover the shoulder of what asset managers are doing in close to real time and take that understanding\nand quantify the exposures that they have and translate that into positions in in liquid securities.\nAnd so, as you mentioned, we have one ETF in the market that folks can see out in the public.\nWe also use that technology and package it together in other products, some of which are\nmore appropriate for financial institutions, particularly thinking through what's sort of the best\nway to construct a portfolio. One of the really neat things about using replication and indexing\nof alphas is you can start to think about how do those alphas perform at different times in the business\ncycle in response to different monetary policy conditions, etc. And sort of build a better and more\nagile multi-strategy portfolio than what's available for typical allocators. So that's sort of the\ninstitutional side of the business as well. Yeah, that's great. And so, what is it about hedge fund\nreturn profiles that investors find appealing? We hear a lot about hedge funds and this shows tailored\nto financial advisors in RIA. So, what is it about that hedge fund return profile and the risk\nreturn of them that makes them appealing or that they should be a part of more of a diversified portfolio?\nWell, I think for most people, they look at, they can look at, say, net returns, indices and\nthey certainly aren't screaming off the chart that that's something that you want in your portfolio.\nAnd what I'd emphasize is that the problem there is not the strategies, the problem there\nis the fees because those performance, that performance that you see is that of hundreds of basis\npoints of fees that the managers are receiving on an annual basis. So, if you think about the strategies,\nnot the net return outcomes with the strategies, those strategies are actually quite good on a\ngross of fee basis. They typically have returns equivalent to or better than the equity market\nover the last 25 years. They have about half the monthly volatility and about a third of the\ndrawdown profile. So, and they're not, you know, they're modestly correlated to assets overall.\nAnd so, you think about that combination of things and that's actually a pretty good return profile\nthat you probably want in your portfolio. The problem is it's too hard to gain access to it\nin a way that's tax efficient and low fee. And so, that's basically what we're targeting at\non limited is how do we translate those great strategies that are out there that are generating\ngreat alpha. How do we make those available in a way that doesn't have so much decay related\nto fees, transaction costs, and the tax problems that typical structures have?\nYeah, of course. And I think to advisors here hedge fund or alternative and they loop that into\nall one thing, right? So, last week we had on Andrew Beer from DBI runs DBMF, great guy. We had a\nreally good conversation. So, can you help the advisor find the distinction between what multi-strategy\nis, which is what you do, and what managed futures are, and what Andrew does, and how those things\ncan either work together or how they work differently inside of a portfolio?\nWell, Andrew has been a great pioneer in the world of low-cost hedge fund indexing. So, it's great\nthat you talk to him right ahead of me coming on. And a lot of ways.\nIt's hedge fund month over here. It's an ad podcast. Yeah, exactly. In many ways, I'm benefited,\nand many products are benefited from his more than a decade of pushing and bringing these\nideas to the forefront for the benefit of investors. Managed futures, you could just think about\nmanaged futures just one hedge fund strategy that exists. Out there in the market, there's a lot\nof different hedge fund strategies, equity-long short, global macro, fixed income strategies,\nmanagers that are focused on the emerging markets, maybe event-focused M&A type strategies\nthat are out there. And so, whereas the managed futures approaches, focus on one particular strategy,\nand generally they do a pretty good job of delivering those strategies at a very cost-effective way.\nWhat we're focused on is building an overall portfolio of alpha strategies or hedge fund\nstyle strategies, which includes all those different strategies. And a lot of ways you can think\nabout what we're doing is creating an index fund of hedge fund strategies in the same way,\nyou know, there's spy or the cues or things like that. So that, you know, for investors who are\nfor allocators who are looking for just an efficient way to gain access to that diversified\nportfolio of different strategies, our idea is this could be one way in which you could do that,\nspecifically rather than necessarily picking individual managers or picking individual\nstrategy types, you sort of get the best of the universe in aggregate by using what we're designed.\nYeah, no, and that's, that's great, and it's helpful. So let's talk about your ETF,\nHF and D. So it's your multi-strategy return tracker ETF. So we kind of hit on it a little bit,\nbut why don't you kind of go a little bit deeper about what the strategy is trying to accomplish?\nWe understand it's hedge fund replication, but what can people find in it, how has it constructed,\nyou know, what's the overall strategy behind it? All right, so our basic goal with with the\nHF and D. ETF is to create a set of positions that over time should reflect the risk and return\nprofile of the aggregate hedge fund industry. That the AUM weighted hedge fund industry. And the\nway that we do that is not in the aggregate, but actually what we do is we break it down into the\npieces of the major hedge fund style. So global macro fix income, equity long short,\nmanaged futures is one of them. And what we do is we build portfolios for each one of those\ndifferent substratages that are intended to match the risk return profile of the overall hedge fund\nstrategy. Now, we do that through, as I mentioned, a machine learning approach, which is intended\nto try and get as up-to-date and understanding of how hedge fund managers are positioned,\nyou know, in close to real time. And so the way that we do that, you know, we could sort of talk\nabout it and sort of a complicated black box sort of way, but the underlying intuitions actually\nvery simple, which is that when you look at a manager's returns and you understand what sort of\nstrategies they're pursuing and you see what's happening in the asset markets, you can actually\ndo a pretty good job of inferring how they must be positioned, which securities or which exposures\nthey likely overweight or underweight, given their sort of normal universe of exposures,\nand part of the thing that we can do to make our ability to match their or understand their\npositioning more effective is that because positioning is continuous, it's also path dependent.\nAnd so we actually look at the pattern of returns relative to the plausible exposures those managers\nmight have on it at any point in time. And basically, back into how they've been positioned through\ntime, and then we take those individual replications, and we combine them together, and that is what\nwe use as the core intellectual property behind our HFND ETF. So what are the key drivers\nin that decision-making model? You gave us a little bit of it there, but it would, so you're looking\nat all the underlying, you know, different hedge fund strategies, you're looking at kind of what the\nmarket environment has been going through and what those return profiles were. And so you're basically\nmaking, I'm going to simplify this, kind of a probabilistic that on what those likely holdings were\nin a sense? That is exactly right. We do build probabilistic portfolios because if you think about it,\nlet's just say I looked at, you know, one particular months returns or, you know, few weeks of daily\nreturns. There's a lot of different combinations of portfolios that could plausibly explain those\nreturns. So like, if you're thinking about a global macro manager, I mean, what are they basically\nhave exposure to? It's, you know, stocks, fixed income, credit, commodities, and currencies, right,\na mix of those assets. And one of the things that we do in terms of creating that higher,\nprobabilistic portfolio is what we do is we look at not just the most recent periods of returns\nand compare that to the market action to solve for what portfolio is the, is the highest probability\none. But we look at it adjacent to the previous periods of portfolio. And that's very important\nbecause today's outcomes are function of today's positions. And today's positions are function of\nyesterday's positions, which can be observed through yesterday's outcomes. And that's very important\nbecause what it means is that probabilistic portfolio narrowes over time, narrowes because the\nonly positions that can explain the most recent returns have to also an adjacent portfolio,\na similar portfolio, has to explain the previous periods returns. And so actually that allows us to\ncreate a higher probability portfolio. And function of what we do is we actually go all the way back\nyour time and then all the way back to today. And so for every single portfolio that describes\nall of the returns back your time in today to get that highest probability portfolio. And I think\none of the things that's pretty cool about that is that we actually get a higher real time\nunderstanding of the positioning than the manager's report themselves and that is aware that people\nare aware of in the market. And so we actually published what we call our hedge fund barometer,\nwhich gives insight into basically the output of our technology and what that means for hedge fund\nmanager positioning, which folks can can look up and take a look at and maybe make that public\nto folks that can understand how our technology is translating into actual understanding of how\nhedge funds are positioned in real time. Yeah, so this is, it intrigues me very interesting to me.\nSo one more question on this, do you almost, could you almost get predictive in a sense if you're\nunderstanding prior regimes and market cycles and return returns streams in those cycles? Could you\nalmost get predictive given as to where kind of the macro economy is and what data is the\nlikely future allocation, you know, next day or next week that a manager might start to put on\nin terms of positioning? It's certainly possible though the thing you would want to wave for\nway in that is your ability to predict their shifts relative to the quality of interpreting their\nshifts and the cost of the delay costs. And so if you have relatively real-time data and there's\nyou know, there's hedge fund performance information that comes out daily for the couple days\nlag, high very high quality information that comes out monthly with a couple weeks, you know,\nmonthly a couple days into the subsequent month. So you want to weigh your ability to predict\nrelative to the information value that exists there. And what I'd say is, you know,\nhedge fund managers, many people think are like hot shots that are like wildly moving their\npositions around. First of all, that is not really true, having sat in the seat of running money\nfor for institutional quality hedge fund and that's because you can't move very fast because you\nstart to incur excess transactions costs and that arose your alpha. So managers by their nature,\nif they're managing any significant amount of money aren't moving that fast and then when you\ncan about collections of managers, it takes time for them to evolve their positions. And so that's\nwhy what we see is there's a lot of information value and just understanding how their position\neven with a very even with a modest lag because the quality of that decision making is generally\nvery good rather than trying to necessarily predict exactly how they might tweak one way or the other.\nYeah, no, so it makes a lot of sense to me. So is the process fully automated or is there some\nintervention that you guys have to input into the process along the way or is it again fully run\nby the machines? Right, the way I would describe it is it's expert design and systematic\nin operation. And what that means is, you know, a lot of there's been a lot of efforts at sort of\nreplication approaches in general and I think one of the challenges with those is that many folks who\nhave pursued those haven't necessarily actually built proprietary strategies and actually run\nthe money to understand how they're constructed. And so there is a real craft in between my co-founder\nand I we have almost 50 years of experience in this business, building head proprietary hedge funds\nstrategies and that that shows in how and that is in critically important terms of how we build\nthe approaches. But from that craft, what we do is we build a systematic process that is running\non a day-to-day basis, taking in manager performance information, asset return information,\nallocation information and basically saying given that set of information in the sort of decision\nrules and design that we've created, what is the highest probabilistic portfolio that's describing\nthe returns that we're seeing in the most recent period. And so that part of it is systematic and\nwhat that allows us to do is take the time to ensure that we can continue to do research and\nimprovement overall processes. Yeah, so talking more about the underlying holdings\nand how it's all constituted is the strategy, you know, easy question. Is the strategy\ngo anywhere? Is there any kind of guardrails? I know you're using some futures and some ETFs,\nso but can you really go anywhere you want? Well, functionally, if you think about\nthere's five trillion dollars of assets and hedge funds, basically what that means is that\nhedge funds are invested in or exposed to the 70-ish largest liquid markets in the world.\nAnd so our opportunity set is essentially the 70-ish largest liquid markets in the world.\nAnd that may adjust over time as certain markets emerge and others no longer are as large.\nBut in general, that opportunity set exists through time and then we just express those views\nin them in what we believe to be the most efficient security possible, whether it's in ETFs\nor cash equities or futures in any cases. And on perspectives, we have the ability to also use\nthings like vanilla or custom swaps as well. So we're basically just using whatever is the most\nefficient way to express the view. And excuse me for not knowing this, I probably is the portfolio\nlong only or can you get, can the portfolio go net short? No, the portfolio is\nincludes positions that are both long and short. And we do have aggregate risk controls in\nplace that are inside the margins that we that exists from a regulatory perspective to ensure that\nwe don't take undue risks or risks that would be unexpected to us over time, although we don't\nreally find ourselves in that position frequently and haven't since we've launched the strategy.\nSo staying on those on those guardrails, do you have any guardrails when positioning in terms of\nsector or regional exposure? I mean, are there kind of max and min's built in there? So you're not\ngetting the portfolio maybe overexposed to, I mean, to, I don't know, home builders, right? Right.\nSo, I mean, the first of all, the thing I would say is by design and craft of the replication\ntechnology, it's intended to be what we describe as a parsimonious yet comprehensive set of\nopportunities. And so just functionally as a result of that, there is not, there's limits to\nconcentration that can exist. For instance, if you're an equity long, if you're trading equity long\nshort, there's regional sector indices, regional indices, factors, sizes, sectors, et cetera,\nthat all of these different pieces that go together to create an opportunity set of, let's say,\n30 different exposures, just for that one type of replication. And so, by, sort of, by design,\nwe ensure that it is, it is not overweight one particular outcome. And then, of course,\nat an aggregate level, you know, one of the things people often can forget is that there are\nsignificant restrictions and constraints on portfolio concentration, regulatory constraints.\nWe're, well, within those regulatory constraints, but those are sort of like the ultimate backstop\nto ensure that there is sufficient diversification. And functionally what you see is, you know,\nroughly 50 positions, you know, and a whole wide variety of different exposures that are in the\nportfolio. So, how often you kind of doing a look, is it a daily look and you're readjusting,\nis it weekly monthly? Like, is there a normal cadence of rebalancing or is it just fully active?\nYeah, what we're doing is we're getting market performance information and manager performance\ninformation, essentially, in, essentially, every day. And reflecting and understanding,\nreflecting that understanding on a daily basis. Now, it doesn't necessarily mean we\ntrade or adjust the positions. Every day, part of running the money also is ensuring that you're\ntrading in a way that doesn't, you know, create undue turn or chop in the process. And so, you want to\nhave significant enough shifts in position to be trading them. So, it doesn't necessarily trade\nevery day at all, but we're sort of reevaluating on a continuous basis. And so, if and when things\nchange meaningfully, we are in a position to be able to adjust the portfolio accordingly,\nyou know, within that same day. It's great. So, if you're sitting down with, you know, an RA group\nthat's got an existing model portfolio that they've constructed, you know, where are you would kind of\nsteering them to find an allocation for this ETF? And kind of I would assume you're going to put it\nin maybe an alt bucket or maybe adjacent to their equity exposure, maybe, but and also kind of\ntalk about how you would look at allocation size for this particular ETF. Yeah, part of the inspiration\nactually of this whole approach was looking at what big institutional investors do with their\nallocations and to simplify the picture. Essentially what, if you're, if you're, you know, hundreds\nof billions of dollars in size, sovereign wealth fund, you go invest in dozens of managers and you beat\nthem down on fees to get essentially a low-cost hedge fund index problem. And so, our kind of idea\nwas to create the the same style of product and just make it available, whether you got, you know,\n20, 20 bucks or 20 million bucks. And so that's the kind of idea. If you look at those institutional\nallocators, the most sophisticated ones are typically allocating about 20-ish percent of their portfolio\nto liquid market alpha strategies, so like hedge fund style strategies. And so, you know, we could,\nwe could probably talk all day about whether 20% of the right number or is it 10 or is it 50?\nI think, you know, there's a good, good reason why they sort of landed on roughly 20 given the balance\nof the portfolio improvement, the probabilistic success of alpha and the goodness of other return\nopportunities. And so, you're thinking about, hey, look, I have a standard ETF portfolio, and I'm\nthinking about, you know, how big should alt be in my portfolio? I think in that context, like roughly\n20% is the right number. And, and within that context, what I'd say is, you know, in the same way,\nand your equity portfolio, you might have spy or the equivalent of the Vanguard equivalent,\nand then have, you know, maybe some sector options or sector allocations or\nthematic allocations that seem compelling at the time. So, too, when you're alt allocation,\ncould you use HFND as a product that is, you know, sort of your standard index for there,\nand then allocate some of that capital to probabilistic opportunities that you think\ncould be compelling. One of the things actually, which can pair this conversation with the previous one,\nif you go look at how to create the sort of best alt portfolio you can, one of the things that has\nworked out really well through time is actually pairing diversified alpha, which is essentially\nwhat we're trying to do with with HFND, with managed futures, and like a 50-50 allocation between\nthose two actually creates a, you know, at least back through time, would have created a relatively,\nyou know, a particularly consistent return stream, combining those two pieces for that alt\nbucket. So, you know, that's, that's a, that would be a compelling way to put the pieces together as\nwell. Yeah, no, I agree. So, you're fund launched about the same time as ours. So, you're\nalmost, what a year and a half, maybe a year and a half in. We know it's kind of a, it's kind of a,\na patient's game in terms of distribution. So, how are you thinking about as you're getting closer to that,\nyou know, three-year number, thinking about distribution kind of going forward and, and starting to\nreally get more people involved in the fund and in this space in general, because I agree with,\nwith your assessment, I think everybody, I think it managed futures and multi-strategy deserves a\nspot in kind of every diversified portfolio. And so, you know, how are you thinking about getting\nthe word out, marketing and distribution as you kind of get a little bit closer to your three-year\nnumbers? Yeah, I mean, as I'm sure you appreciate in the early stage ETF market primarily\nthe investors that are coming to those products, the early movers in that market are your independent\nRIAs. And so, we've had, we've built great relationships with dozens of independent RIA\nmanagers around the country. Many of whom are trying to bring their clients, you know,\ndiversified low-cost ETF model portfolios and pair that sort of asset management with, you know,\nplanning activities that many ways are need to be much more tailored to the individual investor.\nAnd so, that's mostly who we're focused on. I think probably the sort of critical way in which we've\ndone that we're still a very small team is through, you know, a content oriented strategy\nwhere a lot of what I do is connect with both the advisors directly as well as across social media,\nTwitter, YouTube, etc. And as part of that process, really bringing that sort of institutional\nquality research and perspective that had existed when I, when I worked at Bridgewater\nand bringing that to every, to every, you know, RIA that's out there in the world. It's kind of\namazing how underserved those folks are with getting high quality research because they're typically\ntoo small for the banks to really pay attention to and they're, you know, obviously not getting\naccess to big institutional allocator, you know, research that's being, that's been created\nongoing basis. And so, you know, a lot of ways, when I was at Bridgewater, I wrote, I used to\nwrite the daily observations, which was very well regarded institutional research piece there,\ncame out daily. And today, I basically have taken that concept and just translated on Twitter.\nAnd that's been great. It's been an incredible environment. You would be amazed at how many\nadvisors are out there getting meaningful information from Twitter, from YouTube, from all of these\nsources because they don't have great other ways of getting that understanding of what's going on.\nYeah. Well, Bob, I really, really appreciate your time before let you go. Where can people\nlearn more about you? You have your, you have your Twitter handle right here on here. Learn more\nabout unlimited and learn more about HFND. Yeah, for sure. If you want to get into the flow of\nthose sort of ongoing macro takes, definitely check out Twitter at this handle or YouTube under\nthe same handle, which I think where we have monthly macro outlooks publish there as well as clips from\nmy ongoing media appearances. So that I think people find that very, very interesting bite size\nways of getting some perspective on what's going on. I also write about the industry as a whole\non my LinkedIn under my name. And if you want to learn more about what we're doing and unlimited,\ndefinitely check out our advisors site unlimitedfunds.com, which has a lot more information about\nour technology, our products, and backgrounds about what we're doing. Well, again, Bob. Thank you\nso much for your time. Thanks for joining us. Thank you all for having me.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}