{
  "id": "15169399",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nToday we have on Jerry Parker, he is from Chesapeake, and we're here to talk about\ntheir ETF Ticker, TFPN, the Blueprint Chesapeake Multi-Asset Trend ETF,\nas the name says, it is a trend following product trades multiple different markets,\nboth long and short, does a wonderful job in my observation, mitigating draw-down.\nI believe that this would be a very good addition, and a bolt on to help mitigate\nsome overall volatility in the portfolio, as well as a product that can really go anywhere.\nSo without further ado, please enjoy the episode with Mr. Jerry Parker.\nHey Jerry, welcome to the show.\nHey Brad, thanks for having me.\nThis is the beer.\nYeah, no, thanks for doing it.\nSo can you give everybody a bit about your background?\nHow you eventually started Chesapeake and just give us how you got to where you are today?\nYes, I'll start in graduating from accounting and accounting, and being an accountant in public\naccounting for a while, and really desperately wanting to not be in public accounting,\nright shortly after college, and I kind of figured that out.\nSo I answered an ad in Wall Street Journal to go to work for Richard Dennis,\nfamous commodities trader in Chicago, the turtles, the turtle story, everyone's heard about that\nprobably.\nAnd yeah, so December of 1983, I was of what Chicago was taught by Richard Dennis.\nIt was 12 turtles at the time, and then we had a couple weeks of a course,\nand with Rich and Bill that card, and then in January 1984, we started trading with a million\ndollars, it gave us all this knowledge, and everything we needed to\nknow about trading futures, commodities, trend following, and did it gave us the money,\nand it was the perfect client, because he always had to do to please him what's to do what he taught\nus how to do, not even to make money really, because he said, if you make money the wrong way,\nI won't be very happy. So that program lasted about four years, and it was very successful.\nMost people were making probably 200% a year, 150% a year with large drawdowns and lots of\nrisk. And then in February 1988, I started Chesapeake Capital. I would have loved to stay in Chicago,\nwork for Rich for years and years, but they decided to end the turtle program, and that's how\nChesapeake got started. So it's funny, you and I share, we started one year, oh, I did one year in\npublic accounting, and said that was enough for me, one tax season, and I threw my hands up.\nYeah, I was helping them getting my certificate, you know, that's kind of the goal I had,\nokay, I did all this stuff, I passed the exam, I want to get my certificate. So after\nthe few years that it takes to work for another accountants, you finally get your certificate,\nthen I was kind of out of there, and I was trying to find all kinds of jobs, stock broker,\nand I radically, I interviewed for an assistant to a commodity trader,\nin Richmond, Virginia, and I did not get the job, and just a few months later, I got the greatest\njob in the world, and one that I didn't know I should expect, or deserve, you know, to be handed\na career, basically. And my resume is very short, because I'm always dismayed by, you know,\nsend me your bio, and I'm like, oh, God, I haven't done anything except trade futures and\nbe a CTA for, like, almost my entire career, and Chesapeake, and I haven't really done\nmuch more than that, because I've been so totally in love with trend following and focused on that.\nWhen I was, my 20s and learning about trend following my spare time as an accountant,\nI just thought trend following was a great thing ever. I thought it from the, from the first time\nI heard about it, and I, every day, I've woken up since I think I've just fallen in love over again,\nand I think it's just a great thing ever, and I was just really happy that when I went to Chicago,\nI didn't really know, but I kind of thought maybe they were trend following, so I was really happy\nwithout this case. Yeah, so we're going to talk about that a little bit here in a little bit,\nbut before we do, I'm sure trend following's not your only hobby. What is some of the things you\nlike to do when you're not, you know, trading and falling the markets and doing stuff like this?\nWell, I'm a loser now. I'm kind of, I'm kind of older now, but I for about 20, 25 years,\nI've been really into working out and doing weightlifting cardio, and I lost 65, 70 pounds in 1999.\nAnd so for some reason, I just woke up one day and I was like, okay, I'm going to, you know,\nget my body straight, eat healthy, workout, having never done that before, having never been in\nshape before. And now, so it takes up a lot of my interest in time, diet, and fitness. And then\nfishing, I live in Florida, and we've been fishing already a lot this year, and I like fishing quite\na bit, pickleball. And that's the go-to for people in my age, especially in Florida. My wife, my wife\nis a very good athlete. So that kind of like, you know, kind of bums me out a little bit. She's such\nso great at skiing, which I like to ski as well, but she's a great tennis player, but pickleball\nlevels the feel quite a bit. So I enjoy pickleball. Yeah, I heard pickleball is definitely,\nis definitely hot in the south. So can we talk about Chesapeake as a whole? This isn't the ETF\nisn't the only thing you do. So can you talk about all the things you're doing over at Chesapeake\nto help clients? Well, we've kind of evolved into a ETF and mutual fund company. Yeah, so we\nhave sort of given up on practicing classic trend following and earning that incentive. So we have\nsort of a bit the bullet, and just sort of said, okay, we're going to manage money for, you know,\nroughly 100 basis points. And so we have one of the oldest CTA trend following mutual funds out there,\nthat has been around, I think, 12 years or so, and then an ETF that started almost a year ago,\nand so yeah, that's pretty much all we do, and it's all trend following and the, you know,\nthe symbol is TFPN, and which stands for trend following plus nothing. So that's a little\nthing I came up with that I think's kind of funny, but that sort of our total focus is bringing\ntrend following to the masses and to people who love trend following, and then they're a\nhandful of people out there, small percentage of people who really, you know, liked as much as we do.\nYeah, so let's talk about kind of systematic investing as a whole. And we'll also get into some\ntrend following and some of the rules of the ETF, but what is it about systematic investing?\nAnd a lot of our listeners are financial advisors in RAA, so what is it about that systematic\nprocess and about trend following that really makes it appealing for an investor and for advisor?\nRight, I definitely think systematic is a good way to start and talk it about what we do.\nIt is systematic, and it just so happens when we come up with rules and we test them,\nhis historical data, do a back test, the computer says, yeah, you should consider trend following.\nAnd but we have to be systematic first and foremost, we don't want to be\nDr. Mayer religious about one type of strategy unless it actually does work. So with everyone\nkind of realizes that when you have something like investing, you have to come up with some rules\nin order to be maintained, some discipline, and know what to do in all situations and good\nsituations and bad situations, tough situations, you want to have your role as you want to stick\nby them. And the computer analysis and research basically says, look, if you apply these rules\nfor the rest of your life, you may get performance that looks similar to history, maybe.\nThat's what you're kind of hoping for, and you look at a lot of data, have a lot of sample size,\nand then you sort of put your faith in that and really try to follow and love with everything about\nthe system, one of the things that Rich used to say is, you know, traders should love their\nlosses. And what he kind of meant was, you know, you love everything about the systematic approach.\nIt's losses, it's wins, it's win percentage, it gives back profits, too much profits sometimes,\nit makes a lot of profits sometimes. So you really want to embrace it and realize that\nthis objectivity and historical data researching and following a set of rules for the future\nis the best shot at taking money out of the market. Yeah, and couldn't agree more.\nI saw on your website, you have a phrase, prices king. So can you elaborate on kind of how your\nprocess is using price to really generate and make investment decisions?\nBefore I, we only look at the price of the markets and basically it will just\nusing a sort of a trend following approach with moving averages or breakouts or something like that,\njust by looking at the prices, you're able to come up with some entry and exit signals and sort of\nknow what your positions ought to be. That's kind of the way we do it. And we try not to add into\nmany filters or bells and whistles that number one could keep us out of a trend. There's nothing\nworse than missing the trend. For a trend follower, five to ten percent of the trades per year might\nbe a big outlier trend. So number one, you just cannot miss those. You can't have a filter\nthat filters you out of a trade. So you're always taking a lot of, you know, always trades are not\na plus or c's and their d's maybe because you're really going to take every single trade that\nlooks like it's in a trend. Does your wind percentage is going to be kind of low and you're going\nto really have to rely upon those small losses. So before we do a trade, we have a predetermined\nloss that we're going to take on the trade. I think maybe the second most important thing is just\nhanging them with those winning trades in using the price and the signals that the price is\ngiving you and that you're going to sort of say, hey, the trend looks like it's ending. It looks\nlike it's going the other way now. But our strategy is sort of really long term and we try not to\nget out too quickly. We try to get as much out of these long-term trends as possible and not to\npay too much attention to the the givebacks and the volatility. We would try to be shorter term.\nWe would get out quicker if the computer told us that's what work best. So the computer basically\nsays, look, I'll tell you what works best and that is hanging on these trends a lot longer than\nyou want to. It's going to be very uncomfortable. We're going to sit with some volatility. But if you\nwant to pull the most out of the market, that's possible, you're going to have to have some pain and\nsuffering and it makes sense to me. I think to us that that's kind of how the world works.\nYou know, you bring up an interesting point and I know that this is variable based on trend.\nIt's variable based on volatility and market dynamics and how everything is working. But kind of on average\nbecause you could set your moving averages a handful of different ways. What are your typical or\nideal kind of holding periods? And again, it's very, it's definitely volatility dependent,\nprice dependent. But where are you kind of you picking up super long-term cycles? Are we talking\nabout handful of years in some of these things or handful of months or weeks?\nThere are average holding periods about a year. We trade multiple systems at trend following\nsystems and some are shorter-term than the other and then others. But they're all in that nine to 12\nmonth range. And some of these trends can last for multiple years to a three years that would pull\nthe average up. Losing trades may be wouldn't last as long because we're trying to keep the loss\nis sort of optimal. We don't want them to be too small to where we're going to get\nwhip-sawed in and out. And obviously we don't want them to be too large. We want\nwe trade about 400 different instruments. 400, we could have 400 holdings at one time. So each\ntrade, we'd like to call it each bet. We put on the maximum loss. It's going to be really small,\nyou know, 10 to 15 basis points. So microscopic losses, but we have so many markets. And if we\napply this five to 10 percent of the trades will be a big mega outlier. You know, we should\nhave a 20 to 40 big trades per year that will make up for trade each trade us very small.\nThat's interesting. And let's we're going to unpack that in a little bit. So before we kind of get\ndive deeper, I think it's better to talk high level about this specific ETF we're talking about,\nwhich is TFPN is a ticker, which is the blueprint, chess-speaking multi-asset trend ETF.\nSo can you kind of first at a high level explain what this ETF is trying to accomplish and then we'll\ndig into the weeds a little bit? Yes, it's trying to accomplish not so much a managed\nfutures being, it's really trying to accomplish, foot trend following as it's primary\nemphasis. You know, we wanted we wanted to show what trend following can do. So with hundreds of markets\nlike this, we feel like this will show what trend following is all about. We can keep more of a\nclassic trend following approach where we really try to let the profits run and not be too\ninterested in when the volatility kicks up in a trade like Coco. I mean, a Coco was out of sight\nand the volatility was crazy a lot of CTAs are scaling back positions true just based upon\nthe volatility and when Coco's making all-time highs. So we're like, okay, we're going to have\nthis one find that sort of just says we're going to let it run. Irrespective of the volatility\nand trading so much, so many markets, they sort of minimizes Coco's impact, which is kind of bad in\na sense that it would have been a great impact if we'd only traded in a 20 markets. But also when\nyou have those drawdown periods, you know, it's really not anything that's going to upset you too much,\nbecause it's just one out of hopefully 20 or 40 markets that are going to have this outlier\ntrade. So is the ETF go anywhere? Like what types of securities are generally going to be included\ninside of the, you know, the holdings file inside of inside of the CTF? Well, I'll go this there.\nAnother saying, another say we have is following plus trend following everything. So we try to trade\nas many markets as we possibly can. And we have a lot of securities in there, a lot of stocks,\nhalf the portfolio is stock. So that right there, most CTAs don't trend following their stocks,\nthey don't trade single stocks, they trade indices. So we have all this diversification and all\nthese different kind of stocks, long and short, half the portfolio. The other half the portfolio is\nmade up of the currencies, the commodities and the bond futures. And we have some bond ETFs,\nsome of the exposure to the bond markets that you don't get in futures, we pick those up in ETFs,\nlike job bonds, mortgage backs, tips, corporate, duties, things like that. So we're just searching\nthe world over for securities, for futures and trying to create this amazingly diverse portfolio.\nAnd so we're some sort of the managed futures marketing is usually something like, please add us\nto your portfolio, a 5% or 10% allocation to your stock and bond portfolio, to for crisis alpha,\nto mitigate the times where stocks are really bad and have a big sell-off. We're like,\nhey, there's a more direct approach. Let's trend follow the actual stocks and not rely upon\nthe small allocation. I mean, our allocation will probably small anyways. But we sort of say,\nlet's get at this as quickly as possible and wrap around equities themselves, stop losses,\ntrading stops, small losses, all the benefits and the risk management trend following has\nand pick up all this extra diversification that single stocks can give you that you don't get\nfrom indices, like right now every index, every stock index future is long and all around the\nworld. But if you look at some individual stocks, there's a handful of shorts, you know,\ncertainly kind of in a market, but still there's some, there's some shorts out there.\nSo we really like getting that diversification and being like the only CTA who really has a\nreally diverse portfolio that includes trend following of the single stocks.\nWell, in this particular ETF, you briefly mentioned, you know, shorting some stocks as well.\nSo the portfolio is long short. Do you have any guardrails on kind of net long short exposure?\nI'm sure it doesn't get levered, but is there, do you have any guardrails on your net long\nand or short exposures? We set the portfolio up to have a max risk budget for the stocks.\nAnd, you know, the stocks can be long or short. We don't have a preference for either,\njust depends on which way the trend is going. It's really great to come in and have longs and\nshorts in a certain sector. Like right now, we have just mostly only shorts in the interest rates.\nAnd that's the way it has been for quite a while.\nAnd sometimes you get in these situations with the currencies as well, where you just long dollar\nto short all the currencies. And so that's kind of a bummer. Your commodities can give you a\nlittle bit of diversification longs and shorts. That's really got to be your first line of defense.\nIn a sector, do I have some longs and shorts? Or am I going to be scrambling to have\ntremendous, you know, have this sector be mostly just one way long or short and have to scramble\nto reduce risk if the trends were worse. I really like to come in and have longs and shorts.\nAnd commodities give you that and stocks give it to you about as well as any other sector,\nespecially recently because even during this pick run up in the equities where we've, you know,\nhad a lot of big trends in several long stocks. We still can find, you know, stocks that are\nshorting and they have their trends too. I think that people just get so focused on these indexes.\nAnd that's what that's how they see the market. But if you look inside those indexes, you know,\nyou'll say, oh, okay, there's some stocks in here. I want to go long. Some I like to be flat and some,\nI would like to be short. And this is what the benefit you get by not trading the indices\nand looking at each individual market. No CTA would ever say, well, I'm just going to trade the dollar\nindex or I'm just going to trade the Goldman Sachs commodity index or some commodity index. No,\nthey would break that thing apart and see the benefits of the diversification and the sizing\nout of rhythm and all the, you know, a beach and the visual market. And so we like to do that with the\nstocks as well. Well, you you walk me right into my next question, which is let's talk about portfolio\nwaiting. When running kind of a signal-based business, it can be hard to let that signal can\nsometimes be binary. So it could be hard to kind of do portfolio waiting. So how you,\nyou mentioned correlation in a covariance process. Can you explain to the average advisor what\nthat means and how you're going about waiting the holdings inside of this portfolio?\nWell, like to set the, you know, we have four major sectors. Maybe you can set the show\nthrough crypto and there is a fifth smaller sector with some crypto, we have a few crypto stocks\nand blockchain stocks and we try to Bitcoin and Ethereum futures. But we like to set it up to where\nit's basically looking at these sectors and seeing how much diversification is within the sector.\nSo, like I said with stocks, we feel like there's tremendous diversification here with thousands of\nstocks to choose from and we can choose all kinds of stocks, all sorts of companies, maybe a lot of\ncommodity-based commodities that are not on the, not where there's no futures to trade or no\nphysical markets to trade. We go pick up lithium and uranium and marijuana, things like that.\nSo we were always trying to find stocks that have a sort of a commodity tilt to them. So we think\nthat stocks alone because they're so many to choose from, you know, that's worth half the portfolio\nand then we split up the rest evenly with the currencies, commodities, and interest rates.\nIf there was thousands and thousands of commodities, that would be half the portfolio properly\nor the same with the currencies. If you could get inside of that currency sector and really see\nsome diversification, which is not always possible. We have had some good moves recently in the\nend and the pace of, but by and large, we just set the portfolio up to try to achieve maximum\ndiversification from the get-go from the very beginning. But then as we start trading, as we see\nthe markets start to move around, the correlations will vary quite a bit. You know, we trade gold and silver.\nYou could argue that gold is over a kind of the same thing, but sometimes it doesn't work that way.\nThere's been times when silver kind of doubled or tripled in price and gold kind of set there.\nMany times hitting, well, a few times hitting all has done the same thing, doubled in price\ndue to something happening with the weather or freezing in New York and crude kind of just sits there.\nSo you don't want to play to be too concerned with what looks like correlation\nbecause all of a sudden something can happen in these markets and two markets that were once correlated,\nlook nothing alike any longer and yet when the big trend is over and one of them maybe\nthey go back to the end correlated again. So since our goal and our whole reason for existing is to\ncut down these outlier trades and capture these things and allow a small percentage of the overall\ntrades to make all the money and pay for all the small losing trades, we really don't want to take\ncorrelation too seriously because as we've seen historically the markets are individual and\nthey can do their own thing and have these videos and credit moves.\nSo the ETF and the portfolio does a fantastic job of drawdown mitigation. Your drawdown statistics\nare phenomenal. I would assume that has to do with the stop losses that you're kind of applying\nto all of these different positions. So can we talk about your stop losses a bit? Is it a\nstatic stop on each security? Is it variable dependent on the volatility of that particular\nsecurity? Can you talk about how you're limiting that risk? We limit the risk definitely part of\nthat is with the stop losses. Like I said when we put a trade on we have a formula that tells us\nthat we want to treat all the trades the same, give them all the same amount of room and lose\nthe same amount potentially on each trade that we take. So we have a pre-determined stop losses based\nupon the capital, we have under management, the volatility and the particular market at entry.\nAnd so we just subtract something from that entry price and then that tells us where to get out.\nWe don't move that stop. It's just sits there the whole time and then hopefully a trend begins\nand takes off and then the trading stop will move above that stop loss. So the trading stop\nwill sort of take over. So just like a trend following the cliche is that profits run and takes\nsmall losses. We are separating the losing trades much different from the winning trades. We're going\nto be very conservative and very fearful of losing too much money in any one trade. But then\nif that trade becomes a profit, it just hands off. We'll let that thing have lots of volatility.\nIf there are lots of drawdowns because we see all the time, big sell-offs and big drawdowns mean nothing\nsometimes because the market goes right back to all-time highs. So we see this in the data.\nWe wouldn't do it if that's not what we saw in the data. We would love to trade shorter term\nin this for the pain and suffering. We just know that's kind of a part of the optimal strategy.\nSo when you get stopped out of a position, what is the ability to re-enter that position? Are you\nwaiting for your next positive trend signal on? So can you just sit out of it and leave it on the\nbench until you get another long? If we could stop that of a trade with our small loss, we will\nmaybe go the opposite direction next time, wait for that entry signal, or have to get right back in.\nYou know, that's kind of what happens a lot is you take the small loss and you have to get back in\nin the same direction. It's kind of a bummer. But you know originally I didn't say it was a small loss.\nI corrected myself. I said it was an optimal loss. So we don't want it to be too small\nbecause that's going to make our win per centage really low. We're going to get chopped up.\nWe're going to have to keep buying it, new highs all the time. So we're not going to work out very well.\nBut the optimal loss where you have a balance between keeping the losses in a control, not letting\nthem get crazy and yet trying to maximize that win per centage and minimize the whipsawing\nnature of trend following. So the portfolio is set up as active. Are you guys acting on\nnew signals or new trends daily or are you kind of assessing all of your signals and kind of on a\nmore weekly or monthly rebalance schedule for kind of adding or deleting new positions?\nWe need to look at the market's daily and we download new data daily. Put it in our computer is run the\nsystems of the new data. But as I said, with averaging one trade per year per market,\nso we would have a tendency not to trade very often even though we're ready to trade every day.\nWe're acting like we're saying we will trade every day. We just usually don't have to.\nBut not in every market, but with 400 markets, four different entries in exit systems,\n1600 now, you have to be going to get a trade, you know, get a small trade.\nSo you're trading the max position for each market is small. And when you cut that in quarters,\nit's even smaller. So we're always doing these small trades, you know,\nalmost every day we're just doing really small trades. But like I said, we're holding them for\nlong periods of time. Hopefully as long as as long as we can, you know, we know that\nhuman beings don't like to hold on to things too long. They want to book a profit. It's a little\npatterned back. It makes you feel better about yourself. The smallest profit. Just a small little\nprofit, maybe make your day. And so we know we want to stay away from what makes us feel good,\nwhat makes people feel good, because that's kind of a secret to the market. You know, put yourself\nin situations where your win loss, your win percentage is less than 50%. You're willing to live with\ndrawdowns, you're willing to live with volatility, big profits, trading to small profits,\nbig profits thrown into losses, even. So we really don't try to do anything to manipulate\nit to make ourselves feel better. And the name of risk management. That's where I see a lot of\npeople go and wrong with silly rules. And if they just slap risk management on top of it,\nthey think they can get away with it. But I feel like the big money is going to be made and\nletting those profits run. And trying to in trading lots of markets. That's our kind of\ngo to. We can trade this strategy that really doesn't pay too much attention to volatility and\ndrawdowns, like most people do, but we trade so many different markets. One market's not going to\nhelp us that much or hurt us that much. Right. So if you're sitting down with an investment\nadvisor with an already diversified model portfolio, where are you putting TFPN? Is it\nkind of fits in the alt bucket? Or would you argue that it's probably like a bolt on to\nlarge cap equity exposure? Where would you like it to sit, ideally?\nTo tough question. Everybody answers this question to make the advisor feel better. But\nI think that we built it. You can put it wherever you want. You just understand what we're doing,\nunderstand why we think it's so great and how it is different. But we built it for as the core holding.\nI don't want to have anything in my portfolio that doesn't have a stop loss and a training\nstop and can get me and gear with the right trend. You know, bonds were not a good option\nin 2022. You had to be short. And so I'm that's unrepentant on that. We need to be short\nstocks and bonds sometimes. So for me, I'm too conservative. I'm an accountant kind of at heart.\nAnd I'm not going to trade anything or have a portfolio that's not incredibly diversified.\nIn gear with the trends, taking small losses all the time, habitually just taking small losses\nand letting those profits run and being in gear with the trend and not paying attention to\nwhat I think ought to happen in the markets. But looking at those price trends and using prices,\nthe only input. So we certainly built it as a core holding. But you know, I'm sure people say,\nhey, I don't want a lot of TFPM. We love it. I don't pay any attention to what Jerry says.\nI mean, being a core holding. It's 5% or 10%. I actually had someone this past weekend asking\nshe was a young person. She said, help me build my portfolio. And I was she had 60, 40,\nyou know, and I was like, oh, like 5% of KFPN. So I just can't make that decision for people.\nYou know, I sort of say, okay, even I'm going to be subject to what conventional wisdom.\nYou know, I don't believe it for myself. But I really believe that people have to make these decisions\non their own. We have clients who love trend following. They understand. They think it's the greatest\nthing ever. Nothing could be better. And then, but I guess to for most of our clients are\ngoing to be people who have a small percentage allocated to alt.\nYeah. So Jerry, again, thank you for your time. I appreciate you being here before I let\nyou go. Where can people learn more about TFPM and Chesapeake, and as well as yourself?\nThe best place to go is TFPMETF.com. That's all you need to know is right there with the proper\ndisclosure and Twitter. I'm on Twitter. I think RJPJR12. And yeah. And podcast like these. Thank you\nvery much for having me. Yeah. Thanks again, Jerry. Appreciate you doing this.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}