{
  "id": "15204348",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nToday we have on Burke, a Shendon from Innovator ETFs.\nWe talk about their new 100% downside protection ETFs that are coming out in July.\nThey have a six month one year and a two year.\nThey also have a vast suite of buffery ETFs, which we also get into.\nAnd we talk about how to maybe combine some of these to create some really unique outcomes.\nSo without further ado, please enjoy this episode with Mr. Burke Shendon.\nHey Burke, welcome to the show.\nHey Brad, thanks for having me.\nSo before you get started, why don't you give everybody a bit about your background and how you\nended up in the role that you are today with Innovator?\nYeah, thanks so much for having me excited to be here.\nMy current role is Head of Capital Markets at Innovator ETFs.\nMy background is grounded in ETFs.\nI'm started my career on the trading side at Virtue Financial, which is an ETF market making firm\nin New York, cut my teeth under some of those traders, learned how ETFs work, learned how to trade\non, learned a lot about liquidity.\nAnd then from there, came over to the dark side of the ETF issuers.\nIt spent some time in direction doing the leverage ETFs with that team over there, great team.\nAnd then joined Innovator a little over three years ago to start this to find out community\nof journey.\nThat's great.\nAnd so before we kind of jump into that, to find outcome, to find protection suite.\nI always like to ask people, what are you doing?\nYou're not working, not behind the desk, any hobbies, things you enjoy doing?\nYeah, you know, I made the move from New York City after eight years out west to California recently.\nSo spending a lot more time outside than I ever did in New York.\nSo I'd say hiking is something we do a lot about here.\nMirror Woods isn't too far from us, so we're definitely spending more time outside.\nYeah, I live in Pittsburgh, so I don't envy.\nI'm sure you are well aware of what the Northeast weather pattern.\nAnd so any time I can get out to the west side of the country,\nI'd always an enjoyable experience.\nOh yeah, I can be brutal, I know it.\nSo let's talk about Innovator ETFs, like as a whole.\nThe firm has a large suite of ETFs.\nI know they're siloed into kind of some different strategies.\nBut what do you want Innovator to be known for?\nWhat specifically are you guys really, really good at?\nYeah, so Innovator is a firm launched their first ETF in 2018.\nSo our founders were a Bruce Bond and John Suthert.\nThe original founders of PowerShare's ETFs.\nSo legends in the industry, they sold that business to Invesco.\nAnd the great story is one of them is pitched to structure note actually in their pseudo-retirement.\nAnd the light bulb went off and they said, you know what?\nThis is a gigantic market.\nIt's not necessarily touching advisors, it's more so insurance.\nAnd there could be a better way to structure these products in the ETF or Apple.\nSo 2018 launched our first to find out from ETF.\nAnd if there's one thing you have to know about Innovator, it's,\nthis is all we do.\nTo find out from ETFs is our singular focus.\nYou know, we pioneered the space in 2018.\nCompetition has come in, you've seen other issuers launched similar buffer products.\nBut when you pick up the phone, you call Innovator.\nEveryone at the firm focuses on this.\nSo we can serve ourselves experts, we're passionate about it, and it's all we do.\nSo let's talk about what to find outcome is and also what to find protection products are like as a whole.\nSo how do they differ and explain the advisors to really what they're trying to accomplish?\nSo to find out from ETFs are kind of the umbrella, you can think about that as like the high-level\ncatch-all for these ETFs.\nAnd we started with buffers.\nThere was buffer ETFs.\nWe launched a 15% buffer against the S&P.\nSo really simply in that example, over a one-year-out\nComp period, that ETF will give you a zero to negative 15% buffer against losses.\nAnd exchange for that protection, you have a cap on the upside.\nSo we'll call that cap 14%, which is about what it is right now.\nSo no free launch.\nWe give you that downside protection and exchange for that upside cap.\nIf the market moves below, negative 15% over that one-year-out\nComp period, you're going to take on any losses.\nSo I've just clicked numbers.\nIf the market's down 20, and a 15-buffer here in me down 5,\nif the market's down 10, and you have a 15-buffer,\nyou're going to be flat.\nLess expenses, obviously.\nSame thing on the upside.\nYou're one to one on the upside with the price returns by to that cap.\nSo that's kind of a structured note payoff.\nBecause we're that initiated.\nYou can kind of think of rylas in that kind of that part of the industry\nfor those types of payoffs.\nAnd since then, there have been so many different flavors.\nSo we have different buffer levels.\nWe have different indexes.\nWe start with spy.\nWe have a 9-15-thirty buffer.\nAnd now we have quarterly-out Comp periods.\nWe're setting every three months.\nWe have two-year-out Comp periods.\nBut if you had to know the really simple breakdown,\nit's buffers.\nAnd then we're going to talk about today, Define Protection,\nwhich is an extension of buffer, just a 100% buffer,\nwhich is sort of a new creation as the past year.\nSo each of your buffers are all quarterly.\nAre your Define Protection,\nwhich we're going to talk about today,\nare they also on the same quarterly cadence, or are they monthly?\nSo we, the out Comp periods can be quarterly.\nThey can be annual.\nAnd we actually offer different monthly series.\nSo Brad, you'll notice we have a ton of tickers on our website.\nOver 100 ETFs at this point, which is kind of crazy to say aloud.\nAnd the reason we did that is we want funds to be resetting every month.\nSo if advisors have money coming in throughout the year,\nthey can get in right at the start of that new out Comp period.\nSo for instance, our June series, just rolled a couple of days ago.\nSo P-June, P-J-U-Nos are 15 buffer there.\nThat just rolled.\nSo advisors bought in on that day one,\naround day one, and they can hold that for the entire out Comp period,\nand have that protection.\nIf they missed June one, and they want to come in in July,\nwe also have a series resetting at the end of June for July 1st.\nSo we have different monthly series rotating,\nand the out Comp periods are either quarterly or annual.\nSo how are these ETFs kind of structured internally\nin terms of the holdings? Is it there all outcome, or I'm sorry,\nthey all option packages?\nI mean, why don't we pick one, let's pick one of your new issues,\nand kind of whichever one you want,\nand we'll kind of talk about how internally that is built\nin order to achieve the objective.\nYeah.\nSo I guess let's talk about the defined protection,\nsince that's what I was hoping to cover today.\nThose are 100% buffer ETFs.\nSo you can think about them very similarly\nto our rest of our buffer suite.\nIt's a basket of options, is what it is at the end of the day.\nFlex options are what we use.\nFlex, you can just think of flexible.\nYou can customize the tenor, you can customize the strike.\nAnd that's what gives us that pinpoint accuracy,\nwhich is what allows us to deliver a defined outcome.\nWe get questions all the time,\ncan we just use list options?\nWhy do we have to use flux?\nCan we just use whatever is available on screens?\nWe certainly could, but we wouldn't have that precise nature\nof the defined outcome.\nI get you a 14 and a half buffer,\nand a 12.25 cap, but we want to deliver that exact buffer\nthat we state, so that's why we use flex options.\nYou know, peel them back, just how it works.\nWe use for the 100% buffer ETFs,\nit's three options in the basket.\nSo we have a deep in the money call,\nwhich gives us that one to one spy exposure to the upside,\nthen we have a protection.\nSo we buy and add the money put.\nAnd that gives us that full protection.\nNow, like I said before, there's no free lunch with this ETF.\nSo we have to finance that protection somehow.\nSo that's the third option leg.\nWe're in a cellical at the highest level that we can\nto finance that protection.\nAnd we're a restrike that call.\nThat's the cap on the ETF.\nSo let's talk about kind of like a one-year defined\nprotection of 100%.\nSo you've just released that June series of that one.\nAm I do I have that correct?\nThey're actually coming in July.\nSo I three come in, but we already have a couple out there\nthat were launched last July.\nThere were two year-out periods, and now we're taking them annual\nin six months.\nOkay, so for an annual, on the July,\nI don't know if you have the exact outcome period yet\nin terms of the cap.\nBut roughly, let's say that cap is somewhere in the 8 to 9%\nis that fair?\nThat's right, it's actually repricing above 9% right now.\nOkay, great.\nSo but it's not a one-to-one.\nSo if I'm an advisor buying this product,\nand I am looking to cap the S&P exposure at 9%,\nwith 100% downside protection,\nand the market moves up 9% in the first month in January.\nI'm not going to actually make 9% in the ETF,\nthat Nav is not going to move up 9%.\nAnd that's because of the time value of the option\nis that correct?\nThat's exactly right.\nYou can expect a lag in superior.\nSo the Defined Outcome is realized at the end of the outcome period.\nSo if you hold that until the end of the one year,\nthat Defined Outcome will be realized\non the last day of the outcome period at the close.\nNow what's people will always think about this with these types of ETFs,\nbut you have a Defined Outcome at any point\nduring the outcome period when you buy\nif you hold until the end.\nSo in that example, you give a client could also buy in halfway through\nthat when you're out compared at the six month mark\nif they like that payoff and they could hold it\nuntil the end of the outcome period.\nAnd still have it to find out come,\nit would just look different than it was on day one.\nAnd you actually took one of my questions there.\nSo is there a way, if I'm thinking through this,\nis there a way to kind of generate additional alpha,\nmaybe over the cap if the market starts the year highly negative,\nor is the cap the cap?\nThe cap is the cap, but if the market does move down negatively,\nyou're just going to have more cap.\nSo it has that seated cap on the first day of the outcome period.\nBut in that example, you gave if the market starts\nthat outcome period down 5% in the first week or two,\nyou had a sharp drawdown.\nThe ETF made trade down slightly.\nIt's not going to trade down one to one.\nAnd you may have some additional upside cap.\nSo you have three full down side protection ETFs,\nsix month one year and two year, they're launching in July.\nCan you talk about maybe how advisors look at them differently\nand maybe how they're using them?\nBecause I can see using a six month a little bit differently than the two year.\nSo how do you guys at innovator define kind of best practice\nof using these three different outcome periods?\nYeah.\nSo we were trying to solve for a couple of different problems\nwhen we launched these ETFs.\nLike I mentioned before, structured note world\nwe kind of uses our North Star when we're thinking about new products.\nAnd if you look at that space, it's been booming.\nFrankly, over the past few years,\n2023 was a record year,\nfor structured note issuance, over $100 billion.\nAnd principally protected notes were a humongous portion of that.\nIn fact, that's one of the biggest growth areas\nof the past two years.\nSo people love that idea of principle protection for their investment.\nAnd you can think about FIAs.\nYou can think about annuities.\nThose spaces have been growing significantly as well over the past two years.\nSo principally protected structures is what we were trying to target with this.\nAnd we resolved in a couple of problems.\nThe first is cash on the sidelines.\nWe talked to a lot of advisors.\nAnd they tell us that around 30% of the portfolio right now\nis in cash light or cash ETFs.\nIn our view, that's just too high.\nYou're getting attractive yields right now, five percent.\nDifficult to argue with a five percent treasury.\nBut we talked about taxes.\nTaxes are really important too.\nAnd you're getting charged ordinary income on that.\nSo that five percent yield becomes three percent.\nAnd people will always think about that.\nSo from our view, we're trying to help the advisors get cash off the sidelines.\nAnd these types of strategies are able to\naquatize cash with a full-down side buffer.\nSo no principal risk, but you can tie that money to the equity markets.\nSecond thing to is all-time highs.\nI was just talking to a colleague about this.\nAnd we've hit 24 new all-time highs in 2024,\nwhich is an astounding number.\nMarkets off to a rocket start this year.\nI'm up about 12% so far, year-to-date.\nAnd last year I believe you were around 26%.\nSo we've had it really good, no doubt, over the past two years.\nWe haven't had a 2% down day and over 300 days.\nI'm just going to keep throwing stats at you.\nThe market is over its skis.\nAnd I think people a little concerned.\nThe advisors we talk to are concerned about investing\nat all-time highs in equities.\nSo this is a perfect solution for those very conservative clients.\nThose retirees, those pre-retirees,\nto aquatize that cash.\nSo if I'm a model portfolio provider,\nand I'm looking to create risk-managed portfolios.\nLet's say something off of a 70, 30, a 60, 40,\nor even, let's call it a 30, 70.\nAnd my clients are in the growth stage of their life.\nThey don't need the income.\nIsn't there also, could there be an argument\nthat you could utilize some of these as a fixed income\nand volatility dampener in an overall portfolio\nrather than having to rely on the fixed income markets\nto reduce some standard deviation volatility\nMost definitely.\nThe use cases are numerous.\nIt could be a conservative equity allocation.\nBut with a 9% cap on the S&P over one year,\nthat's above the average S&P return when you look historically.\nSo that right there in and of itself\ncould be a conservative equity allocation.\nBonds we are definitely seeing used as a short-term fixed income alternative.\nLike I said before, you're getting a decent yield right now\nto fixed income.\nI want to deny that.\nBut taxes matter.\nSo to your point, if someone's going to hold this in perpetuity,\nthe cool thing about these ETFs is they reset within the structure.\nSo every year, or every six months or every two years,\ndepending on what ETF you buy,\nit's going to roll within the ETF wrapper.\nAnd there's no taxable event.\nYou're going to get a fresh downside buffer.\nYou're going to get a fresh upside cap.\nAnd we don't expect any distributions.\nAnd you get to choose as the investor when you sell.\nAnd if it's over one year, you're paying long-term capital gains,\n20%.\nSo when looking through the entire suite,\nyou've got various different buffers.\nYou've got 100% downside protection ETFs over multiple\ndifferent periods.\nI'm sure you can create.\nAnd I'm sure internally you guys have talked about this.\nSome really cool portfolios that have\nkind of broader to find outcomes by combining some of these in an asset allocation.\nCan you talk about that at all, or is that discussion?\nI saw briefly, and I didn't do enough due diligence.\nI hope you can talk through it.\nSome model portfolios you guys have that are on the site.\nBut I'm sure there's a way to combine some of these different products\nto create something pretty cool.\nYeah.\nI mean, no doubt that's where the puck is going.\nI think across the industry model portfolios.\nIt's just simple for advisors to implement.\nSo we launched our own off-the-shelf model portfolios on our website.\nJust because advisors kept asking for some sort of direction\naround how they can implement this in a model.\nSo if you go to Innovator Research,\nwe actually have model portfolios on the website.\nAnd we help advisors think about how they can implement these within that model allocation.\nTo your point, I mean, you could put the six-month with the two-year,\nand you get some pretty interesting risk return characteristics,\nor you could pair the 100% buffer with a 15% buffer.\nSo we'll either have a little bit more upside,\nthan just if you were in our principally protected,\ndefine protection ETFs.\nSo there's all sorts of different flavors.\nAnd we really try to simplify it in Innovator,\nlike I said, we have over 100 ETFs,\nbut we really think about it simply.\nIt's buffers.\nSo if you come to us, we can help you with that implementation.\nSo I know that there's a billion different use cases for these,\nand which makes them unique, I think they're great products.\nIf you're sitting down with an advisor,\nthough, with an already kind of static standard model portfolio,\nyou've got their large cap equity bucket,\nthey've got some fixed income in there,\nmaybe they're holding some allts.\nWhere are you advising them kind of first\nto start implementing a full 100% downside perception?\nI would assume that's in the cash bucket.\nI think that is your first.\nBut kind of when you're talking to advisors\nthat have already created a diversified model portfolio,\nwhat products are you trying to lead with,\nand where would you put them?\nSo right now, we're definitely leading with the 100% buffer ETFs.\nThe 15% buffer, we call their power buffer,\nis sort of our bread and butter.\nIf people are gonna try their first buffer ETF,\nthat's generally the most popular,\nit's kind of that sweet spot,\nwhere it could be hedged equity,\nand also just a core equity allocation,\nfor the defined protection ETFs,\nwhich is what we've been talking about.\nIt doesn't make a difference if you put a 5%\nor a 3% allocation in the portfolio,\nyou'd have a meaningful allocation to this,\nprotection to make a difference.\nSo we would say 20% of the portfolio,\nmaybe even 30% pulling from that allts\nthat fixed income in that cash.\nAdvisors, it was really interesting\nwhen we go back to COVID, and rates came all the way down.\nOur buffer ETFs kind of took on a new life.\nThey flipped, and people started to actually use\nthat our buffers almost exclusively\nas a fixed income alternative,\nbecause they were rates worth the time.\nThey need a more upside, they juice their bonds\nfor everything they could,\nso they use buffers as a solution there.\nSo we're starting to see that continue\ndespite the higher rates,\nthe caps that we have right now in these products,\nare really compelling.\nA 9% cap over one year has definitely garnered a lot\nof attention in the marketplace.\nSo what would the difference between a one year\nand a two year, 100% of or is there an advantage\nof using a two over a one?\nWhy not just let the one year roll over\nand having that flexibility at the roll period\nto be able to kind of either find something else\nor generate a new cap, what would compel someone\nto use it to instead of just roll on a one twice?\nIt's a really, really good question.\nAnd we got it a lot because we launched the two year first\nand folks asked why didn't you do the six month,\nwhy didn't you do the one year?\nSo a couple of reasons.\nThe first is, think about how markets work, right?\nSo your frequency of getting caped out\nis gonna be higher potentially with a shorter outcome period.\nSo with the two year, if the market skyrocket's 15% in one year,\nand then it has a lower return the following year,\na three percent return,\nyou're gonna get to capture all of that upside\nin the two year products.\nVersus, let's say the market, how often does the market\nactually return the average, right?\nVery rare.\nAlmost never see the average.\nNo, right.\nSo the market kind of goes like this.\nSo we wanted to deliver a product\nthat might have more staying power\nfor those kind of sideways choppy markets,\nwhich is why we started with the two year.\nThe one year out, compared to the nine percent return,\nis equally compelling.\nAnd that's for folks that might have a shorter outcome period.\nThey might have a shorter time horizon.\nIn the six month is just pricing really well right now.\nThat's JJL is the ticker on that one.\nAnd it's pricing around a 4.8 to 5% cap.\nAnd that is extremely compelling for somebody\nthat is looking for a true cash alternative.\nNo, I asked this question earlier,\nbut just for my knowledge,\nif it's a two year out-comperiod,\nand as in your example,\nthe market skyrocket's in year one,\nsay 15%, maybe you're only gonna capture\nseven percent of that upside.\nYou can put me wrong.\nThis is just the way my head's working.\nBut if the next year, it's up only 3%,\nyou're gonna continue to earn incremental nav\nup to that cap or close to that cap in year two.\nSo you might only get 30 to 50% of the actual return\nof year one.\nAm I thinking about that correctly?\nYou're right.\nThere will definitely be lag.\nYou're not gonna move one to one\nwith ETF during the outcome period.\nBut I mean, if you think about it,\nwhat if the market doesn't nothing for the next year?\nIt just stays flat.\nWell, then you're just gonna see that ETFs nav\nappreciate up to that cap, so it's just different flavors\nfor different folks.\nAnd it innovator, we just wanna give you\nthe broadest set of solutions.\nYeah, no, I love that because I'm thinking of a situation\nwhere if I'm a tactical active advisor\nand I think I have a flat, a pretty flatish view\nof what the market is gonna do that year\nand you have a two year to find outcome\nthat's got some growing to do.\nIt makes sense to add it because you know\nthat if the market does nothing that year,\nthere's gonna be some alpha there.\nSo it's interesting.\nI find these products extremely interesting.\nHow they work, can you just go through the six months\nthe one year in the two year July issues?\nWhat those tickers are and what the current caps are\nthat you're expecting in those products for July one?\nYes, J.J.L. is the six month product.\nAnd that's pricing and your 5% cap right now.\nZ.J. U.L. is the one year ticker.\nAnd that's pricing a high nine's close to 10% cap\nand then A.J. U.L. is the two year ticker.\nAnd that's pricing around an 18 to 19% cap.\nSo those are the three funds launched in,\nyou know, to all just to add Brad with these types of ETFs.\nWe talked about the structured note set of things.\nWe surveyed advisors and the big things\nthat they value are liquidity, simplicity, and costs.\nSo the ETF just wins on all of those fronts\nrelative to some of those legacy solutions.\nYeah, I was actually staying on that topic\nbecause having this conversation with a friend of mine\nand said this, the structured note, a business,\neven though it boom last year\nis going to be completely taken over by these things.\nThe liquidity's in the cost is just way too attractive.\nAs well as the flexibility, not to utilize these rather\nthan kind of an old-fashioned insurance-based structured\nnote product.\nYeah, I mean, when you think about some of the headaches\nthat come with those products, Phantom income\nis one that destroys people crazy.\nYou're going to hit with that in-trow computer\nwith some of those structured products.\nIf you want to sell out, you're probably going to cross\na gargantuan spread if you can even get out at all\nin the structured product.\nSo we talked about that lag earlier,\ninterprepared with ETFs.\nSure, it's going to lag on the upside\nif you want to exit before the end of the out-comperiod.\nBut having that escape patch for advisors\nis also really valuable.\nWell, Burke, I really appreciate your time.\nBefore I let you go, is there anything else\nyou want to discuss regarding innovator,\nany of these ETFs to miss?\nAgain, you guys have a huge lineup.\nAnd so I want to give you, make sure I give you the opportunity.\nIf there's anything cool, you guys are working on\nto share it with us now.\nYeah, Brad, I mean, thank you so much for the time today.\nI would just say that when you think about to find out\nfrom ETFs and you look at our broad suite,\nyes, it is a lot of ETFs, but the concepts are really simple.\nThey're just different monthly series,\ndifferent flavors of the same product.\nSo I would encourage advisors or whoever's listening\nto this call to go to our website\nand look at our tools.\nWe have spent a lot of time creating these tools\nto help simplify things for advisors.\nWe have a potential outcome analyzer tool.\nLet's see your outcomes based on that specific point.\nIt would you buy.\nWe have previous outcome analyzer tool,\nwhich lets you look back at older out-comperiods.\nSo the tools are there.\nWe have a sales team in each territory\nthat can help answer those questions.\nAnd like I said, this is all we do.\nSo I'm proud of it.\nWell, again, before I let you go,\nwhere can people actually get that information?\nSo can you give them kind of your website\nor any other research-based websites you guys have?\nYes, I'll point them to innovatorETFs.com.\nAll right, well, again, Burke.\nThank you so much for your time.\nI appreciate you being with us today.\nThanks so much, Brad.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}