{
  "id": "15249561",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, Chief Investment Officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nToday we have on Yang Tang.\nHe is from Arch Indices, and we are talking about their new issue.\nTicker VWI, the Arch Indices, VOI, Absolute Income ETF.\nIt is an all-in-one product that they use optimization techniques to try and drive the highest\nyield with the lowest volatility out of dividend paying stocks, as well as some fixed income\nsecurities and ETFs.\nWe talk about that low volatility factor, why it is important, and this product is really great\nfor those investors that are in or near retirement that are looking for yield and also looking\nfor a level of low volatility.\nSo without further ado, please welcome Yang Tang.\nHey, Yang, welcome to the show.\nHi, thank you so much for having me.\nSo why don't you tell everybody a bit about your background, and then how eventually you end up\nstarting Arch Indices?\nYeah, I'd love to.\nSo I started in my career in sales.\nI started in the commodity sales group at Barclays, and then I went to business\nschool Columbia.\nAnd after business school, I was recruited into more than standing in a group called\nMac Pro Solutions.\nAnd the idea of Mac Pro Solutions was to cover banks and share as asset managers for products\nthat were non-benefits.\nEverything bespoke, everything structured.\nIt was very much focused on interest rates, effects, macro products.\nAfter that, I had those in the same group at city where I met my co-founder, Dr. Jacob\nHuang, who was a PhD in math, and started a Solomon Brothers as a co-op in the 90s.\nAnd then I was recruited to Habik to start the same group in the Americas.\nAnd then I was recruited to create a agricultural to start the same group, also for the\nAmericas.\nSo my career really was on the self-site and working institution of clients.\nAnd what's really interesting about that is, you know, a lot of the clients are investors,\nbut they're not investors in the way that many people are investors.\nThey're investors because they have a purpose.\nIt's really called a liability driven investing.\nSo if you think about an insurance company, the goal of an insurance company is to meet the\napplications with its live volatility spots.\nSo very rarely is the, you know, the return, the main fact is the return and context of volatility\nexperience as well as the capital officials.\nDuring COVID, you know, my co-founder and I were kind of talking as more as friends.\nAnd we came up with the ideas how to build a better portfolio.\nAnd the genesis of what we do is pretty much all pass the portfolios out there,\nare either market cap or, and if you think about this, historically market cap was actually\nnegative, I factor, right?\nIf you look at that to research, small caps are thrown out perform large caps over a long period\nof times. Of course, the last 70 years is not a good example of that, but nonetheless,\nthe way people try to correct for that is to look at people.\nSome of the most interesting charts will see us at equal weight versus market cap weight,\nS&P 500. But when you think about it, you know, those are just one and two ways of waiting\nfor a portfolio, we're not to build something around waiting for a full risk adjusted contribution.\nAnd this takes into account a little bit of the modern portfolio theory of, you know, the optimal\nportfolio and where the efficient frontier is. So what we do in waiting is really to look for\nthe efficient frontier of assets. And that's filled with the idea of risk adjusted contribution.\nSo we launched, we started the company August 2022. We spent about the first year as, you know,\nyou as an ETF entrepreneur will know it's a, it's a bit of a lift to just start an ETF.\nIt's a lot more than the 75-day filing period. So we built a lot of intellectual property.\nWe put everything together, ETF wrapper. You know, we actually custom index ourselves,\nwhat they third party Calcation, but it was a wonderful partner for us. And we launched the\nincome ETF last October. And the income ETF really is tickler VWI. What it is is combined\ndividend stocks and bond ETFs, it uses our optimal way to do risk adjusted contribution.\nAnd it looks for the most amount income you can get and the least amount of vault.\nSo I guess that's a kind of a long way to jump into our ETF as well as my career back then.\nYeah, sure. So we're going to get into all this because I do find this\nvery interesting and appealing. But I always like to ask people before even into kind of a nitty gritty\ninto the business side. Any hobbies? What do you like to do when you're not working?\nYou know, I think if you use an entrepreneur will know, this thing consumes almost every\nweighty moment of your day. You know, outside of work, my wife and I love the arts theme to\nculture scene as well as I'm a big San Francisco 49ers fan in a big San Jose Sharks fan.\nSo those are very consuming although I'm at the point of life where, you know, I used to watch\nall 16, 19 or 17 Niners games on Direct TV. Now I'm down for about four, you know, one of\nsomething like that game, one of them Monday night. Yeah, you and I both are kind of football and hockey\nguys. So it's good to know. So we talked a little bit about our genesis as a whole. I kind of the audience\nprobably knows what you do. But let's get into really, I think the intellectual property and the IP.\nCan you talk about what like variance optimization is and just what it is and how it can help\nbuild better portfolios. Yeah. So the idea of an optimization actually came from the modern portfolio\ntheory, what Harry Marker was. He introduced the idea, I think, in the 50s. So realistically\noptimization is not a new idea, right? It's about as old as, say, you know, the tabular computer\nand the first computer. The idea of an optimization is, you know, knowing what the world looks like,\nhow do you build a portfolio that achieves your goal, whether it's total return and come,\nyou know, a price return and also have to lease to mount a volatility or other\nconstrained factors. So, you know, the way an investor would think about it is, if I have two\nportfolios and they both have the same return. I love, of course, the least volatile portfolio.\nYou know, and there are some people that want to go along with the opposite of that.\nI want as much volatility as possible. But a rational investor would generally say,\nI want the least amount of portfolio is a buying whole investor, not a political trading\nmentality. So that's what it is. The optimization is actually very technical. So if you think about\nNPT and tail, right, it entails a linear algebra approach, which is the covariance matrix.\nAnd that's taking into account the volatility multiplied by the correlation,\nand essentially linear algebra format, and using a solver to hit that, you know, waiting,\nlike, waiting scheme. That's actually a lot of people don't realize the modern portfolio theory\nis actually very flawed on that perspective. The first flaw is it expects you to, as a human,\nthe run expected returns. You know, no human I've ever met has had any level of consistency\nin expected returns. And fun fact, even when I was in, you know, the sales and trading side,\nthe market side of the banking world are best traders on the trading floor, had on average\nlow 50s in terms of win rate. Right. So let's separate in a good trader from an unemployed trader\nwas this idea of risk management. You know, I've met traders that are right about one in three\ntimes, but they're extremely profitable because they know how to manage risk, control risk,\nand maximize opportunities. So that's going to be, you know, the the active approach,\nwhere you take an optimization approach, which is really kind of passive with a factor.\nSo we did a few things. The first thing that we did was we don't view expected returns\nbecause that's crazy. We look for some kind of output that four relates to total return.\nAnd if you think about this using our, you know, income fund as a case study, most income\ninvestors will correlate yield and total return. Right. Because a lot of income products that\nlittle to no price appreciation potential and even dividend stocks or somewhat limited\nin price of potential, price appreciation potential relative to more speculative stocks or,\nyou know, more growth stocks. Moving on about that later. The second is, you know, people think\nof the idea of, you know, expect the volatility expected correlation. We kind of corrected for that\nby using market observability, market observability. And really the last thing that I think\nif the huge differentiator, what we built is we don't use a covariance matrix. We use something\ncalled a recursive approach. So a recursive approach does, it solves for the flaws of a matrix\noptimization. And, you know, once it doesn't take a linear algebra, it takes a profile starting\nwith two assets. That becomes one portfolio. Right. And then you continuously and recursively add assets\nuntil adding more assets does not want decreased the expected volatility or number two\nincreased the expected output. So in essence, what you're trying to do is think of it as what is\nthe optimal path in a large number of assets. And just to put this in perspective, the hardest\nthings that's plenty of this to people is people are used to, you know, two dimensional charts.\nPeople like to see one graph. Right. People love to see, you know, I use a chart for a\nrelation between the S&P 500 and 30 year bonds. Well, guess that's just two assets. And RETF alone,\nthere's 600 available assets between dividend stocks and 12 bond ETFs. 600 assets gives you 180,000\ntwo portfolio permutations. So what is the out of that 180,000 permutations? How do you use that to\nbuild the poor and poor optimal portfolio? And of course, there's no way to visualize. Right. Like,\nI mean, you would just, you know, your eyes would blow out if you, you know, try to look at two\n180 graphs. You have to use a bit of a map and that, and getting people to understand that.\nHey, talk about that. Is that really the power of our product? Yeah. And I want to get into the\nproduct. But let's just stay on volatility management here. It just did a high level. We talk about\nthe power of kind of keeping ball suppressed as much as you can, a portfolio. And you would\nmention taking, you know, two total returns of the same amount, one with lower volatility,\nright, an investor would want a logical investor would choose one that's got a lower volatility\ntilt. So, but what though mathematically does reducing volatility in an overall portfolio do to long-term\nreturn outcomes? Yeah, I think pretty much every study has shown two. Number one,\nit's near impossible to time to go. And number two is people are really exposed to sequence\nof return risk. This is probably most relevant for a withdrawal portfolio, such as a retiree,\nbut even, you know, for someone who's accumulating assets, sequence of return is, you know,\nit's not just a mathematical concept, it's also psychological. So, let's start with kind of the\nidea of tiny markets, right? You know, I think it's very, you know, you've met a lot of people,\nI think either probably in the social media space or talking heads, and they talk about signals,\nall these things, it's almost flawed in some bubble, because no one has consistently shown\nbeing able to time the market. And I think it's very, and the obvious and hindsight,\nwhat in market bottom and a market top is, but, you know, I think if you were an investor say\nduring the recent experience of COVID, right, you know, the stock market crash almost 40% from\nFebruary to March. If you thought stocks in February and you've sold out of panic in March,\nthat certainly was poor. Just conversely, right? If you bought in March and then you went through\nprobably three more phases of volatility over the summer of 2020, 2021, you know,\nprobably the biggest debt hike. You've experienced significant volatility and it's not\nclear that every investor has the stuff to have high volatility. So reducing volatility,\nnot timing markets itself makes it a portfolio more palatable over the long run. And the key,\nI think, of course, is not sacrificing returns in the process. So that's another important\nthing, but the first is, you know, being invested in the market, staying in the market,\nhaving to write a amount of, you know, tolerance and getting the most returns for that level of\ntolerance, is really what keeps people and makes people get invested. The second is volatility\nrisk is actually very real for people that have a certain goal. So if we talk about retirement plan,\npeople talk about sequence of returns. And, you know, you can have the same amount of returns\nover a portfolio and in a long run, the portfolio values are the same. But if you experience,\nyou know, positive or negative returns early relative to later, that impacts number one,\nthe amount of money you have for that goal and number two, the amount of money you can withdraw over time.\nSo as any retirement planning person will tell you, you want to reduce as much portfolio risk\nif you are having a specific goal. And that of course applies for accumulation as well.\nYou could be saving for a house, right? And, you know, instead of putting your money into a 5%\ndetail, you know, maybe you want to put a little bit of this thought market to get extra returns\nto stay invested while you look for the house, because you just don't know when that perfect house is going to come.\nSo why not have a little bit of extra returns? But at the same time, you don't want to be so\noverexposed to risk that the house comes and you go, oh, shoot, I just took a 10% draw down,\nyou know, by my hands, right? Yeah, of course. So let's talk about the ETF,\nVWI, it's the arc indices, VOI absolute income ETF. And from the naming convention, I thought\nit was going to be a fixed income product until I started reading more. So this will be good.\nLet's just talk it at a high level. And then we'll get into kind of the details. What is this\nfun really trying to accomplish? Yeah. So the idea of this fun is to do two things. It's to generate\nincome, really it's targeted towards income focused investors. And the second is is to reduce volatility.\nSo you want the most amount of income and the least amount of all. And we do this by using two\nkey assets, which is dividend paying stocks and bond ETFs. So we have a screener approach for\ndividend stocks. We have minimum market cap, minimum daily average trading value, minimum yield\nand minimum regular dividend investor. And of course, just to note, that's actually the\ncriteria for inclusion. We don't exclude assets. If they don't, if they reach those criteria,\nsilly because that would actually create volatility instead of reducing wealth. And the second\nis, you know, we combined that with 12 bond ETF we picked. Tell the number our low cost,\nmissing card ETFs, and the other two are products that are very, I think, beneficial to the portfolio\nof Vanguard this time. Yeah. So the idea is, well, how can you mix that? You dynamically\nrebalance every quarter to catch up with changing market conditions. And, you know, if the majority\nof the assets are traditionally different in stocks, which also have potential for capital appreciates.\nSo the idea is, generous, much income is possible. Have to potential for capital appreciations\nand have to lease the amount of volatility engaged. So do you have a target role you're trying\nto achieve when you start building out the asset mix or is it just, and do you have a yield target?\nLike, how are you kind of honing this in to try to optimize it to get both the lowest volatility\nand the highest possible yield? Yeah. So because this is a dynamic product, there is still specific\ntarget. So right now, the index yield is probably 6.8% when we rebalance the beginning of\nme, and it's historically been probably high five from the low side to over 7%. So you're probably\nreally thinking about calling a 6.7% type product. The volatility, so I think that one of the,\nyou bring a really interesting point, Brad, is kind of targeting volatility. I think anyone who's\nbeen an investor will not lose low volatility periods and high volatility periods. So one thing\nthat we don't do is we don't introduce leverage in this product. So without, you know, using leverage,\nyou can not achieve the right volatility target. So an essence is, it's just looking for the lowest\namount of volatility in today's market. And it's really beneficial because, you know, there's\ngoing to be period where you cannot achieve low volatility. Right, if there was the March 2020,\nyou know, or October 2008, there's just not a whole lot you can do if you want to stay invested.\nAnd you should stay invested. You shouldn't give up because volatility is high. And you shouldn't.\nSo if you were targeting volatility, right, because volatility went up, you would have to reduce\nexposure, which actually leads to adverse outcomes for investors. And just by the stop, the same kind\nof coin flip, you know, if time for a low, like 2019, 2017, so forth, you shouldn't leverage,\nright, because leverage, increase the exposure volatility as low, generally will give you adverse\noutcomes if volatility spikes. Interesting. So we have, you explain the kind of the screening\nmechanism to be able to get to a universe. Now, do you dwindle down from that screen? Because you\nsaid it gives you about 600 names. Are you, are you then dwindling it down to a more concentrated\nset of holdings or are you using all of them? So yeah, so those are the criteria for inclusion.\nSo if you, the one we actually do optimization, if we don't actually target yield directly,\nwe target something we call the performance ratio, which is yield relative to asset volatility.\nSo what you want is you want a lot of assets that have extremely high yield relative to its\nunderlying volatility. So that doesn't mean that you want 26% dividend pay stocks, right? You want\nsay something that has high yield, but also extremely low volatility. And the second is the second\nlayer of defense is looking for assets that don't move together. So of the 600 available stocks,\nI'm going to need to get a moment on the low end. The optimization will only include about $0.75\non the high end. It could be about $1253. We're probably about $1.18 right now,\nwhich is on the high end. So in this process, what's great is, remember what it'll dynamically\ncatch when things when stocks change. Because, you know, as you know, in a market participant,\nno stock has gone from 100 to 0 over. Right. It's taken massive drops. It's bounced back.\nIt's introduced a lot of volatility on that process deal. So when the volatility, the asset\nincreases naturally, it's not attractive for our frame. So the optimization will go,\nalthough you're doing 5%, you know, yield at a 10% volatility, but now you're doing 7%\nyield at 20% volatility, right? That naturally is on attract. So you will be de-inphasized all those\nbeing. Yeah, I was conversely somebody I could go from 5% volatility to 10% yield to say,\nyou know, around your 4% volatility, or sorry, 4% yield, and maybe 3% volatility,\nthat actually becomes extremely attractive from a performance ratio perspective.\nThat makes sense to me. So you've now dwindled, you've, you've, have your inclusion universe,\nyou dwindled it down to 75 to 125 names. Now the waiting process would kick in. So on a quarterly\nbasis, you're running a new optimization to figure out what the new weights are, is that correct?\nThat's correct. So we dynamically rebalance what changing market condition. And do you put any\nguardrails inside of that optimization, or around the rebalance to kind of put any guardrails on\nsector or industry concentrations, or are you allowing the process and the optimization,\nit kind of take you wherever you need to go. So we allow to take a wherever we need to go.\nI think, you know, over time there's been, you know, some kind of sector changes.\nIt's actually quite, it actually captures sector changes quite well. So in that may reap balance\nas an interesting point, it's almost 50% between bond ETFs and BDCs. And that's actually\nquite noticeable because number one, correlation between stocks and bonds have been dropped in\nall year, and bond volatility actually declined by after. Whereas if you look at kind of our\nOctober rebalance last year, even though yields on 30 year bonds probably hit gosh decade high in\nOctober, it actually did increase its allocation to bond ETFs. So, because that increase\nin yield came with an increase in volatility. So that thing was interesting about the performance\nratio. It does a pretty, I think it does a pretty strong job of getting by itself the sector\nallocations and the diversifications currently. And I think, you know, it's important for investors\nto appreciate that sectors are really a human invention, right? It's not like when you think about\nit like, you know, Facebook is in the communications sector, right? While Microsoft is in\ninformation technology, the semester car are in the financial sector. So by itself, you can make\nan argument that perhaps master car is more of an information technology company. It may be\nFacebook is more of an, you know, information technology company than say some things, even in\nthe information technology sector. So I think it's important that, you know, like the investor,\nit's not too hung up on having just a quote of quote sector allocation because of all the underlying\ndynamics that happens within companies and what they set. So you mentioned you have fixed income\nexposure. Somebody Vanguard to others. Can you talk about what types of fixed income exposure\nyou're targeting? Is it traditional fixed income? Do you have some other things in there\nthat might generate some more yield like CLOs? You know, can you talk about the fixed income\nside? Yeah. So we try to, yes, close to the, you know, I guess the broad investment bond index\nfor dollars. So it's going to be, you know, the different duration sectors of both ICHE\ncorporates as well as US government bonds. We do have AAA CLOs. So yes, we do have security\nas product exposure. We have mortgage back exposure as well. It's not always included. So we only\nhave actually eight or nine bond ETFs in the moment. And then we try to, we just try to capture\nas much of the dollar bond investment universe as we can from a pure sector approach. That's\nactually a big area where the ETF industry has not quite caught up to perhaps the overall broad\nasset management industry in terms of products offered. But in general, we want to, as long as the\ncost and the exposure is correct, we want to be able to conclude it into our firm because having\nmore assets is generally beneficial. And then I think, yeah, we have a B&D, we have a short term,\nyeah, we have a USHY, which is the other non-banned carbon, which is the high yield exposure.\nSo we're trying to capture as much exposure as we possibly can. So how often is VWI kicking off\nincome is it a monthly distribution? Yes. So we pay income as we receive it. So the US federal\nworld likes to pay on the March, June, September, December. Those are generally the biggest\nmonths for dividends. And then, you know, that you always actually, the lowest month, because\nit's the shortest amount out of calendar days. And tradition, not a lot of companies pay dividends\nthen. So, you know, you'll see a little bit of fluctuations, but it's a month with them.\nSo here's the, the million dollar question, right, is you, you have an advisor that already has\nexisting diversified model portfolio. And just listening to you talk and what it's trying to\naccomplish, like it could theoretically, in my opinion, be something where you could run an SMA on\nkind of your entire portfolio and just have it be a standalone. But you and I both know that that's\nnot how the, the average investment advisor RA is kind of running their book. They like a diversified\nmix of assets. So if you're sitting down with an advisor, where are you suggesting that this\nexposure sits and kind of, how much exposure? I know that's a, that's a loaded question,\nbut kind of where would you put it and how would you advise them to use it?\nYeah, so we have actually gotten the most traction with a retirement plan in focus devices,\nwhich is no surprise, because our ETF, if extremely well suited for inflation risk, because of the\npotential for capital appreciation, as well as dividends growing over time. And the sequence\nof returns, which is reducing volatility. So it does very well there. It's, you know, an all-in-blind\ndynamically-rebalanced portfolio. I, of course, would use it for 100%. But that being said,\nyou know, it's pretty good, I think, as a 440 within retirement income portfolios. And then\nallowing advisors to, you know, put in different exposures, different assets on top. So I think,\nyou know, the part of the part of the part of this is how much income you absolutely need for retirement,\nwhereas I think someone with, you know, a hundred million dollars for retirement is very\ndifferent than some one million dollars for time. So if you're a one million dollar retireee,\nthis can make up, you know, all, if not most of it. And then maybe you add in some different\nassets, exposure to either one further reduced volatility or gain some level of additional\ncapital gains. If you're a hundred million dollar portfolio, I would still think this is a\ngood part of your whole list, but maybe you want something that has, you know, more kind of capital\nappreciation bent to it. So you can leave your errors or, you know, your charitable foundation\nwith more money. Um, essentially, we're discussing this with, um, both a pension fund as well as\nthree and downs at the moment. It's also well used on the, you know, institutional space. The second\nplace that we've talked a lot of people about is what they call a courtesy account. I think a lot of\nadvisors have, you know, accounts that just don't meet their minimum thresholds, but they don't\nwant to turn away. So, because, you know, those six accounts have, you know, relationship value\nor, you know, they are a growing account. Uh, so this is a good place to as an alternative for,\nyou know, someone who is new to investing, who's accumulating assets, who doesn't understand the amount\nof personal risk tolerance that they have to perhaps put in 50,100,000, get a sense of their\nmarket feel, and then one, either later scale that into a strategy or, you know, transform this\ninto something else. Um, the third place is really for moderate and kind of conservative allocation\nportfolios. Whereas, you know, if you use a moderate or conservative allocation portfolio,\nyou have some level of stocks and bonds being mixed together. Uh, this kind of does that when\nwe balance it for you and takes away an additional layer of either, you know, operational household\nor reducing fees from not having to pay multiple ventures for essentially the same exposure.\nYeah, it should have asked us earlier. My apologies. I didn't. Is the ETF the only way to access\nthe strategy or you guys working, have outside the ETF providing, you know, model portfolios or SM\nas, um, does that part of your business? Yeah. We, uh, we have to have a partnership with a company\nhealth course. We run our SMase through their platform. So they've been an excellent partner for\nus. They have tax loss harvesting. So we have definitely those capabilities, uh, at the moment.\nThat's right. So I want to ask the question just because you're, you're a new issuer, um, you know,\nwhat was that decision like to jump into what we call like the ETF Thunderdome, you know, there's\nthousands of them now, um, and how are you going about kind of getting the word out and telling\nyour story? Yeah. So there was a, you know, let's start. And, you know, we started this as two people\nthat have or not traditional asset managers. So we came into this building with an intellectual\nproperty approach. And we started this ETF actually at zero. We didn't, there was no see,\nthere was very little if any, um, kind of pre-marketing or socialization. We just really want to do\nthis as a proof of concept for our business. Uh, so yeah, it's, uh, it's an extremely competitive\nfield. Uh, we think our product is differentiated, but at the same time, you know, being the first\ntime to make sure, being a new issuer, there is just a level of, I think, you know, while climbing\nyou have to do. Uh, so I think it's been, it's been a certainly very strong, uh, learning process\nfor us. In the beginning, I think we were a little bit over-focused on, uh, certain marketing strategies\nthat may have not, well, that what we were too early for. We've actually gone a lot of traction just\nusing the, using this as a retirement planning portfolio, engaging with people that are either\nindividual retirees, uh, or retirement focused devices. And I think that's where this type of product\nis, I say, low volatility income generated product, um, this time a good reception with, you know,\nsmaller and downwinds, uh, and also also to find kind of, uh, contribution plans. Um,\nthat's where if we also, I said, part of our business, we're planning to release analytics,\nso people be able to access our optimization and our tools as they solve for package, uh,\nsurely on our website, which is going to be, uh, probably have that out right around the fourth\nyear long. That's great. Uh, I'll definitely get in there and check it out. Speaking of your website\nand Yang, I really appreciate your time with us today. So where can people learn more about\nyour company and where can people learn more about the ETF? Yes. So the, uh, it's, we have a website\nread direct by the service. www.ff.com. It's got the landing page and the information for our ETF,\nour fact sheets on there, um, the perspectives on there are everything that you would like\nas on there. We have our research learned in sites linked, uh, and our main corporate page is arch\ninto seas.com. And that's where you're going to find our tools. Yeah, we can also reach out to\nus, um, you know, there's a contact page on both of our websites to reach out. Uh, I'm on LinkedIn.\nI'm on Twitter. Um, so anyway, people want to engage, uh, we're more than happy to do so.\nWell again, thank you so much for your time. I appreciate your being here. Thank you so much for\nhaving us. Then a pleasure.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}