{
  "id": "15290519",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, chief investment officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they can\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nToday we have on Danielle Gilbert, she is from Panagram, and we are talking structured credit\nand collateralized loan obligations, better known as CLOs.\nThey recently launched two ETFs, CLOZ and CLOX, one investing in bees, the triple bees, the\nother investing in the triple A-trunch.\nShe does a wonderful job educating me as well as all of you, as to what structured credit\nis, and specifically what CLOs are, and how they can be a great compliment to traditional\nfixed income inside a diversified model portfolio.\nWithout further ado, please welcome Danielle Gilbert.\nHey Danielle, welcome to the show.\nGreat to see you, Brad.\nI'm so happy to be here today.\nBefore we get started, always like to know what's your background and how did you eventually\nget into your role here at Panagram?\nAm I saying that correctly?\nYou are, yes.\nOkay, so a little bit of background on me.\nI am a group of Midwest, suburbs of Chicago, studied engineering, as always, you know, math\nand science type of person, and I loved New York City.\nI found myself a Ravden New York City in the early 2000s, and had an opportunity to join\na training program at UBS.\nNow UBS at the time, this is pre-goval financial crisis in the early 2000s.\nThey had a massive training floor, and I don't know if you're even aware of the straight\nfloor.\nIt was in Connecticut, two football field size, a very exciting time to be starting a sales\nand trading career, and in that program I actually ended up specializing in structured credit,\nwhich at the time was very niche, and I picked it because I was actually scared that everything\nelse would soon become automated.\nI remember I came from more of an engineering background, so I said, I'm going to pick\nsomething really complex that they're still going to be a need for human interaction.\nBut it was actually, well, time because that market has grown to what it is today, which\nis very institutional, but I had a front seat to that growth.\nSo my role was, as a salesperson, covering portfolio managers, sophisticated portfolio managers,\nthat had pools of capital that they were allocating to structured credit.\nSo I was in pre-GFC, during the GFC post, along career in that type of opportunity of settling\nand covering those types of sophisticated clients.\nNow, it was in that role that I met the panogram team, so they were working at Eldridge,\ninvesting capital on behalf of Eldridge and the affiliated balance sheet.\nThey were one of the largest players actually in the C alone, investing marketing, continued\nto be today, and I was covering them as a client.\nAnd they came to me and they said, we're launching a new, we're spinning out of Eldridge,\nand we're launching a new platform called Panogram.\nWe have size and scale, but we're going to introduce ourselves to third party investors.\nSo this was interesting because this was a pretty big pivot, and I had been, I've actually\nbeen approached in the past to do this type of opportunity, but it wasn't until this\nteam actually came to me that I thought it was attractive, because, first of all, the people,\nI think you always have to lead with people.\nThey had a great reputation in the market, I enjoyed covering them from the client perspective.\nThey also had an advantage because they were one of the larger players, and I thought this\nis going to be an interesting way to launch a new asset manager.\nWe're not launching from scratch.\nWe actually have expertise, and we're in this market every day.\nWe're just new to the outside world, so I jumped on the opportunity and started when\nwe pretty much launched in 2021 to that side of the world in the fall of 2021.\nSo it's almost three years ago to lead up business development and to solve that, how do\nwe grow from there?\nThat's great.\nBefore we get into more about what Panogram does, I always have to ask, any hobbies, what\ndo you like to do when you're not working?\nOkay, so I did a little bit of prep, and I listened to your podcast before, and I laughed\nwhen this question came up, because I was like, oh my gosh, how am I going to answer\nthis one?\nSo I have three children, and I live in New York City, and I obviously have this big\njob that's demanding, but I do have a life outside of work, it just happens to revolve\naround my kids.\nSo my family, which I love, the major engines are 14, soon to be 10, and just turned eight.\nIt's very important when they're that little to kind of quantify it that way, but I would\nsay in the winter time, you'll find me at the bottom of the ski mountain, because all\nof my kids are ski racers, and growing up in the Midwest, where it's very flat, I had to\nlearn how to ski, so I did that a couple of years ago, and I'm still kind of hanging with\nmy kids.\nCertainly will not be at their level, maybe anytime, sooner ever, that's okay.\nAnd then I do other random things, like, because we live in the city, my kids go to school\nin the city.\nI come forth, like a couple of weeks ago, I signed up to be a guest of my daughter's second\ngreat class, and it was funny because you're supposed to talk about what you do for work,\nand I was Googling and using AI to try and figure out what would be fun to describe\nto kids finance or finance investing, and there were all these different ideas and some\nwere great, some were really boring, and I tossed them all, and I said, I'm going to teach\nthese kids how to make balloon animals, because that's fun.\nAnd the whole point was, you can learn anything, even complex things, you can teach yourself,\nit's available, and it was actually a big hit.\nMy daughter was proud that I didn't talk about finance, and then I taught them how to make\na dog at a balloons.\nExcuse me.\nSo, that's a little bit of what I do outside of work.\nSo, it's funny, my seven-year-old daughter, so she's going into second grade, and even\nthough, like, yeah, I do all the sales and trading, we run a billion to an asset.\nShe's like, my dad's on Spotify.\nIt's really, he's kind of, it's really cool, he's on, I'm like, that's fine.\nJust tell everybody I'm on Spotify, oh, that's great.\nTell everybody I'm on Spotify, it's all good.\nIt's funny.\nAnyways, let's get back to Panogram.\nSo, can you kind of walk through how you guys are helping clients, I know you do a number\nof things we're going to talk about the ETFs you have, or can you talk about the firm as\na whole?\nAbsolutely.\nSo, Panogram is a specialized structured credit asset manager.\nThey manage about 17 billion in assets, 16.8, rounding up, and more than half of that\nis in CLO related investments.\nWe're big investors in CLO bonds and CLO equity.\nWe're not a CLO manager, it's very important distinction.\nWe actually specialize in investing in the management of CLO, so the structure.\nAnd the team, the investment team has been working together since 2014.\nThey first started when Eldridge was being formed, managing the assets for Eldridge and\nthe affiliates.\nNow, one of the larger affiliates that Eldridge owns is an insurance company that requires\nbook yield, healthy book yield, prudent book yield, and that asset was growing, and the\nteam that while they were sitting with Eldridge, they kept deploying the capital to ensure\nthat they had that stable book yield.\nThen, in 2021, with the demand from outside investors, the team spun out to launch Panogram,\nand that was really to add other investors to the access point that they were already providing\nfor Eldridge.\nSo today, what we do on the institutional side is we do specialized SMAs.\nSo we have banks that want to access AAA CLOs, which is a great asset for banks.\nWe have customized SMAs with banks.\nWe have customized SMAs where people want to explore other structure credit in addition\nto CLO.\nSo, what we're going to talk about today, which I'm excited about, was we launched our first\nsuite of wealth products in 2023.\nAnd we saw this as an opportunity to bring access to everyone in the form of the ETF.\nSo in January 2023, we launched our first CLO CLO Z, and then in the second half of last year,\nwe launched our second CLO ETF CLO X, which I know we're talking about today, but this\nwas something that we thought, we're already in this market every day, we're active,\nand this is a way to kind of expand into a wrapper that provides more broader access.\nSure.\nAnd let's take this moment to kind of do a little bit of education, because we talked\nto a ton of RAs, and not a lot of them are utilizing structured credit in their practice.\nSo can you just explain what structured credit is and how it differs from traditional\nfixed income investing?\nYeah.\nSure.\nAnd that's a common question that comes up.\nI think the name actually sounds more complicated than it really is.\nWhen you think about structured credit, it's a way to access a diversified pool of contractual\ncash flows.\nSo think of anything that you can put together that has a contractual cash flow, that\ncould be mortgages, it could be credit cards, it could be corporate loans, which is what\nwe're going to talk about today with CLO's.\nBut these products were really started probably, like in the 1970s, I think it's when\nthe first mortgage-back security was created, and then it was credit cards and evolved\nover time.\nCLO's were created in the 1990s.\nBut at the end of the day, it's taking a pool of contractual cash flows, and then creating\ndifferent risk profiles for investors to invest in those products.\nAnd it's a growing asset class and institutional clients love the ability to have that\ncustomized exposure.\nAnd the companies love it because it's another way for them to fund their businesses.\nSo a CLO or collateralized loan obligation is a one-facet of what would be structured credit.\nIs that correct?\nThat's right.\nIt's a category of structured credit.\nAnd I think it's important if I talk about CLO's right now is the way that I like to\nexplain is CLO is the first kind of start with what it is.\nSo remember, structured credit is contractual cash flows.\nBut you want really good quality cash flows.\nAnd there's three common misconceptions when somebody will ask, like, what is a CLO?\nAnd the first thing that they go to, and I'm saying this is in truth and honesty, is the\nbig short.\nThey either have seen the movie or they read the book or they lived in the global financial\ncrisis, but they just assume isn't that the product that blew up everything 2008?\nAnd the Jenga box?\nYes, exactly.\nAnd the exact of the Jenga box.\nAnd although the structure seems similar when I'm going to explain it, it's very different\nbecause of the collateral.\nThat was some prime collateral.\nIt was consumer risk to consumers at work and a pay.\nRemember, their contractual cash flows.\nIf the contract isn't good at the cash flow, component, it doesn't matter how you slice\nand dice it.\nIt's not going to end very well.\nIt's a bad movie, right?\nIt's a sad ending for all those investors.\nCLO's actually performed well during the global financial crisis.\nBut then the other two misconceptions that people make is it relates to CLO's.\nIs they see the yield or the credits spread and they say, oh, it must be risky.\nIf you're getting that much, there's got to be a ton of risk.\nAnd if you look at the historical history of the defaults, and you see how resilient CLOs\nhave been since the early, since when they came, they early launched in the 90s through\nthe global financial crisis, but through other crises as well.\nI think the third misconception, but this is really more new as it relates to the ETF\nwrapper, is people assume they're liquid.\nAnd in fact, that's also not true, and that's been defended through a lot of volatility\neven in the recent years.\nBut I guess I should probably explain what a CLO actually is.\nNow that I've gone to what it is, it's a CLO collateralized loan obligation.\nLet's start with the L, the Lone.\nThe Lones are senior secured loans.\nThese are loans to corporations, big multinational U.S. companies small pieces.\nI'll give you some examples American Airlines, Restoration Hardware, Formula One, names\nthat you're going to be familiar with.\nThe reason why they're called senior secured is they sit at the top of a corporate capital\nbalance sheet.\nSo you have unscured debt and maybe equity beneath you.\nBut the secured definition is very important because when there's a default, you're obligated\nthe assets backing that pool.\nSo the corporate assets, you have a claim on the corporate assets.\nSo what does that mean?\nWell, first of all, the default rates are actually quite low for senior secured loans,\nbut even when they do default, historical recoveries are quite high.\nYou're not getting completely wiped out.\nYou're actually recovering anywhere from 60 to 70 cents in the dollar on like the long-term\nhistory.\nIn high yield, just to compare that is probably going to be somewhere in the 40s, 40s,\n40s to 50s range.\nOf course, there's tales, but I'm just giving you like an average, a long-term average,\njust kind of in that range because you have a claim on assets.\nSo you're taking this pool of loans that I explained.\nLittle pieces, 150 to 300, and that's your asset pool that's going to feed into what becomes\na CLO.\nDoes this make sense so far?\nMakes a hundred percent sense.\nYou're doing great.\nWe're not even at the sea, but right now, so I want you to envision this pool, and what's\nthe pool doing, right?\nThose companies are making their payments, they're making their interest payments, and eventually\nthey're going to pay back their principles.\nSo think about these cash flows, right?\nThose cash flows and feed into what's caught becomes of the CLO structure.\nThe CLO structure is trunched out into triple A, double A, single A, triple B, double B,\nand equity.\nThose are the bonds, the CLO bonds.\nThe triple A receives a cash flows first, they get first priority.\nThey also have the biggest buffer underneath them from any kind of losses.\nDouble B's are going to be your highest risk adjusted return, because they're the first\nafter having that equity cushion.\nThis is important to describe there's eight to ten points of cushion.\nThey're the first to kind of, with that would impair any kind of loss in the credit structure.\nBut remember, each loan is supported by, has an LTV of probably like 50-ish, so there's\npoints of equity cushion under each loan.\nThen you're putting those cash flows here, and then the debt structure still has a cushion\nat the equity level.\nImportant to floating rate loans, floating rate bonds.\nSo a CLO triple A would be like three months, so for plus 100 to 150 range, a double B\nis going to be three months, so for plus 500 to 600 range.\nSo if I'm a bond investor, and I'm just doing direct CLO investing, I can invest in\na, which institutions do all day long, I can choose where I want to be along that spectrum\nof investments.\nAnd the equity actually performs quite well too, because remember, the bonds are just\nare funding that asset pool, but there's excess that's just feeds into the equity.\nAnd CLOs aren't created unless there's a prediction that there's going to be more assets\nflowing at that pool to that equity, which is typically structured as eight to ten points.\nDoes that make sense?\nWell, Daniel, you did a great job of making something very confusing and putting it all together.\nSo thank you for that.\nThat'll be very helpful at the rest of this conversation.\nSo let's get into why we're here.\nWe've got two ETFs that you recently issued.\nWe have CLO Z, which is your triple B's, and we have CLO X, what's your triple B's to B,\nand then CLO X is your triple A's.\nSo let's talk about both.\nLet's talk about CLO Z first, so at a high level, what is this fun trying to accomplish?\nOkay, we'll remember at the end of the day, what are CLOs giving you?\nThey're giving you exposure to loans.\nOkay.\nThe CLO Z is giving you exposure to loans that are wrapped in CLO triple B and double B's.\nThis is the highest risk adjusted portion of the CLO when I describe that CLO capital structure,\nand it's really going to give you income.\nLike right now, we're distributing income monthly and the SEC 30 day yield,\nwhich again, you know, can change, of course, is around nine and a quarter percent.\nBut that income is, again, distribute monthly.\nIt's really helpful in any portfolio.\nWhat we're trying to do is invest in diverse high quality CLO bonds.\nThe CLO bonds, those pool of loans, and this is important.\nI should have described this when I was describing what a CLO.\nThey're actively managed pools.\nThey're not static pools, and there's a CLO manager that's actively managing.\nThat risk, CLO triple B's and double B's.\nWe want to make sure that we're aligned with the highest quality manager.\nRemember, we're in the market every day, and this market is not automated.\nIt's still OTC.\nSo it's really important to actually be a player and get that access.\nAnd we do that every day in this portfolio.\nBut at the end of the day, what is an investor getting their beginning income?\nAnd it's distributed monthly.\nSo anybody, you know, needs that income, but without taking duration risk, right?\nSo that's an important component.\nA lot of people are in their fixed income portfolio or taking duration risk today.\nAnd this is a way to get floating rate exposure.\nCapture the front of the curve plus a credit spread.\nSo you touched on this kind of briefly in that response.\nSo how are your investment managers screening for the right opportunities to include in this portfolio?\nI'm assuming there's some preferences to which CLOs are maybe better investments than others?\nOh, absolutely.\nSo the CLO markets over 1 trillion.\nAnd there's over probably 125 CLO managers.\nBut you don't see 125 CLO managers in our fund.\nAnd that's very intentional.\nWe want to align with the managers that have the best teams and our best equipped\nwith managing the loans in the portfolio.\nWe also want to align.\nThis is important.\nThere's a liquidity component.\nSo I would say there's three different tiers.\nAnd this is how the market talks about it.\nAnd from my sales and trading side, we would be where witness to it.\nThere's tier 1, there's tier 2, and there's tier 3.\nAnd the managers get clumped into all of those categories.\nAnd the statistics, like what's great about the CLO markets, you get the data every month.\nSo you can see how everybody's performing.\nAnd then another data point is whenever a new deal is created, you can see how tight\nthose credits spreads were for those CLO managers.\nBut we are going to shy away from a tier 2 or tier 3.\nAnd the reason why is not only from the managing of the collateral, but also the way\nthat they're actually marked or the value.\nLike if I need to sell that on the bid asks, bread is actually can become quite wide.\nIf you're aligning with a lower tier, it actually impacts the liquidity and being able to get\nout of that position.\nAnd we don't want to be in that situation.\nAnd any day of the week, I'd rather have a tier 1 double be than a tier 3 triple base.\nIt's not worth the risk to be aligned with the manager that can't manage the portfolio\nwell, but also where you're going to be impacted on the liquidity side and add volatility\nto the portfolio.\nSo are your internal PMs actively trading in and out of the CLOs to try to drive\nalpha opportunities or are you just kind of holding and maintaining and letting the tier\n1 managers kind of manage that risk?\nWell, remember there's two active components happening here.\nThere's the active component of the loan collateral.\nSo that's being tended to by the manager, but then there's the active component of us managing\nthe CLO risk.\nAnd we absolutely will, opportunistically, always try and find, create the most high-quality\nupper tier portfolio.\nHowever, to your point, if we see a bond that we've invested in and we're capturing healthy\nyield and we're monitoring the metrics of how that bond is performing in our portfolio,\nthe loan metrics, and we're happy with it.\nWe're not just going to turn it over just for the sake of turning it over.\nSo I would say it's a combination of both, but part of the active management component\nis we have the ability to constantly be taking in that data, evaluating our managers and\nseeing how they perform and being able to pivot when we find it necessary.\nBut what's great is the CLO is set up with a lot of rules.\nAnd the managers can't really go outside the box too much.\nThis is important.\nSo one thing that I would like to talk about is not a question that you're asking, but\nI want to make sure that we cover it today, is people might say, well, I already let\nown loan exposure, like I have it maybe in a loan ETF or I have it in a loan mutual fund.\nWhy do I need to do put something in a seed blank go and have this active management?\nAnd what's interesting is the institutions love the CLOs because they've actually performed\nbetter than having that direct exposure because there's a lot of guardrails around what\nthe manager can actually do.\nThey can't go over certain industry concentration limits.\nThey can't go heavy on a single name.\nThey are limited on the triple C exposure that they can do.\nSo that active management has a lot of rules around it, but when it works, it's beautiful.\nAnd I think that that's an important thing to understand.\nAnd you've seen that with the outperformance of CLOs too.\nSo I know the yield can kind of be a moving target.\nSo I'm not going to hold you to anything, but as you're kicking out kind of monthly\nincome distributions, CLOs, the where is that kind of like a proximate yield coming\nin on an annual basis?\nOh, well, okay.\nSo where is the yield coming from?\nYou have three months over, plus a credit spread, right?\nSo how do I get to that yield today?\nWell, three months over is high.\nIt's elevated and it's closely tied to that fund rates.\nIt's at 5.3.\nNow, obviously, we've been in this higher for longer and there's its expectation that\nof course the Fed will be will and at some points start reducing rates, but you're\nnot taking duration risk here.\nYou have the benefit of kind of capturing that front end.\nAnd then the credit spread is really the spread duration component that can change.\nSo just generically, the spread on the triple B's could be around three a hundred today\nand for double B's five to six hundred, that's the component that we get to actively\nmanage.\nObviously, I can't control what the Fed is doing, but I'm also, you're not going to get\noff sides here.\nYou're just going to the distribution would come down and its rates come down.\nWell, we're trying to do as protect that credit spread component, but that's where\nthe yield is derived from today if you want to kind of break those two pieces out.\nSure.\nSo if I'm an kind of a advisor, I have a model portfolio, what are the benefits of\nholding a CLO exposure over say, like traditional fixed income investments that they\nmight have in their or traditional fixed income ETFs?\nYeah.\nWell, I think traditional fixed income investments obviously can serve a purpose in a portfolio.\nHowever, I do think that investors have been looking for alternatives.\nYou saw at the end of 2022, a lot of people were burned because of the increased correlation\nbetween traditional equities and traditional fixed income products.\nI mean, even equities are something on my desk today.\nI just printed this out.\nI'm just showing it to you.\nIt's a Bloomberg article.\nI'm going to quote it.\nBut this is, you know, we keep hearing about the MagSendup 7, but I thought this was just\na really interesting stat.\nSo the 10 largest stocks in the index by market capitalization, which is mostly obviously\nthe tech giants, have posted a median gain of 17%, while the rest have lost 1.3%.\nSo on the equity side, you're already pretty heavily indexed to a few names, but then\non the fixed income side, I think what's happening just to relate it back to that is\nyou're heavily indexed to duration risk.\nMost of the 40% is fixed rate.\nAnd I think a lot of people have been getting off sides for not only because of the increased\ncorrelation because they've been taking on, look at we saw the regional banks.\nThat was really what took the regional banks down.\nThey would actually have benefited from owning CLO tripalates in their portfolio.\nMost of them didn't.\nAnd it's unfortunate because again, you're not taking your taking the spread duration,\nbut you're not taking interest rate duration.\nSo it's starting to go off for a little bit of a tangent here.\nNo.\nDaniel, thanks for reminding me of that.\nIf someone who runs equal weight portfolio, sector exposure portfolios, I love continuing\nto see that stat.\nI need.\nYeah, I think it's just a rest of the market to participate for please.\nThere's other things to look at.\nOkay.\nWhy see Lowe's now?\nOne, you're getting more yield for the risk.\nSo just generically, traditional fixed income is going to be somewhere in the four to five\npercent range.\nWe're CLO ETFs are probably going to be somewhere in the six to nine percent range.\nRight?\nSo I'm capturing more yield.\nBut there are more that yield has a better historical track record.\nWe haven't talked about this yet.\nSince 2010, post GFC, there have been zero defaults in AAA, AA,\nsingle A, triple B CLOs.\nThe cumulative default rate for CLO double B's is 47 basis points.\nIf you put a corporate credit equivalent,\ncumulative default, we've done this.\nLike the 13 year cumulative default comparison between that number.\nIt's around 15 percent.\nBecause again, you have the structure that's wrapping the loan exposure\nand giving you structural protection.\nSo let's talk about CLO X, same concept, different tranche.\nSo we know at a high level what it's doing.\nI'm just going to ask, is the demand for holding triple A more of a risk-based decision\nwhen you're looking at this?\nI mean, because it's basically the same product or you can with a different tranche.\nYou can correct me if I'm wrong.\nBut what's kind of the decision for someone holding CLO X over CLO Z?\nIs it, again, just a risk decision?\nIt could be a third component we talked about yield resilience,\nbut third is just less correlated.\nAnd that's both triple B, double B risk and the triple A risk.\nWe've seen, listen, I've seen it allocated in a lot of different ways.\nSo I've seen investors use CLO Z as a high yield replacement.\nSo that could be either high yield, traditional high yield,\nor they're replacing their loan exposure and getting exposed to an triple B double B.\nBut I've also seen an investors do a barbell approach\nwhere they maybe have 50% exposure to CLO Z and 50% exposure to CLO X.\nAnd they're putting that into like an income portfolio.\nAnd they set that as their baseline and then they adjust it as they see fit,\nbased on their views on where credit risk is.\nAnd then I've seen investors that are more conservative\nthat really want 100% exposure to just pure play, CLO triple A's.\nNow, I don't know if you're familiar with this step,\nbut there are 10 CLO ETFs in the market today.\nThe first one was created in October of 2020.\nSo we're talking about post-COVID, really.\nAnd the aggregate AUM is 12 billion.\nI think it's almost 13 billion today.\nSo there's been a lot of asset flows into this product.\nMost of that has been in the more conservative end of the spectrum,\nthe triple A. But I think what's great about what we're doing.\nWe're in this market every day and we're giving investors choice.\nSo you can choose to have 100% of your exposure to pure play triple A\nor 100% of your exposure to triple B double B.\nOr you can kind of toggle between the two.\nBut at the end of the day, it's important that we're giving the investors choice.\nAnd they haven't had that.\nLike this product, the CLO product is over one trillion.\nAnd it's mostly institutionally held.\nAnd they've had a choice to figure out where they want to be across the spectrum.\nBut now what we're doing is we're giving the individual investor choice in the ETF\nwrapper of how much how they want to gain that exposure.\nYeah. So I was going to ask kind of how advisors are using these products.\nYou kind of answered it there.\nI'm going to ask a different question.\nSince your head of business development over there on the exact correct.\nYep. So these are newer products, right?\nYeah. It's not the ETF world is not if you build it, they will come.\nSo how are you thinking about distribution?\nHow are you thinking about starting to get these kind of worked into advisor portfolios\nkind of across the universe?\nWell, I love that you answered that.\nAsk me that question because it's something I think about every day.\nBut I would say that we really, and I think this was very intentional when the investment team\nbrought somebody like with my background on to lead a business development.\nIt wasn't a traditional this development hire.\nBut it was because we lead with education.\nWe have to, and maybe I failed on my way that I explained CLO today.\nBut we have to teach about the product.\nMake awareness of it.\nAnd I think that there's a component of scary when you hear what a CLO is.\nAnd really like demystifying that notion.\nBecause the product has performed very well.\nI've been quite resilient for the institutional, but the individual investor doesn't know about it.\nSo I would say number one, we're leading with education.\nAnytime we have an opportunity, whether it's myself, John Kim or CEO, to get on a podcast,\nto be part of a webinar, we're the first to sign up.\nWe love, we love partnering with people like you, Brad, and doing that.\nThe second is we're out there having our own educational seminars or one-on-one discussions with advisors\nand really in the model portfolio teams and the wire houses.\nAnd really, again, when I go in, I'm not pitching panogram.\nI'm pitching what a CLO is first.\nI think it's important to like do it in that aspect because people then\nagrabitate. They want to be educated.\nThey want to get the latest data.\nThey want to understand it.\nBecause nobody's going to recommend this to a client if they don't have an understanding.\nAnd then the third thing is really just kind of everybody here, although I, my role is\nbusiness development, and we're all business development.\nAnd that's the culture like we're all advocates for not only the firm and the culture,\nbut also the brand.\nAnd I think it's important because like I had described when I was on the other side\non the cell side, this team has a really good reputation within structured credit,\nbut it's really creating awareness outside of the type world of structured credit\nand making sure that then people are aware of what we're doing here.\nSo I would say those are the three things that we're doing.\nWell, Danielle, I really appreciate you spending some time with me before I let you go,\nwhere can people learn more about you, panogram, and your two ETFs?\nWell, we have websites, of course, for each of the fun websites.\nIt's CLOZfund.com and CLOXfund.com. Those are updated daily.\nAnd then panogram has his own generic website, but I would welcome anybody reaching out to me.\nObviously, this is a fun topic.\nAnd as I've been interested enough, I love educating and talking about it.\nOr I can teach you about balloon animals.\nThey can do it. You can do it. You can do it next webinar where I'll teach you guys all about balloon animals.\nBut thanks for having me, Brad, I really enjoyed it today.\nAnd we'll be in touch.\nAll right, thanks, Danielle.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}