{
  "id": "15328898",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, chief investment officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for educational\nand entertainment purposes only.\nWelcome to Behind the Ticker.\nToday we have on Andrew Scatoff, he is from Ben Creek, and we are talking about their\ntwo ETFs, BCUS, which is their US large-cap ETF and BCIL, which is their international\nlarge-cap ETF.\nIt's a very interesting episode, as Andrew has come out of the family office space and\nhas built a quantitative model that uses both fundamental as well as other quantitative factors\nto identify what they deem structurally advantageous companies to put inside of their\nportfolios, both in the US large-cap space and international large-cap space.\nThey rely solely in fully on their models, so it is completely computer driven.\nSo I think you will find this episode rather interesting.\nSo without further ado, please welcome Mr. Andrew Scatoff.\nHey Andrew, welcome to the show.\nHi Brad, thanks for having it.\nSo before we get started, why don't you share a bit about your background and how you eventually\nstarted Ben Creek?\nSure.\nWell, it all started after graduating from business school.\nI went to Columbia Business School and went through the value investing program, and graduated\nin 2009 right after the financial crisis, as you can imagine, it was very interesting\ntime to be looking out into the marketplace.\nAnd I was very fortunate because I ended up finding my way into the family office world\nand joined this wonderful New York-based family in 2009, and really learned the framework\nand mindset needed to compound capital over long periods of time, both our CIO and the\nfamily just had this wonderful framework on how to think of long-term and investing.\nAnd I spent the next decade plus kind of looking at public equity opportunities and direct\nprivate equity opportunities for the family.\nAnd really spent a lot of time thinking through the right kind of qualities or attributes\nthat you would want for businesses to invest in that can help you compound your capital over\ngenerations.\nAnd ended up kind of creating this strategy around the public markets, given that there\nwere so much data out there, you could really dig in and find these types of wonderful\nbusinesses.\nAnd so kind of created this portfolio of what I would call structurally advantage business\nmodels for the family and ran it internally for a number of years, before ultimately\nspinning out in early 21 to work with other family offices that I thought would be interested\nin kind of what we were building internally.\nAnd then, you know, we've been running kind of this capital for families the last few years\nand the overall strategy has a very, you know, what I would call data centric bent to it.\nAnd ultimately we figured out a way that we can bring kind of this pure quant version of\nour strategy to the marketplace through the ETF wrapper.\nAnd we launched our first ETF, which is our US only, BCUS last December, and we launched\nour international only excluding US ETF, BCIL in March of this year.\nSo can you talk about the decision to, you know, you have a great family office job to make\nthat job to start your own company and really take on, you know, that entrepreneurship role.\nLike, was that a, was that a hard decision, did it just feel right to you?\nYeah, it was an incredibly difficult decision, you know, I think mainly because I enjoyed\nworking with the family and our CAO so much.\nI mean, I was learning so much having these wonderful opportunities.\nBut at the same time, when I started to come up with the strategy and we can talk about kind\nof the data focus around it and it's all predicated around information theory, I realized\nthat what we were, what I was coming up with was so interesting that I needed to dedicate\nall of my time to really see it through and dive in and I think create the expression\nthat we have today through the ETF.\nSo it wasn't an easy decision, but it was something that I felt was super interesting\nand I needed to dedicate all my time to kind of build it out.\nYeah, no, that's great.\nBefore we get into the kind of band creek and the strategies of ETFs and kind of the data\nset that you're using and going to build these portfolios, I always like to ask people,\nwhat do you like to do when you're not working?\nI know as an entrepreneur, it's going to eat up a lot of your life, but do you have any hobbies\nwhen you're not sitting behind the desk?\nI do, so I have two young children, a ten-year-old boy and a eight-year-old girl.\nI spend a lot of time with them playing sports, so I've coach both my son and daughter's basketball\nteams, you know, as a parent, you know, you typically are traveling quite a bit on the weekends,\nyou know, kind of shuffering them around to different events, whether it's gymnastics or\nbasketball or tennis, so I spend a lot of time with them.\nI also like to get out and run when I can, you know, based in California, the weather is pretty\ngreat, so I do tend to get out and run as often as I can, and then spend time with my wife,\nwe'll go, you know, to dinners or just walk around the neighborhood, so I do try to stay active\nwhen I'm not thinking about investing in data.\nYeah, well, I've tried the running thing, I'm not much of a runner, I try to get my exercise in\nsome other way, I think I just have heavy feet, but good for you, for getting out there and\nand getting after it, but let's talk about Ben Creek, you know, I know you have two ETFs out there,\nso are you providing, you know, other things to clients such as research or SMAs or indexes,\nlike how else are you working with clients outside of the two ETFs? Sure, so once we made the\ndecision to kind of create the ETF platform, we launched our advisor site as well, and, you know,\none of the things that we had been doing internally for a long time was kind of developing and looking\nat data visualization tools primarily through a software program called Tableau, and one of our\npartners on the investment team prior to joining Ben Creek had spent a lot of time kind of building\nout and providing transparency for the drug pricing industry. And so this was something that was\ninteresting to us, and, you know, we spent a lot of time kind of building out these tools,\nour first tool that we published was around inflation, CPI and PCE. We recently put out a new tool\naround employment, and we decided to just publish these tools free for the public, and it's on\nour website, Ben Creek.com, so that everybody can kind of explore the tools. We've even been\npretty fortunate to have, you know, some of our data tools published in the financial times in\nthe Boston Globe. So, you know, the tools I'm hoping are providing some additional value to\nfolks out there. So, outside of, you know, the investing, that's kind of one of the other things that\nwe've been providing to clients and non- clients, really, just anybody that's interested in it.\nYeah, well, the mantra at the firm seems to be driven all around data. So, I guess what kind of\ndata are you taking in? And obviously, more importantly, how are you using it to drive\ninvestment decisions? Sure. So, if we kind of look back to my days with the family office,\nwhen I was kind of creating the initial strategy, what I was doing was creating a checklist of,\nwhat I'm called, fundamental and quantitative factors for, you know, assets, right? So,\nthings that I thought led to long-term compounding. And, again, this was the initial checklist\nfor the pre-version of this, and, you know, as I was doing more and more of this, I realized that\nI needed a lot of help to make it one more efficient and to broaden out the scope of the data\nthat we took a look at. And, you know, that led to me leaving, but also bringing in our chief data\nscientists, Anton Yan, who, you know, spent almost two decades of working at, well, it's\nlivermore, national labs, and Lincoln lab, and really specializing in modeling the simulation\nof, like, complex data systems. So, really what we wanted to do was bring in as much data as possible.\nAnd, again, it's for the investment world. It's really focused on fundamental, so things that\nthe company is releasing and reporting, and then quantitative. So, we've developed a number of\nfeatures over the years that we believe help identify these structurally vantage business models,\nand it's all focused on that. It's taking the data and using it to identify businesses that have\nan edge, right? And so, the edge, you know, business could be something like brand development\nover, you know, 50 years, or a robust distribution pipeline, or, you know, a company that has\ndeveloped these meaningful network effects. And, you know, we feel like we have figured out a way\nto take this data to help us look and recognize specific patterns that are highly correlated\nwith identifying business models. Yeah, can we dive into this term structurally advantageous,\nlike a little bit more? You gave some examples there, but when you're finding, you know, a company\nor an avenue that you get really excited about, how would you kind of define the word structurally\nadvantageous? And what types of companies, or, you know, as part of your data checklist,\nor are you checking off to make sure that you've, you know, identified one that you're excited\nabout and you're ready to invest in? Yeah. So, you know, again, over the years, the tool that\nand the engine that we've kind of developed is purely quantitative now. So, you know, we're very\ncomfortable that when the tool is identifying a business at this point, we know there's something\nyou need to about it. And when you think about an edge, obviously a lot of people use terms,\nlike modes and, you know, the quality of businesses, really you're looking for companies that are\nvery efficient in their own capital allocation decisions, right? So, they have this edge where they\ncan either get pricing, or, you know, they're uniquely positioned where they're, they're really\nthe only human town, or there is a long front rate for growth, and they can, they can either\ndeploy the capital to grow internally, or they can make a creative acquisitions, right? So, you know,\nit runs the spectrum of, you know, is there, you obviously need the growth to compound,\nin it can either come internally or through external acquisitions. So, you know, when you're looking\nfor a company that has that edge, you're, you're looking for, for all of these things that kind\nof come together. And typically, the companies that we're looking for have been around for\nvery long time, right? So, if you're looking at a company that's been around for a hundred plus\nyears, clearly there has been something that has made it hard to disrupt. And again, we're\ntalking about edge and compound, you can compound that edge over time. So, every year that\na company is in business, they're able to strengthen their positioning. So, really, we're looking\nfor the data, the quantitative data you're looking for, assets that are fairly predictable\nfor management, right? So, if management has, you know, management team has this business,\nand they have these assets, what you want to be able to do is be able to predict, like, hey,\nthis is, you know, growth expectations for the next year, or whatever visibility duration you have,\nand, you know, the best businesses are the best, but I would say, like long-term compounding\nbusinesses have a fairly predictable, you know, the least shorter-term future. So, it basically,\nyou have fewer surprises for management and then ultimately investors. And so, what that leads to\nis what I would call, like, a less volatile path to growth, with that makes sense.\nYeah, no, it makes it ton of sense. I think one of the differentiations, if I'm picking this up,\nis it, like, most quantitative systems that are built, they're kind of focused on shorter and\nmedium-term opportunities, right? They're, they're trying to build edge around, you know, momentum,\nor certain inefficiencies that might be taking place in the market. This, to me, the system that\nyou've built seems to be trying to really mind for and find long-term value. That assumption\nbeing kind of correct. Exactly. So, we're applying, we're basically applying,\nwant to long-term investing. And again, I think that that is kind of the unique proposition that\nwe're offering that we've figured out, you know, a way to really pulse for specific patterns in\nthese assets over long period of time, looking at a ton of data. And again, there's, there's,\nthere's been, you know, it's pretty highly correlated that when we find these specific patterns\nthat you're, once you dig into the business, you know, it's, it's typically like a terrific\nbusiness that's been around for a long time. So, let's talk about BCUS, which is your U.S. large\ncap ETF. Sure. You know, at a very high level, can you just kind of talk about what the fund is\ntrying to achieve and accomplish? Yeah. So, you know, with these tools that we've developed,\nwhat we do and what the, what the engine does is rank every company in the investable\nuniverse that we're looking at. So, for BCUS, it's large cap U.S. companies. So, we're ranking\nevery company, you know, let's call it roughly 5 billion or more, you know, our investable universe\nbased on the factors that we talked about, some fundamental and in some quantitative that we've\ndeveloped internally. And we're ranking them. And then the model will tell us, here are the, you know,\ntop 30 or so businesses, you know, right now, according to kind of our data, and that's what\nwe'll be expressed in the ETF. And so, we're looking to create this basket of structurally\nadvantaged business models for our shareholders. So, my next question was going to be\nwhat's the investable universe? So, I've got, I've got that down. I've kind of two questions\noften that just on a curiosity. Have you looked at the, have you looked at trying to apply this\nto maybe the midcap space? Have you had any success finding an edge there? We have. So,\nyou know, we're constantly looking at, you know, other markets that we can apply this to,\nmidcap for sure is on our radar and we have been looking at it. You know, honestly,\nthe focus initially has just been to get the large cap space cover because obviously it's a really\nlarge market. We think there's a lot of opportunity in the US and really in the international.\nSo, our focus has been primarily on those two, but we have started to look at other markets.\nAnd again, the nice thing about the framework that we've developed over the years is you can\napply it to a number of different markets. So, it's not unique for just the US large cap or\ninternational large cap. We feel like we'll ultimately be able to apply it across a number of\ndifferent universes over time. Yeah, no, that's great. And one more thing about kind of looking\nat US large cap like that, it's a big universe. It's obviously a big marketplace of you. Do you ever\nstart to see kind of flows and trends inside of your screens as you're ranking companies that\nmight tilt a little bit more towards value or sometimes could potentially tilt more towards\ngrowth or are you primarily just seeing value in the portfolio? Can you talk about that at all?\nSure. You know, I would say, you know, we're kind of in that in that sweet spot of\nyou want the quality businesses that grow, right? That's ultimately what we're searching for.\nSo, you know, if all of a sudden a stock gets hammered and is trading at like 10 times earnings,\nfor us that, you know, our tool is probably not going to love that because there's probably\nsomething going on within that business for that asset to trade to trade to opt in that extent.\nWe're really looking for the companies that let's say have this historical growth engine.\nAnd when I say historical growth engine, you know, it's actually a metric that we've kind of created\ninternally. We're looking at a number of whirling periods over time for a company to determine,\nlike, hey, this has been, it's, you know, structural growth rate over, you know,\nX number of years. And so, you know, we're looking for the companies that tend to have, like,\nload a bit of teams kind of gross that they've been able to achieve over a long period of time.\nAnd so, given that, we also are looking for stability in that growth. So, you know, I think what\nyou see, you know, in terms of trends over time is you might see some trends in terms of overall\nsector exposure. So, you know, right now, if you looked at BCUS, you would notice that we have a large\nexposure to industrials right now. I think if you follow this back over decades, you probably\ndo see some shift in sector exposure. But ultimately, you know, we are looking for what the data\nis saying and telling us to be like the top companies with edge at any different point of time.\nSo, kind of piggybacking off of that sector exposure, do you allow the screen to kind of take\nyou anywhere in terms of that sector industry exposure? Or do you have any kind of guardrails to say,\nhey, look, we only want to have, let's, a max of, I'm making this up, 50% exposure in consumer discretionary\nor in industrials or whatever it may be, or do you kind of just let it run?\nYeah, I mean, honestly, we kind of let the tool run. Again, we've, you know, we spent years\nkind of developing this and so we're really comfortable with the businesses that it is identifying.\nThey're just, sometimes they're just going to have a higher exposure to certain sectors.\nIndustrial oil is kind of interesting because it's almost like a hot podge of businesses.\nIt's, you know, if you think about industrial oil, it's like every company that doesn't have\nlike a clearly defined sector kind of gets lumped into industrial oil. So, if you look at\nours in particular, like there isn't a ton of overlap, which again, you know, just gives us more\ncomfort that, you know, it's okay to have, you know, some level of concentration across sector.\nSo, I would say what we found to yield the best results is to kind of let the tool\ndo what it does and kind of, you know, follow the allocation recommendations that it has.\nSo, you've, you've run your screen, you've got your 30-day, 30 or so names.\nHow then are you kind of making decisions around waiting and doing portfolio, waiting around those\nnames? Yep. So, that's all determined by our engine. Again, we refresh the portfolio,\nmonthly. So, there could be changes to, you know, the constituents within the ETF,\nmonthly basis. But again, we're relying on all of, you know, the longer-term data\nto help us kind of stack rank all of these businesses. But the ETFs are totally reliant on the\ncool that we've developed in terms of construction of the portfolio and sizing and everything.\nRight. Yeah. And what does it end up being, I'm sure you get, you know, a tear down in weights,\ndoes it end up being fairly, I don't want to use the word equal weighted, but are there any massive\ndivergence in terms of significant exposure at those rebalances? Like one name getting 40% of the\nportfolio or 30% of the portfolio or is it fairly, you know, handed out between all 30 constituents?\nYeah. I mean, I would say for the most part, it's, it's going to be fairly equal a,\nbecause that's, that's the approach that has yielded the most interesting results through our\nresearch process. Having, you know, significantly outside positions, while great when it\nworks leads to enhanced volatility. And so that's not something that, you know, we're going to\nhave in the portfolio. So, you know, I would, I would just, you know, when you think about\nMan Creek and our ETFs, you know, think about the position sizes being in, you know, the three\nfish to flourish range and that's, you know, you could have some things that are working well\nthat get a little bit larger and a little smaller, but that's kind of the range that I would expect\nto see in the ETFs. I certainly wouldn't expect, you know, a 10% position or anything like that.\nGot it. And so, you would mention your re-running the screen and kind of re-running the\nweights on a monthly basis. Anything intermonth or just let everything run for the month?\nYeah. So, I mean, we're constantly working on the engine. So, that's, that's kind of what we\nspend decent amount of our time. So, we're constantly testing, trying to find new features,\nthings that did improve the portfolio's performance, but the cadence of the ETF right now is for\nevery fresh, every month, even though we're constantly working on it in the background.\nGot it. So, looking at BCUS, you're sitting down with an advisor. He's got, you know, he's got\nthe large cap exposure in a diversified model portfolio. Where are you kind of advising\nor recommending this advisor kind of allocate to BCUS and like, where would you put it?\nYeah. I mean, certainly kind of have that large cap bucket, you know, almost straddling kind of like\nthe growth in value plays. You know, we kind of think of ourselves as a more efficient version of\nthe market, right? And so, we certainly could be pretty flexible in terms of where we're placed\nin any portfolio. So, let's, let's make a switch. Let's pivot. Let's go over to BCIL,\nwhich is your international large cap ETF. I'm going to make an assumption that it's a very similar\nfund to BCUS, but it's just using an international universe. Is that correct? Yes. So, the framework\nis exactly the same, right? We're collecting all of this data that's available to us. And we're\nusing our tools to determine, you know, what's the right model or, you know, waiting for all of the\nfeatures that we develop for the international markets as opposed to the US markets. But same,\nsame sort of framework involves, you know, looking for, you know, it's called it 30 or so,\nterrific, you know, structurally advanced as business is internationally. And, you know, I feel like\nthe international markets kind of gets, they get a bad rap and have for, you know, the last\ndecade plus, really because, you know, the US markets have, have outperform significantly, right,\nas a whole. But when you actually start digging in, you know, the top echelon of companies\ninternationally are right up there with, you know, the folks in the US markets in terms of\nperformance and overall quality of their business models. So, we're actually really excited about BCIL.\nAnd I think there's a lot of opportunity. And really, there's not a ton of products out there\nin the ETF marketplace to address, you know, these, these wonderful businesses and get investors,\nthe opportunity to invest them. So, I would assume, again, I keep making assumptions on you that\nmost of the international exposure given the type of screen that you're running or coming out of\nthose international developed type markets, are there any kind of country restrictions or you\nnot looking in emerging markets at all? So, is would that be correct? Yeah. So, we're in the\n22 developed economies. So, you know, there's 23, we're absolutely not in the US, but we're in\neverywhere else. So, Canada, you know, Western Europe, you know, Japan, New Zealand, Australia,\nthose markets would be the markets that were focused on, we wouldn't have exposure to markets,\nsuch as China or India or Brazil at this point. So, just thinking about like the international\nmarketplace as a whole, do you think that there are certain situations or because of a certain\ncompany or country, you know, rules or laws that might make some international companies in some\ncases, giving you an opportunity to find even more structurally advantageous opportunities?\nOh, for sure. I mean, that's the exciting part, right? So, there are, there are certain markets\nwhere, you know, just being in that market from, you know, from a geography perspective,\nthere's a strategic advantage. And so, you'll have, you'll see that, for sure, where, you know,\nthey might have, you know, 25, 30, 40% of market share in that country, just because, you know,\nthat's where they're based. And that's the advantage that maybe the government has put in place\nfor them or, or just because there's a language barrier, whatever, whatever the case may be,\nthese companies have developed this advantage, no different than kind of the US companies that\nhave developed their advantage domestically. You see the same thing internationally.\nBut, you know, I would say that for majority of the case, so it's these international companies,\njust because they're based in, you know, say, like Sweden, they're still global companies,\nthey're still selling through, you know, to the US and almost every developed market, too. So,\nyou know, you look at that and it's like, okay, they're not that dissimilar from the types of\ncompanies that we're fighting in DCUS. So, I mean, touched on it for briefly, but, you know,\nwe're not making any predictions here, recommendations, but like, given the disparity between\nhow international markets have performed and how the US has performed and how many standard\ndeviations away from like the historical norm in terms of, you know, the performance upkeep.\nDo you think it's time for advisors to start thinking about international exposures of them\nbecause it's been a really tough go. A lot of them don't want to invest in it at all.\nI'm on the camp that now is probably the time to start looking international. Would you kind of agree\nwith that sentiment? Yeah, I mean, we love, we love our BCIO ETF. Like, we think that's a really\ninteresting place to look for these types of businesses. And again, you're right, they, they haven't\nreceived the attention that their US counterparts have for a number of years, but they're still there,\nthey're still, they're still growing, they still have their own modes since strategic and\ncompetitive advantages, and they continue to compound those edges over time. And if you're looking\nfor the right types of businesses and assets that can generate and grow at, you know, low to\nmid, you know, teens over a long period of time, regardless of the multiple, and you could\nargue that the multiples have compressed internationally. You know, I think you end up with pretty\ninteresting returns long term if you're able to, you know, handle some level of volatility in\nthese markets. Yeah, no, I would agree with that. So both of your ETFs are rather new, you guys are,\nyou know, an entrepreneur driven, you know, small business, kind of two questions, really,\nwhat was the decision and how, you know, how hard was the decision to kind of jump into the ETF space?\nThere's a lot of funds, there's a lot of competition. And how are you thinking about, you know,\ngrowing and marketing your funds over the next, you know, 18 and 24 months? Sure. So the main decision to\nto make that jump into the ETF marketplace was really the fact of what we feel what we're doing\nas unique and is not something that we saw in the marketplace. So, you know, we also saw market\nplace that was growing, especially actively managed ETFs. So we looked at that as a compelling\nopportunity, just given that there's so much growth going on in the space, we thought we were\nbringing a unique concept to the marketplace and we found really good partners and exchange traded\nconcepts who are partners or that are platform, right? So we work with ETC to kind of launch,\nwe work with ETC to launch BCUS and BCIL. And so that was kind of the decision process, you know,\nhow we're kind of going to markets, you know, we're talking to RAs to kind of help them with, you know,\ntheir own portfolio management, so they can, you know, potentially have access to the companies\nin BCUS and BCIL for their clients. And it's really just kind of going to some conferences and\ntalking to folks and just trying to get our name out there. So folks, at least take a look,\nyou'd see kind of what the whole things are because we do think we're pretty unique and differentiated\nfrom most of the ETFs out there in terms of the constituents within RATFs. And so that's kind of what\nwe've been doing to just kind of, you know, talk to folks and get out there and hopefully have\npeople take a look at us. Well, speaking about taking a look, where can people learn more about you,\nthe company and find information on BCUS and BCIL? Sure. So if they want to start just learning a\nlittle bit more about vancrete in general, they can go to our advisor site vancrete.com.\nYou can learn a little bit more about our history. You can play with some of the data\nvisualization tools that I mentioned earlier. And if you want to learn more about our ETFs,\nyou can go to vancrete.s.com and learn more about BCUS, BCIL. You can see the whole things that we have.\nAnd so you can read a little bit more about our process online. Well Andrew, thank you so much for\nspending some time with us. I hope to see you out on the conference circuit. I'm sure. But again,\nthanks for spending some time and appreciate being with us. Really appreciate it, right? Thank you so much.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}