{
  "id": "15365878",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, chief investment officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the ticker uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nToday we have on John McQ, he is from wealth trust, and we are talking about the wealth trust\nlong-term growth ETF, ticker WLTG.\nIt's a very interesting product, and wealth trust has a long history, providing SMA and\nmodel portfolios, through TAMS, two advisors, but this is their first crack in the ETF space.\nThe product is very unique, it's done very well.\n75% of the portfolio is an individual stock, names that are quality, that are paying a\ndividend, and that are likely to be beating their earnings estimates.\nThe other 25% is in indexed ETFs for diversification, as well as risk management.\nAnd over top of it all, he has an momentum indicator to help drive buy and sell decisions,\nas well as find some unique opportunities.\nSo without further ado, please enjoy this conversation with Mr. John McQ.\nHey, John, welcome to the show.\nWell, thank you for having me here.\nSo before we get started, can you give everybody just a little bit about your background,\nand how you eventually started wealth trust?\nSure.\nWell, I started with Merrill Lynch back in 1988, so I've been around for a little while anyway.\nAnd after John and Merrill Lynch, I kind of wanted to manage portfolios on a discretionary basis,\nso I'm an hammer, probably over.\nAnd I believe it was 1994, so I actually started in a program there called The Omega Program.\nSo I was one of the few advisors that was allowed to manage portfolios at that time,\nI wanted to discretionary basis for our clients.\nThe cool thing about it, when I said Merrill, you know, and you probably know this,\nthey would tell you, you got to build a position at a particular stock, right?\nAnd so the nice thing about being able to do it on a discretionary basis,\nyou could take your small clients as well as your larger clients.\nSo that's when I actually started a many support portfolios on a discretionary basis.\nFrom there, I went to credential, which actually became wealth-fargo advisors.\nSo I was one of the two groups at Wells Fargo advisors that was allowed to manage portfolios\nfor the clients of other advisors at Wells Fargo.\nSo, the other way I was audited by Wells Fargo legal team a lot,\nI was kind of like the fish out of water, if you know I'm saying.\nAnd so after a while, and I guess it was 2015 that said,\nI need to farm my own RIA, and at that point in time, I left Wells and started wealth-rust\nas a management. So at that point, you know, we get to actually start our performance over again,\nand just to relate back to that, Wells Fargo would allow me to take our statements with us,\nbecause our long-term growth portfolio basically is out of the S&P 500,\n65% of the time since 2000s, you know, for the last 21 years.\nSo that's how we got started with the management of the wealth-rust long-term growth portfolio.\nIt's wonderful. You and I have a similarity. We both started at Merrill.\nI didn't, I probably didn't last as long as you, though. I think I was only there for about nine months,\nbut yeah. So I always like to ask though before we start talking about, you know,\nthe business and the ETF we're going to talk about today is, what do you like to do when you're\nnot behind the desk, any hobbies interests? That's a good one. Well, I have a golf wood or\nI don't know if you've ever heard of one. I've ever had a very few of us. My wife is a golfer in\nthe family. She actually, I met her on a blind date playing golf, and she actually fell in love\nwith golf. She wanted to play golf so she could meet a man, and so she met a man but she fell in\nlove with golf. So at this day, she's the golfer in the family. I'm a boulder. I like being out of the water,\nand doing a little fishing, watching the sun set, go down, you know, late in the afternoon.\nDown here, we live down here in Desaflara, so we have a down here, everything is named after\nIndians. So we live on Indian by and so we have a direct access to alcoholicsy bay. And that\nbay is just beautiful. And so I like to go out there, just relax. That's my time to unwind,\nif you don't understand. Yeah, a lot of builders on the show. It's funny. But there's something\nwith managing money in the love of water. I'll maybe figure that out at one point. But\nbefore we talk about WLTG, which is your long-term growth ETF, let's talk about wealth\ntrust as a whole. I know, like I said, you have the ETF, but are there any other services\nthat firm provides? Is there any way you're working with clients outside the CTF? Sure.\nWe manage portfolios on six term-key asset management platforms. So we actually manage portfolios\nfor advisors. We have 12 strategies that we currently manage from small cap, bit cap, fixed income,\nconservative fixed income, and a large cap, a long-term growth portfolio. And we have two\nbalance portfolios. So we do that. The two balance portfolios are five-star,\nlonger-star portfolios. And a long-term growth portfolio is the four-star portfolio. We just\ngot gifts to prove in January of the year, which is, if you know, that's a very difficult thing to do.\nSo now our firm is gifts to prove. I guess we can call themselves a four-star portfolio manager.\nSo we manage portfolios on other term-key asset management platforms like investment,\ntheir smartx, Orion communities. So clients can have access to this through those programs.\nThese are other advisors. We really enjoy managing portfolios for other advisors.\nAnd one of the things that we do that's very different is that we actually do webinars\nwith advisors and their clients. And we try to get it to where the advisors themselves\nparticipated to the webinars. So they can actually, if you're a while, they understand our\nmethodology, and they like to talk about it. So we work with advisors and their clients\nto present our methodology. I like teaching. In fact, my daughter said to me,\nI want you to just come and teach me because you love teaching what you do. I said,\nwell, I think I'll stick with what I'm doing. So you bring up methodology. I think you have a\nreally interesting methodology. I want to jump into it. I want to talk about it in depth. And it's\nthe ticker is WLTG, which is the wealth-trust long-term growth ETF. Before we get into the weeds\nand the details about the product at a very high level, what does this ETF try to accomplish?\nOkay. Well, it's a growth at reasonable price ETF. So it competes with the Russell 1000,\nalthough it has a more of a growth step to it than the Russell 1000, or the S&P 500,\nlike the I like to identify companies that have good quality earnings, good quality\ndividends, basically that I know I can depend on them. I work for a company in St. Louis.\nWhen I left, when I graduated from college, it was the S&P, it was the 500 company, and\nwe would actually do things to manage expectations for the quarter of the earnings. So we would\nhave the chief financial officer, I was the director of financial recording for the company.\nThe chief financial officer would come into me all the time and say, hey, we want to be the consensus\nassessment, it's quarter, like two cents. Okay. Well, guess what, we would do things. They were\njelly-accepted accounting prints. It was by the way. My wife says to me, honey, if you don't brag about\nyourself, I'm not going to brag about you. And so we, you know, at Wells Fargo, I mean, it's good\nto be at this company I work for. We would actually do what's, give support. We pass the CPA exam,\nthe first time our I pass the CPA exam, the first time I took it. And so therefore I know what\ngives the laws or what they don't allow. And so we would do things. So my background, basically,\nwas in industry itself. We're confident, you know, that's a 500 company. And so what we try to\naccomplish is identify companies that have great quality earnings, great quality dividends.\nYou know, for example, if they have a company has a lot of deferred expenses, that's not\nquality right. They've got to come back onto the, onto the books eventually. They have no deferred income.\nThat's a good, or they have some good deferred income. That's a good thing. So the goal is to\nto outperform on a reasonably priced spaces. RPE is very close to the S&P 500, but our growth rate\nis around 19%. So our peg ratio, PE divided by the growth rate is 1.1. So our goal\nis to make it longer, make it charter, is to outperform on a reasonably priced spaces.\nMakes a ton of sense. And so if I understand this correctly, you guys, this particular fund is broken\nout into almost two distinct strategies, right? So first, let's talk about the analysis piece. So\nif you're running a screen to find high probabilistic companies that are more likely to be\nearning estimates. And then there's a kind of a secondary strategy, which we'll talk about later,\nwhich is momentum based, or you're combining them to get your outcome. So are you able to talk\nabout some of the factors you're using to isolate a company that would have a high probability\nof beating their earnings estimates? That's a good question. The database that we have is 9,000\nand I've been using it for 21 years. Back when I started using it, there was about 3,000\ncompanies. So it's now it's 9,000. It has about 1700 American Depository Reseeds in it.\nSo it's kind of like the Hoots who have all the companies that you would consider buying.\nSo I started screening that. I built my own screened criteria for the things that I think is important.\nYou know, my peg ratio, my PE ratio ratios. So when I do my initial screen, I can do that anytime.\nSo, you know, once 2, 3 times a week I'll run my screens and I ended up with about 400 companies.\nI have about 9,000 companies that meet my screened criteria. And so we call that the art and portfolio\nmanagement, taking those 400 companies. And identifying what you like in those companies. For example,\nyou know, we talked about everything's quality, dividend quality, quantitative ranking.\nThe quantitative ranking is probably one of the most important things as far as\nI decided to find companies that's going to consistently beat their estimates. So let's just say\nthat three research accounts they go on to visit a company and then today at tomorrow.\nAnd let's say one of those research accounts is a five-store analyst.\nAnd let's say the company actually beat their consensus estimate last quarter.\nSo they come out to visit a company and they all raise their estimates in a significant way.\nLet's say for example, there's 20 companies that follow 20 research accounts and follow their\ncompany. So three of them raise their estimates. And that falls into a buy signal for a strong buy signal for us.\nLet's say those three analysts they go out and they do just the opposite. They lower their estimates\nfor this quarter. And so in a significant way. So that throws it into a strong cell discipline.\nNow there might be a time when, you know, the three analysts disagree with each other.\nSo one might or two might increase and one might make just be neutral or decrease.\nThat could fall into just a normal buy category. So we have five levels of quantum analysis.\nIt's drawn by by, hold, cell as strong cell. Now the market, the problem with the market or any index\nitself is that it has a lot of companies that are in them that have estimates that are going down.\nIn the S&P 500, any particular point of time, the S&P 500, between 15 and 20% of the companies\nin the S&P 500, or what we call quant fours of five. So those estimates are going down.\nSo we don't buy those fours of fives in the first place. So let's say we buy a quant two\na company that's estimates are going up. And all of a sudden it goes from two to a four.\nSo in other words, estimates start going down. So that becomes our cell signal.\nSo if we have a four or five, you have a between a 70 to 90% chance of that company missing\nits estimates. The market misses 25% of time. Since we don't buy the fours in fives in the first place,\nand since the if it does go to a four or five, it goes to a five. We sell it immediately.\nIf it goes to a four, we will watch it until maybe the day before our earnings come out.\nAnd it's still a four the day before we will sell it. 99% of the time, that results in us missing\nor actually only having, let's look at the other way. Our earnings be 95% of the time with the market\nonly beats 75% of the time. So that's quantitative analysis. Like I said, we look at companies\nthat we think have good growth potential to them. Have somewhat of a dividend. And the quantity\nof analysis helps us have lower standard deviation. Our downside risk factor is, I was just\nlooking at our larger growth portfolio, our downside risk factor is 0.85 on the downside downcatcher.\nWhich is pretty good. So we're more concerned about having a lower downcatcher and having close\nto equal on the upcatcher. Standard deviation is below. Great alpha. Great beta.\nSo John, when you're running your screen, looking at the portfolio gets fairly concentrated.\nSo you're going through all of these, you go through the screen, then you go through quantitative\nfactoring, you're finding your buys, you're finding yourselves. How many names are you targeting to\nget into this portfolio at any particular rebalance? We're looking at, potentially, 25 to 30 names.\nOkay, we really like to get it up to about 30. And by the way, since they are large cap,\nare mega cap companies. Like I said, I work for a Fortune 500 company. They have a better opportunity\nof beating the rest of them. They might only be average on a quad ranking, like a quad 3,\nbut large cap of mega caps can do things at small companies or mid cap companies camp. So we're\nlooking at 35 to 30 large cap or mega cap companies. And then they also have a strong possibility\nof beating their estimates. So how often you said you're kind of re-running the screen,\nyou know, maybe one to three times a week is, are you rebalancing this portfolio quite frequently\nor do you have it on a weekly monthly schedule? No, it depends what the market's doing.\nFor example, in 2022, our trend analysis program told us to go from growth to add some value\ninto it. And so we are actually taking some trades off of, we had some of the max 7s,\ndifferent than 7s in our portfolio, they do very well in 2001. So but in 2022, we actually took\nsome money off of that and start bailed banks and value. So in 2022 is smart to do some trades.\nPrior to that, there might be three, four year time period where we have the same stocks\nin it for a very long period of time. When growth is in value, we want to have as many\nlong-term growth portfolio. So we want to keep our capital gains down, down to the lowest\nminimum that we possibly can. So the right time, you've got to switch, you can't just stay\nwith one particular sector or asset class. So that being said, you know, you're holding on\nto names for quite some time, when kind of initially putting the portfolio, are you equally\nwaiting these 25 to 30 names, are you providing some overweight to your strong buys? Are you\nletting things run? Like, do you ever pull things back in to maybe a more strategic line?\nThat's a good question. It's actually something that we're in the process of doing now. We've\nhad some great run. So I'm in video, you know, it's kind of maybe not like the time to, you know,\nwe're up to like four and a half percent, I believe in the ETF within video. This might be a\ntime to take it, bring it back down to a three percent level. So that that is possible. You\nwant to have been currently. If you think about it since 1988, there's always been an asset class\nor sector that performed well, except for one year, and there was 2008. And even in 2008,\nif you would have the treasuries in your portfolio, you made money. So for example, if from\n2000 to 2002, if you remember that, the mark was down 45 percent, right? There's because technology\nbubble. A QQQ was down, you know, 70 percent from 2002. People don't even talk about that anymore.\nSo a lot, if you would have started buying home builders in 2002, or housing related stocks in\n2002, you've actually made money during that year because you're in the right asset class,\nthe right sectors. So that's what we do. So basically, it's tactical in nature, sort of squat rankings,\nand our methodology of identifying these 9,000 companies will give us, you know,\nresearch analysts know what their sectors are doing. They know what their stocks are the companies\nand their sectors are doing better than anybody. They get paid their bonus money based on how\nclose their estimates come to actual results. So, you know, they do a good job of investment earnings\nrevisions because that's how they get paid. So if home builders are performing well,\nthey will show up as squat ones and quantos. If if commodities are performing better,\nthey will show up as squat ones or quantos because the research analysts are telling us\nthat their earnings estimates are growing up. So this is a pretty loaded question, John,\nbut I figured if anybody would have an insight into this, it'd probably be you. Historically,\ncompanies that are consistently beating earnings, what level of outperformance are they kind of exhibiting\nover a benchmark or over, let's say the S&P or Russell? If you're consistently quarter in quarter\nout beating estimates, I know this is going to be a wide range. I'll simplify the question.\nIf you have consistent earnings beats within a particular company, are you expecting them or\ndo they historically always kind of beat the benchmark? Yes, your question. If you look at\nQuatt rank, it's just to give you an example. Quatt ones and quantos average around 25% per year\nsince 1988. Okay, so if you can identify a company that let's say it's a quant to, you know,\nyou're outperforming about, you're getting about 20% return since 1988. Guess what,\nQuatt 4 is a quant 5, so that average about 2% per three percent per year. Estimates are going\nnow. You know, they missed their estimates. So I would say, I've never done that analogy before,\nbut I would say that it's significant to have long-term growth companies that pay it somewhat of\na dividend that can consistently beat their estimates. And by doing so, I say you'd outperform,\nI can't quantify it, but I know based on my history that that's how we make a lot of money.\nYeah. So when you get down into your screen, you again, select a 25 30 names. Do you have any\nsector or industry guard rails to prevent kind of maybe over-concentration? Or do you just let the\nscreen drive allocation? Yeah, that's a good question too. It goes back to the quantitative analysis.\nOkay, it goes back to over-weighting sectors that are the right sectors to be. For example,\nin 2005, the Fed started raising interest rates, right? Why were they raising interest rates?\nBecause commodity prices went up so much. Well, you know, we bought an offshore drilling company.\nA Chinese offshore drilling company at $3 a share. They went to $130 a share.\nSo there's times to be in the right sector, the right asset class at the right time,\nand there's times where, you know, we try to, we look at what we can actually look into the S&P 500\nand see the actual allocation. Okay, last year, which is amazing, you know, Google for a while,\nit was in the S&P 500, two times. And with 10% of the S&P 500. So, you know, did we have 10% in\nGoogle? No, there's no way we would do that. Do we have 4% in Google? Yes.\nSo, I don't know if that answers your question or not. I think it, uh,\nWell, I think, I think if all up to that would be, you run the screen, let's just say,\nyou know, 80% of the companies are on one particular sector. Do you just let that be?\nOr do you say, hey, look, we're not going to let more than 40% of the portfolio be in\ntechnology? I will typically never go more than what's the technology. For example,\nin technology, right now it's, you know, 40% of the S&P 500. I will never go above there.\nOkay, I want to make sure that I'm at least, but I want to have the best companies in technology.\nRight, that's the first. I mean, you could have technology, you could buy\ntechnology index, but then you have a lot of companies in technology that are performing.\nSo, do you really want to own Intel? Or do you want to own Nvidia? All right.\nSo, part two of your process is, is an AI momentum overlay. So, what is it about that momentum\nfactor that can help provide kind of additional confidence or even outperformance over just running\nthe screen itself? Yes, that's probably the most exciting thing I've been doing in the last three\nyears. So, our portfolio basically has two two groupings. One 25% is in passive ETFs.\n75% is in these large-camp and big-camp stocks. So, let's talk about the 75% first.\nSo, starting last year, 12 months ago, I identified the ability to find out which companies in the\nRussell 1,000 are in QQQ, are in VTV, the Vanguard, and the values of which companies have the most\nmomentum. Now, what I do is I can pull those and I take them and I put them into our screening process\nuser-acquant ranking, I quite analysis and a normal quantitative fundamental analysis. How do you\nwhen do you sell a company that's up 30% sure? Do you buy a company itself 30% this year?\nI mean, money mayors, they look at itself 30% I'm not going to touch it, it's already up 30%.\nWell, it could be up 60% by the end of the year. So, when do you sell it? Well, you sell it before\nearnings estimates go to, well, when an earnings estimate start going down. You sell it,\nwhen they have a possibility of missing their estimates. So, that's the cool thing where we're\nable to identify the companies in these ETFs, basically, or it could be any ETF that have the most\nmomentum. We take them and then we double-screen them with our quacket analysis, all right?\nBy the way, we go the other direction too. So, for example, well, of those 400 companies,\nwe might identify a company that's not a perfect match on momentum. Maybe it's just an average match.\nAnd we take that and we put it back into our watch list, okay? Let's say we buy it.\nI think Tyson Foods is one of the stocks that's in our portfolio. We identified it as a average match,\neven though it's not a perfect match for momentum. And now it's going from an average to a good match.\nSo, we'll track it both ways. So, it's a double check on each other. So, we check through the momentum.\nWe have to move the momentum stocks. By the way, in the Russell 1000, we get an email\nbasically that he has the top momentum stocks. It's the about 125 companies in the Russell 1000.\nTo take those 125 companies, we put it into our quantitative analysis, our normal fundamental\nX-21 year analysis. And we say, okay, we like this stack, this stack, and that stack.\nIt helps us identify companies that have good momentum. But also, what we like in a company,\nlow-pague ratios, quality of earnings, quality of dividends. Does that make sense?\nYeah, makes a ton of sense. Can, go ahead. Sorry, please.\nThe other 25 percent, we've been doing for about three and a half years. So, the other 25 percent,\nwe use a trend analysis program. We have 14 ETFs that we identify as potential additions to those\nto that 25 percent. So, right now, we have four passive ETFs, QQQ, mostly growth ETFs that are\nin that portion of the portfolio. So, let's say that the trend analysis says, okay, QQQ is trending\nnow. SPYG, you know, the SAP growth index is trending now. And guess what's trending up?\nIt's the Russell 2000, you know, it's small caps, ours, the mid caps,\nours value. Okay. So, it allows us, that's what we did in 2022. We identified when it was time to get\nout of growth, and put some more investments into value. So, we sold a lot of these ETFs that\n25 percent of these passive ETFs and bought value ETFs in depth to a important time. So,\nthe Russell 1000 growth, I think, was down 38 percent in 2022. And we were done significantly less\nthan that because of our move from growth to value. Now, so, investing, investing about, I'm sorry.\nNo, please go. So, that's about it. If there's no momentum in any of those 14 ETFs,\nguess what we can do? We can buy a treasury, you know, a, you know, a BIL, a short-term treasury.\nIf we're going, if we think we're going to recession, we can buy a TLT, a 20 year treasure.\nWe can buy gold. And we have the ability to buy an inverse ETF if we think it's necessary.\nWe haven't done that yet. But if we really think that we're going into a recession,\nwe can buy an inverse ETF for that 25 percent. And by the way, I did a study on inverse ETFs.\nThey're really good for a sharp period of time, where it's one-on-one. But if they're health\nfor a year longer, they only protect for about 37 and a half percent. They're not a one for one.\nIf the market's down 50, they'll be down, they'll be up 37 and a half percent. So, I've done that\nanalysis. And I know that it's still better than not having that inverse ETF, correct?\nBut it's not one one if you hold it for 12 months or longer.\nYeah. So, you, you kind of answered my question, but I'll ask it directly. So, from a portfolio\nmanager's perspective, you have a ton of confidence in, you know, 75 percent of your names.\nAnd this 25 percent using kind of broad-based ETFs is your way to add either in an upmarket,\nyou know, diversification or when a market cycle starts to change, it gives you the ability to\nmanage risk. You said it. I mean, I couldn't say it any better.\nSo, is momentum the only driving factor for the ETF selections? Are you running any quantitative,\nyou know, screens on kind of these large indexes or is it just purely a momentum play?\nOn the indexes is purely a momentum play.\nOn the indexes. However, on the individual stocks, we, we do the screening down to 400.\nThen we go back and we, we watch from that to not that. But, you know, individual stocks\nis more quantitative. On the ETFs is more trying the analysis of that big sense.\nYeah, it makes a ton of sense. And just to follow up on that. So, on the stock side of the portfolio,\ncan waning momentum ever be an indication for you to cut exposure or sell? Is it, or is it\na change in rank that's going to be your sell signal? That's a very good question.\nAnd right now, QQQ, when I did an analysis on QQQ, and I wanted to identify the top 10 percent\nthat have the most momentum in QQQ. There was about 30 stocks in QQQ, and they had that high momentum.\nToday, it's down to 10. Okay. So, and so what's happening, which is really funny, the Russell\n1000, the top 10 percent, was about 100 stocks. Now, it's up to 185. So, we're starting to see\nthis broad-based, okay, return, where it's going from mostly QQQ technology, magnificent 7.\nAnd we're starting to see at this particular point where it's actually running out\nto the rest of the Russell 1000. So, the rest of the March, the Large Game Mark.\nSo, if you're sitting down with an advisor kind of today, where are you putting this in an\nalready diversified model portfolio? And where is WLTG sitting?\nWell, it's probably should be part of an SMA, okay, for a large account, for a small account,\nyou know, for a family member that only has 10,000 dollars. It's probably a good thing to use.\nFor that. So, it could be core for smaller accounts. And I think it should be part of an SMA\nfor large-air accounts. But, you know, I like what it does. So, I kind of prejudice\nof know how much it should be used. So, the ETF is fairly new. Kind of two-part question.\nWhat drove you to start it and get it out there, since you have a successful SMA business,\nyou're working with a ton of, you know, really great tamps. So, what kind of drove the decision\nto launch and then how are you kind of thinking about growing this ETF over the next handful of\nyears as you kind of get your three and five year numbers? That's a good question too. I started\nat the wrong time. I started December of 2021. So, I think that's what a lot of people do.\nThey kind of make that mistake and they think, oh, the Mark is doing great.\nThe nice of it at ETF to provide for the advisors that I work with, you know, I work for,\nyou know, hundreds of advisors with hearts of advisors. So, I thought I'd have the effort\nof their smaller accounts. And, you know, so they could actually use our long-term growth\nfor larger accounts. So, that's why I started it. And so, what we're trying to do, we're on a\ncouple of different programs where we're actually wealth advice or magazine. I don't know if\nyou've started that. The wealth advice magazine is promoting us on their website. We're doing it\nthrough LinkedIn. We have a company called BCN. So, we're doing on LinkedIn. We're identifying\nso we can send information out to our eyes. And, we're at the point now, we got it up to close to\n$29 million some assets. Okay. So, that's kind of like a, we're trying to get to that $30\nmillion point. And so, the next thing to do is get our spreads narrower, more. I think when we do that,\nit'll be more attractive to advisors and clients. So, there's ways that we can do that.\nAnd it's something that I can't really talk about now. But there's ways that we can narrow this\nspread. But I want to say this to those individuals that we're thinking about buying it. We have 11\nmarket makers. Okay. And so, if somebody wants to buy a large block, they can go to their block\ntrader whether it's swap or fidelity. And they can say, go to the market makers. I want to buy\n10,000 shares of WLTG. So, they can go to the market makers. And they will get a great execution.\nIf they do that, it's important. You don't put a 10,000 shares of market art on our ETF.\nYou have to go, it may be 100 shares. You can do that. It's 10,000 shares, 25,000 share purchase.\nDo you want to go to the market makers and make sure that you're getting a great execution\nsomewhere between the bid and the answer? Yeah. Well, I mean, John, I think, you know,\nthe investment advisors that are listening this and model portfolio providers,\nthat this product, I think, is a great compliment to just traditional large cab growth exposure.\nI don't think it's just a small account solution. There's a lot of people that are running\nETF only. Model portfolios are delivering to tamps. And I think this would be a great compliment\nto help drive some alpha. And that large cab growth bucket is their building portfolios.\nI think the ETF is really intelligently constructed. The performance has been great. So,\nkudos to you. But before I let you go, and I really, really appreciate your time. This has been\nreally great. Where can people learn more about you, your firm and the fund? Okay. The best thing\nis go to our ETF website. It's just wealthrustETF.com. Okay. Well, Ben, John, go ahead. If they want to\nknow more about the firm, then they go to wealthrustAM.com. Well, trustETF.com is the ETF website.\nWell, trustAM.com is our website for the entire firm. They can actually access the ETF website\nfrom wealthrustAM.com. Again, well, John, thank you so much for your time. This has been wonderful.\nYeah. I really appreciate it. Thanks, Ben. Thank you.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}