{
  "id": "15412002",
  "transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology they are run on\nand you want more customization and flexibility, as well as a AI-driven model marketplace,\nUX wealth partners is your destination.\nOn top of that they have institutional trading, so if you are an ETF issuer or an SMA provider\nlooking for outsourced institutional trading, UX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and\nmake your practice more efficient.\nWelcome to Behind the ticker.\nToday we have on Clark Allen, he's the head of ETFs at Horizon Investments.\nWe talk about the firm, we talk about their two ETFs that they just launched, but we are\nmostly focusing today on BenJ, which is BENJ, the Horizon Landmark ETF, which is really\na cast management strategy using box spreads.\nIt's offering a T-Bill plus like return, but the kicker is it is not kicking off income.\nSo we talk about that strategy.\nWe also briefly touch on HBTA and the firm's plans to launch more product.\nSo without further ado, please welcome Mr. Clark Allen.\nHey Clark, welcome to the show.\nHi, thanks.\nWelcome.\nGlad to be here.\nBefore we started, why don't you walk everybody through a bit of your background and\nwhat led you to Horizon and a little bit about your role there?\nYeah, absolutely.\nI'm the head of ETFs here at Horizon Investments.\nI started my career in public accounting doing M&A evaluation work and then made my way into\nthe investment world working at the asset management arm of insurance companies.\nSo we'll call it institutional asset management and then from there I work my way into\na single family office for a multi-billion dollar family, which included some of the\ninstitutional capacity management, alternatives investments, but also dealing with an\nclient.\nAnd so as I sort of found this role here at Horizon, what really attracted me to this firm\nis the way that Horizon is able to blend institutional asset management with the context\nand really putting that into context about client things in their emotional capacity.\nAnd so I came here originally was just focused on the point research, the director of\ncontent research, portfolio management as well.\nAnd then more recently we've entered the ETF space and so it was promoted ahead of ETFs\nand overseeing not just sort of research efforts, but also execution and launching of our\nETF business.\nIt's funny, you and I have fairly similar backgrounds.\nI did public accounting, but I was on the tax side and I lasted about one tax season and\nit was like that's enough for me.\nYeah, I was about two and a half years and my first kid was born and I was like, okay, I can't\nkeep doing this.\nAlthough it's fun work, I enjoyed the consulting side, it was a lot of fun, but I just\nknew it wasn't sustainable for me in that particular season of life with my wife having\na new born and home.\nAnd so transition now and I also wanted to make my way to the investment space, so I just\nfound the right opportunity and sort of pivoted over.\nYeah, no, that's great.\nBefore we jump into kind of the media this always have to ask people, I know you and\nI were talking, you have three kids, so you're probably tied up a bit, but any hobby\nseems you'd like to do when you're all working.\nHang with the kids, hang with the wife, we live in North Carolina, so we do a lot of hiking.\nThere's a place here called the Whitewater Center that's got rock climbing and whitewater\nrafting and ropes course, so I do that pretty much every weekend I can with the kids.\nThey're old enough now where we can get on a ropes course and everybody can hang.\nMy wife just sits in her lot of chair and waits for us to be done, so that's pretty much\nwhat we do for fun.\nYeah, no, that's great.\nSo let's talk about horizon as a whole, like you'd share a bit about the history,\nbut also for them really evolved over time.\nYeah, horizon was born out of a wealth manager.\nMany years ago, I can't know exactly, I think 95, maybe.\nAnd so we were born out of a wealth manager pivoted into, quote, like a strategist type\nfirm, when model, the model business was really taken off and they were strategists in\nthat space.\nWe were sort of at the beginnings of that.\nAnd we expanded from the model business to launch our own mutual funds.\nWe now have nine mutual funds.\nAnd shortly after that, we started surviving some active ETFs for first trust.\nAll of those products, the mutual funds and the ETFs were utilized in our own product\nmodels alongside, we'll call it, third party models.\nAnd then we also expanded in other ways where we have an OCIO business, we'll partner\nwith it, with advisors to build their own custom models that utilize some of our product\nas well as other people's products and so we're blending together different approaches\nto tailor the portfolio to them and their needs.\nI'd say that more recently, we've expanded even more, we continue to grow and evolve because\nwe kind of view ourselves as solutions provider, not just an asset manager, we're trying to partner\nwith and provide solutions to advisors to help them really grow their practice and their\nbusiness.\nAnd so we've launched a custom portfolio business, which is custom estimates, attack management.\nAnd then even more recently, now we've launched our first two ETFs, and we just filed for\nseven more, and there will be more to come this year where we're coming pretty quickly\ninto the Active ETF space, and simply because we see that there's a need.\nAnd again, we have solutions, and we see that there's gaps in those solutions that are offering\nadvisors, and we want to be able to have product to fill those needs and really serve these\nadvisors.\nI think there's two real models that are firm, which is to empower advisors, which is to\nempower them to serve their clients and to fill financial plans and also to fuel advisor\ngrowth.\nSo how can we partner to provide a solution to an advisor, help them fuel growth\ntheir business, and help them grow not only maybe so that they can then sell that business\ninto the next advisor, the younger generation, and sort of transition that, or maybe if it's\na younger advisor that's looking to acquire some of these advisors that are looking to\ngo out of business, and how can we support their business, so as they bring in new advisor\npractices and take on new assets, how can they be in a position to actually execute on\nthat?\nSo you mentioned, you guys are running kind of a CIO business, as well as a model business,\nwe'll obviously get into the ETF.\nSo when constructing portfolios for clients, you have a legalizing ETFs, or are you doing\nsingle stock?\nLike, you really have a long history of using ETFs, don't you?\nAbsolutely.\nSo we've used ETFs for a long time in the strategist business, because the model business\non platform at these independent broker dealers was traditionally done through the ETF\nspace.\nWe also used the ETFs in our mutual fund business.\nI would say that all of our really a core tentative who we are, and we were goals-based\nbefore goals-based was interesting, and before people were talking about it, but we built\nour strategist business around the goals-based philosophy, which is really to connect\nat our view, it's how you connect a product to a plan, the accumulation preservation\nand distribution phases.\nHow do you launch product, our manager model in a way, utilizing, as you said, ETFs,\nto really connect that model, ultimately, to a financial plan, and so that the advisor can\ntell the story about why I'm aligning this?\nThe thing that's really annoying to me is when somebody spends an hour or two on a financial\nplan, and then you have this convoluted set of securities and active mutual funds, and somebody's\ntrying to explain how they connected that financial plan, and it doesn't make any sense.\nYou're like, why am I even aligning this?\nAnd so we really, we use technology, we have in-house technology to really connect the product\nto a plan.\nBut ETFs have really been at the core of everything, and that's why we sell advise ETFs\nfor first trust, and it's really what's given us is the confidence that come to market\nwith so many ETFs this year, because we understand how ETFs work.\nWe understand where the gaps are, we understand where there's potential for innovation,\nand so we feel pretty confident that we're going to be able to come to market with ETFs\nthat are differentiated unique and really fit into this model framework, and connect\nthe ETFs to a plan.\nWe're not like a traditional ETF provider that's just talking our single product traditionally,\nwe're really talking about a solution set, and a set of ETFs that really fulfill a need\nfor an advisor and fulfilling financial plans.\nYeah, so it's, you know, you kind of have been using ETFs for a long time, you know,\nyou've launched two, you've said you're going to launch what's seven more, so like, what\nwas the decision tree, you know, I'm asking internally to say, hey, look, we need to get\nour own products out there.\nWas it a market need, were you seeing holes in your models, like, you know, what made\nyou guys decide to kind of jump into the ETF Thunderdown?\nI'd say it's a number of things, the biggest thing for us was a lot of advisor feedback,\nand so the way we think about providing solutions is we don't want to force an advisor\nto fit into our box, we want to tailor our solutions to them, and so we had mutual funds,\nwe had a couple of ETFs we sub-advised.\nWe also offered single stock portfolios, active management, tax management, you know, SMAs.\nSo we had all these different pieces, but the one thing we didn't have was our own ETFs,\nand so it was one gap that we had when an advisor came to us and said, we want to work\nwith you in this way, we didn't have something to offer them.\nAnd so really it's just expanding the solutions that we can offer to advisors.\nYes, we did do think that there is needs and there's some product gaps that we wanted\nto fill, but instead of launching more mutual funds, let's say, let's launch an ETF.\nSo we can fill those gaps and also offer a new solution set to advisors in a new way.\nI think that, at this point, we think we have a lot of the solutions that advisors need\nfor their practice, and so as we expand, again, we have just five or seven, like I said,\nwe'll file for more later this year to really push heavily in because we know that there's gaps\nand we know there's needs.\nWe have a lot of advisors we work with, especially in the USA, a world, and so we want\nto be able to just go to them with a menu of options and say, how do you want to work\nwith us and how can we best serve you in your practice?\nLike, how can we partner with you in the best way possible?\nSo you can grow your practice and differentiate yourself from the advisor across the street.\nSo just have to carry out, so you're launching that many funds, just like as an internal\ndiscussion.\nDid you guys, are you using a white label or did you file for your own trust and launching\nyour own product?\nAre you still subsidizing, like, what's the structure of the ETF business on your side?\nYeah, it's a great question.\nIt's one that I love to have because I've had a lot of market makers and other\nissues.\nSo we have, we have a trust or own trust that we that had our own mutual funds in it, if\nyou will.\nWe call it our own trust, but it's the horizon funds and those ETFs rolled up into\nthat trust.\nAnd so that gives us a little bit more control, as well as not having a deal with.\nIt can be similar, white label and additional costs that comes with that.\nWe have hired a trading sub advisor to allow us to scale pretty quickly because we've\ntraded mutual funds, we've traded resumes, but there's a lot more to trading ETFs in terms\nof the in-kind process, the APs dealing with the market makers, the exchange, and there's\na lot of different other pieces that we work familiar with.\nAnd so coming to market with this many ETFs, let's just, we said, let's just partner\nwith somebody that's really good and we'll come up with the strategy, we'll come up with\nthe distribution, and we'll let them do the trading and execution on our behalf.\nSo we still have ultimate control as the advisor, but they're the trading sub advisor\nall on.\nYeah, no.\nI mean, it makes a ton of sense, especially with that many product and you had your own\ntrust plus like this speed, you're going to be able to get to market, having some control\nover the board, you know, that they're independent, but, you know, being able to kind of\nhave conversations and set your board meeting times, like there's a lot of ad the vanages\nthat having your own trust.\nSo you guys really understand the ETF landscape, like I said, the OCIO business, your model\nbusiness, how do you see kind of the ETF landscape evolving, and it's moving fast?\nSo like, what are the trends and things that you're kind of paying attention to over\nhorizon?\nYeah, like I said, kind of the beginning, we built ourselves up as a model strategist\nin the goals-based framework, which is really about providing outcomes for that connect\nof financial plans and providing expectation certainly for clients.\nAnd when you say this product, this model is going to do X, they can get some certainty\naround that outcome, which means it connects to the plan and you can actually plan.\nAnd so what I think is going to come more and more, and we just saw some filings here this\nweek, is just more and more product centered around expectations, certainly.\nSo not just this high-flying, let me just look to find out for anywhere tracking error,\nbut this product is designed to give you X.\nYou can use that as a building block along Y, you know, and you can partner that with this\nother product that's product A. And those products fit together and provide a solution\nfor your financial plan that gives you the outcome you're looking for with some certainty.\nBecause you're using financial engineering, you're using, call it, for additional finance\ntheory, the well-documented, well-traught and past, and you're coming out with products that\nreally fit into those solutions that will still give you some alpha, right?\nLike, here's alpha opportunity, but let's not try to be a hedge fund within an ETF, because\nit's really hard for an advisor to put that in a plan and then plan around that.\nAlthough it's a cool idea, and you're going to probably see more of those kinds of things,\nit can be really hard in tracking errors that high, to really understand how does this\nfulfill a plan, and how can I actually get some certainty around, let's just say, a probability\nof success over planning horizon, if this product could swing any one's direction, because\nit's fully on constraint. And so I think there's going to be a lot more of those outcome-oriented\nsolutions that maybe aren't, we'll call it the buffer strategies, but are in that direction\nto really hone in on outcomes, an expectation of certain you four products for advisors,\nand really have helped them fulfill their plans.\nYeah, no, it's funny. I've been thinking along the same path to where now with some\nof the innovations in the ETF space, you know, the fine outcome products, you got buffered\nproducts, you can really build some things, some really compelling model portfolios, even\nfor, you know, risk adverse clients, but also clients who really want to understand what\nthis model is going to do, point to point, and no, I couldn't agree with you more. I think\nit's exciting. Definitely gives advisors and clients, you know, some stability, especially\nwhen you're either talking after some volatility in market, and, you know, it's nice for\na client to kind of know what their expectations are.\nYeah. So, let's pivot. Let's talk about your newly released ETF. I'm going to talk about\nBen J, BNJ, the Horizon Landmark ETF, at a high level, kind of, what is this fun trying\nto accomplish? Yeah, Ben J, this was, gave me the Benjamin's, so this is for liquidity. This\nis a strategy that fills, fits right into our distribution portfolios. We've modeled portfolios.\nWe've, I would say, fairly unique way that we execute on those standard distribution portfolios\nwhere we have an equity overweight relative to other folks, but we have a pretty big allocation\nto what we call a steady reserve or liquidity bucket. And so that helps you stomach the volatility\nthat you are probably taking on with the equity risk that you likely need to have a high probability\nsuccess. But with a high liquidity bucket, if you just ignore the fact that you're getting volatility\nin your equity portfolio, or even equity fixed income mix, and just focus on your liquidity bucket,\nthat's going to be able to provide you the spending you need to meet your needs. And so this is\nan ETF that's designed specifically to fit that liquidity bucket. And so we have the flexibility\non treasuries and treasuries like securities, but, you know, since launch and kind of the expectations\nwe're using box spreads in the option market to access, we'll call it T-Bills Plus.\nAnd we also think that there's some advantage here. I'm not going to say explicitly, but there's\nsome innovation that the ETF rappers is offering within the fixing income space and even in the\ncash space as a release of taxes. And I think this is just one product and there's going to be more\nof these and aggregate bonds and high yields where you're going to see folks implementing these\nin a way that doesn't make you have to compromise as a release of tax location. And so with a\nproduct like this, or if you were to get something, a product that's kind of flavor like this in the\nag bond or the high yield space, you could hold that within non-qualified account, not have to worry\nabout income getting kicked off. You don't have to worry about tax location, which is what folks\ndo now at large RAA is they put all the fixing income in the qualify, the whole equity, the non-qualified,\nand they try to optimize for taxes. Well, what if you had ETFs that didn't have to kick off that income?\nSo this is a way to kind of play into that direction. I think there's going to be more products like\nthis going out into the aggregate bond and high yield and other fixing income allocations that are\npretty common in model portfolios. Yeah, super interesting. So how does BenJ determine kind of asset\nselection and the allocation within this particular portfolio? Yeah, this one's about one to three\nmonth out box spreads is what we're looking to target. We were much smaller than some of the other\nfunds in the space and so we're trying to be a little more tactful with how we execute on that.\nThis is pretty low risk because you're effectively lending from the OCC, so if the OCC fails,\nyou will fail, but you won't get paid, but I think OCC failing would be the least of our concerns\nat that point if that were to happen. I'd say we're looking for about T-Buil like returns T-Buil plus\nand there's a pretty good, we'll say historic precedent that you can access that through the\nbox spread market and T-Buil plus and so there's obviously times where that market is going to\ntighten and sometimes where that market is going to widen and so we just want to be tactful\nand tactical around that and around the one to three month matured your age. Yeah, so that was going to\nbe my next question. Like what conditions tighter or wider is this portfolio going to really\nperform best and like what do you guys prefer? Yeah, I mean the box spread market is sort of\nirrelevant to or it doesn't really is not really impacted by, we'll say equity vote, although\nthere it potentially is by the fact that you have market makers and other folks that have\nto quote you and provide you a market and so that can come in like we've seen that market come\nin a little bit more recently and it doesn't necessarily move a little bit more with with a\nshort term rate but obviously Fed funds doesn't move and so T-Buil's are sort of penned by\nFed funds and so you can see some opportunistic trading around what you think the Fed's going to do\nthat you could probably you know opportunistically maybe extend duration because you think the Fed's\ngoing to cut or maybe put a shorter duration on so that you can roll into a fact that the Fed's\ngoing to cut or you know right you can play that market a little bit obviously some of that is\ngoing to be reflected in the box spread market through basically changing the short term rate\nbut it's not a it's not a market that moves that much again this is a perfect\nperfect strategy for the liquidity bucket there's other funds out here that will do access\nsell commercial paper or other sorts of short term exposures you've got some strategies that\nwill own short term treasuries and sell you know puts breads on top of that to try to add some\nadditional yield this is an approach that we think is going to give that liquidity like exposures\nuncertainty around what you can expect from performance which is really important for somebody\nthat's in a spending stage or somebody that's looking to take distributions but also giving\nsome other benefits that we think is really conducive to a model portfolio one of the things that\nreally has if you think about a model portfolio model portfolio especially in the context of a\nbroker dealer you're dictating the weights and if you have a strategy or an ETF that's kicking off\ncash all the time that cash is then coming into the model and then that model has to do something\nwith the cash and so if you can have strategies that aren't kicking off that cash all the time\nit's really conducive to the execution of a model portfolio because that is what a model portfolio\nis it's experiencing the total return and when you need to access the capital I you want it liquidity\nyou just change the model weights and you access that capital model getting cash that kicks off\nconstantly is causing the broker dealer or the advisor to do something with that cash which isn't\nreally the intention right they want that cash when they want it not every month in time frames\nthat they don't right while these advisors maybe do quarterly distributions or even six\nmonth or annual distributions so getting that cash every month it's just causing them to have\nunnecessary activity so this is getting rid of that need to have cash kicked off but giving the return\nthat you're actually looking for got it so if I'm a model portfolio advisor or providing\nasset locations to advisors instead of maybe using you know BIL or Swah money market fund it's\ngoing to kick off income this would be the replacement for that that you're still getting\nincome per say it's just not being realized. Yeah it's a total return which then allows you to\nto we'll say access that capital when you need it which is really what the advisor does right when\nthey want that access that capital they changed the model weights and they access it\ngetting that cash kicked off which then you have to pay taxes on in addition to the fact that you\nalso need to do something with that cash year generating this cash and sitting there it's not\nreturning potentially as much depending on where that cash is getting swept to and then you eventually\nhave to take that cash when it's large enough and buy the ETF weights okay just causes all this\nunnecessary activity and so this provides I think there's going to be more strategies like this\nlike I said in aggregate bonds and how yield them should be two other biggest spaces within the\nmodel business I think this fits really well into a model portfolio and again it gives you that\nreturn that you're looking for without the need to have as cash that you're constantly having to do\nsomething with and it fits in it gives again liquidity exposure like we find we've typically two to three\nyears where the spend so if you're looking for 5% distribution that could be 5 to 10 and maybe\neven 15% of your portfolio if you have three years of cash outside to meet your stunning needs\nwhich is our sort of base model allocation that's 15% of your portfolio that's kicking off cash and\nnow you have to do something with it in this case it's 15% of your portfolio that's just sitting in this\nwe'll call it this ETF that's just going to experience a total return similar to what you would\nbe getting but you're not having this cash that's constantly coming in that you have to actually\nrespond to and allocate reinvest in all of those things that are not really conducive to a model\nbusiness in the way they think about a model portfolio which is weights those weights drift\nand then I rebounds back to those weights or I change those weights as I see fit.\nMakes a ton of sense to me I can also see like some tackle managers utilizing this\nso it's not kicking off income you know if you're using a BIL or something else is a you know risk\noff trigger or a way to kind of de-risk the portfolio using this you don't have that additional income\nmakes a ton of sense to me so you guys are fairly new to the ETF space longer I'm assuming\nin the mutual fund space so like how is your firm thinking about like marketing distribution like\nyou're coming out a lot of product like this is the million dollar question to a little bit different\nthan the distribution for model portfolios and mutual funds so like how are you thinking about\nentering the market and making a splash yeah I think it's it's a multi-pronged approach\na word ETF model provider and so you could see us make some changes to our ETF models to utilize\nsome of our own products which has been you've seen that done by some strategists in the space\nwe also have a very mature OCIO business with several hundred advisors that we work very\nclosely with and we also have advisors that have not worked with us and the OCIO capacity and the\nsolutions oriented approach because we don't have ETFs and that's all they use and so this is\ngoing to as these get to scale hopefully in the next year through some sort of allocations that\nwe're going to likely to make it will give us the opportunity to go into that business and push\nin there with different building blocks it's not like we're going to say hey you need to use\nall 10 or 12 or 15 of these ETFs but it might say hey these two are three fit in the context\nof your solution and they pair well with these other products that you use and that your clients\nare used to using and provide you a really outcome oriented solution that's conducive to your\nfinancial plan and so it might be this this advisor uses these three a different advisor uses these\ntwo and the goal is to just have a lot of different building blocks so again we can be agnostic\nto how we can distribute and work with the advisor we're just looking to provide them a solution\nthat's their own custom models that they can own as their own and that they can help grow their\npractice through that sort of custom model framework yeah based on a sense before that you\ngo you said you launched two we talked about Ben J what what is the other ticker and what's it\ndo the other ticker is HBTA it's called Expedition Plus this is a large cap US equity basket with\nMichelle and put spreads on top of that and so it's about a 1.21.3 beta not the best time to launch\na strategy like that but what I will say is right the way we think about products is\nright trying to time we're not trying to come to market and time the best time or a bull market\nor whatnot we're just coming to come to market with strategies that we think are going to provide\ncertainty and so it's providing certainty with higher risk but when the market rips higher it's\ncan also provide that and this is really what we found with advisors as they said hey I want\nsome high risk exposure especially through 2324 and you think back to like 21 not 22\nthose periods they're saying hey we want some high risk so they either go buy cues\nthey buy small caps or they buy in the video and so we said well let's come up with something\nit's got a reasonable tracking or the S&P but it's with certainty because of the way we're\nexecuting on it it's going to give a lot more our expectation certainty about delivering that\nthat beta or that higher risk straight to the S&P because most people benchmark the S&P\ncues doesn't always win small caps don't always win depends on the market environment\nand the video isn't a video so let's just focus on what they care about which is I want to\noutperform the S&P when it's up 24 and so that's what we looked at design and then so\nwith certainty it's going to provide that but it's also going to underperform the S&P when it's down\nand that that's fine I mean I'm not trying to gain the system because then I'm not providing\nyou certainty right I'm giving you certainty of like this is what it's going to be it's going to be a\nhigh risk exposure without it's leverage per se so yeah now I can tell you all about launching\nit's a long time I launched an equal weight low volatility strategy at the end of\nend of 22 and then 2324 was market cap weighted no volatility so I get it man\nso sometimes you time a ride Brad and that's why he's got a come to market and keep pushing\nand also just really tell the compelling story of like where it fits and then right then folks know\nlike this is how this fits in my portfolio and you just happen to launch it at bad time and and\nthat's okay because when that time comes this strategy is going to be here right we have we\nsub-advised three low volatility as for first trust and we launched our first two and one was at\n2016 and so like a little bit of that run was amazing and then we've had basically I don't know\nyou can do the mass six years of just absolute underperformance for low law and every state of the\nworld so low laws been a tough factor until this quarter so yeah it'll have its day it's just\nyou should have an understanding of like this is why you would use this and this is where fits\nand that's kind of where we think it's not just about a product push which really what differentiates\nis from other ETF issuers where it's all about a single product push and like creating all this\nit's about let's provide solutions and then tell you how you can use those and where they fit in\nyour portfolio and the overall low-vol equal way may underperform in most states of the world this\nis why you're holding it in this way because it fits in these contexts and don't compliment\nin a video right it'll compliment this other exposure and provide you something you can't get\nit somewhere else so that's the way we think about like you're not going to see me come to market\nand talk about a single ETF much right you're not going to see me come to market and just like\ntrying to push the next hot ETF ticker I think we've got some great tickers I think we have\nsome cool strategies but it's always going to be centered around these are for solutions for\nadvisors and they're going to fit into their practice in ways that make sense for them\nyeah not trying to just go straight retail Reddit Avenue it's it's really centered around fulfilling\nand financial plans and empowering advisors to grow their practices which I think it's it's kind of\nunique in the ETF space because you've got a lot of the the latter and not much of the kind of\nyeah well Clark I really appreciate you spending some time with me before I let you go where can\npeople learn more about horizon where can people learn more about your ETFs yeah horizon investments\ndot com and then we've got horizon ETFs dot com those are the two two places you can go\none's going to give you a sense of our firm and the different solutions we offer advisors and one's\ngoing to give you a link to our two ETFs and many more to come this year it's going to be a busy\nyear for us over here but we're excited about the products that we're coming to market with\nthe opportunity to bring some innovation into the space well when you get the new ones out\nand you you're excited about something getting a ring we'll get you back on absolutely thanks Brad thanks\nhard",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}