{
  "id": "15446649",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, chief investment officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nToday we have on Tim Kramer.\nHe is from CNIC Funds.\nWe are talking about Amt, which is their Ice US Carbon Neutral Power ETF.\nTrades off of an index, they have designed.\nIt's a very interesting conversation.\nI've could have talked to Tim for a very long time about the power markets.\nI find them very intriguing.\nThere can be extremely volatile, extremely speculative, but in this case we talk about\nwhere you should be looking at getting exposure to this commodity and how to use it in overall\nportfolio, as well as some of the mechanics of how this portfolio and the ETF actually operate.\nWithout further ado, please welcome Mr. Tim Kramer.\nHey Tim, welcome to the show.\nThanks for having me.\nI appreciate the opportunity.\nBefore we get started, I want to tell everybody a little bit about who you are,\nyour background, and how you eventually started CNIC Funds.\nSure, so my name is Tim Kramer, and I've been in the energy industry since about 1997.\nWorked at a number of different energy companies, some asset-based, and some just proprietary\ntrading-based.\nBefore starting CNIC, my most recent job is I work for a private equity company where I was\nresponsible for hedging their commodity exposure for their PE group and their infrastructure group.\nSo that would be crude oil, natural gas, electricity, interest rates, effects, metals,\nand pretty much anything that you could put a price on it and you wanted to get the risk out\nthe door, that's what I was doing for.\nAnd so then we saw an opportunity there, and kind of a whole thought process was this.\nIf you take a look at this, there's commodity indexes.\nSo there's what's called the B-com, the Bloomberg commodity index.\nAnd then there's the Goldman Sachs commodity index, called the GSCI,\nand oddly enough owned by S&P, not Goldman Sachs now.\nAnd there's somewhere between like 500 billion to 800 billion dollars,\nlike directly and indirectly tied to these commodity indexes.\nAnd so they each hold about 24 or 25 different commodities.\nSo it might be gold futures and crude oil futures and corn futures, etc.\nBut electricity also has futures that trade on ice, intercontinental exchange.\nSame guys in the New York Stock Exchange.\nAnd so electricity in the US is the most consumed commodity on a retail\nemotional basis.\nBut it's not in any index, any ETF, any mutual on its nowhere.\nAnd so we kind of started scratching our heads and said it just doesn't really make any sense\nthat the most consumed commodity is not in any one of the commodity indexes.\nSo what we did on we kind of make the joke that we would took a long weekend in a case of beer,\nand we created the first ever electricity index, and then we partnered with ice,\nand we published the index in January of 2023, and then we did an ETF that was benchmarked\nthat the ticker is out to AMPB, and we chose that because like all the other cool tickers like\nshock and bulletin stuff will take and so we landed on it.\nAnd so we launched that in, let's see, it was May of 23.\nSo that's kind of the background and where we are right now.\nSo kind of before we get into all the nuts and bolts, I always like to ask everybody,\nwhat do you like to do when you're not behind the desk, any hobbies?\nThis ETF and the company starting your company doing this, this is the screaming infant that never\nquiets.\nAnd so pretty much everything I do is tied to just trying to make this thing survive, make it better,\nand we're dealing with that.\nThe few instances that I have that I do get some time off, I like to go back to Pennsylvania,\nand visit my parents and you know, go fishing.\nYeah, so let's talk about, we're going to talk about the electricity markets,\nbut one of the things that I keep reading is and comes up is carbon neutral in your name.\nSo can you talk about what carbon neutral allowances are,\nand I also saw that there are futures for these as well.\nSo can you explain how those contracts work as well?\nOh sure, so so basically you've got in the United States.\nThere are certain areas of the country where if you have a power plant,\nthey don't want you to have any emissions.\nBut if you do have emissions, you're allowed to have these certificates,\nthese carbon offsets, and you pay money for them.\nSo what happens is it's basically a tax on polluting.\nAnd there's futures that trade on the exchanges also for these carbon offsets.\nSo a simplified way of thinking about it is once a year in these areas,\nsomebody climbs up the emission stack and reads the meter and says,\nhere's how much carbon you put out.\nThese are the number of offsets that you have to have.\nAnd so there's a futures market that trades.\nAnd so these things, like the Paris Accord, the EPA,\nNirk Freckman, all of the US agencies are saying that for transition to a\ncarbon neutral environment that using allowances, which is basically taxing or right to pollute,\nbut you pay money for it, they're saying that that is a necessary step to kind of get you\nwhere you need to be to be totally carbon neutral emissions free for what the grid's going to be.\nInteresting, so as far as the future is concerned, how is that price in terms of when you're\nlooking at kind of the NAV of that future, how does it move and why would it move?\nSo for instance, the two big ones in the US are what's called Reggie's regional greenhouse\ngas initiative, and that's for like the Mid-Atlantic States.\nAnd then California has what's called the CCA's California Carbon allowances.\nAnd so they'll have auctions for these carbon certificates.\nAnd every time they have an auction, they've got a floor and a ceiling for what the price is going to be.\nSo they've got the price kind of ratcheting up.\nAnd they also reduce the number in each auction that you're going to have.\nSo in essence, this is an increasing price and a decreasing number of allowances with us.\nSo what they're doing is they're giving you time to transition, but they're making it\nmore and more expensive for people that actually aren't actively doing that.\nSo what happens is you kind of have an idea of what the range of these prices should be.\nAnd then if the guys that actively speculatively trade these things, they'll put together models.\nAnd they'll say, OK, well, we think we know how much every power plant in this one region\nis running, and we think we know how many emissions they're going to use.\nAnd oh, hey, the weather didn't materialize, they're going to use less.\nSo we may short it for a little bit.\nSo you've got that dynamic going on also.\nBut that's pretty much what do other things work is just like the auction process.\nAnd then you've got the increasing price and you've got the decreasing volumes on that.\nAnd then you've got the future market, the future is to trade on those things,\nwhich kind of correspond to the physical certificate work.\nInteresting.\nThanks for that, because when I was reading about it on your site, I'm like,\ninstead of me doing my own research, I figured I'd just let you tell everybody here.\nSo yeah, no worries.\nWe meant, well, what we do with our, with our ETF and the index is we take futures,\npower futures from six of the different regions in the US, so you get a national footprint.\nAnd then we wait those based on what the average annual electricity consumption is.\nSo we've got kind of a good picture for the US and how much electricity is being used.\nAnd then we go on the EPA website and you get the carbon footprint for each one of those regions.\nAnd then the index and the ETF basically purchases the right amount of carbon offset\nso that the whole thing is carbon neutral.\nAnd so we're, we're SFDR article eight, which is the second highest over in Europe.\nAnd SEC, SEC, New York Stock Exchange, I say, everybody took a look at it and said,\nyeah, we a bunch of people in the pen and look and said, yeah, this, this, this can count as carbon neutral.\nInteresting. I wouldn't say that it's funny because we are originally where we're calling ourselves green.\nAnd we had somebody smack us in the nose and the newspaper and say, you're not green.\nYou don't even know what green is. Nobody knows what green is.\nAnd so it was kind of difficult to define that. So at least saying carbon neutral is quantifier.\nGot it. So let's talk about electricity. We have a lot of, I think you're the 50th episode.\nWe've had everything from CLOs to stocks to bonds to ETFs to funds of funds.\nSo this is the first electricity product. And a lot of financial advisors who listen to this\nprobably don't understand or know that electricity is even an investable universe.\nSo can you talk about like at a high level, what are the main drivers that can affect the\nprice of electricity and how it can move up and down as time goes on?\nYeah, sure. So kind of like the background of this would be, you've got, we'll just\nlook pick on gold right now. So you've got gold mining companies like freeport,\nmacro and etc. So if you wanted to, you could invest in the equities of a company like that.\nBut also, you can just choose to buy physical gold or you can choose to buy gold futures.\nSo all those different investment vehicles exist. And typically, if you want exposure to\ncommodity, you'll buy the commodity futures because it gives you direct exposure.\nIf you bought a company that mined gold, well, you don't know if a hedge or didn't hedge and\nthey've got operating expenses and overhead. So you're not getting a real pure play on the\ncommodity if you buy the equity. So you're buying the equity for a different reason.\nMaybe it's a dividend or something else. So that same logic exists when you talk about electricity.\nSo there's, you can buy stocks and companies that are called IPPs independent power producers\nwhere you can buy utility stocks. And that can give you, like from an equity perspective,\nthat could kind of give you exposure to electricity. But we are the first or the only,\nbecause we have a five-year exclusive of ice in a continental exchange on a data and the indexes.\nSo we're the only guys that can do this for five years. And so our investment product is the\nactual futures that trade on the intercontinental exchange. So we are commodity futures and\nthe product and specifically what the electricity futures. So then that's kind of the underlying\norder this. So then your second part of your question is kind of what affects this in terms of\nlike supply and demand. So we would say in terms of demand, every time you pick up any paper,\nyou're looking at AI and how much that's going to impact, you're looking at newer chips,\nto take more power, you're looking at electric vehicles and the share of that's going to be\neverything you pick on paper is saying that demand for electricity is grossly understeady.\nAnd then in terms of supply, what you've got right now is the US has a goal of trying to be\n100% renewable generation. To move in target, sometimes people say 2035, it's kind of in pushback\nlike maybe 2040, 2050 just depends. But the US is trying to add renewable generation.\nAnd the problem is they're retiring fossil generation pretty much in a faster rate than they're\nout in the renewables. So that creates a supply imbalance. We think demand is grossly\nunderstated. We think supply is grossly overstated. And then there's in third issue, which is\nwhat we're going to call, let's just say reliability. And that is the fossil fuel generation that\nis getting replaced. You can control the output of that. So if all of a sudden you've got a\nreally hot period, you can instantly ramp up the output from those fossil generators,\nbut you can't do that with wind and solar for the most part because those things you just can't\nvary the input. I mean you get the wind and you get it or you don't get it in the same with the solar.\nSo there's kind of a reliability issue and you're adding more volatility. And there was an article\non the journal today that talked about battery companies and they're saying, yeah, we can only\nguarantee this in the more volatility. So that's kind of the supply demand overall picture. And then\nthere's that other added element of volatility. So talking about volatility, you walked right\ninto my next question. I had a couple of friends who were actually PGM electricity traders.\nThis is can be one of the most volatile asset classes out there if you're trading the ice\nfuture. Oh, no, not can be electricity is the most volatile commodity in the world. But now what\nhappens is that's on a shorter term basis, right? So electricity for our product, we use the\nfuture. So we use one month future out to like month 12. And then is that prompt future\nstarts to expire. We'll roll that to month 13. So we're always like a 12 month strip. That's what\nthe index and ETF is. But for your bodies that trade PGM, which Pennsylvania Jersey Maryland,\nyou can trade hourly power. You can trade next day power balance of the way you balance them\nlike you can trade things like that. That stuff's crazy volatile. That stuff like that'll be like,\nyou know, 800% on an annualized volatility. That stuff's crazy. So what we do is we do the longer\n10 or we do that 12 month rolling strip. And so for instance, the 100-day volatility like right now\non the index is 15%. And if you think about this, right? If you're taking a look and we're sitting\nhere today like in mid July. And if you're trading PGM, and you're looking at these weather\nforecasts, which change all the time, those prices are swinging around massively. But the index\nright now, it holds August of 2024 futures all the way through July of 2025. Just because next\nday like July 18th to July 19th power is moving around. It's really volatile. That's not really\ngoing to give you that much of an impact on what your perception is and what's going to happen to the\nJuly of 25 contract. So the longer you are, like the longer you go out on the future skirt, the less\nvolatile that stuff is. But your buddies are exactly right. And what they're doing is, in essence,\nit's crazy. Well, I mean, it can be, you know, kind of just staying on the topic for\nminute before we get into Amp. It can be, there is some predictability to it based off of\nseasonality weather. I mean, but they are trading like day trading in the short, which is highly\nhighly speculative. But the energy market to me is fairly interesting because there is seasonality\nto it where you can get a little bit predictive in terms of trying to take advantage of, you know,\nmedium term price movements in futures. So I would say if you look at it this way, that's a really\ngood point. You've got, we'll say, two things. There's going to be a seasonality aspect to it,\nabsolutely. And there's going to be trends. And so those, you know, playing longball, those trends,\nthose things tend to exist for a while. But then you've got the noise around that, which would be\nlike, for instance, you had an El Nino event. So you had the warmest December January February\nin the history of, like, recorded with, like, all that back to, like, 1893, I think it is. And so\nwhat happens is they just crushed everything. And you can look at the power index or Amp through\nyou can look at, you know, a lot of different things. And you've seen those things kind of, you know,\ngo down. But the overall fundamentals are still in plan. We said, we still think the fundamentals are\nkind of like really robust for, like, long-term appreciation of power. But you'll see that white\nnoise around what the longer trends are. And so there are some guys. I'm sure your friends are in\nthis bucket that do a really good job of, you know, making money off of that short-term ball.\nLike, back when I worked for an asset-based company and had, you know, asset-based and proprietary\ntrading books. We had five meteorologists that worked for us. And their ability to tell you kind\nof what the long-range weather is, like, we think the next three months are going to be warmer\nthan normal. They're really good at that. But asking them to kind of get, like, the shorter-term\nweather, and it was almost like a coin flip. Yeah. So matter of fact, a quick aside is, we know,\nthe weather really matters. And so, and this is back, like, early 2000s. So which we said,\nokay, we want the biggest, baddest, best meteorologist we could find. Who's that guy going to be?\nAnd so, we actually picked up NASA's head meteorologist because we figured if the guy can land\nthe space shuttle in the middle of a hurricane, he's got to be pretty good. And so, the game at that point\nin time was, there was a bunch of commercially available weather reports that would come out in the\nindustry would follow. So our guy would say, here's our forecast. We think it and, you know,\nmake something up. We think it's going to be really hot. He said, but at 9 o'clock, this commercial\nvendor is going to say normal and 10 o'clock commercial vendor 2 is going to say cold. And he would\ntell us when everybody was going to say when they would say it. And then we could wait until\nthe worker reacted to the commercial and then we could use the proprietary. And even that was\nnot as accurate as you would have liked it to be. And now today, you've got, I mean, you've got\nguys that are using ridiculous amounts of data and they're throwing AI at this. And they're looking\nat individual, like, hour by hour, weather forecast for adjacent cities and they're doing some\nreally specific trading on this individual point. So to your point, it's really gotten pretty\nsophisticated. So let's, let's talk about AMP. Sure. Let's go back to, so it's a MPD. And\nat a high level, we talked about it a little bit, but, you know, your elevator pitch on what this\nproduct is really trying to accomplish and where it's trying to fit in the market.\nThe elevator pitch is the electrification of America. And then the way we kind of back that up is\nwhen you buy something for your portfolio, there's just two reasons you buy it. One would be speculant\nit. I'm sorry. One would be what we would say strategic, excuse me. So this strategic reason\nwould be why do you want to buy this and hold it forever. And then the second reason would be\ntactical, which is like, why do you want to buy it now? So for the strategic, like, why do you want\nto buy and hold it forever? If you take a look, and for the longest time, model portfolio is\nworth 60, 40. So 60% stock, 40% bonds. You have kind of, let's just say that's kind of falling\nout of favor a little bit. And so now you see investment advisors that are talking about 60, 35,\nwith 5 being commodities. If you take a look over, like, I think it's like an 80 or 10 year period,\nthe 60, 35, 500 risk adjusted and an absolute basis has been beating the 64. If you do a 60,\n35, 32 with 2 being us, it beats everything. Over a longer period of time, it goes back to\nlike we talked about it with the white noise and everything else. So number one, we think strategically\nmodel portfolio. Number two is inflation. And so when CPI comes out month after month, 2.5% of CPI\nis directly weighted to electricity. So that's the direct. But the indirect, you can make the\ncase electricity literally touches everything in the US. One good example of this would be,\nwe talk about retail grocery stores. So retail grocery stores about 17% of their\nopx is electricity. And their profit margins are like 1%. So if you increase power prices,\nyou can see what that's going to do. You have to pass that through to mom,\npa, cranberry, or when they go grocery shop. So we think just the direct and the indirect components\nso from an inflation perspective, we think that also does a really good piece of protecting the\nportfolio. And then the third for strategic is we're not correlated to anything so we give you\nportfolio investigation. So that's the strategic. The tactical is like, why do you buy it now?\nThe first reason would be, like we talked about, we think that demand is grossly\nunderstated, supply is grossly overstated. And there's the whole, you know, we'll say reliability\nissue. The second thing is, when you buy AMP, to me you're basically buying futures that we\npackage for you and ETF, if you buy a hundred dollars worth of futures, $15 goes to your broker\nto support the trade is margin. The other 85% at the 85 dollars goes into basically three month\ntreasures. So you get paid the risk free rate to hold this position as you wait for the\nfundamentals to unfold. So that's kind of the strategic and the tactical reason and how I think\nyou should live in this. So I think you answered this question earlier, but are you doing kind of\nany analysis to potentially overweight one region over another or like how are you making the\nwaiting decision inside of the portfolio? Right. So this particular product, AMP,\nAMP is a passive product. It is benchmarked to the power index. And so we are not actively\ntrading against this because this is the first ever product any time that you do any with your ETF\nexperience you know this. But any time you do an actively managed product, people say, well, I want\nto see a five-year track record. And so in order to get this to market, what we did is when we\nwould be partnered with ICE, like I said five-year exclusive of the data in the index,\nbut the index actually goes back to 2014. So there's a 10-year history that ICE publishes for this\nindex. And so by benchmarking to the index and staying passive and matching that, what that does\nis that removes the ability to set for people to say, well, I want to watch how you actively\ntry to trade this as CL or Excel. So we just stayed benchmarked to that. And then the weights,\njust like what the Bloomberg commodity index, the Goldman Sachs, or this other primary commodity\nindexes, the weights that we have, those weights are re-weighted once a year based upon what the\ndata is for what the electricity consumption is. Perfect. That was going to be my next question.\nHow often are you bringing this index back in line? So annual, I was looking at the index history.\nGo ahead, John. We did annual because we're making it fungible with the Bloomberg commodity\nindex and like other commodity indexes. And the reason that we're making it fungible is because\nwe think that you, there's lots of applications for this. So the 60-35-5, we think that works,\nbut also for people to just have commodity exposure. And so if you look at like the top hundred\nendowments in the U.S., I think they've got something like $500 billion. And if you look at the\ntop hundred pensions, they've got something like, it's like six trillion. It's a mind-boggling number.\nAnd the pensions tend to hold, we'll say, about 2.3% in commodities, and the endowments hold\na little more like 2.8. And so what we're saying is it doesn't make any sense that you don't hold\nthe most concerned commodity in the U.S., so we make it fungible with their other commodity\nindexes so they can kind of switch a little bit of late in there. So I was looking at the index history\non your website. And it seems to me that it can kind of bounce around for a little while. And then I\nsaw in 2021, 2022, there's this massive spike in the index. And then it normalizes. Is that kind of\nthe expectation of somebody who's holding this in a portfolio that every once in a while that\ncan happen? And what talked about this a little bit, but I just want to hear it from you,\nkind of what drives that price movement in the index, which will eventually affect the ETF?\nYeah, sure. We think that when you look at this thing over time, and where it has been,\nwhere it is now, and where it's going, we think that this thing is going to be,\nyou know, appreciated over time for a very long period of time because of what we talked about\nwith the electrification of America, you know, the AI, EED is all that good stuff, right?\nSo we think that you've got that, but there's going to be, you know, the white noise around that\nthat we talked about. And so the reason you had that big spike up is you were coming at a COVID,\nand you had just massive amounts of pent up demand, you know, industrial, as well as people\nwere turning to the office. And so that manifested itself pretty nicely for it. And then you had\nthe cell off because like we talked about, you had the warmest winter history of the U.S.,\nDecember January February. So when it, when it's, you know, a pick a number of 50 degrees in\nFebruary down the I-95 corridor, you've got enough electricity, and prices are going to be low.\nSo we just kind of view that as the noise around what we view the longer-term trend.\nSo I see the product actually offers a yield. Where is that yield coming from?\nAnd, you know, was that, I guess it's like a value add to having direct index exposure here to\nelectricity, but like I saw, I think the product right now is offering like a 3.1% yield.\nYeah, that's about right. So what we talked about, when you put money into commodity futures,\nif you buy a hundred dollars worth of futures, you don't need to put the whole hundred dollars\nto work on a futures contract, your broker is going to do a calculation, he's going to say,\nwell, I know how much it can change in price. And so I'm going to make you just post up that\nmuch in margin. So if it changes, I know that, you know, we're covered. And so of the hundred\ndollars that go in the futures, about 15 of it go into the actual contracts itself. And then the\nrest, according to the index and the ETFs, same thing, they get parked in three-month\ntreasuries. And so 85% of the money goes towards getting your back that meal. But you still are\ngetting full, no $100 exposure, you still need to put the $400 to work on the futures.\nYep. So I know that you guys are buying longer term future contracts in this product,\nwhich will help dampen volatility, of course. But do you see periods where this product might\nbecome day-traded in periods where you're having that so-called white noise event?\nOh, absolutely. We think that, like we talked about for this,\nthe strategic and the tactical, that's kind of where we think if this is portfolio. But once,\nonce we get a little bit more liquidity and actually and amp itself,\nwe think that there would be some very interesting opportunities for guys like the PJM\ntraders that you talk to that they could keep an eye on things and they may have a different view\nthan the rest of the marketplace. And so we could see this being a pretty interesting arbitrage\nwe go for certain people in marketplace, absolutely. So funds fairly new. I always like to ask people,\nyou know, how are you kind of envisioning, getting the name out there, marketing and distributing\nthe fund? So great question again. We built this up where we call crawlwalk run and so we didn't\nchoke down a lot of overhead. So we used a white label, ETF provider for compliance, legal,\nthings like that. We call that mid and back in the box. And we also have just kind of not\ntaken out like a whole lot of staff. And so the marketing and the distribution of this,\nwhat we're looking to do is we are looking to partner with and we're having some ongoing conversations\nwith the number of platforms. What we're looking to partner with a platform because in addition\nto having that five year exclusivity, we have the ability to brand or co-brand this with anybody\nwe want. So for instance, if you had your own ETF platform, we could call this the Brad Electricity\nfund or we could call it Brad-IS Electricity fund. And so there are a number of platforms that\nbecause of that five year exclusivity could be the only ones that would have their name on\nsomething associated with this for a pretty long period of time. And that would give them a competitive\nadvantage. But absolutely recognize that we need to have a strong institutional and retail sales force.\nAnd instead of trying to grow that ourselves, we're trying to use our competitive advantage\nto partner with somebody and just get the best of both strengths. So Tim, I really appreciate your\ntime and super interesting. We could have gone down so many different paths with, you know, we're\ntalking about shopping centers and the whole brokerage and hedging side of this. Like, there's\na lot that people don't understand about the electricity market that you and I can probably talk\nfor hours about. But again, I really appreciate your time and before I let you go today,\nwhere can people learn more about you and in CNIC? Sure. So our website, CNIC funds with an S, CNIC\nfunds.com. And that we published white papers on there once a month. We put our podcast\nwebcast on there that would do with third parties. And so there should be enough material\nthere for people to get a really good understanding kind of what the product is.\nWell, again, thank you so much. And, you know, good luck on growing this thing. I think it's\nit is the most unique product in the space. Because I think it's the only one. So good luck\nand good to see you. And I just want to say thank you. Once going to appreciate the opportunity\nbecause as you know, when you're starting up your own ETF like this, it's a difficult endeavor.\nAnd so, you know, guys like you, they give us a voice and help us get the word out since\nit's certainly appreciate what you're doing. All right. We'll see you soon, Tim. Thanks. Thanks. Appreciate it.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}