{
  "id": "15484014",
  "transcript": "Welcome to Behind the Ticker.\nI'm Brad Roth, chief investment officer of Thor Financial Technologies, and portfolio manager\nof THLV, the Thor Low Volatility ETF.\nBehind the Ticker, uncovers the inner workings of the ETF industry.\nWe will interview portfolio managers and ETF service providers to dive deep into their\nwork lives and their businesses.\nWe will learn the inner workings of their strategies and what drives them as they continue\nto grow their company.\nMany of these individuals are entrepreneurs, and will have unique and compelling insights\nto share as much goes on behind the Ticker.\nPlease note, nothing in this show is investment advice, and it is meant solely for\neducational and entertainment purposes only.\nWelcome to Behind the Ticker.\nToday we have on Will Rind, he is from Granted Shares, and we are talking about D-Rupp.\nI had him on earlier in the year, we talked about their leveraged ETF and inverse ETF series of\nsingle stock, and today we are talking about their Nasdaq Select Disrupters ETF.\nIt is a really unique strategy.\nIt is in that innovation, thematic space, but also has a bit of a value tilt companies that\nhave a sort of a moat around it.\nIf you are looking for an alternative to innovation type strategies, I think this is definitely\none to look at, so please enjoy this conversation with Mr. Will Rind.\nHey Will, welcome back to the show.\nThank you, Brad. Good to see you. Good to be back on the show.\nYeah, so why don't we just do a quick refresher?\nI know we've had you on, you've done your extensive who you are, and we talked about Granted Shares,\nbut for one of the new listeners to the show, why don't you give everybody just a refresher\nwho you are in a little bit about Granted Shares?\nYeah, sure. I'm happy to.\nAs I'm Will Rind, founder and CEO of Granted Des, we're an ETF issuer.\nThat means that we issue ETFs, or manufacture ETFs, and market them.\nWe create lots of different ETFs, everything from physical goal, to income strategies, to broad\nequity strategies, to what's becoming very, very popular at the moment is leveraged and inverse\nETFs on single stocks, like Tesla, India, etc.\nSo the company is about 8 billion in terms of assets on the management.\nI'm growing very rapidly, and we have a big presence, not just here in the United States,\nbut in European markets as well.\nSo we're here today specifically to talk about your Granted Shares Nasdaq select disruptors ETF.\nI'm going to call it drop, drop, I don't know, ticker DRUP at a very high level.\nCan you explain to us what that fund is trying to accomplish?\nYeah, so at a very high level, this is the top 50 most disruptive\nequities in the US market as selected by Nasdaq.\nSo how would you kind of define that word disruptor?\nWhat does that mean to you when you're putting some of these names in the portfolio?\nYeah, so DRUP, as I call it, but drop DRUP is the strategy here.\nAnd it's an index based strategy, that means that the index and the methodology behind it\nwas created in partnership with Nasdaq.\nSo we aim to replicate that index and then the methodology that's used in terms of how companies\nget selected, it is a combination of factors.\nSo those factors are things like the patent value of a particular company's patent portfolio,\nstuff like the amount of money that is being put into R&D, gross margins,\nother factors that ultimately make up a score.\nEvery company from the Nasdaq, so the top 500 companies in the Nasdaq are ranked\nscored and then ranked.\nSo we take the top 50 names with the highest scores and that becomes the portfolio.\nSo really think about it in terms of disruptions and not a factor.\nSo it's not like value or growth or momentum where you can say, hey, here are the most disruptive\ncompanies, it kind of means different things to different people.\nSo the idea behind this is to try and put a framework around disrupting and say, okay,\nwhat would a disruptive company look like if we were to actually measure it and then that ultimately\nis what the portfolio becomes?\nSo I saw like in some of the literature you mentioned, you're looking at disruptors in different\nstages. So infancy expansion, maturity. So as part of that 50, do you require some of these companies\nbe maybe in that infancy stage or in that maturity stage or is it purely based on that rank\nand you're getting the top 50? That's right. It's purely based on the rank, but the aim is to\ncapture it through that sort of S-curve cycle. And so they're all large cap companies, but companies\nare being different stages of that disruptive cycle and by using this particular framework,\nit enables us to then sort of select the way you think about innovation investing, for example.\nAnd again, we have the the benefit in many ways of creating this after 2022 or after the\nFed reprised interest rate. So if you think about other innovation, well-known innovation\nstrategy, they could be a somatic based ETFs or they could be sell-style innovation ETFs.\nThe problem that a lot of those, if not all of them had, was they were pursuing ultimately\na growth of all cost strategy. And so that was fine in a market where we had zero interest rate\nand the market was washed with liquidity. But when the Fed reprised all stocks, what happened\nis those strategies performed incredibly poorly because they were biased or overweight, a lot\nof the companies which were like the most affected by the reprising environment. So which companies,\ncompanies that I just say that did the best in a zero interest rate environment pretty much did\nthe worst in a 5% interest rate environment. And so looking at that, it's okay, well, how can we do\ninnovation investing better? How can we improve on these thematic ETFs, improve on these innovation\nETFs? And think about disruption more from this lens of what does it mean to be disruptive?\nAnd as you'll see, some of the factors that we use, namely things like gross margins,\nmargin sharp, margin growth, that's introducing a sort of a quality factor almost into the design,\nwhich means that we're getting companies that are not just large-cap companies, not just innovative\ncompanies, not just disruptive companies, but ones that are actually quality as well. And they're\nnot going to blow up, you know, just because the interest rate environment suddenly changes and\nthose companies business models don't work anymore. Yeah, that's where I was going to go, as you\nwere talking, it sounds to me like you're not only trying to find companies with a disruptive\ncompetitive advantage, but also have some sort of trying to find the right word, almost a mode\naround them where they have a quality to them that allows them to sustain that disruption. Is that\nthat simply right? So if you paid, for example, the patent value, that's a unique thing to\ndeal up. And the reason for that is because out of the, the many companies that NASDAQ owns\nactually owns a company that evaluates patent portfolios. And so puts a value on those companies\nthat have large patent portfolios. So it's not just the case that we're looking for companies that\nhave a large patent portfolio because clearly if you have a large patent portfolio,\nbut the patents are kind of worthless, then it doesn't really mean much. So we're looking for\npatent portfolios that do have significant value. And we think that's important because, again,\nin technology or in innovation more broadly, you know, typically if you have patents and you\nhave patents available, all things been equal, it normally means that you have some kind of\nmode, some kind of competitive advantage in whatever field that you're in and therefore it's\ndifficult for the competition to compete, you know, on a like for like basis with you,\nas long as they don't have access to that patent. So that's a good example of where, yes,\nit's a quality factor, but it's introducing a kind of a mode like quality whereby we're trying to\npick companies that disruptive, but why are they disruptive? Well, a lot of times they're disruptive\nor they're innovative because they've secured a patent on some particular process or some particular\ncodes and technology that they're exploiting, you know, to their benefit and to the detriment\nof others. So when kind of looking through the portfolio holdings, the portfolio is not equal weight.\nIt's actually, to me, it's fairly equal weight on the bottom tier, but it looks like kind of\nthose top five or 10 holdings or holding the lion share of some of that allocated capital. So\ncan you talk about how that weighting decision or how you derive and come to that weighting decision?\nYeah, so it's a dusted pre-flow market cap, which basically means it's market cap weighted\nwith some adjustments so that when you've got 50 companies and you have some very large companies\nin there. So for example, a microsoft is in there. It doesn't become something crazy like 20%\nof the portfolio. So it is market cap weighted, but it has adjustments for the largest companies.\nSo they don't get over or they don't, you know, represent more than a certain percentage of the portfolio.\nAnd so how often are you going back in and kind of rebalancing this port or rebalancing the\nindex or adhering to the index? It's a quarterly rebalance. So like fairly regular cycle.\nSo one of the surprising things that I noticed and I hope you can shed some light on this is\nand the video is not in the portfolio. But you've still achieved great returns. Like achieving\ngood returns in this environment without, you know, having the biggest of the mag seven in terms\nof performance is quite difficult. But can you speak to maybe why that didn't quite make the cut\nand how you were kind of able to keep up with performance without that key driver?\nYeah, and you bring up a really good point and it's actually more than in video. So we don't\nhave four of the magnificent seven. So we don't have Tesla. We don't have Apple. And we don't\nhave Amazon. So again, one of the weaknesses of a lot of these innovations, flash technology,\nthe magic-based ETFs, they're really just a mag seven strategy. And so what makes\nthe rough super interesting is that by applying the scoring methodology that we have,\nwe end up with companies that people wouldn't necessarily think of. And most importantly,\nit's not just another mag seven fund. So that's kind of really interesting. And in terms of\nspecifically the reason for not including in video, again, it goes back to the factors or going back\nto the way to methodology. And for the period that those stocks are considered, you know, that\nin video didn't make that particular cut. And it's kind of an interesting story because you\nup until quite recently, I guess the fortunes have been video, we're just very different. And so\nup until really, you could say like the end of of 2022, in video was thought of not on the radar\nor a lot of people. And then clearly that changed, you know, after factory BT came out in the\nbeginning of 2023, and the company's gone from strength to strength since then. But as a time\nand the time period considered based upon the factors that we have, you know, it hasn't or didn't\nscore highly enough to be included in the portfolio. But again, that's the beauty of the methodology,\nis it's completely devoid of emotion. And it's just, you know, we select the companies that score\nbest. And if a company doesn't score, doesn't mean to say that it can't be included in the\nfuture, because there's a reconstitution that happens over a couple of times a year. But you don't\nget into these sort of arguments about, well, I like this stock, I like that stock. So, well,\nyou have to like the methodology and agree or trust the methodology. And, you know, I think, again,\nthat's one of the amazing things about the rough is that the performance was keeping pace,\nif not how performing slightly, you know, the NASDAQ without, in video, without Apple, without Tesla,\nwithout Amazon. And that sort of stands out from the other sort of tech or innovation-based ETFs.\nHey, you bring up a really good point there about creating a methodology. I find it crazy when I talk\nto, you know, traders or investors that have spent all this time building a screen, building a\nfilter, building some sort of methodology, and then don't like certain outputs and override the\nsystem, right? So, at that point, what's the point of making the methodology, right?\nYep, no, exactly. And I mean, you know, we love and video, personally. I mean, our biggest ETFs,\nthe two-axon video, ETF and VDL, is being huge for us. But that's not what people are buying.\nFirst say, when you buy into a methodology around D-Rop, you're buying into that methodology,\nwhich selects that methodology, the leaves of the top 50 companies from an innovation perspective,\nyou know, in the market. And, you know, those are the top 50. You've got to go, you've got to trust the\nprocess. So, you want to touch back on a point that you made and how this fund is different,\nthen some of the other thematic or innovation funds. I'm not, I'm not picking on Kathy Wood,\nbut Kathy Wood runs a very large innovation fund. And you would never see an aim in there like\nJohnson and Johnson, that is included in your portfolio. And I don't think people would assimilate\nJohnson and Johnson with being quoted disruptor. So, how does a name like Johnson and Johnson get in\nthere? Is it based on that motementality? You'd brought up the term patent value a handful of times.\nLike, what gets a name like that included in this portfolio?\nSo, as the combination of the patent value that we're talking about. So, again,\nI mean, ultimately has to score highly in all the factors that we evaluate. But it's going to be\na combination of patent value and profitability. In other words, it's a quality stock with a high\nvalue portfolio of patents, which have a crude or would, you know, deliver significant value.\nAnd when you think about actually the two biggest sectors that represented here,\nit's maybe unsurprisingly as technology and health care. And interestingly enough,\nwhy patents are important and why IP is important in healthcare? Is I think there's a new kind of\ngolden age dawning in terms of the AI applications in healthcare? Because if you think about,\nyou know, these drug companies just take, you know, one example. So, companies like Johnson and Johnson\nthat have been for decades, you're trying to produce different medicines, different drugs,\net cetera, testing all these different combinations, you know, obviously medicines to treat\nall sorts of different ailments and conditions. That data is not public. That data is all private.\nSo, it's owned by the company. And one of the, I think one of the biggest things we'll see\nin terms of advancements with AI is when companies, and by the way, this is already happening.\nThis is not like some kind of pioneer sky is going to be in the future. This is already happening.\nThat companies like JJ are going to start to use AI, to look at all the data,\nall the research that's been done for decades. And you could almost bet that they're going to\nbe some big discoveries that have made through that data that already exists. And again,\nthat's their data. That's not open source, other companies, you know, other technologies\nthat they don't have access to that. And so I think that's when you're going to see the value\nof these particular technologies really come to light, is that companies with the amounts of\nresearch are going to have a completely different way of looking at that research. And I bet\nthere's going to be some very interesting discoveries come out of it. Yeah, and I think too,\njust staying on the topic because I find it interesting is, you know, as our compute power increases\nand we move into kind of the second age of compute, I think health care probably stands to be\nthe biggest gainer and benefactor of the innovations and technology and to deliver medicines.\nAnd also to deliver medicines, it might be just for you, like just for will. So that's right.\nYeah, I think the health care industry is ripe for disruption innovation and advancement. And\nagain, everybody thinks, you know, when they think about disruption, they think tech tech tech\nbut I think health care is probably going to be the biggest benefactor. And it'll be interesting\nto see and hopefully it has very positive outcomes for all of us. And so I said, I think when it\ncomes to the application for AI, you know, that a lot of the times we're talking about AI is really\nbeing like a massive productivity tool and really helping to improve productivity, which undoubtedly\nthat's going to be a major, major application for AI. But we're also to be talking about in\nfields like healthcare where you have deep research, deep levels of proprietary research.\nI think taking a completely new set of eyes to that research and potentially be\nable to unlock the massive new discoveries. So getting back to D-RUP, if you're sitting down\nwith an advisor or you're sitting on a call, where are you advising kind of this gets\nsleeped into an already diversified model portfolio? Sure, a lot of advisors have, you know,\nlike a direct allocation to QQ, or something in the like. So where are you putting this?\nYeah, that's right. And depending on how you look at it or what's in your portfolio,\nI think really there's probably two ways. So, you know, most obviously it's a replacement for\na technology or an innovation sleeve that you already have. So that might be, in the case of\na QQQ, that might be the way that you're doing it. So this is an easy way to do that. But probably\nmore likely, it's a replacement for the massive based or innovation strategies, which are holding\nis more of a satellite position. There's not necessarily a QD, but you might hold, you know,\na 10% 15% of the portfolio in, so the massive based ideas. And so this is a replacement for that,\nyou know, on the innovation side. So it, granted shares, you know, you have, you've had great,\nbut this has been a great product. I think it's a very interesting product. It's fairly new. So\nhow are you kind of going and thinking about marketing this particular fund? Yeah, I mean, we're\ngoing to market it as, I mean, first of all, did unique challenges. So this was an index that was created\nby the NASDAQ, you know, with with us. And so this is something that is not just, you know,\noffered by every, you know, ETF company out there. And when you're building a unique idea,\nit's about really trying to, you know, first and foremost, get that product market fit. And,\nyou know, for us, that speaks to like the technology, the innovation, you know, the disruptive sort of\nlandscape. And we're marketing it in the same way that we would market, you know, our other ETFs,\nwhich is to have conversations with advisors, conversations with retail investors, wherever\nit may be about, you know, why this is a quote unquote, better way to do innovation.\nAnd, you know, hopefully the performance will speak for itself. So just to, I mean, we've had a\nprevious conversation mostly about your, your leverage single stock suite. How is that going?\nI'm sure they're being heavily utilized by traders. So can you just touch on the single stock\nsuite? How's, how's everything going there? Yeah, I mean, that's really the kind of phenomenal\nof this year that you've had a huge interest in leverage single stock. We really sort of\npioneered this category and have become the market leader in the space. So to extend videos,\nour flagship ETF, that's the NVDL, the most traded largest leverage single stock in the world at\nthe moment. And, you know, obviously there's huge interest in that story. And more broadly, I think\nthe category itself because, you know, at the end of the day, we're offering institutionally\npriced leverage. And, you know, we're offering that in with the ease and efficiency of ETF\nwrapper. And that's kind of the core proposition here. So right now is, you know, the sort of best\ntime, if you will, for thinking about these types of strategies when we're in earning season. And so\nyes, today, we had Tesla earnings and interestingly enough, we had probably two times the amount\nof value traded on our two actual Tesla or PSDD. Then our two actual long DSLR during the day,\nyesterday. So people were clearly anticipated or, you know, larger section were anticipating a\nbearish outcome for the call after the close yesterday. And of course, those investors will be\nham from the rewarded today with the price action and test. But that's kind of the beauty of\nthese instruments. They, they really galvanize attention around earnings. People get really excited\nabout what's going on and want, you know, sort of a short, you know, way to implement those kind of\nideas. So I'm assuming, as you move down your product life cycle with single stock leveraged\nyour university ETFs, there's going to be some crossover between the holdings inside D-RUP and\nsome of the ETFs that you're launching on the leverage side. So hypothetical theoretical question,\ndo you ever see a situation where you might launch a levered D-RUP where some of your larger\nholdings may be, you know, held by your leveraged ETF holdings? Yeah, no, absolutely. I mean,\nthere's also, you know, potentially, or negatively with multiple strategies. We don't have it as\nmuch as they dig a firms because we just don't have as many ETFs. But if you think about\nthe larger firm, the amount across pollination is ridiculous. They probably, you know, if you're on\nthe equity side and the most equity funds are going to have, you know, exposure to, you know, the\ntech stocks or, or the large capital. So from that perspective, yeah, absolutely. But remember that\neach ETF is very different and serves a completely unique purpose. So it's okay to have that\nacross pollination. You know, across the strategy is kind of natural when you're in a market\nwhether the market is being dominated by these tech companies. Yeah. Well, well, I always appreciate your\ntime. This has been very helpful. I think the strategy is extremely unique. And so before I let you go,\nwhere can people learn more about granite shares, where can people get all the information they need\nabout D-RUP? Yeah. So right, says.com is the best place to go in terms of general information about\nthe fund, about the company. On there, you can contact contact us page, you know, find out ways\nto get in contact with directly and pretend more information around D-RUP or any of our strategies.\nThen of course, I'm third to media. You know, follow us on LinkedIn, follow us on Twitter.\nAnd it's, you know, feel free to reach out with any questions, etc. Well, again, well, thanks so much for\nyour time. Thanks, Brad. Well, good to see you.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}