{
  "id": "15523679",
  "transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology, they are run on and you want more customization and flexibility.\nAs well as a AI driven model marketplace, UX wealth partners is your destination.\nOn top of that, they have institutional trading.\nSo if you are an ETF issuer or an SMA provider looking for outsourced institutional trading, UX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and make your practice more efficient.\nWelcome to Behind the ticker.\nToday we have on Taylor, Chris Koviac.\nAnd if you saw how that was spelled, you might be mildly impressed with me.\nHe is from themes ETFs.\nWe are talking about G-sib or G-S-I-B.\nThey're global, systemically important bank ETFs.\nSo think about too big to fail.\nThere are 28 of those banks.\nWe talk about the most recent performance of which it's done well.\nWe talk about some of the systemic risk that are actually taken out of the portfolio by removing some of the commercial bank and regional exposures that are kind of in traditional financial ETFs.\nBut overall, I think you'll find this conversation really interesting with Mr. Taylor, Chris Koviac.\nHey Taylor, welcome to the show.\nThank you so much for having me, Brad, pleasure to be here.\nSo before we get started, can you give everybody a little bit of your background and how you eventually got to themes ETFs?\nAbsolutely.\nAnd the way of the quick background worked at a number of different firms ranging from Fortune 500 down to some small boutique asset managers.\nI started my career in investment strategy, where I worked as a macroeconomic analyst, looking at all things in investment strategy, taking a look at global markets from that macro perspective.\nAnd ultimately, transition to the asset management side, where I was able to apply that macroeconomic analysis background to actionable investments.\nAnd portfolio transition from Raven James, where I worked at investment strategy to Sebo Vest, which is a boutique asset manager focused on derivatives strategies before finally,\nleaving the company with a colleague of mine to help start themes ETFs, which is a founded by Jose Gonzalez, former co-founder of Global X, just started the firm in the last year.\nAnd really excited about the strategies that we're bringing to market, especially at some of the more competitive price points relative to the competition.\nYeah, and we're going to talk about all that. Looks like you guys have launched, you know, a handful of funds, but before we get into the business stuff, I always like to ask,\nwhen you're not working any hobbies, things you like to do? Yeah, a number of things, when it's winter weather, love to find myself on the ski slope, was raised out in Colorado, so make my way out to the rockies whenever I can,\nand try to catch some good snow out that way. And the summertime often find myself, of course, by riding a living northern Virginia horse country here, so whether that's a polo or,\nso to keep chasing out in the field, then a great way to get out and enjoy the great outdoors. Well, you were the first polo player on the podcast, so congratulations.\nThank you very much. So let's talk about themes ETF as a whole. You guys have about 13 ETFs at the moment.\nYou kind of talk about strategy. What you guys are, are specializing in what you're trying to get out there in the market?\nYeah, absolutely. I think the common denominator behind all of our products is we took a look at the market and saw that there was an opportunity to bring some strategies to market at a lower price point, specifically focusing on the thematic side of the investment equation,\nas one would expect with a company named themes ETFs, our first round of product launches focused on some of those as niche investments, whether that's artificial intelligence,\ncybersecurity cloud computing, or some of the more traditional sectors, whether that'd be banks, airlines, European luxury brands, and giving investors that targeted exposure to a subsection of the market,\nultimately doing so at a more competitive price point across the board, our products are about 40% cheaper than the category average.\nAnd we saw that this was an opportunity to lower that price point for investors, since we all know that over the course of the long run,\nthose fees are going to eat into your total returns. And in an environment where total market returns may be a little bit more muted going forward,\nand that's going to ultimately give you a windfall in the terms of the overall portfolio performance you can expect from some of the strategies,\nbut ultimately at the end of the day one of the things that we're trying to do is provide a menu of options of buffet bar of sorts.\nThey give investors access to whatever strategy would ever trade they want to play in the current market.\nSo like I said, the first batch of ETFs that we launched, we have 13 live right now, but all focused primarily on the metrics as well as some fundamental strategies,\nbut our next round of products we're also going to have a number of leverage inverse on single names as well as some derivative strategies as well.\nSo really running the entire spectrum from just plain vanilla equity to more complex derivative strategies.\nSo is the idea when launching product more trying to find areas that are seeing flows, but might be a little bit more expensive,\nor are you trying to find themes and areas that maybe are up and coming or kind of just working off of what's hot now?\nLike what's the art behind it and when you guys are deciding to launch product?\nSo what you just described is the perfect combination of both, and that is primarily what we look at, which is a where are the assets where the flows right down and to what extent can we replicate a similar strategy at a more competitive price point,\nor in some cases perhaps even improve the underlying methodology, so to give a similar exposure, but ultimately a tweak some of the criteria to make it just a bit better at least in terms of some of the quality and fundamental factors that we look at\nand developing that methodology and constructing some of the indices that these funds track.\nAnd then separately to your point, the other thing that we've tried to look and see if there are any novel strategies that have not been implemented yet,\nthat may have potential one of which will discuss it later today, but looking at a combination of both where existing assets are and where we might be able to offer a similar strategy at a lower price point,\nor offering a strategy that has not yet been brought to market because we believe that there is some credibility to that investment methodology that has potential for total return that may not yet be tabbed by current issuers.\nGot it. So as you alluded to, we're here to talk specifically today about GSIB, which is your global systematically important bank ETF.\nSo first, what is globally systematically important mean to you?\nIt's an incredible mouthful and one that requires a little bit of unpacking care, but as one would expect from the actual name, global systemically important banks are just that.\nThey are global and they are systemically important to the global financial system.\nIn short, and more in plain English, these are the two big to fail institutions. What we mean by that is any failure in one of these institutions would cause a significant impact on the global financial system.\nThis whole concept emerged in the wake of the financial crisis in 2007, 2008, where we saw obviously a huge impact on the entire global economy from financial contagion, much of which originated at some of these larger institutions.\nSo when the supervisory and regulatory authorities that together what they realized was, look, we need to identify some of these big institutions that have systematic importance to the global financial system and ultimately hold these banks and these institutions to a higher regulatory requirement.\nSo over that, again, these 15 years that has been in place, we've seen these banks ultimately thrive. They've had been subject to higher capital and liquidity requirements such that they can absorb losses in the event of a significant financial event.\nAnd over time, and what we've really seen over the last couple of years is that these banks specifically have really benefited from the macro economic environment and some of the things that have been really dragging down some of their smaller counterparts since central banks started raising interest rates two years ago.\nAnd when we put all of this together, what we really seen is that these banks are actually posting performance that is rivaling even the biggest tech stocks, magnificent seven stocks and many of which are actually up higher than those magnificent seven stocks. So far a year to date, we'll unpack that a little bit more detail, but that is essentially what we're looking at investing in those 28 publicly traded global systemically important things.\nReally like I said, it's a bit of a mouthful of an acronym, but it's really the two big-to-fail banks that we're looking at and investing in those banks specifically and excluding smaller regional banks.\nAnd we'll explain in more detail why we think that that's important both historically and going forward in the future.\nSo let's get into that a little bit, but before we do, can you kind of talk to me about what the benefits of investing in an ETF like this rather than what most advisors do, they're just going to go out and buy XLF exposure, right?\nRight, direct financial exposure. So to you, what are the key benefits of getting this type of exposure rather than just blanket financial exposure, or sector?\nSo this is I think where we go back to kind of our thesis as an issuer in saying that picking out specific subsections of a sector.\nSpecific slices of the market are ultimately made generate better returns than investing in the sector more broadly.\nYou know, an app comparison over the last couple of years was just identifying some of the big tech firms that were the beneficiaries, if I think it's a big movement, especially towards artificial intelligence, and how those stocks did relative to the broader index.\nSimilar story can be painted in the banking world. So to your point, instead of just drawing broad financial exposure, here we're focusing on investing in just those big banks, and there are a few great both anecdotal reasons for that as well as some analytical reasons.\nSo as we know back in March 2023, we saw that banking crisis, right? So we had a number of big names, a go under Silicon Valley Bank, first for public bank, and it really caused some shock waves to go through the system because these smaller banks were succumbing to the impact of higher rates, but higher rates that were implemented very, very quickly as the Federal Reserve and under central banks felt like they had to play catch up to get back into front of inflation.\nAnd ultimately, the smaller institutions proved incapable of weathering the increase in interest rates both the magnitude and the pace of those rate increases.\nAnd ultimately, the larger banks, not only weathered that storm, but they were the ones that were some of the beneficiaries of the collapses of those smaller banks.\nFor example, JP Morgan was able to buy out the assets of first republic at distressed pricing, and we've seen that actually be a windfall in the overall performance of JP Morgan since that date.\nSo this specific answer to your question in short, so instead of buying a broad-based index, which includes some of these smaller regional banks that ultimately found themselves on the wrong end of this macroeconomic dynamic, where they were feeling the pinch.\nFrom these higher rates, these bigger guys ultimately fare to a lot better.\nSo this is one of those instances where selecting those big banks and flocking towards quality did in fact make a difference.\nAnd in this case, the bigger the institution, the better the outcome was generally speaking across the board and focusing your exposure on just those big guys ultimately had a really big impact.\nTo put a couple of numbers around this. So if we take a look at how those global systemically important banks did, starting in January 2022 when the Fed first started announcing that it was going to start hiking interest rates through today's date.\nThose names are up over 35%.\nJust for comparison, banks in general over that same time period, the entire sector down 7%.\nSo really significant differential there, and just another point of reference over that same time period, NASDAQ and S&P up just 21% and 20% respectively.\nSo we're seeing G-sids outperforming not only their regional and peers in the banking industry, but also the broader market as well in general because of this dynamic and because they have been insulated from this wave of higher interest rates.\nAnd they've ultimately benefited from this environment for a number of different reasons.\nTwo part question here, and you might have kind of referenced it a little bit. Do you see investing in G-sid almost as almost because these banks are so big and so important, systemically important.\nDo you also see this is a little bit of a risk management play rather than just holding the entire financial sector as a whole?\nAbsolutely, and you could even extrapolate this further and it being a risk management play beyond tech that we've seen most of the major indices become very, very tech heavy.\nI think we saw over the course of the last month, this was a bit of a wake up call when the fear was that a lot of these tech stocks were priced to perfection and some of them were selling off in the wake of even beating earnings.\nBut not beating earnings to the same magnitude as the street expected.\nWe saw that for a Microsoft and video was even taking a little bit of a bunch.\nAnd ultimately, I think there was a bit of concern that when investing in some of these major indices, whether it be NASDAQ or the SMB500, you ultimately were buying into just a handful of stocks that were driving the majors and predominant of the growth in the market.\nSo to your point, beyond just diversifying risk in the financial sectors, specifically more broad based actually being able to diversify your growth beyond some of the tech heavy names that have been historically the significant, significant sources of return over the course of the last year.\nAnd just to put some numbers here, you normally don't associate these big banks, some of which are 300 year institutions like parkways with double digit returns.\nYet that's the sort of returns that some of these banks are putting up.\nSo just to round out a couple of them, year to date through the end of July, parkways is up 56%.\nThat's trouncing six of the seven magnificent stocks, for example.\nSo just again, I think contextualizing how this performance is comparing to some of the bigger household names, the magnificent seven names, as an important way to diversify your portfolio exposure away from some of those names that may have, you know, become a bit of a concentration risk across indices and across portfolios.\nSo you've, you know, you've mentioned the performance in a rising rate environment and the impress performance overall like first, you know, what do you attribute that performance, you know, driver in this type of environment and then secondly, as, you know, we might start to see in September rates come down.\nHow do you think that'll impact G-sib and, you know, more specifically these big banks?\nYeah, I think there's a couple of things to unpack here and to kind of wait into the analytics as to why G-sibs have done so well.\nOne of the big, I think, lesser talked about reasons for this performance is their relatively low exposure to commercial real estate.\nSo, you know, anecdotally we know that there is a huge sea change in the wake of COVID and post pandemic.\nWe saw everyone working from home. They're being a flight to, you know, the suburbs out of the city and ultimately we saw a lot of these big office buildings.\nSo they can, and for example, over the course of the last year, the office sector down over 23% and this commercial real estate has really turned into a bit of a ticking time bomb.\nThe IMF has labeled it as one of the biggest financial risks to stability and the thing that everyone I think fails to, I think really appreciate in terms of how the interest rate dynamic currently impacts.\nThe commercial real estate market is even though we got, you know, some good data this month and after the press conference from the Fed this week, it seems all, you know, systems are go for a cut in September and then ultimately incremental cuts after that.\nThe thing is is that the Fed still has not started cutting interest rate and everyone is starting to, to price in the impacts of falling rates, but the reality is that as all of these commercial real estate loans come due, they still have to be refinance at the prevailing rates of interest.\nSo we have over 800 billion dollars of commercial real estate exposure out there that has to get refinance at these high interest rates because the Fed still has not the cut yet.\nAnd as a result, we're seeing losses amount in that particular sector of the market and this is where Jesus has really stand out to get, you know, kind of into the weeds technically on a relative basis.\nJesus have four times lower exposure to commercial real estate relative to their smaller regional peers and this is where that quality and those regulatory requirements for these big banks are really making them stand out and as a result of that they have higher capitalization, they have higher liquidity and they have lower exposure to this commercial real estate.\nThat's time bomb that I think is it's just kind of a car crash and slow motion that's really been dragging some of these smaller banks and we've seen that in the performance.\nSo there's been a flight to quality I think over the course of the entire banking sector moving into to these bigger names, these g-sid names and away from these smaller regional names because they continue to get dragged down due to their both commercial real estate exposure as well as their inability to.\nSome of the losses associated with these higher rates and then finally, you know, back to your point about where we stand kind of in the dynamics of interest rates.\nWe have to remember that we've been in an inverted curve environment for a long while now the short end of the curve has been significantly higher than the long end of the curve, which generally speaking is bad news for banking at its most fundamental level.\nBut banks revolve around what's known as a carry trade right they ultimately take deposits and loan that money out at theoretically higher rates of interest, you know, further out on the curve and and because of the inversion of the curve right now that that's not possible so it's it's and because of that it's been hurting some of these smaller banks that haven't been able to weather that dynamic as well as the g-sid banks have.\nAnd the other thing that's interesting about g-sids is that not only have they attracted more customer deposits, their deposits are up 30% relative to their pre-pandemic levels and we've seen more customers gravitate toward banking with these larger banks.\nWe've also seen things like they're not interest in companies like their investment banking revenues things like their wealth management revenues that they collect from fees on asset under management and cost cutting measures.\nYou put all of those together, it's ultimately led to this better performance of the g-sid names and importantly it's also insulated from a lot of this.\nI think pressure that we've seen on tech lately so finally to wrap this all up this in numbers.\nHere today we've seen our g-sid fund up 21% handily outperforming both the NASDAQ only up 15% the S&P out 16% through the end of July so far this year so.\nThat I think is really where the rubber meets the road and you see all of these underlying dynamics translated into performance so again how performing not only to peer group of other banks that outperforming the market in general.\nSo let's let's talk about the inner workings of G-sid you know you mentioned it's 28 names how are you getting to those 28 names is there a screen that you run is there a published list of what is.\nSystemically important how do you get to the names so fortunately that work is all done for us we really are just following the lead of the financial stability board and the basal committee on banking supervision each year they publish a list of the banks that they deemed to be globally systemically important.\nAnd in our case we just invest on an equally weighted basis across those 28 publicly traded cheeses and we equally weight those in the fund and ultimately we can so instead of trying to pick a single bank that we think maybe doing better than another we equally weight that exposure across all of those names.\nI guess since we believe that there is common quality across the board since they are all held to the same sort of string and regulatory requirement and fortunately that strategy as we've said is has done very very well as a result.\nSo historically are there ever any additions or subtractions to that list like could you foresee holdings changing on an annual basis it is certainly possible in fact we saw that the one notable example of this was in the midst of the banking crisis in 2023.\nWe saw a big name like credit squeeze actually have to file for bankruptcy and ironically it was actually acquired by another geese in firm UBS so there we did see a rotation there there was.\nYou know credit squeeze was dropped from that list but ultimately was acquired by another geese in name so in practice if you're on that list you're either going to stay on that list for the foreseeable future or in the event that you face headwinds like credit squeeze did.\nUltimately you're going to find yourself acquired by another big geese institution like UBS so that's a I think an example of one of the rare cases where we did see a change in that list apart from that this list is generally.\nPretty you know tried and true list of the things that we all know that have been around for it long long time and that list is not necessarily prone to significant change over time.\nSo we've got 28 names were equally weighted are you do you have guardrails on when you're rebalancing or do you have a schedule is it quarterly annually monthly like how often you're repolling these things back in line.\nSo this is a quarterly rebalance so we do try to bring all of those names back into equal late once per quarter and that's ultimately what we've I think found.\nOver our back testing and that strategy has I think done well to make sure you're you're getting even and equal weighted exposure to all of those points.\nSo if you're sitting in advisors office they've got an existing model portfolio they've been running for number of years you know where are you recommending geese if gets added or where would you slot this.\nSo this is where we've you know obviously at to your point earlier you can see this is obviously an easy way to replace some of your existing exposure to financials or to banks in general.\nTo the extent that you have exposure to that subsection of the market but given the performance that we've seen from these names and some of the low volatility with which it's delivered that performance.\nWe can actually see this as a replacement even just for your core equity growth and portfolio and I think as advisors get more nervous about the tech situation.\nThe over concentration in fewer names the prospect that you know this artificial intelligence hype may not live up to the.\nYou know earnings multiples that have been priced out by the market and as a result of all of that there is a place for geese have been a portfolio to diversify that growth.\nYou know again I think the number speak for themselves the fact that the funds outperforming the market year to date by a pretty significant margin makes this a candidate to diversify growth beyond some of these more volatile tech names.\nAnd then obviously dependent upon individual risk tolerance and time horizon you can see how you know putting big established banks at a larger percentage of a portfolio may be appealing especially for.\nYou clients and investors that may be closer to retirement and may not be able to stomach some of the the more significant volatility that we've seen out of some of the more growth areas of the market.\nTech being one that comes to mind and being able to at least diversify your sources of growth and this is where I think geese could be a real shining example of ways that you can obtain growth in other parts of market beyond tech.\nSo the firm as a whole is fairly new this ETF is fairly new and congratulations on the you know six the success so far particularly performance.\nYou know what strategies are you employing over there to get the word out on this fund and how do you guys think about distribution as a whole over there.\nSo this is where you know we really kind of practice what we preach in terms of being able to pass on savings from our low overhead to consumers and investors in the form of lower fees.\nSo ultimately we're actually kind of applying some of the same things that we believe in for investment strategies in our business so for example we're implementing actually a lot of artificial intelligence solutions to make our outreach and distribution efforts a lot more efficient.\nWe're we're trying to target advisors who may already own exposure to the strategies and or maybe interested in some of the research that we've produced and published.\nSo we've been able to work much more efficiently I think with both fewer heads so to speak and relative to some of the traditional distribution models that ordinarily require significantly higher head count.\nWe're able to run a leaner shop and a leaner organization and because of that we're able to pass on those savings directly to investors in the form of lower fees.\nSo that's really where I think the rubber hits the road in terms of work trying to implement a pretty lean business model and again pass those savings on to investors.\nAnd beyond that we have also seen a tremendous uptake I think in some of these points specifically you know in some of our research that we published highlighting this commercial real estate.\nDynamic given the fact that we're the only fund right now that focuses purely on these G-sid banks we've seen get a lot of traction because there's just not a strategy out there like it right now.\nIt's a novelty of the strategy itself as well as its relevance in the current macroeconomic environment I think has led to some of the traction that we've seen in this flows in the fund and again with a much more efficient distribution mechanism.\nWe're able to I think get in front of more people with fewer heads at our organization.\nSo Taylor I really appreciate your time before I let you go where can people learn more about your ETFs and learn more about you.\nWe are found on bingsetf.com so just as just like the mathematics themes ETFs.com is where you can find all of our ETFs more information about each one of the strategies top reasons to invest as well as the performance of the funds and their costs relative to the overall competition.\nAll of that will be there while also on all social media channels as well LinkedIn Twitter and LinkedIn Twitter and Instagram and Reddit as well.\nWell again Taylor I really appreciate your time and hope to have the opportunity to have you back on the future as you launch your second trunks of funds likewise thank you so much for your time Brad it's been an absolute pleasure.\nThank you.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}