{
  "id": "15561979",
  "transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology, they are run on and you want more customization and flexibility.\nAs well as a AI driven model marketplace, UX wealth partners is your destination.\nOn top of that, they have institutional trading.\nSo if you are an ETF issuer or an SMA provider looking for outsourced institutional trading, UX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and make your practice more efficient.\nWelcome to Behind the ticker.\nToday we have on Joanna Gallagos. She is from bond blocks and we really have a wonderful conversation because she has such a rich experience in the ETF space.\nShe's launched 175 ETFs in counting. She is a co-founder of bond blocks and they have done an exceptional job in such a short period of time getting that firm over 3 billion.\nSo we focus on the ETF landscape and then we move into one of their many products which is XCCC which is triple C rated US high yield corporate bond ETF.\nIt's very targeted exposure in that particular tronch of fixed income. So I think you'll find the product compelling.\nBut without further ado, please welcome Miss Joanna Gallagos.\nHey, Joanna, welcome to the show. So before we get started, let's talk about your background and how you eventually moved into co-founding bond blocks.\nI've been an ETFs my entire career. I started out at Barclays Global Investors for really days of high shares and then BlackRock acquired that firm and really shortly after that.\nI moved on to JP Morgan. What I did in the first part of my career at high shares was I was in the product team and I helped launch a lot of the inaugural products in equity and fixed income specifically fixed income with the team I'm with now.\nAnd you know, I'd grown with the business a while and then JP Morgan called and said, we're going to start a new business and so I went over there to help them start their ETF business.\nAnd I was there for almost 10 years working on that and then bomb blocks called it wasn't bomb blocks then it was a few of us that started the firm in October 2020 one at the time.\nSo few of us got together our CEO Leland Clemens. It's been an architect of fixed income ETFs both in terms of product design but also in sort of how they've lived and grieved in capital markets.\nWe just really harder appreciate right now. But you know, when we launched HWG in 2007, there just wasn't the bond market infrastructure to match sort of the equity infrastructure that ETFs operated in.\nAnd so there's a lot of work that had to be done to connect all of those points literally going the different desks a different big big firm to explain them how to price, you know, a bond portfolio of so many bonds and then how to get that work.\nAnd so he was he was he was really kind of early pioneer in that he and in the other co-founder Tony Kelly and he was always had this idea about focusing on fixed income and launching more product.\nIt would help, you know, be easier to create fully as a way to be more precise and co-bit happened and it was sort of I would say maybe the third major volatility event that affected all markets specifically succinct on markets.\nAnd he called another co-founder at a bond block, his name's Brian O'Donnell and says, here we got to do this business. We've been talking about it at conferences over drinks for so long.\nBut the way that markets are have been functioning and the role of ETFs specifically in fixed income is time. Like, do you want to do this?\nAnd so they made a couple more calls. And so there were seven of us that came together in October of 2021 to form a fixed income only ETF provider. We saw a few things.\nOne is we knew that rates were going to rise at some point. We knew the volatility would continue in the markets.\nAnd we also, because we both, you know, in our former days, together in our life shares, but also in our subsequent roles at JPMorgan and Goldman Sachs in Northern Trust, knew that there wasn't enough fixed income product for the markets in the next 10 years.\nBecause we see that markets in the next 10 years were going to be very different from the markets in the last 10 years. And so we saw that there was a pretty, like fixed income product was underdeveloped for quite a long time in ETFs.\nAnd it needed to be focused on. And we wanted to bring more precision to fixing from the best in 3 ETFs.\nThat's the premise of on-box is that, you know, clients need to have updated products for these markets because they're different than the markets that they were familiar with from, you know, post GFC, even before.\nAnd then, you know, there wasn't enough development focus on delivering that product to market. So there's about 80% of all ETFs are equates. And that's really surprising.\nWe saw a lot of future growth in fixed income and a lot of underserved clients. And that's me.\nBefore we talk more about bomb blocks and some of the things I always like to ask people, you know, what do you like to do when you're not sitting behind the desk and, you know, what any hobbies things you like to do for fun.\nBut like about this, I've only had time to run after my four-year-old and find an after-year-old. And some of my days are on New York City playgrounds, getting wet in the sprinklers for the summer, or, you know, just from, you know, Friday at about four o'clock until Sunday at about nine o'clock.\nThat's what I have time for. It's definitely not their world. I try to be present at their school and volunteer in their school. And so, you know, this and I think many entrepreneurs in the show know this, like, your job doesn't really turn off, you know, on the weekends.\nAnd so I have two commitments and that's bomb blocks and my family and, and I'm having fun, you know, do lots of fun stuff with them. So that's what my hobby is.\nThere's no, there's no me right now, and that's all right. Yeah, well, four and five is a crazy age.\nI'm, I'm approaching, I've got one that's out of that stage. The other one is entering that stage and it seems like every five seconds he's trying to do something that he's not capable of doing and is going to hurt himself.\nBut yeah, I've got a climber in a jumper and that was it. I'm, I'm active on those playgrounds like that's right.\nSo you have a really impressive background. I was reading your bio. You've got 175 launches. You also have some ETF related patents. What, it's talk about those at all.\nI've named and mentor and so is another cook on our bomb blocks, Tony Kelly on the multiple basket pattern.\nSo there was a wave of business process patterns that people did with ETFs back in, probably like 2002 to 2004.\nAnd they're not, they're not particularly protective unless you pursue them, but, you know, we kind of put a stake in the round on the IP that we have built multiple baskets is used so prolifically in ETFs.\nSo relevant to fixed income that people may not want to know about this geeky detail, but essentially it's a wave for, you know, the standard baskets that if you know the structure of ETFs, you know, they trade in, they trade in for folios of securities and they're called baskets.\nAnd so for that say, if you buy 100, find you have 500 names in that basket. And if you deliver those securities to the provider, they will deliver you share it.\nAnd so if you want to alter that basket for a lot of really good reasons, you can create a second basket.\nAnd so one is for creation or an option and one may be for just pricing the basket in a different way.\nAnd so that's what the first pattern is, is how do you do that operationally? And nowadays, that was that process was actually codified in an SEC rule if 6011, again, getting super nerdy here.\nBut we do have the pattern on it, or we're named as inventors of the pattern on it for having, you know, developed that business process really really early on in ETF history.\nNo, it's great. And the second one was it was a while as a Jamie Morgan, I named inventor of a ETF portfolio management system and and trading system.\nAnd so when I got to Jamie Morgan, we had to build out, you know, technology infrastructure to, you know, connect to all the portfolio desks and create these baskets and help portfolio managers run their funds everyday.\nAnd so we built a piece of technology and I and the technologies for name on it.\nWell, that's cool. Yeah, ETF.\nIt's kind of boring when you explain it.\nNo, it's, I mean, it's still, it's cool.\nIt's not anybody's like so deeply in the space and able to, you know, make it more efficient or change it.\nI just, I had to ask. So, you, you, you had made, you know, you've got an ETF to your entire career.\nI'm curious on your perspective, like, how has the landscape changed over all the years?\nAnd do you think there's room for further innovations in the space?\nOh, if the last 10 years has proven anything that is that it's the, the BTO industry needed to be animated and needed more competition and needed more providers.\nSo the landscape has largely changed from this dialogue about the big three providers in the marketplace.\nTo smaller providers and, you know, traditional active management firms coming in.\nAnd, you know, when I, and I had some experiences and so did another co-founder in her firm as well.\nSo, like, when you bring ETF capability to an existing ask manager or really large ask manager, they quickly find out how interested their clients are in the ETFs and how they've been using them.\nAnd maybe they haven't had that dialogue with clients.\nI don't know if this new offering in a way to talk to them.\nAnd importantly, like, you know, that gives choice to investors and ETFs.\nAnd, you know, there is some fatigue.\nAs I mentioned, like, you can't, your innovation budget can't be as big if you're traditionally one of those older chassis ETF providers that are really big.\nLike, they have multi-asset products, they have hundreds of products.\nThat they want to maybe, you know, to try out has a big, big margin to clear in order to get through the product development process.\nSo, you know, there's a lot of competing priorities at those firms, those large ETF firms, where when you bring in smaller firms like newer firms like bottom blocks or established, you know, other ask managers to come in space.\nIt just benefits investors who they have more choice, they have more product interact with, they have more providers interact with.\nAnd I think that has been really, really important.\nThen, this really boring technical thing I just mentioned, but regulation level with competitive playing field for all ETF providers.\nThat's incredibly helpful to the landscape going forward like the last, like I said the next 10 years, we're very different from the last 10 years.\nBecause just not, not on purpose, but the SEC just invariably we're giving different types of, you know, rulesets to different providers.\nAlong the way over 20 years.\nAnd they normalize all that and made it so that everybody plays plays.\nAnd we'll set to competitively that's fantastic.\nAnd I think you see that in the choice of product, you know, yours as well is like, you know, we're a lot of registered investment advisors that are bringing their expertise to clients.\nI think there's some interesting strategies that are out there that, you know, haven't been there.\nSo more choice, more ideas, tones of innovation and focus.\nSo bomb locks is important.\nEach of these firms is like bomb locks.\nThey're focusing on a problem.\nAnd they're investing in that problem every day.\nAnd they're solving things for clients.\nThey're listening closer to clients of what they need.\nAnd that's good for clients.\nIt's good for them.\nSo yeah, no, I can't, I couldn't agree more.\nAnd you're seeing, which kind of leads me to the next question, like,\nthese active managers or people who are kind of traditionally running SMA portfolios are moving into this ETF space.\nYou and I have the misfortune of both being the chairs of our trust comes with extra work.\nBut can you talk to me about the decision, like, why bomb locks decided, hey, we want our own trust rather than just white labeling it.\nLike it seems like most people are doing these days.\nThe team of deep ETF experts from this Vanguard and the State Street and BlackRock and JB Morgan and Goldman Sachs and Bloomberg.\nAnd there's just sort of a, we know how to get these decisions made and get them done faster.\nSo we can execute better if we were, we grew everything from scratch.\nSo we, I think, not uniquely, but we had the capability to do this.\nLike, we could do this. I think going to a white label is you're buying the capability in someone else and that's appropriate.\nAnd that, I think that works for, you know, getting a market quickly and simplifying a ton of things you don't need to do.\nIt's really in the innovation decision making me want to be able to make and also just the execution timing we want.\nThat's why we did it.\nWe know how to do it. We're really good at doing it and we're really great at executing. So we stood up by our business.\nWe started. We all came together. It's assembled in October of 2021 in the same place.\nAnd we had our first fund launched in February of 2022.\nSo we stood up the asset managers stood up all of the infrastructure to run the trust in four months.\nThat's really hard to do if you don't put away that they will.\nRight. Yeah. I mean, there's no reason to go pay someone to do it.\nDo it yourself. Yeah. I mean, we had a similar thought. Only congratulations on four months. It took us seven.\nBut, you know, that's okay.\nYeah.\nSo kind of staying on you for a moment and even maybe the rest of the team, right?\nYou guys all came from well-established places. You were at bigger firms running really large ETF books.\nYou know, how is the actual experience been for you as kind of a co-founder and an owner rather than working for, you know, a bigger larger corporation.\nYou know, like an eye shares of JP Morgan.\nWe were very specific opportunity. And I was so happy at JP Morgan.\nAnd I talk about JP Morgan a lot because it was a place of innovation for me growth.\nAnd I was supported there and I loved my team.\nBut this particular group of people, it was sort of a dream job where I had been working with them not very recently.\nProbably hadn't worked with any of these individuals for 10 years.\nBut I've known them for 24. And I know their work.\nAnd I know we had a shorthand and a trust that snapped up very quickly.\nAnd to me, that's just an amazing way to work.\nI've never felt like I could, you know, really work exactly the way I wanted to work.\nAnd that's what this group is.\nAnd so what it feels like when my bond box is working with the people I want to work with and working on the problem I want to work on.\nAnd I'm doing it with a group of, it's not just the people we start off with.\nThis is almost almost 30 people.\nBut I'm doing it with a team that is really, really motivated to get this right.\nAnd it just, it feels great every day.\nSo that's what I think people would assume you would follow lots of be like going from the big firm full little firm.\nThe other thing that's just so, I'm so appreciative of that we have, as we have a ton of perspective and a ton of context from leaving a bigger firm.\nI'm going to query, you probably yell this way too.\nLike acquiring every single client and being so humbled and, you know, and feeling so appreciative that clients are choosing you so quickly.\nAnd that is, that's been great.\nLike learning, re-learning sort of the path to engaging with a client, earning their trust, having them by your product early.\nIt has this, it has this great virtual cycle of, of the feels great.\nYou know, it feels great to do something super, super hard.\nIt is hard.\nThe perspective of being a way from bigger firm is it's harder.\nAnd the people at bomb locks signed up for that, the degree of difficulty.\nOur first hire was in March of 2022.\nHe came from Bloomberg.\nAnd he called us and he said, I know what you guys are doing.\nAnd I want to do it too.\nAnd that's not the only call we got.\nTwo or three months later, we got a call from Shoyan Bianco who is,\nMark is trying to just hear bomb locks and she said, I saw you guys on TV.\nAnd I wanted to be part of that.\nSo like everyone sort of self-selected into this degree of difficulty.\nAnd that's an incredible team to work with.\nIt's harder in a lot of ways, but it has an energy that keeps you really focused.\nYeah.\nWell, it has an energy and there's a, there's a certain, certainness to it where, you know, it's hard every day.\nBut you're, you're kind of all working towards a common goal together.\nAnd you're all in it together.\nAnd it, it makes it more fun.\nYou mentioned, you know, those little wins.\nAnd you guys have had many little wins because the entire suite is, is now a grown over two billion dollars.\nIf I don't know where it is today, but that was the last TV I saw.\nYou can't.\nYou can't.\nOkay. Well, big wins.\nAnd he's not at really, really quickly.\nAnd so first congratulations on that success.\nI mean, starting the firm in 2021,\nwe're getting to 3 billion this fast is exceptional.\nSo first of all, congratulations.\nBut kind of, what do you attribute that to and how did you guys go in viewing the strategy around marketing and getting that distribution so fast?\nWell, one thing we had in the manager is that we get to use all of the tools of today to establish our brand and build our brand.\nSo we started on making our entry point into the market.\nSo as as loud as possible.\nSo we started with PR.\nAnd we talked a lot about, like, why are we coming to the marketplace?\nI think we, it was, it was noted to your point.\nLike some of the initial initial employees of,\nof Uncle Ox had resumes, like you generously complimented in my resume.\nLike, have they really deep resumes?\nAnd all of us in one place was the first sort of like,\nwow, what's going on over there and what are they doing?\nAnd then from there we started to build the brand a bit by bit.\nAnd also, I think we benefited from the fact that in February of 2022 markets completely changed.\nI mean, we thought there'd be registrations,\nwe thought there'd be higher volatility over time,\nbut we didn't think what happened so fast and happened really quickly.\nSo fixing came into view and right when we launched,\nyou know, we had a lot of opportunities in PR and a teller story and to get out there and then,\nyou know, we have an amazing CMO at Bumble Ox that has, you know,\nbuilt her brand brick by brick.\nSo I think that we've made a really great impression and we've been able to reach a lot of people quickly.\nThat's a huge key to our success.\nPeople have heard of us.\nI'm so excited when I'm, you know, somebody say, I work at Bumble Ox right halfway.\nThe best one is, like, back to the playground,\nwhere my Bumble Ox, basically had on the playground,\nwhen pushing a stool, as pushing a swing with my kid, and like someone was like, oh,\nI know Bumble Ox, and they want to talk about Bumble Ox,\nlike that's, that's a big testament to getting your name out there.\nAnd we punch above her weight.\nThat's what we like to say about Bumble Ox in a lot of ways,\nand in brand, I think we do that.\nWith clients, listen, like, we also know what to do there too.\nWe hire some of the best and most experienced ETF sales people in the industry.\nAnd they knew who to call day one, and they knew how to call us people back.\nDay two, day 90, and day one, 20, and 20.\nAnd so they came into the funds.\nAnd so, again, it's that know how and that initial plan.\nI think what you have to be appreciative is, like, what works in the first year or two\nisn't going to work in the second year and third year and fourth year.\nSo the degree of difficulty is always leveling up.\nAnd that's based right now.\nLike, 3 billion is great.\nBut what are we doing to position and talk to clients about what's going on in race?\nAnd what's going on in credit right now?\nYou know, how to make sure we're getting our share of that.\nThat big migratory transition, that big migratory sort of move from, you know,\nfor free assets into credit.\nLike, we have to be on top of that as well.\nSo we, I get to say, know how it's really leaning into brand and digital ways\nto to amplify what we're doing.\nAnd we're just out there, Brad.\nLike, yeah, it's funny you mentioned it.\nYeah, yeah, they're every single day.\nAll across the country.\nAnd that's what it's easy.\nIt's funny you mentioned the hat.\nI do the same thing.\nI make fun of myself sometimes if, uh, kind of look like a race car driver at\ntime is with the brand on.\nBut it's something you got to do.\nUm.\nThere are bomb lines, places are weekend, art, art spaces.\nYou know, yeah.\nThe houses are wearing it.\nLike, this is all a family affair.\nMy life's still.\nWell, it, what makes it, what I, when I get a chuckle of is so I bought,\nwhen we launched our, when we launched our first CTF, I bought a box of 100 hats.\nAnd people would notice it and then, like, friends and family sort of wearing them.\nAnd then, like, people who were around in our neighborhood, like,\nwanted them.\nAnd so we go to the pool on the weekends, um, you know,\nthere'll be seven and eight year olds wearing our,\nwearing our thor hats around.\nAnd it's like, I love it.\nI love to see it.\nI'm like, you guys are now my favorite.\nSo whatever you want.\nIf you, if you see me in an airport,\nI've got a bomb on it's backpack on.\nBut it's hat.\nLike, it's also because I like, I like, I love the, I love the hat.\nLike, I love wearing it.\nUm, and my husband and I fight over one of them on,\non, and I keep away from my kids.\nLike, I don't touch my bomb life stuff.\nLike, the problem is now I have too many hats.\nUm, yeah.\nAnd I've got to get rid of some.\nBut anyways, let's talk about some product.\nYeah.\nYeah.\nI've got it.\nXCC.\nYeah.\nIt is your triple C rated US high yield corporate bond ETF.\nMm-hmm.\nAt a high level, can you just help me understand, you know,\nwhat the product is and what is trying to accomplish?\nYeah.\nSo I will back up and say this part of the learner suite of\nSolution.\nSo what fun walks is an entire product line.\nIt's about its precision and fixing come.\nAnd so we started in high yield back in 2022.\nAnd it wasn't sort of the kind of thing that people really wanted to\ntalk about at the time.\nBut what we know from, you know, 20 years of fixed income ETFs\nis that, um, you know, everything started in big,\nblunt blocks of broad market exposure.\nAnd this just hadn't been updated yet.\nSo in high yield, we brought forward two things.\nWe brought sector products.\nSo we brought seven industry sector products in high yield.\nAnd then we did three credit rating products.\nAnd so trading through the credit spectrum\nin credit in general, but in high yield,\nspecifically from WB all the way to triple C,\nis actually how institutional investors\nthink about their portfolios and where their risk is.\nAnd so we wanted to put all of these tools.\nThere's 10 different high yield ETFs that we have.\nThere's actually 11.\nAnd we have a sector rotation product as well.\nBut there's 10 different ways that you could\namplify your exposure in, you know,\nyour broad high yield exposure.\nAnd so, extribalcy, there isn't, I thought,\nit'd be a good place to start as two reasons.\nOne is, it has had an incredible story in the last two years.\nAnd two is that, you know, right now,\nas we're thinking about rates declining,\nthe resiliency of the economy,\neven within today's news of, you know, seeing some softening.\nExtribalcy is sort of positioned really well\nto, you know, provide extra yields,\nlower volatility versus equities.\nYou know, it's a great opportunity.\nIt's our top pick in the fixing of opportunities right now.\nBut what it is essentially, is it's a diversified portfolio\nof over 220 bonds in the triple C category.\nAnd to orient you and why that's different in,\nin new is that, you know,\nwhen you think about a broad based high yield product,\nor you think about benchmarks in high yield,\nlike, you know, the big, the bigger,\nthe bigger index broad high yield products,\nthere's about, you know, 10 to 11 percent\nin the given time of a broad high yield benchmark in triple Cs.\nSo if you're buying a high yield ETF today,\nand you're getting the beta index exposure to that,\nyou're already exposed to about 10 percent triple Cs.\nAnd so what is interesting is, you know,\nfor someone that's using that in their allocation today,\nthis is a really great compliment to say,\nwell, maybe, you know, you should be adding\nanother slice of triple Cs adding more exposure\ninto your broad based high yield exposure.\nThe yield has been bouncing around 12 percent all year.\nAnd it's had some amazing price appreciation in 2023.\nIt should have good price appreciation going forward,\ngiven that rates are coming down.\nAnd, you know, you can be enjoying, you know,\na really big yield pickup by, you know,\nadding some triple Cs to your portfolio.\nSo that's one way to think about the product.\nThe advantage is that, you know,\nyou're getting the benefits of diversification.\nSo a lot of active managers in fixed income,\nor in a yield, they're picking QCIP by QCIP, right?\nThey're picking a set of QCIPs,\nthey think are the right QCIPs to invest in.\nAnd often a lot of higher managers just exclude triple Cs altogether.\nAnd so, whether you're picking a few QCIPs,\nyou might be unintentionally underallocated\nto the category versus your benchmark.\nSo you could add this to sort of, you know,\ngets you at least benchmarked neutral,\nbut still express reviews through those individual QCIPs.\nSo that's another way to think it compliments an investment process.\nOr, you know, if you're out of triple C,\nand you want to be out of triple C,\nit's a way to use this really efficient product\nand to, or the other products, actually.\nSo you would use W and single B to build your portfolio.\nSo if you want to lean into the higher quality side\nof high yield, you do that.\nSo these credit reading products, these sector products,\nare all designed so that you could express a view.\nAnd a more precise view.\nLean into things as they're happening,\nso you have a benefit of liquidity,\nso you have to get in and out of these positions.\nYou have the benefit of them being diversified portfolios.\nYou're not buying one or two bonds,\nand triple C, which is risky,\nyou're buying hundreds of bonds.\nAnd it hasn't been done before,\nand it's really impressive\nof how affected the priceiness when you trade in on exchange.\nAnd that's, that's triple C.\nI think it's a broader story about, you know,\nabout the whole products that it belongs to,\nand how you use them.\nBut I like triple C because they're top pick\nin terms of an opportunity to fix income,\nand it's really has a ton of utility for these markets.\nWell, when an advisor looks at,\nsay, triple C, the first thing that comes into their brain\nis going to be that towards a junk bond.\nSo what?\nCan I explain?\nYeah.\nWhat's that?\nThank you, 1980s.\nYeah.\nSo let's, let's clear the air then.\nCan you explain, you know,\nwell, I guess,\nwhat would investors get wrong about\nthis tranche to fix income?\nAnd, you know, why is there value\nin looking at this tranche?\nWell, I think what they're getting wrong today,\nin this market cycle,\nis they're getting wrong\nthat the fundamentals of high yield\nin general are very, very strong.\nThey're also getting wrong.\nWe're not in a credit downturn\nlike we've seen in other market cycles.\nSo you've had a resilient economy,\nespecially in the high yield fundamentals\nhave a hold up.\nAnd, you know,\nyou actually sort of when you look at the broader market,\nthere's actually an up-and-quality\nin high yield in general.\nSo there's a higher percentage of\ndouble beads in high yield issuance.\nAnd, you know,\nthat means that like the category itself\nhas a much lower default rate rate.\nAnd it's been that way for a while.\nAnd so, yes,\nif you go all the way down\ninto the credit spectrum of triple seas,\nthere's a higher default risk,\nbut you're in a portfolio of hundreds of\ntriple seas.\nSo that is dampened,\nan offset of it in the diversification.\nAnd we're not at\nhistoric,\nwe're not past historical norms for defaults.\nAnd so, I guess,\nbut people are getting wrong today\nis we don't foresee\nan economic event.\nThis is going to impact this chart,\nthis category in triple sea.\nAnd it differently than, you know,\nit would normally.\nAnd that means you get the benefits\nof all of this exposure\nand you get the benefits of the sealed\nin one trade.\nAnd so, that's hard.\nYou know, we've taught,\nwe've taught multiple seas for two years\nand people have been asking us about like\nsomething's going to happen.\nPeople will be able to cover their interest\nbecause rates are so high.\nWell,\nthis category also,\nwhich is different.\nStart,\nsorry, this,\nthis market cycle is different\nbecause it started off with the pandemic.\nAnd a lot of these issuers\nrefinance their debt\nand their cultural low rates.\nAnd so, they're in a really good position\nto pay their debt\nand they've weathered these higher rates pretty well.\nThere's also a sense that, like,\nas rates might be coming down\nin the next couple quarters,\nthe maturity of some of this debt.\nAgain, most of it being higher quality\nin the broader category,\nthe maturity of this broader debt\nis going to happen in 2025 and 2026.\nThat's a lot of time,\nyou know, to absorb, you know, refinancing rates\nand to weather this storm,\nI think it's been working really well.\nSo what people have unfortunately missed out on,\nif they haven't invested in the category,\nthey've missed out on the yield.\nIn 2023,\nit was the top performing category.\nIf they think of it,\nit returned over 20%.\nAnd, you know,\nit's hard for people to create a relative sense of\nwhat's different about junk bonds\nand I try not to use that word.\nToday versus what they knew\nand what they're associating,\nthey're associating with, like,\nthe floor dropping out and everything going away.\nThat could happen if you build up\nreally specific idiosyncratic risk\nand your portfolio with certain coupes\nand certain fundamentals,\nbut in certain, you know,\nsmaller size exposure to a triple seed.\nThat's not this product.\nThis is category exposure.\nSo, as you mentioned,\nas you mentioned,\nthere's, you know,\nhundreds of different coupes\nin here attracts,\nyou know, the ice triple seed index.\nHow, just quickly,\nhow often is that index reconstituted\nand how often are you kind of\nrebalancing the underlying?\nYeah.\nAnd we monitor this,\nit's rebalancing to index.\nYeah.\nAnd so, you also mentioned,\nyou know,\nthis particular product has really juicy yields.\nSo,\nhow susceptible is,\nis NAV,\nand we've talked about it a little bit,\nbut Fed lowering interest rates,\npotentially,\nI wouldn't see why they wouldn't.\nNow,\nbut,\nyou know,\nI guess my question is,\nwhat's the relative volatility of this product,\nmaybe compared to some of the more broad-based benchmark,\nhigh-yield exposure products?\nGoing to be,\nyou know,\nit's going to be a little higher than the broad-based high-yields.\nBroad-based high-yield is closer to equity\nthan other categories\nand fixed income are\nin terms of its volatility.\nI think the thing you want\nto do is,\nthere's two views that we have at bomb locks.\nOne is,\nwe don't foresee an immediate recession coming.\nAlthough,\nyou know,\nyou know,\nI think people are really reacting\nevery millisecond to every economic piece of data that comes out.\nYou need to see some,\nsome trends.\nAnd I think that has been true of this whole period,\nwhere a lot is made of one economic indicator,\npeople have put trades on,\nand been very wrong in many different points of,\nof this journey.\nSo you need to see more,\nbut we don't foresee our recession coming.\nAnd the second thing is,\nagain, going back to bond math\nand just giving some historical perspective on this,\nlike the coupon income\nhas been the primary driver of long-term returns\nin fixed income\nand specifically in high-yield.\nWe have some data that shows\nthat it really has driven\nand absorbed\nin volatility\nin the high-yield segment.\nSo in particular,\nwhen you have a 12%\nmillion-long yield within the portfolio,\nit can,\nit can weather price volatility,\nvery, very well.\nAnd so that did happen in 2023.\nThe yield was high,\nthere was,\nthere was some volatility in,\nin the underlying,\nbut the total return\nbecause of the coupon yield was,\nwas, was, was cushioning that along the way.\nSo that's what's really important.\nSo we believe the second thing we believe\nis that rates are going to be higher\nfor longer.\nThere's a lot of estimation\nthat rates are going to really start\nto turn around\nin September.\nAnd I think there's one,\nthere's one firm that's\ncalling for eight rate cuts\nsuccessfully.\nVery quickly.\nWe don't see that happening\nbecause again, there's economic targets\nthat haven't been met.\nSo you need to see that all come together.\nAnd I think that that\nsupports our view\nthat rates are going to be higher\nfor longer if there isn't\nan in-ending recession\nand that backdrop,\nI give you,\nwhich is like,\nthis is not the credit market\neverybody wants to say,\nit wants it to be.\nThey want it to be\nlike much more of a downturn\nthan it has never produced\nitself to be.\nSo to your question about\nvolatility,\nyes, it is more\nvolatile than the broader\nideal than it's volatile than\nother.\nIt's more if it has higher volatility than\nother classes,\nbut it's been supported\nby this gigantic coupon.\nAnd that is been,\nI think people just forget\nthat's how the ones work\nand that's how,\nand that's the benefit of higher rates.\nSo when talking to,\nyou know,\nan investment advisor,\nmost of those investment advisors\nor when they think of high yield,\nthey're going to probably a product\nthat you worked on,\nHYG, right?\nIt's a $16 billion\nbehemoth.\nI will say,\nyour expense ratio is lower,\nyour yields are higher\nand the performance has been better.\nBut if you were to kind of sit\nwith a registered investment advisor,\nhow would you\nallocate to XCCC?\nDo you view it as a compliment\nto your overall high yield basket?\nDo you view it as a replacement?\nHow would you make that recommendation?\nWe think.\nWe think everybody\nout and built-in Interpol,\nsee it's like,\nhoney and slice of it to your high yield.\nTake, you know,\nI think that there's been a lot of flows\ninto credit ETFs,\nboth on the corporate side and\non the high yield side,\nspecifically in last three months,\nflows have picked up.\nSo I think,\nand they've been pretty strong,\nactually, since November 23,\nbut if we're seeing\nWe're seeing that investors are willing to take some risk.\nThey're willing to go back into risk assets.\nHere's a way to optimize that viewpoint.\nAnd like I said, just add a little bit more into that space.\nSo in triple C, what we do is it's a complete complement.\nAnd it's just your viewpoint on here\nwould be that you don't see recession coming.\nYou see rates dropping.\nThere's a price appreciation opportunity here\nwith with triple C.\nAnd there's a volatility of absorption\nwith such a high coupon.\nSo lean into it more.\nBecause your typical exposure, like I said, is 10%.\nLean into it more.\nIt could be a source of extra performance and extra yield.\nAnd you couldn't do that before.\nYou couldn't trade 200 triple C.\nI yield bonds in on exchange before.\nAnd you should be able to.\nYou could also feel a little differently.\nAnd you could go a little higher in part of quality\nand you know, add more single B has a really great\nsweet in credit in terms of in terms of the risk report there.\nAnd that's what those credit rating products\nare meant to do.\nLike express your view and be able to move in and out of your view\nas things develop.\nWell, Joanna, this has been really wonderful.\nBefore I let you go, where can people learn more about\nyour entire suite of bond blocks, products,\nincluding XCCC, and also learn more about you?\nEverybody at bond blocks and I would love people\nto take a look at everyone who is making this firm happen.\nSo we're at bondblocksETF.com.\nAnd there's a lot of information on there.\nWe just released our mid-year outlet for 2024.\nIt has some really cool detail on what I would\nbe speaking about, especially about also on treasuries\nand rates right now in our viewpoint there.\nSo a lot more to explore with bond blocks on that site.\nWell, again, thank you very much.\nI'll keep my eyes peeled in the airport\nfor that bondblocks backpack and hat or conferences.\nBut again, thanks for spending some time with me.\nAll right, thank you so much, Brad.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}