{
  "id": "15597367",
  "transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology, they are run on and you want more customization and flexibility.\nAs well as a AI-driven model marketplace, UX wealth partners is your destination.\nOn top of that, they have institutional trading.\nSo if you are an ETF issuer or an SMA provider looking for outsourced institutional trading, UX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and make your practice more efficient.\nWelcome to Behind the ticker.\nToday we have on Howard Chan, he is from Curve Investment Management.\nWe are talking about their technology titans select ETF, which is ticker KQQQ, which is a really interesting and cool product.\nI love the way that it operates as an active ETF.\nIt is looking for really direct technology exposure and a handful of select names.\nAnd then it will wait based on positive momentum signals.\nAnd when you have some waning momentum, it is going to write some cover calls on those names for income.\nSo a two-way product here focused on growth as well as risk management.\nSo I think you will find the construction of this product and also the overall discussion.\nVery interesting.\nSo please enjoy this episode with Mr. Howard Chan.\nHey Howard, welcome to the show.\nGlad to be here.\nSo before we get started, I wanted to give everybody a bit about your background and how you eventually decided to start Curve.\nYes, my name is Howard Chan. I am the founder of Curve Investment Management.\nTo be honest, I ended up in finance through a string of lucky things that happened in my life.\nI was trained actually as an engineer. I was an electrical engineering computer science.\nAs I was going through that internship, I realized that might be the wrong thing for me.\nBecause I was just sitting in front of a computer all day with no human interaction.\nAnd so I tried to broaden that out a little bit by being more of a consultant in technical fields, which had more interactions, but also felt a little bit bored to be honest.\nAnd so I had this moment where what am I going to do next.\nAnd I think a lot of engineers, when they are at engineering school, they don't think about finance because it is not as rigorous as, say, building a bridge.\nYou need to know how many cars you can go across the bridge. But I was wrong. I think it's because the system is so complex that you can capture everything.\nAnd so I kind of fell into it and it's been extremely fascinating, constant changes, things to discover and learn.\nAnd yeah, it's been a great career.\nSo when you're not working at curve, I always like to ask people before we get into the nitty gritty.\nAny hobbies, what do you like to do for fun?\nYeah, I'm actually really into music. And if there was an alternate reality, I almost became a conductor actually.\nSo I play the piano in the violin.\nAnd so whenever I have kind of friends around that wants to jam or play something, that would be, I'm a little bit more rusty now.\nBut that's always something that I would love to do. Just to get, you know, my now off of work and just do something a little bit different.\nYeah, I'm envious of that. I've always wanted to learn how to play the piano, but for some reason, my brain just was not able to figure out how to read music.\nI just couldn't do it.\nSo let's talk about curve as a whole.\nYou guys do kind of a variety of different things.\nSo how does the business help clients? How are you serving clients as the landscape is set today?\nYeah, the mission for curve is that we want to make well designed, tax efficient, institutional grade strategies available to all investors.\nAnd maybe a little bit of a background.\nI had previously worked at Goldman and Pimco, and I let their ETF business actually in Europe had actually taken a break.\nWhen I came back to the US, I met a lot of advisors just, you know, at random events, and they were talking about how they had, you know, investment problems to solve in their portfolios and given, you know, my background, what do I do about them?\nAnd we try to find solutions. It's kind of when I realized that, you know, a lot of the, you know, obviously a Pimco and Goldman, you work with a lot of really large institutional clients.\nAnd you realize there's a lot actually a lot of best practices that are not really available or accessible to all investors.\nAnd so I actually went back and I talked to a lot of folks who also left Pimco, but who I worked with the ETF business.\nAnd I said, hey, there might be opportunity to make things accessible and available, are you interested in, you know, a lot of people were actually very interested.\nSo we got 80% of the folks that Pimco are all folks that I worked with and we kind of brought the band back together using a music analogy.\nAnd so that's really what we're focused on.\nI mean, I want to kind of deep dive into, you know, two aspects. So, you know, the tax efficiency is actually very important to us.\nBecause there are actually really a lot of really great institutional strategies that are incredibly tax inefficient.\nThey trade a lot, but that's okay because the people who are using it are non taxable entities, pension funds and dominance. So they don't really care about taxes.\nBut as soon as you move down to taxable entities, those strategies don't work as well because you have this layer of tax.\nSo our idea, what, you know, obviously maybe a lot of your audience, you know, are familiar with tax loss harvesting that always philosophically didn't quite make sense to me because you have to have lost first.\nRight.\nSo what we wanted to do is build a strategy that thinks about tax on the gains.\nAnd so, so that's kind of built into each one of our strategies. And I can go into detail when we talk about the various things that we have.\nAnd the second part is institutional grade. So, you know, your audience probably are aware that a couple years, 2020, too.\nI think, you know, there was a change in the ETF rules that allowed derivatives.\nAnd what that actually opens up is accessible to the different kind of risk premium that all investors were not able to access unless you were the largest investors.\nRight. And primarily using derivatives.\nYou know, there's, you know, you have to set up is does you have documentation, collateral management, those really were not available to all investors.\nSo what we want to do is just to make that easy. And, and there's risk premiums that, for instance, volatility risk premiums that are much easier to gain access to.\nYou can get it in other asset classes like mortgages or, you know, whatnot, but, or assets that have optionality in it, but now you can have a direct access.\nAnd these are actually some risk premiums that even my former employers that, that these are the consistent risk premium that they tap into to outperform their benchmark.\nSo we want to kind of build in these strategies now, so that it's available to all investors.\nWell, let's talk about that a little bit. And you have, you know, a pretty, you have a handful of ETFs.\nAnd the first kind of trunch of ETFs that you launched were, you know, your single stock yield premium strategies.\nSo, can you talk about how those products kind of operate underneath the hood and really what they're trying to accomplish for an investor?\nYeah. So, so we always, maybe this is back to my engineering background, it's like we always start with a problem when we try to find a solution.\nSo, so here are, are two, two issues that we were trying to solve for.\nThe first is that generally, if you look at the six ETFs, the yield premium cover called ETFs, they're generally technology names.\nAnd there's actually a characteristics about tech names, which is that they generally do not distribute dividends or they do, they're very low dividends.\nAnd so, if you were income focused or dividend focused investor, and you want that income, generally you have to overweight a few common sectors.\nThere are financials, utilities and energies, right? And you're underweight tech to get that dividend yield.\nAnd if you think about that, you're actually overweighting older parts of the economy, right? You used to be energy is the largest part of the Dow.\nFinancial also was a very component, those are much smaller now.\nAnd then you're underweight the growth at part of the economy, right?\nSo, we kind of started these single names as a means for people to make that trade off a little bit easier.\nSo, if they backed by a basket of those names, they can actually generate income on a growthy part of the economy.\nYou know, they could still hold the other dividend stocks in the other sectors, but now it's more balanced to what an S&P would probably look like.\nAnd the other problem that we were trying to solve was actually, you know, these cover call strategies are not like new, right?\nThey've been used since the 80s for really large private wealth advisors to generate some additional income in folks's portfolio.\nAnd the flow would usually be maybe it's a client driven, hey, advisor, can you look through my portfolio, write some cover calls.\nAnd then the advisor would go through, you know, 30, maybe 40 line items, you what makes sense.\nThey might not know how to trade options.\nIf you're really, and a really big advisory firm, maybe, you know, they might have a dedicated execution desk, so you can execute options.\nBut if you're a smaller advisor, those are not necessarily even available.\nThe idea was for these particular names that you can now, even if you're a smaller advisors, a self-directed investors, who are focused on income, you can access these strategies immediately.\nBut more importantly, I think most people don't talk about is when you want to exit the strategy, you have to unwind these trades, right?\nYou have to buy your cover call back and all, you know.\nAnd instead of making those kind of unwinding, you can just sell a share of the ETF.\nSo that was the problem we were trying to solve with those funds.\nAnd generally, those funds are intended to, and we're seeing the investor set is generally people who are close to retirement, who are retired, who want to supplement some of the income.\nAnd we try to keep that distribution as stable as possible, so they can kind of predict what portion of a self supplement of income they want to have in their portfolios.\nSo for kind of the audience of the show, who's, you know, maybe a small to mid size RIA, or people that are in the ETF space.\nYou know, when you're writing a cover call on a single name here, like, what if any upside are you giving up in the growth potential of that security rather than owning it outright?\nI know we're getting the cash flow, but are you giving up any upside?\nYou are, and the way I would think about cover calls and cover calls work really well in three different environments, right?\nWhen the underlying is falling, when the underlying is trading sideways, or it's slowly appreciating.\nAnd, and, and for those who don't know what a cover call is, you have an underlying asset, let's say, I have a Tesla stock.\nAnd then I'm writing and sort out of the money, so let's say Tesla is at a hundred.\nYou're writing a call that's maybe a little bit higher at, you know, one fifteen.\nYou receive a premium, that's the income that you get.\nAnd as long as the underlying stock doesn't go above 115, you get the full amount of premium, right?\nSo you are trading of some potential upside to getting that income.\nAnd, and that is actually, this is why the original six is very more suitable for folks who are in retirement,\nwhere they, they don't, the price appreciation potential is not as important as steadiness of income.\nIf, if I will say, the cover call is not a great in an environment where you have sudden sharp increases in price appreciation,\nbecause you're capping up the stocks appreciation, right?\nSo the, the big question always is like, would you have wanted to write a cover call on Nvidia this year, right?\nIt almost would be better for you to write the price appreciation and sell some shares to generate the amount of income, right?\nSo I'm, I'm generally pretty, a forward about, you know, the cover call strategy is very, you know, good for specific set of investors that want to have the income.\nThey don't, you know, we, we think about total return as having three components, right?\nThere's the price return, there's income return, and there's an FX return.\nWe, we're generally buying US assets, so that, that's zero.\nSo it's really priced for resources income.\nAnd this set of investors really focused on the income that's being generated and less so on the, on the price return.\nSo yeah, and speaking in general, it is, I don't want to hold it to a specific number.\nIt would generally speaking, what are you kind of the range of distribution yields on these single stock strategies?\nYeah, so so we, on our ETFs, it ranges from the less volatile, volatile names like Apple, they generate 10 to 12% of distribution to more volatile names like Tesla, they generate up to 30%.\nAnd so it's worth mentioning, you know, why would you do single stock maybe versus an index, right?\nSo, you know, after 2022, we saw the slew of cover call ETFs coming out in the market.\nAnd largely because the economy at the time was not doing very well, so it was a great environment to clip coupons while the kind of the economy gets sorted.\nBut there's actually been kind of an interesting thing that's been happening in the market up until the recent kind of tech correction, which is that,\nyou know, volatility was at almost four years low, so when you're writing a cover call essentially what you're doing is harvesting this volatility premium, right?\nAnd, and inherently, it's low because in an index, there's diversification in that index, so the volatility that the pricing of volatility would be lower.\nBut on single names, the volatility is actually quite high, so what you can do in some ways is to buy a back get of single names.\nYou get, you get the risk premium first, and then you get the diversification later with the different combinations of single names.\nSo that, that's been kind of written about in sort of this divergence of single-valv versus index law.\nThat's in the market.\nWell, we're here today to talk about your newest issue, which is KQQQQ or KQs, as I've been calling it, which is your technology titan select ETF.\nSo first at a high level, a simple question, what is this strategy trying to accomplish, and then I have some more detail questions behind it?\nYeah, so the strategy is looking to provide a strategic exposure, so something you would hold for three to five years of the largest technology companies.\nThat is, has basically asymmetric upside and downside, and it looks to essentially provide income when market is correcting to mitigate any downside volatility.\nAnd then when a market is going up, we want to be able to magnify the trends in the market.\nSo let's talk about first, like, you're going to get, we're going to get very targeted in security selection here, but what is it about broad technology exposure rather than the targeted exposure that you're delivering?\nLike, what is it about that that can be a benefit to somebody who wants to invest in the tech sector?\nYeah, so this is actually very, you know, when you're launching ETF, you have to file it 75 days before you launch, right?\nSo we were already kind of anticipating at the beginning of the year that the pricing of technology companies is becoming rich and how do you, and maybe I actually go kind of go back a little bit, which is,\nwe see this as a strategic exposure, so something that you want to hold for the next three to five years, and the premise is that, you know, a lot of these technology companies do have extreme pricing power and they're very dominant in their vertical, whatever that is.\nAnd the way we describe technology is not just software companies or semiconductor companies, is any companies that have used technology to essentially leap forward in their vertical.\nSo that includes also, you know, Netflix, which, you know, changed the way that we delivered media, right?\nAnd so we went back, there's been a lot written this year about, you know, how the market is driven by seven names and what's happening with the rest of 493.\nWe actually did research going back 20 years and see actually if this cohort of largest names actually behaved differently, and what we've seen is that year over year, even the last five, six years, the these names have outperformed the overall benchmark.\nYou just use a proxy like the top 15 names on a NASDAQ versus the NASDAQ 100, which is a broad benchmark year over year, it's actually outperformed 400 basis points about.\nAnd that's really unusual because if you think about it, the larger the company is the growth project should be slower, right, because the larger part of the market, you know, that and it just doesn't quite fit technology companies.\nAnd, and so what we wanted to do is, and by the way, that the portfolios generally a name a basket of 15 to 20 names, so it's not just, you know, that the largest names in the basket.\nAnd so, you know, so one of the things that we wanted to focus on was, the sector is attractive, but we do accept that if you, if you accept that this is a strategic exposure that you want to have your, have your portfolio, then what is the behavior of this basket.\nAnd in technology we know their tends to be exuberance and then correction, right, that that is a behavior of the sector, like the the most recent one I would say is they're in COVID.\nEverybody thought we would never ever go out of our home, so, you know, there was a huge price action and then as soon as it's COVID went away a little bit, there was a correction, right.\nSo if you accept that this is a strategic exposure and this is the behavior, then the question is, how do you take advantage when it's during the exuberance face and how do you minimize the correction.\nThat's our premise, we don't, we don't, we don't want to guess whether it's richer, we know it's going to happen.\nSo when it happens, how do you deal with that?\nBecause I think that one of the things that a lot of asset managers really talk about is their view on something.\nBut they never talk about, but what if they're wrong, what hedges do they put in your portfolio, right? They never, they didn't ever mention that that.\nSo we accept that, hey, our view is long term, this is going to be great, but we know their short term volatility.\nSo what sort of hedges do we put in our portfolio to mitigate when we're wrong?\nAnd so, and then the last, again, we tried to solve for problems for the strategy.\nSo the three things that we were trying to solve for is it income on technology sector that we've discussed that.\nTo how do we deal with this boom and bust cycle and technology?\nAnd the third one is actually, we connect with the cover call strategy.\nYou just, you brought up great point, right? Do you, do you, are you trading off some off upside, right?\nWould you want to wear a cover call on a video? How do you deal with that?\nSo we built this strategy to address those three things.\nYeah, and I definitely want to get into how you do that in terms of implementation.\nSo let's drive down into the underlying strategies.\nSo 15 to 20 names, what, what type of kind of filtering or factor process you're going through to get to,\nyour initial 15 or 20?\nYeah, so the first thing that step up the portfolio construction process is what we call smart security selection.\nSo one of the things that I think oftentimes when people have technology exposure,\nlike things like the triple cues or whatnot, they buy NASDAQ and they assume that is, that's the technology allocation.\nBut that's actually 20% of that index.\nThat merely means the names that are listed on the NASDAQ index exchange.\nIt doesn't mean their technology. So 20% of that index is actually not technology.\nSo what we do is we actually are agnostic in terms of the exchange.\nWe look at the whole entire set of technology names.\nAnd we actually, more importantly, remove the names that are not technology.\nSo for instance, I'm using the top 15 names on NASDAQ as an example.\nPepsi,\nComcast and Linda, which is a German gas company is actually, sorry, Costco is a huge component of the cues.\nAnd actually, if you just remove those because they don't have that growth behavior,\nthey don't already improve actually the performance of the asking.\nAnd then additionally, if you look at other exchanges, for example,\nOracle is listed on the New York Stock Exchange, there's other names like ASML, that's not US.\nYou can buy those. We can buy those. We don't have it in a portfolio right now.\nHedge out the Euro risk, then then you have a more complete picture of what that basket would look like.\nSo that is the first step in terms of looking at what is the core 15 to 20.\nAnd another thing is that, you know, part of why we're not quite concerned about this mag seven,\nthen raise up is that there's other names that have underperforming in the basket that we,\nif there's a really mean reverting component to it, we think the other, you know,\npotential 18 names or whatnot can actually also be performance drivers in the basket.\nSo here's where I think your engineering brain is going to come out.\nIt says, when I was reading the perspective, you're waiting these dynamically in an optimized way,\nyou know, the momentum signals. So can you talk about the process of, you know,\nrebalancing the portfolio and maybe dive a little bit deeper in, are you looking at kind of shorter term momentum,\ncycle momentum, you know, can you talk about, I'm sure you're underlying process that you guys probably had some hands in an engineering\nand trying to derive what momentum looks like.\nYeah, so again, we, we, we kind of accept the behavior of the sector that we are in and we design a strategy around it.\nAnd so, you know, a lot of technology companies are growth stocks and growth stocks tend to exhibit momentum, right?\nAnd so what our strategy does is that when there is upward momentum, we start over waiting basically the names that have upward momentum.\nAnd we start, what we've seen is that if you take a look at, for example, the top 15 names that the cycle of average of tech,\nthe names that have upwards prime price momentum for tech names is actually an average about about 10 months versus non-tech is about 7 months.\nSo what we want to do is obviously get at the beginning of that cycle, right?\nSo we, on our momentum signal, what we do is there are some shorter term signals.\nSo when we start seeing those kind of behaviors, we start over waiting about 2.5%.\nAnd when they're in the middle of that cycle, we'll over wait another 2.5%.\nSo the over wait is actually fairly modest. Well, the maximum is about 5%.\nBut we want to capture some of the over waiting at the beginning of the cycle.\nAnd if the momentum tend to be true, then we over wait it more on in the basket.\nNow, yes, I was going to say how often is that kind of signal reviewed in that over waiting occurring,\ndo you have it on a weekly or monthly cadence, or are you basically looking at them on a day-to-day basis and re-aligning the portfolio is necessary?\nYeah, so one consideration of the design is also to have not too much turnover transaction cost.\nSo first of all, I forgot to mention in the 1520 names we actually re-balance quarterly, because we don't want short-term volatility to incur cost.\nSo one of the things you might not be able to manage the market, but the one thing you can manage is the cost and the fund.\nSo we want to minimize that.\nIn terms of the momentum waiting, we do, again, we take a longer view.\nSo, and when I mean that is, if this is an exposure that is going to be in your portfolio for 3 to 5 years, the shorter signal would be on a monthly basis, not on a daily basis.\nWe think daily there's too much noise in there, signal to noise ratio is very, very high.\nAnd then we have a longer term that says, okay, if the average momentum cycle is 10 months, we can maybe cut that in half and see, get the second wind on those particular names.\nNow, this actually brings up to the third part, which is what if a name doesn't have momentum?\nWhat happens, right?\nAnd then, in fact, I would argue when a name doesn't have momentum, upward price momentum is actually perfect time for cover calls.\nSo, remember, in the environment that I mentioned, cover calls great, when it's trading sideways or it's going down, right?\nSo, that when there is no momentum, signal switches on, so we start writing cover calls on those names that have negative price momentum.\nAnd that actually helps us essentially making sure that all of the cover calls expire out of the money.\nAnd we can clip those coupons, get those premiums in the portfolio.\nAnd that's part of income generation in the fund, it's sort of dynamic.\nAnd one of the special behavior of this design is that, let's say we have a market sell-off that we've had recently, right?\nSo, many of the names don't have price momentum.\nSo, you actually, everything starts turning on on the cover call.\nSo, you generate more income, and that's sort of the counter cyclical income generation that will cushion your downside.\nAnd then, on top of that, is that when there is a sell-off, implied volatility tend to go up.\nSo, the amount of premium you get would actually also be incrementally higher.\nSo, that's how we think about, and maybe I should tell you a little bit of the origin story about this.\nSo, you know, we launched this six cover call ETFs because we wanted them to be tools.\nPeople can pick which names they want.\nAnd the most common questions we get was, like, we don't want to make a decision.\nWe want you, you're the manager, we want you to make a decision.\nSo, we could have just did a basket of the six ETFs.\nBut we actually went down back to the drawing board and say, if what is a strategy we want in our portfolio, right?\nWe know the weaknesses of cover call strategies.\nWe want the upside, but we also want the income.\nSo, that's how we came to this dynamic waiting to, again, asymmetrically get the upside and then cushioned the downside for the strategy.\nWell, I think the strategy is, I mean, this is episode 54.\nIt's one of the most unique ones that I've had the ability to kind of dive into.\nSo, you know, if you're an investment advisor, you're sitting there, you've got an existing diversify model portfolio.\nAnd this comes across your desk, which is, and I have a tech focused ETF that gives you the ability to get upside.\nBut also, it was going to flip and write covered calls when there's waning momentum.\nWhere are you putting this? Like, how are you advising your clients or investment advisors of where to kind of slot this in an overall asset allocation?\nYeah, that's also part of the design, right?\nSo, so when I was a Goldman, I was actually the asset allocator for huge, huge funds to make decisions about asset allocation.\nSo, let's start with essentially a 64 year portfolio, right?\nThis would, would fit into obviously the large cap bucket, large cap growth.\nWe think it would be good substitute for just a triple Q allocation.\nThe reason why maybe we named it K triple Q, just for the downside mitigation, right?\nIt would be a compliment to an SMP exposure, because SMP already has overweight, some of these techniques, so this would be used as a compliment.\nThe other thing in terms of asset allocation we thought about is actually the switching cost.\nSo, you know, in the market right now, there's a lot of discussion about, oh, people are rotating into small cap.\nSo, you know, if you're an asset allocator, you know, there's an issue with that statement, which is a unit of risk of large cap is not a unit of risk of small cap.\nSmall cap is much more volatile.\nSo, in the asset allocation, that's always a smaller part of your portfolio, right?\nSo, you can't, you can't just allocate yourself out of a large cap.\nSo, that's why we decided that downside mitigation is actually more important, because you have this core holding you have to hold for your risk exposure.\nAnd then maybe just, why do we think about using income as downside mitigation instead of buying protection, right?\nI personally have never really seen a tail risk hedging strategy that works.\nAnd the reason is because when you buy tail risk, you have to, it's like insurance you're going to buy it.\nIt's hard to gauge the size of the down, you know, how much premium you want to pay to ensure your downside and how much, how do you size the downside cap that, that, that, that,\nthat, you know, that you bought them that you want to, you want to cap down, right?\nAnd if you don't buy the sell this premium and you want to buy a put when the market sells up, the put is already very expensive, right?\nSo, so, and then you're using capital to buy the, so our thinking is, instead of spending capital, you generate capital to mitigate the downside.\nAnd so, so going back to to the asset allocation question is that also, we know many people have held\na technology names for a long time, right? They probably written before COVID.\nSo, if you were to really, you can technically modify on the edges, but if you were to really sell out that you're going to get a huge capital gains tax,\nwhether it's long term or short term, the tax bill is going to be there.\nSo, if you want, you, you want to minimize that tax efficiency also, right? That's part of what we think about the taxes.\nSo, you hold this exposure, you generate income. So, you don't have to sell out of the exposure and have a tax, you know, tax, tax bill, essentially, when you reallocate.\nAnd you hold it. And that income might give you some ordinary income or some whatever, but that's excess capital you wouldn't have ever otherwise have.\nSo, that, that was our thinking in terms of this design in the asset allocation perspective, where it fits into the portfolio.\nWell, how are this? It's been great. I really appreciate your time with me today. Before I let you go, where can people learn more about you and get all the information on all of your ETS?\nSure. Our website is www.curveinvest.auRVINVST.com, and all of the information will be on that website. Probably don't need to find me.\nI'm less interesting than the website that we have. So, I will be on there too, but that's where you can find all the information.\nWell, again, Howard, thank you so much for being with us.\nGreat. Thank you.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}