{
  "id": "15633947",
  "transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology, they are run on and you want more customization and flexibility.\nAs well as a AI driven model marketplace, UX wealth partners is your destination.\nOn top of that, they have institutional trading.\nSo if you are an ETF issuer or an SMA provider looking for outsourced institutional trading, UX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and make your practice more efficient.\nWelcome to Behind the ticker.\nToday we have on Springer Harris, he is the author of the book Get ETF.\nAn insider's guide to starting and running an ETF.\nSo we had a great little chat talking about what it takes to get an ETF to market.\nIt is an extensive amount of experience in the industry.\nSo we talk about all the different options when getting started, navigating through all the different decisions that need to be made.\nWe talk about marketing.\nWe talk about patience.\nWe talk about the entrepreneurship of the whole thing.\nSo if you're thinking about starting an ETF or your new to the ETF industry, I think this would be a great lesson.\nSo please enjoy this episode with Mr. Springer Harris.\nThanks, Springer. Welcome to the show.\nThanks, Springer.\nSo before we get started, always like to get a little bit about your background, what you're doing today and how eventually you decided to write Get ETF to a practical guide to starting and running an ETF.\nYeah, absolutely.\nSo I'm lucky enough to have spent basically my entire career in the ETF industry and rare enough that I've actually spent that whole time at the same firm.\nOut of college, I was actually invited to join two cream at that point.\nI didn't even know what an ETF was and two cream hadn't even launched its first fund.\nAnd so I wanted to have a little bit more stability in life and so I started to go down the corporate route.\nI went into major PR firm, major global PR firms started working on emerging social media.\nI didn't even know what Twitter was when I started working there, right?\nAnd we're doing that for super large, you know, Fortune 500 firms.\nAbout a year into that, I realized, you know, you know, put my head down, grind real hard 10 years from now.\nI could be that guy in that office there and that's about as far as I was going to get.\nAnd so I called two cream and I said, hey, does the offer still stand?\nThey had one fund out at that point.\nI said, you know, this is really what I want to do.\nAnd so I've been doing that now for 14 years.\nThe portfolio manager and chief operating officer at two cream now.\nAnd it's been a really exciting run for us.\nBut like any ETF issue are out there.\nIf you've been in the game for a little while, you've definitely had someone come to you and ask you,\nhow did you do that?\nHow did you launch your ETF?\nHow would I do it myself?\nAnd two cream we've always had an open door policy.\nWe've always talked to asset managers to make sure that we were being as helpful as we possibly could.\nAnd that sort of organically developed into providing some advisory services and\nsupport services for other funds.\nAnd what I noticed though is that more and more people were coming to me,\nespecially back in like 2022,\nwanting to know basically the same they had the same questions.\nEveryone had the same questions.\nHow do I start this ETF?\nWhat do I do?\nWhat are the different paths?\nHow long does it take?\nHow much does it cost, right?\nAnd I found myself just sending hours answering the same questions for folks,\nwhich struck me as an opportunity.\nAnd so I was invited onto a podcast back then to talk about how to start in old\nETF.\nAnd it spent a lot of time framing out how I was going to talk about that,\nhow I was going to present it.\nAnd I thought like great, this is this awesome piece of evergreen content that I'm going to be able to make\nand help people start ETFs, right?\nThis wasn't about having a business or making money or doing anything.\nI really just wanted to find a way to make my mark on the ETF industry a way to\nraise the tide for everyone.\nAnd the way that we do that is to empower entrepreneurs to push the limits of what the ETF\nrappers capable of, right?\nThat's where we're going to find it.\nSo I wanted to make sure that that basic information was out there.\nAnd so it was on the podcast.\nIt was really great.\nAnd literally the next day we're driving.\nAnd we're actually we're in the jungle.\nWe're coming back from Panama.\nIt's just me and my wife and I look in my wife and I say,\nI'm going to write a book and she laughs.\nI mean, she laughs.\nI mean, she laughs at me.\nLike belly laughs.\nLike couldn't believe it.\nLike there is no waste right here.\nLike you can barely get through an email.\nYou're not going to write a book.\nWe got home that night.\nAnd I literally just put hands to keyboard and started writing.\nAnd just pretty much poured my soul and everything I could think of about ETFs\ninto this book for about nine months.\nAnd went through the whole process and we can talk about that.\nBut it really was just a, you know, me wanting to put out there and speak to\nthe entrepreneur about what it means to be an ETF issue.\nYeah, no, that's great.\nAnd I certainly have gotten a lot of those questions as well.\nAnd I can just hand your book over instead of, instead of answering all the questions.\nBut before we kind of get into, you know, starting an ETF, how it all works.\nI always like to ask everybody when you're not working.\nWhat do you like to do outside the office?\nAny hobbies?\nI mean, so I'm an outdoors guy, right?\nBut I like clean outdoors guy.\nSo it's all water for me.\nI live in Vermont.\nAnd all my friends, they basically spend all their times in the mountains.\nI spend mine on the lake.\nWe've got a sailboat, motorboat.\nBasically, I'm not in the office.\nSun up to sundown.\nWe try to get out on the lake as much as we can.\nAnd when it's cold, I'm in the water as well.\nSo just getting out there surfing as much as I can.\nSo water.\nSo definitely a water guy.\nSo let's talk about just at the high level ETFs.\nLike what makes the ETF structure so appealing for an asset manager,\nbut also the end investor.\nSo I think what it comes down to right is we've got,\nwe've put a lot of pressure on the ETF where it's almost become like,\nit's the only vehicle and right?\nIt's not, but it is quickly becoming everybody's favorite vehicle.\nIn the sense that the interday liquidity and the ability to control your own\ninvestment with inside your brokerage account and get access to all these different types of strategies,\nall these markets that were otherwise previously potentially unacceptable,\nor there was a lot of friction in trying to access them.\nThat was one piece, right?\nAnd we've done a really good job at as an industry,\neducating end users on the features of ETFs,\nhow they were, why you would use them.\nBut let's be honest, right?\nThat was pretty self-serving education.\nAnd we did that so that more people would adopt the ETF as an investor,\nand we would all have more investors and our funds, right?\nAnd we needed to do it and there's still a lot of education left to do,\nwhich is why you still see ETF issuers hosting regularly about,\nhow does an ETF work?\nWhat's a creation or redemption, right?\nThere's still a lot more of that to do.\nBut the audience that was neglected during this was the asset manager\nwho could bring out more ETFs, right?\nWhen we all started to form, you know, build our ETF businesses,\nwhite labels didn't exist, multi-series trusted and exist.\nYou had to come out, you had to build the entire infrastructure yourself.\nAnd that created a barrier to entry.\nBut then the other thing that we did is we put barriers to entry up about how you do it.\nSo that's where we lost educating the public,\nwas how they work from the inside,\nwhat the folks like us have to do when we're running those funds.\nAnd I think that once we've started to lower the barriers to entry,\nwe've started to flatten the learning curve for how they work.\nAsset managers are starting to realize,\nthis is a fantastic way to put my strategy because it makes my job a little bit easier.\nI'm not managing maybe a bunch of SMAs,\nyou know, whatever those types of things that you're packaging up into the ETF,\nmake sure of like sort of operational life easier.\nBut now all of a sudden, the ecosystem for your customer is anybody with a brokerage account,\nright?\nAs long as you can get your fund on the platform,\nas long as a person can sign into their brokerage account,\ntype in your ticker,\nand click by,\nthey're a potential customer.\nAnd so it changes the landscape of who you can market to,\nI mean, let's be honest,\nin the ETF space,\nwhen we're marketing,\nyou're marketing to everyone all the time.\nYou don't know who's purchasing your fund,\nand you don't know when you put out a piece of content or education,\nwho that's actually going to trigger.\nWell,\nif you take about a small asset manager with,\nyou know,\nmaybe a hundred million dollars in SMAs,\nall of a sudden,\nnow there are strategies available for basically the whole world to purchase.\nLike that's a huge opportunity, right?\nYeah, of course.\nYou touched on this lately,\nI think one of the things that people have a fear,\nespecially when you're talking to SMA managers is they,\nit used to be,\nyou know,\na fairly heavy lift to get these things to market.\nSo,\nyou talk about how that landscape has changed to kind of make the process of getting to market a little bit easier.\nYeah.\nSo,\nthe way that I structure the book, right,\nis to basically talk to the,\nI talked to the entrepreneur.\nWhen I was writing the book,\nI was,\nI had the picture of myself,\nyou know,\nsomeone like you Brad,\nlike starting a business from scratch,\nand speaking to the entrepreneurial spirit within the asset manager.\nAnd a part of that is to explain\nthat there are multiple ways that you can bring an ETF to market.\nAnd it's about looking at your business plan,\nyour long-term goals,\nwhat you want to do.\nAnd so when you look at that,\nyou really got three ways.\nOne,\nyou can build your own business.\nAnd there's a lot of reasons why you would want to do that.\nThere's also a few of the reasons how you wouldn't.\nOn the other side of that spectrum,\nyou have a bunch of new entrants,\nyou know,\nme included,\nthat have white label businesses,\nwhere you can basically just\nbring your strategy to the table,\nring cap,\nenough capital launch it,\nit's much cheaper to do it that way,\nbecause the economy's a scale.\nAnd you have an established business,\nbasically just present you with a turnkey,\noperations,\nregulatory,\neverything you need,\nyou can be out in 75 days,\noff to the races, right?\nAnd then in the middle,\nthere's this,\na lot of different ways that you can build a hybrid business,\nwhere you can use a multi-series trust,\nyou can have more control over your business,\nyou can be the advisor,\nand you kind of can create the best of both worlds,\ndepending on what you want the outcome of your business plan\nto look like.\nAnd so oftentimes when I talk with aspiring ETF sponsors\nand issuers,\nI always try to get everyone to take a step back\nand really look at their business plan\nand say,\nwhere do you want to go?\nWhat are the different ways that this might evolve?\nDon't just look at this as asset management.\nYou have to look at this as any entrepreneur would\nin their business.\nAnd when you start to look at it like that\nand you think about your own goals and your plans,\nwhat makes you excited to come to work in the morning,\nyou can figure out really what the best path for you.\nSo when you're talking to advisors that are making that decision,\nwhat would kind of shift your advice to say,\nhey look, why don't you build your own trust?\nLet's do everything soup to not control your destiny there,\nand then what would kind of make you say,\nlike I think the white labeling approach is right for you?\nWhite labels definitely good for an advisor or asset manager\nthat has one strategy, two strategies.\nThey really haven't learned much about how the ETF ecosystem works\nand frankly don't care to.\nThey want to focus on what they do best.\nThey want to manage their strategy.\nThey want to go out and market their fund, right?\nAnd if that's all you want to do,\nthen the white labels great for you.\nYou have to recognize that you're going to get those efficiencies,\nbut on the other side, you're paying a whole team of people\nto do all the work for.\nAnd so when you do less, you make less, right?\nThat's just anything, right?\nYou don't know your own lawn.\nYou have to pay for it.\nIf you know your own lawn, you get to keep that money, right?\nThat's a seamless level.\nThat's what it is.\nAnd so if you want to, if you're a really go-getter,\nentrepreneur, and you want to build an enterprise,\nsomething with, you know,\nsignificant value that you may want to exit from,\nand you want to sell.\nIf you want to manage a team of people,\nif you want to, you know,\nget the brain calluses to go through this business and figure out\nwho are the best partners to work with,\nconstantly making changes,\nand bring out most importantly,\nI mean, an entire suite of product.\nIf you want to build a brand and a whole suite of products,\nthen, you know,\ndo it yourself is the way to go.\nThere's a lot of empowerment,\na lot of pride that comes with building a whole ETF business,\nbut it's hard and it's expensive.\nAnd so you really have to be committed\nto the ETF game for the long-term\nin your business plan versus, you know,\njust wanting to build strategies.\nSo you touched on this as, you know,\nfor those people that are kind of doing it\nthemselves, finding the best partner.\nSo there are many choices that come after,\nyou know, deciding to launch an ETF flight.\nDo your service provider is what exchange\nyou're going to list on?\nWho's going to be your lead market maker?\nAll these different things.\nYeah.\nSo how do you kind of advise someone or\nkind of coach them through navigating\nsome of these decisions?\nBecause there's a ton of options out there.\nYeah. I mean, that's one of,\nthat's a whole chapter in the book, right?\nSo, you know, building your team.\nSo you've decided that, you know,\nfirst chapter basically just teaches you,\nhere are the basic terminology that we use inside the industry, right?\nBecause any industry,\nif you're a doctor, whatever it is,\nlike I'm on the board at the hospital, right?\nThe doctors use vocabulary that I don't understand.\nAnd when they do that, they label you as an outsider.\nAnd it's just natural, human tendency\nto do that in every business,\nevery culture, every, you know,\nsport, some culture, whatever it is.\nWe have a vocabulary that we use.\nAnd it's a way of establishing insiders and outsiders.\nAnd at its basic core, that's just what we do as humans.\nAnd so in the ETF industry, we're no different.\nAnd so the first thing I do is I teach the aspiring ETF sponsor,\nthe vocabulary, that they can use\nwhen they enter into a conversation with someone like you,\nor me, or a service provider.\nBecause if you don't have that, all of a sudden,\nyou don't have the confidence to be a part of the conversation,\nand you don't feel like you're an insider.\nAnd so you got to have that confidence to just step up\nto the table and actually have the conversation.\nBut then, okay, I'm confident I'm ready to go.\nI'm ready to do that.\nBut now, who do I have the conversation with?\nI don't even know what I need.\nAnd so I build out in the chapters,\nbasically internal teams versus external teams.\nNo ETF business can operate 100% internal.\nIt's not possible.\nYou have external partners in different parts of that ecosystem.\nIt's a requirement.\nAnd I lay out basically how you can build\na small team or the biggest team internally, right?\nAnd minimally, I mean, you can be a one-man shop,\nbut if you're going to build your own ETF business,\nyou need to be at least three people.\nI mean, that's you have to be.\nAnd then you look at, if you're going to outsource everything,\nwho do you need and what are the major rules that need to be played, right?\nSo I go down and I list who they are,\nbut what the rules are, right?\nI don't mention any businesses on my book at all.\nI did that on purpose, right?\nAnd you go through that.\nThen when you start to dive into it and you start to Google,\nokay, who's a funded administrator?\nWho's a distributor?\nWho does this?\nWho does that?\nNow you're just left with a ton of choices.\nAnd so if you're going to enter and start to build your own business,\nit's probably worthwhile to find a consultant,\nfind a consultant's a really good way to do that.\nI do that for people.\nOr just start to make friends with inside the industry\nwho can basically give you referrals of who works from,\nwho I've chosen and why.\nAnd that's kind of how the ETF industry works, right?\nThere's a few different centers of influence\nthat basically get everybody the business.\nThe attorneys usually start, right?\nYou hire an attorney and the attorney knows different people\nand they say talk to this person, talk to that person.\nOr you pick one of your first, you know,\none of your first service providers,\nyour administrator, your distributor,\nand they start to give you a web, right?\nAnd now you've gotten introductions to these firms.\nBut how do you choose?\nThey're essentially providing the same service,\nbut they're going to do it differently and they're going to charge differently.\nSo one piece is definitely price.\nYou have to keep price in mind.\nWe always do any decision we make in life and business.\nYou keep price in mind.\nBut the thing that I really instill in people in the book and in my conversations\nis that when you're choosing a partner,\nchoose them the same way that you would hire inside your business.\nThe same level of diligence that you would do before you allowed someone\nto show up physically in your office and work for you every day,\ndo that with your service providers.\nBecause they will be working for you,\nyour funds, your investors, every single debt.\nThese need to be people that are easy to communicate with,\nyou enjoy communicating with,\nthat you want to celebrate your successes with.\nBut you can also give feedback to when it's time.\nBecause, you know, this is a challenging business\nand we all have to give each other, you know,\nnegative feedback sometimes about the way things are going.\nAnd you need to have a group of people who are going to work with you in that.\nAnd they want to see your success.\nAnd so the biggest piece of advice that I can give there is really\nchoose your business partners,\nyour service providers,\nas if you were choosing business partners and employees.\nBut also don't be afraid to let them go either.\nYou're not stuck.\nYou're never stuck with any of your service providers.\nSo it's very difficult to change.\nIt can be painful.\nIt can be time consuming.\nBut, you know, I've changed almost every service provider\nwe've had over the years.\nAnd it's a healthy thing to do.\nAnd you really have to be open to it.\nYeah.\nI mean, that's really great advice because you,\nyou think you're just picking a service provider based on,\nokay, let's get our margins as high as we possibly can.\nBut in reality, you end up spending a lot of time with these people.\nYou see them around.\nYou see them at conferences.\nYou're talking to them sometimes, you know,\ndaily or weekly.\nSo it's definitely important to find service providers that you enjoy\nworking with, even if they are maybe a little bit more expensive.\nAnd I think, too, you end up, once you create that relationship,\nyou end up getting a better level of service, right?\nAbsolutely.\nYou know, I mean, if you've been in the ETF industry long enough,\nyou know, I think, I mean, you've had so many people on this show, right?\nIt is an amazing community.\nI think it's the best community in finance.\nI think everybody that's in ETFs would say the same thing.\nIt's an ETF family.\nAnd you can see that when we all get together at the different conferences,\njust how excited we are to be around each other,\nnot even necessarily talking about business.\nAnd so if you're looking at entering the ETF industry,\nyou have to recognize from the beginning that you are stepping into\nan extremely close-knit family.\nIt's a growing family, but it's still pretty small.\nI mean, we all know each other.\nAnd having those relationships with the people that you work with\nis critical.\nYou know, staying on that firm in it, that was one of the things that surprised\nme the most about entering the ETF industry\nwhen we did a couple of years ago, because the other parts of finance\ncan sometimes be a little bit cut throat and a little bit ugly.\nAnd I mean, there's a lot of entrance in this space.\nIt's crowded, but everybody is willing to help and is willing to work together\nin some capacity.\nBecause I think there's a feeling that the industry has been growing rapidly,\nbut it's like a rising tide lifts all boats, right?\nAnd I think we're all on it together.\nAbsolutely.\nAnd the thing that makes it so cool is that not only, I mean, there is no doubt.\nIt is hyper-competitive, right?\nLike if you've got an idea for an ETF, you have to assume two other people\nhave the same idea and they're working on it harder and faster than you are.\nThat's what gives you that fire to actually come to market.\nThat race, you have to race yourself because you're assuming other people\nare coming with you, right?\nAt the same time, I think you or I could call anybody in ETF industry\nand ask them a question, who are you using for this?\nHow did you do that?\nI'm really curious about this.\nEvery one of us will give up the answer, right?\nAnd so we'll help each other to succeed while also being\nextraordinarily competitive.\nBut that's the difference between competition and being cutthroat, right?\nI don't see the ETF industry as cutthroat, right?\nAnd that's why I love being a part of it.\nSo it's getting back to kind of starting an ETF.\nSomeone comes to you, what is the number one misconception that you hear all the time\nwhen people are trying to enter this space?\nThat everything can be an ETF.\nI mean, that's like everybody has this idea and they're like, I want to put it into an ETF\nand it's like, all right, we can push the boundaries of what the ETF can do.\nBut not everything can be an ETF, right?\nYou really have to look at it and you have to look at the parameters of what the rapper can do.\nAnd some types of strategies are just better for a closed-end fund or a hedge fund or an SMA, right?\nI mean, I've had folks come to me and they say, you know, I might make anywhere between zero\nand a thousand trades each day, but I start the day with cash and I end the day with cash.\nAnd it's like, dude, I can't be an ETF, right?\nStop.\nYou know?\nAnd so it's this misconception that everything can be an ETF.\nThat's one.\nAnd then two is that if I build it, they will come, right?\nIf I put it into an ETF rapper, I'm going to make a whole bunch of AUM and therefore\nI'm going to make a bunch of management fee.\nAnd that couldn't be further from the truth, right?\nWe all know that.\nYou can build the best ETF and they're not going to come.\nAnd so when I talk with different entrepreneurs, the thing that I wouldn't say it's a misconception,\nI think the thing that surprises them the most is when I say they need to have a three-year\nbusiness plan.\nAnd I wrote that in the book.\nAnd I make that basically a requirement for folks that I work with is that if you're going to come\ninto the ETF space, you need to have cash flow to support your ETF for three years.\nBecause far too often I talked to entrepreneurs who say, I've saved up enough money.\nWe've got enough cash flow.\nBut this has to work in 12 months.\n12 months, I need to be above break even.\nI'm not bringing any assets to the table, right?\nSo we're going to start at seed two and a half million.\nAnd I need to be up to 50 million in 12 months or I'm out, we're closing.\nAnd you can't do that.\nIt is way too risky.\nI mean, the capital that you're going to put on the table to start that ETF and say that you\n100% have to be at break even in 12 months or you're out of the game.\nIt's too risky.\nSo you have to look at it and you have to say, this is a three-year business plan.\nI'm going to support this ETF through tough times for three years.\nYou know, plus or minus, I mean, if you've been hit at two and a half,\nI mean, this isn't like an exact science.\nBut you need to have a long-term view of success in your ETF.\nAnd I think that is the sobering reality and conversation that I find where people\nreally then step back and start to evaluate their business plan.\nSo it's great.\nLet's stay on this for a little bit.\nSo I was going to ask that question.\nHow much capital would you say you need to sustain and kind of grow this thing?\nSo you kind of gave me that three years.\nBut the built, if you build it, they will come is the number one thing that I hear\nand when I talk to people, I have to explain like that is just because the ticker\ngoes live, you're not going to get flowed.\nSo how would you approach marketing kind of then the first one and two years of a fun\nlaunch?\nAnd then all of a sudden you've got a three year track record.\nAnd so, you know, that's a big milestone and kind of how would you approach,\nyou know, once you get to that three year mark,\nhow would you approach continuing to kind of get momentum and continue to grow?\nSo in get ETF, right?\nI walked through a very linear path of coming to market, right?\nLearning the terms coming, you know, coming up with a good idea,\nvetting it against the marketplace, all the components of having a good idea.\nThen we go through the build out your team, regulatory structures,\ngetting through filing, getting up through launch, all that, right?\nNot that that's easy, but it's a tried and true path, right?\nAnd anyone with enough dedication and support can get through that path.\nFor once you're standing there on the New York Stock Exchange and the bell goes off\nand your family's clapping for you and you go to dinner that night and you celebrate\nand you wake up the next morning.\nThat's when the real work begins, right?\nYou just spent six months bringing this to this point.\nAnd now you're actually at the starting line.\nAnd at the starting line, you've got two things you have to do.\nOne, you have to operate this thing day in and day out.\nOn the other side, you also have to grow it day in and day out.\nAnd in the ETF industry, there isn't a single person here who has the ideal\nformula worked out for how you market an ETF.\nBecause if you did, you wouldn't be working in the ETF industry.\nYou'd be owning your own island, you'd be sitting out there and you'd be sit in\nMargaritas because you'd be worth tens of billions of dollars because that's what\nwe're all looking for is what works in marketing in this industry.\nAnd my colleague says it best.\nJay Canley, he's our head of marketing here.\nEverything works in nothing works.\nAnd that's the most frustrating part about ETFs is you have to do everything.\nAnd none of it's ever going to feel like it's working.\nBecause no single thing that you do is the golden ticket.\nYou're not going to be able to look at one single action and say,\nthat made me $5 million.\nThat made me $10 million.\nHe doesn't work like that.\nIt's an entire strategy for marketing that you run month to month,\nyear to year.\nAnd you build.\nYou build not only your track record in terms of performance,\nbut you build your brand.\nYou build trust.\nYou build relationships.\nThat is really where a lot of this is.\nAnd then also it's time in market.\nI mean, you and I have both seen really great ETFs,\nflows right before their time would have been.\nYou know, they closed down and then whatever market that they were invested in,\njust explodes.\nAnd it's like, oh, you missed it because you just didn't stay in the game long enough.\nAnd then we've also seen ETFs that are time perfectly, right?\nThey come out.\nThey had no intent of being a unicorn.\nAnd it's just timed as a miraculous miracle.\nAnd they're one of the unicorns that go down in ETF history, right?\nBut that's not what most of us are going to experience.\nAnd so at the early stages,\nit's about setting your brand,\nestablishing who you are,\nbeing, you know, being honest about who you are,\nbeing authentic.\nAnd getting that education out there that not only your fund exists,\nbut what it does.\nAnd you have to recognize that when you're doing that,\nyou're fighting for not assets.\nYou're fighting for tension, right?\nEvery one of us is our tension is being pulled by our phones all day long,\nby every consumer product, whatever it might be.\nAnd so you're fighting for that attention to being known.\nAnd then once you start to actually get some momentum,\nthen you can start to go and have a lot more 101 conversations with advisors\nand investors and so forth.\nBut if anybody tries to sell you the golden ticket,\nthey don't have it.\nI'm not going to say that I am a marketer, right?\nI'm an ops guy.\nYou know, I love ETFs a lot of building.\nYou know, I had to market my own book.\nThat's been a lot of fun, right?\nBilly my own brand.\nAnd so like that's really one of the things that I can speak to, right?\nIs having to build a brand for myself as an individual,\nbrand for my book and my business, GDTF.\nThat was a lot of fun.\nAnd then on the individual side in ETFs, right?\nThere's a lot of really great teams out there that can help folks come up with brands.\nIf you don't want to do it yourself.\nAnd then oftentimes, you know, with the older established businesses,\nwe've kind of evolved over time, right?\nWhen I think about branding, you're not the sign you put on the door.\nYour brand is who you are and the experience that people have with you.\nAnd what they think about you.\nAnd so, you know, think about a grocery store, right?\nYou've got to logo on the door.\nThat's not your brand.\nThe brand is what the grocery store looks like.\nWhat if you like to shop there?\nHow happy you are when you walk out the door?\nHow you were treated?\nThose are the things that an ETF company should focus on, right?\nYou can spend a ton of money getting a really cute logo and\nsuper high tech website and all this other kind of stuff.\nThat is important on the surface.\nBut if it's not backed up with culture, it's worth nothing.\nAnd so, for me, when I think about what builds an ETF business,\nit's when an investor calls you, answer the phone.\nWhen somebody sends you an email through your email and says,\nI'm interested in this, email them back immediately.\nThat's the level of service that people are not accustomed to.\nI don't even think in the ETF industry.\nAnd so, if you can do something like that to set yourself apart,\nyou're everything.\nAnd that's something that, you know, I do agree.\nI mean, we work a lot on that.\nIf you call us and you leave a voicemail,\nyou're going to get a call back from somebody in 30 minutes.\nAnd it's going to be the person who can answer your question.\nIt's not going to be a call center.\nIf you shoot us a note on email or you send us something through social media,\nyou're going to get the person who has the answer and they're going to get back to you immediately.\nThose are really important things to do.\nAnd so, when you're coming out and you establish yourself,\nbe authentic, set your brand, you know, lucky enough we're in ETFs.\nWe're not stuffy.\nYou know, we all are who we are.\nWe've got lives and we bring those lives to the office and we work hard.\nJust be a real human being and treat your customers and your investors.\nThe same way.\nMeet them where they're at help them educate them.\nBut, you know, just be available and all too often you just don't find people that are.\nWe've just got a culture where we ignore emails.\nWe don't answer phones.\nAnd frankly, it's just not okay.\nYeah.\nAnd to going back to your point about having, you know,\na three year plan and operational budget.\nLike, it's not just operations.\nWe've got to include in that budget, right, PR.\nIf you're going to do, you know, pulse, if you're going to do, you know,\noutsource distribution or if you're going to bring that internal,\nif you're going to have someone help you with social,\nyour website, like all of these things need to be included in that.\nBecause it adds up quickly and they're monthly on going expenses.\nAnd you're, you also said something else that I couldn't agree more with is.\nYou have no idea where money is coming from and what his work\nand sparks someone's interest.\nSo you kind of have to do all of it.\nSo let's talk about it.\nIt is the most frustrating thing.\nIt's the most frustrating thing.\nYou bang your head against the wall.\nTry to figure out what it works.\nAnd you feel like you're just cutting checks all day,\nevery day in marketing.\nAnd you want to optimize that.\nAnd you can to an extent.\nBut it takes a long time to figure that out.\nAnd so working with folks who've done it before is really important, right?\nLike any of us who've been in the industry for long enough.\nWe've made some bad marketing choices.\nWe've made some bad marketing deals.\nWe all have.\nAnd we learn from them.\nAnd so, you know, don't just buy everything in your soul.\nYou know, there's a lot of really great ETF marketers out there.\nAnd there's a lot of people that are just, you know,\nthey're selling false hope.\nYeah, I would agree with that.\nSo let's stay on marketing for a minute.\nOne of the biggest gripes I get from asset managers who are getting\ninto the ETF space is they're frustrated by what they can and cannot say\nbecause of, you know, distribution and compliance.\nSo how do you try to set someone's expectation going in that,\nyou know, this isn't the wild west.\nAnd you got to be careful about what you say.\nYeah, no doubt, right?\nWe all have that challenge.\nYou know, we're not, we're not selling sneakers.\nYou know, I mean, we're selling asset management.\nAnd we've got a high bar that we have to hit both operationally.\nAnd from a compliance aspect when you're talking about people.\nI mean, this is, this is people's money you're talking about.\nAnd it's important.\nAnd we have a lot of rules trust me.\nI know that the SEC was in my office for the, you know, Monday and Tuesday\nbecause we've got our, you know, periodic audit.\nAnd so it's, it's very fresh in my mind this topic.\nThere's a science to it.\nAnd there is a way that you can do a lot and still remain very compliant.\nIs it frustrating?\nYes.\nIt might it take twice as long three times as long to produce that piece of content.\nAbsolutely.\nBut you can do it.\nLuckily, a lot of people who are thinking about starting an ETF,\nthey're not wild west.\nIt's sort of culture because they're probably coming from a background\nand finance anyway.\nThe people who kind of think about that is the person who's still quite a far away\nfrom launch, like they've got like a back test ideal and there's Excel sheet.\nAnd they've never managed any money before.\nAnd, you know, they've got a long road to go before that ETF actually comes out\nto market and they'll learn that.\nBut any of us that have been in finance for any period of time,\nwe recognize how difficult it is.\nBut as the environment evolves,\nespecially with online advertising,\nthere's a lot of ways that that you can get your message across.\nAnd I'm really excited about these suite of products that are coming out that are\ngeared towards finance from the compliance side that are basically like compliance\nchatGBT, right, where you can spend less time,\nless of your own time trying to make sure that something is written just\nperfectly.\nWe can move a lot faster.\nI mean, you could even do like, you know, voice to type,\nget a piece of content out there, throw it through some of these tools.\nAnd it gives it back to you 100% fully compliant.\nThe SEC is going to be good with it.\nThen we're going to be good with it, right?\nAnd so, time to market and content is really important.\nAnd I think that's one of the biggest challenges we face.\nNo, no, no, no, no, no, that's one about there.\nMake false promises about what we produce, right?\nNo, I mean, some people do that and they get trouble for it.\nBut nobody that's really in this game is doing anything like that.\nYour reputation is way too important.\nBut time in producing compliant material is difficult.\nAnd so I think as some of these different firms that are producing AI tools\nto solve that problem for us,\nI think you're going to see a lot more content getting produced.\nAnd it'll it'll lower the learning curve for newer entrance on how to produce compliant material.\nI love that.\nI didn't know that those existed.\nSo I'll be doing a Google search after after our podcast here.\nYeah, they're very impressive.\nThey're impressive.\nSo let's talk about the, you know, kind of finally,\nwe've talked about starting an ETF.\nWe've talked about picking partners.\nWe've talked about marketing alluded to this a little bit.\nLike when is it time to say, okay, the shows over and I need to shut it down?\nI've shut down ETFs.\nWe all have it sucks.\nI mean, it's like going to a funeral.\nYou know, you've put so much time and effort and money into just getting to the point\nwhere you launch it, you put so much effort into running it, all the stress,\nthe time, you know, this industry, it takes a lot.\nI mean, it takes a lot out of you.\nYou get tired and to shut something down that didn't work is just it sucks.\nAnd there's no other way to say it because you had high hopes for it.\nYou would have never launched it if you didn't have high hopes.\nAnd so what you have to sort of admit that you fail.\nAnd that's okay.\nIt's okay in the ETF industry because it doesn't mean you failed as an ETF\nissuer.\nIt means that strategy didn't work.\nAnd simply by coming to market, running it, doing everything that you could.\nYou know, you learn from it and you apply that to your next strategy.\nAnd so it's, it's really no different than any other business, right?\nThe people who have been the most successful in this industry are the ones that stay at it.\nThey find a way to stay in business, cut their losses when they have to,\nand keep focusing on the next step forward.\nAnd it is an entrepreneurial journey.\nAnd that's why I look at the ETF industry in two different lights, right?\nI call this the 60 and the 40, right?\nYou've got the 40% of issuers at the top, the major banks, the large institutions.\nThey're running ETFs in a totally different way, right?\nThey will call ETFs like it is nothing.\nThey don't care.\nThey can afford, you know, to throw this spaghetti at the walls as we all say and see what sticks.\nLet the other ones go.\nThe entrepreneur, we don't have that luxury, right?\nWhen we choose something, we chose it and we put a lot behind it in order to do that.\nAnd that's where I like to focus my effort.\nMy time is on the bottom 60.\nIt's a different ETF industry for me, right?\nThe entrepreneurs and the large corporations, I cut the line and I say,\nwe're not even operating in the same industry,\neven though we operate the same wrapper, right?\nAnd yeah, I've closed 20 of ETFs for clients.\nI've closed ETFs for our own firm.\nYou just, you have to know when to do it.\nAnd sometimes you can take it too far.\nAnd then when you just have a zombie ETF that just exists out in the marketplace,\nit's pretty hard to come back from that.\nAfter you've gone too long with no assets or poor performance.\nYeah, well, springer, I can't thank you enough for being here before I let you go.\nWhere can people learn more about you?\nWhere can people find the book and get themselves a copy?\nAbsolutely.\nSo I still publish the book which it was its own journey in and of itself.\nSo it's available on Amazon.\nYou can get it in Kindle or in print.\nVery active on LinkedIn.\nSo basically just taking a lot of that content,\nturning it into micro content, trying to educate the whole community on one step at a time.\nJust like this podcast, I get to write on ETF Central.\nAnd so bring out a lot of topics there on ETF Central.\nBut I'm always available on LinkedIn.\nAnd then my website just get ETF or how to start an ETF.com.\nYou can find different ways to either get on my schedule or get a copy of the book.\nWell, again, springer, thank you so much for your time.\nI appreciate you being here with me today.\nAnd thank you so much.\nIt's been pleasure.\nThank you.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}