{
  "id": "15707534",
  "transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology they are run on\nand you want more customization and flexibility, as well as a AI-driven model marketplace,\nUX wealth partners is your destination.\nOn top of that they have institutional trading, so if you are an ETF issuer or an SMA provider\nlooking for outsourced institutional trading, UX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and\nmake your practice more efficient.\nWelcome to Behind the ticker.\nToday we have on James St. Auburn.\nHe's from Ocean Park asset management where they do a number of things whether it's their\nsolutions business, their mutual fund business and their growing ETF business.\nToday we're here to talk about DuckQDUKQ, which is their domestic equities ETF, focusing\nat the conversation really on the signaling process, how the ETF operates and where it fits\ninside an overall model portfolio.\nSo without further ado, please welcome Mr. James St. Auburn.\nHey James, welcome to the show.\nHi Brad, thanks for having me.\nSure.\nBefore we get started, always like to ask, can you give everybody a little bit about your background\nand how you eventually ended up over at Ocean Park?\nSure.\nChief Investment Officer at Ocean Park, I've been here for two years and prior to that,\nmy career has spanned a number of firms that really all focused, all the roles that I've\nhad focused on, manager search, selection, so a gatekeeper role as well as asset allocation\nand portfolio construction.\nSo I started at Smith Barney in the early days of my career and moved into consulting with\ntwo firms that you might be familiar with, will share it and it bits and associates.\nSo I spent time mostly doing asset allocation, constructing target risk, target date,\nportfolios for financial intermediaries.\nAnd then more recently, I was at a head of investment strategy for a private bank and\nsort of my career evolved to Ocean Park a couple of years ago and I'm very excited to be\nhere.\nWe've got a lot of exciting things going on.\nYeah, and I'm excited to talk about those things.\nBefore we do that, though, I always like to ask, what any hobbies you got when you're\nnot kind of sitting down the desk or when you're not work and what do you like to do when\nyou got some free time?\nYeah, free time is limited for me.\nI have four kids that are between five and twelve.\nSo you can imagine what that means.\nI've spent a lot of time in the car.\nSo in front of a computer screen or a shuffling, kids around to different activities.\nBut I like to be outdoors and that's where I'll hear a basic Santa Monica and Southern California.\nThey're big reason why people move out here is to be in the outdoors.\nYeah, no.\nI spend a little bit of time out there as well.\nIt's beautiful out there.\nYeah, you're with four kids between those ages.\nIt's entering false sports season.\nSo I can assume you're all over the place.\nAlways on the move.\nAlways on the move.\nSo let's talk about Ocean Park as a whole.\nYou have a suite of ETFs, but you also do a number of other things.\nYou can just kind of talk about how the firm helps clients holistically and all the different\nthings that you do.\nSure.\nSo Ocean Parks, it's roots go back more than 35 years to the mid-80s.\nWhere the founders, I think the origin story is really interesting, where folks that\nwere not in finance or investing, they can't have an unconventional path to the asset management\nworld.\nBut they started in RIA, and when they started in RIA back in the mid-80s, they asked clients,\nwhat are your concerns?\nWhat it means most to you in your investing journey.\nAnd they heard very much similar things and keep in mind they were targeting retirees or\nfolks that were near retirement.\nAnd they all had a major concern of losing money in that very vulnerable period before\nor during retirement when distributions are near and recognize the sort of psychological\nimpact and the sort of financial impact large declines and the market can have.\nAnd so they developed their own proprietary strategy, which I'm sure we'll get into that\nreally focused on protecting the downside.\nWell, hopefully, being able to participate in the upside as well, to deliver total return,\nbut really focused on trying to mitigate exposure to the left-tail risk that is not common,\nbut can be painful when it happens.\nSo today we have our four ETFs.\nWe also advise eight mutual funds under the Sierra brand, which will be changing to Ocean\nPark in next month.\nAnd we also have a solutions business, so we've been packaging our funds into as a fund\nstrategist and to portfolios for advisors to use of those that don't want to use their\nown strategy, their own asset allocation.\nThey can port into a solution that combines the best of our strategies together in a way\nthat makes sense for a particular risk profile.\nYeah.\nAnd we were talking before we got on like we run a very kind of similar business and also have\na very similar mindset, not only from the solution side, but the ETF, but also, you know,\nwe kind of have that mantra as well where it's like, you know, we'd much rather cut off as much\nof the left-tail as we can, as humanly possible because that is tends to be the most painful\nquestion and the most painful things that advisors and clients have to deal with.\nSo let's talk about if as much as you want as much as we can, kind of your quantitative\nprocess and kind of that quantitative strategy holistically, you know, it seems to me it's\nthree parts, right?\nYou have security selection, which I think would that security selection would be deemed\nupon, you know, what type of strategy you want to run.\nAnd then it looks like there is, you know, a buy signal and also a sell signal.\nSo could you explain to me, you know, what would kind of trigger a signal on the buy side\nand then, since your focus kind of more on capital preservation, you know, what that sell\nsignal looks like?\nIs it a stop loss?\nIs it technically driven, quantitatively driven, like, can you kind of get into the weeds\na little bit?\nAbsolutely.\nSo you're right, how do we start with the buy signal?\nBecause that's the first step.\nWe always say every investment manager has to answer three questions, what to buy, when\nto buy, and when to sell.\nSo on the, when to buy question, we look for trend positive trends, right?\nAnd signals are strategy uses banded moving averages, not to get too far into the weeds.\nHere we have a lot of detail on that on our website if you're really interested.\nBut the banded moving averages use short-term, exponential moving averages as the bands,\nand we also have another secondary, longer-term moving averages as sort of a second signal\nto confirm the uptrend, and when we see that signal in a particular, like you mentioned,\nwe have different target markets, and we'll get into specifics later.\nBut whether, whatever the target market is, we'll look for funds, all of our holdings\nare underlying ETFs, so we don't buy individual securities.\nWe're buying other underlying ETFs.\nIn each one of those ETFs has a band around its price, and when it crosses the recent\nlow of the upper band, and the secondary moving average, that is a buy signal for us.\nSo that's a buyable fund.\nIn our ETFs, we have a predefined list of funds that we've researched that we believe\ncomplementary to the target exposure we're looking for, and if one of those funds enters\na buy signal, it will be bought and added to the portfolio at a prescribed way.\nNow, let's talk about, let's dig into that a little bit further before we go to the\nkind of the cell discipline, which would be, let's say, we're going to talk about DUKQs.\nLet's dig with domestic equities for the time being.\nI'm sorry, domestic ETFs, since everything's funded funds are ETFs ran.\nSo are you picking kind of that security selection, are you picking a bench, if you will,\nto apply that signal to, or are you kind of looking at a much broader universe, like,\nhow narrow is your scope when you're kind of looking in a general direction?\nSo our research refined the list of names.\nSo we do have a bench and a list of what, what if all the funds within our, our bench\nare opportunity set that's been pre-defined, have buy signals, they will all be in a portfolio,\nhave exposure in the portfolio at a certain weight.\nWe did, we decided what funds, now that includes broad market exposures like the S&P 500\nand QQQ, or the NASDAQ 100, but also small cap and mid cap exposure as well.\nSo we looked at all the opportunities that we could invest in during our research process\nand said, okay, which ones are the most complementary to each other?\nAnd that's how we narrowed it down to a smaller list of the individual ETFs that have specific\nmarket exposures that we think will be additive to the diversification of the portfolio overall.\nGot it.\nAnd so then let's talk about the cell discipline.\nSo we've picked our bench, we've identified things that are in positive trend that we want\nto own.\nRight?\nSo on the flip side of this, when are we, when are we deciding to kind of pull the plug on those\ninvestments and sell them and put them back on the bench?\nSo yeah, our cell stop discipline is just, it's a trailing stop that moves with the price\nof the fund.\nSo just like I mentioned on the upper band, the signal for the, the cell signal for\nus is the price of the fund moving below the recent high of the lower band.\nAnd that is an automatic, unemotional cell and we will eliminate that in the portfolio.\nNow, under certain conditions that may be redeployed to other funds that are still in\nbi-signals for us, if certain funds are not in bi-signals, we can hold cash.\nAnd so that, I think that's our defensive nature is to be able to hold cash during those\nperiods of broad market declines.\nThat has been, we think the, the value in our, in our strategy is to be able to, whether\nthe storm, so to speak, by holding cash when markets are declining broadly.\nYeah.\nSo that was going to be my next question and let's elaborate on this a little bit.\nSo get a cell signal, it doesn't necessarily, let's just say you've got a cell signal\non small caps.\nDoesn't necessarily mean that that allocation is going to move directly to cash.\nIt can be deployed elsewhere in the market that might, you know, be a little bit less\nvolatile for a period of time or, or until that enters a cell zone.\nSo it's not, hey, one for one, we're going to allocate, making this up, 5% of the portfolio\nof small caps, if it's, you know, risk off, you're not just going to bucket that to cash immediately.\nDo I have that right?\nExactly.\nSo in that, in that example of small cap or small cap fund, hit a cell signal and we still\nhad a bi-signal in the S&P 500, we would reallocate that capital to the S&P 500.\nSo now if the S&P 500 do not have a bi-signal in, it was in a cell signal, then that's\nwhen the portfolio can start moving to cash.\nGot it.\nMakes a ton of sense.\nSo let's dive into DUKQ.\nI've been calling it duckQ.\nI don't know what you guys call it short over there, but it is your domestic ETF.\nSo in a very high level, can you tell us what that fund is trying to accomplish?\nSure.\nAll of our strategies follow the same process that we just talked about, and it's applied\nto different areas of the market.\nIn this case, domestic equities are the target exposure that we're looking for.\nIn that area, we have, like I said, a core exposure, then say the S&P 500 and then sort\nof tertiary exposure to things like small cap, mid-cap factors, momentum.\nThere's a number of areas in the market we can go into that, again, our research historically\nindicated would be value-add to the portfolio.\nAnd for us, it was really about making the targeted exposure to equities.\nSo it can be slotted into an individual or an advisor's portfolio that generally has\nan allocation in domestic equities, so it's broad-based.\nAnd again, it's just about applying that same process, whether it's Q, we have, as you\nmentioned, three other ETFs follow the same process, target different parts of the market.\nThis one happens to target domestic equities.\nSo in this particular fund, about how many securities are kind of sitting on that bench,\nlike what is that investable universal looks like in terms of like number of names or, you\nknow, if everything's in buy mode, about how many holdings can we expect in the fund\nat any given time?\nSo it'll be about 10 to 12 names across all of our funds.\nWe keep it diversified, but we don't, you know, what a diversified too much.\nAnd we think right now, it would be about 10 names.\nAnd so when, let's say everything is risk on, right, about how are you making kind of waiting\ndecisions, is it going to be market cap weighted, is it weighted based off of, you know,\nmomentum or conviction, like how are you, how are you driving a waiting for those holdings?\nYeah.\nSo the weights are predetermined and what are sort of the grounding philosophy was that\nwe wanted core equity exposure, meaning as you think about the market cap and how that\nlooks, we have some, I would call them tilts relative to say a broad market, our index,\nwhich is a more of an all cap, a broad market index, but you know, we, everything has\na prescribed weight, depending conditionally based on it, having a buy signal, right?\nSo, or something like a small cap ETF, you know, would have a roughly a 5% weight in the\nportfolio.\nSo, is the fund itself, is it like purely active where you can get the signal on a Wednesday\nand you're trading it on a Wednesday or do you have a kind of a weekly or monthly reconstitution\nthat you're kind of, you know, taking in signals over a period of time and then deploying\nthem?\nIt's a daily process.\nWe've based our signals on the previous day closing nav of the underlying ETFs in the\nportfolio.\nSo, we revisit that every day and discuss, you know, it's very, again, an emotional process\nwhere we look at, okay, is this, is this in a cell signal or not?\nAnd if it is, obviously, it gets, it gets sold and depending on other factors, it may\nget redeployed somewhere else in the portfolio or sent to cash temporarily.\nYeah.\nSo, without, without going, you know, again, too deep in the weeds on process, you know,\nwhat is a typical holding period or turnover look like for a particular ETF?\nLike, are you guys making shorter-term investment decisions or are you looking, you know,\nare these holding periods longer in nature like where are you kind of targeting a signal\non average?\nSo, yeah, it depends on your definition of short-term or long-term, I suppose, but our\nturnover is a typical turnover is a two times a year.\nSo, we would be going in and out of a fund on average.\nI mean, that can vary from zero to four, but the average tends to be around two times.\nYou got it.\nSo, you know, you have a fairly active process, markets can be, you know, kind of finicky.\nCan this ETF in particular, sit 100% in cash or, or short-term money markets?\nAbsolutely.\nAnd that happened from time to time when the markets in complete meltdown mode, the\noptionality to go to cash, I think, is what really gives us an advantage.\nWe don't like to be in cash, that's not a target allocation for us, but if we need to\nbe, we can be.\nAnd so, the portfolio can be 100% cash if all of the funds in the opportunity set are\nin sales, sales signals, then the fund will be 100% in cash.\nGot it.\nAnd I know the answer to this question, but just like, you're not, there's no, this isn't\nlike a pure, you're not doing any shorting, you're not buying any inverse, right?\nIt's either, we are either long equities or we are either in money markets.\nYeah, you call it long neutral, long cash.\nI know a lot of trend followers, managed features specifically will have short exposures.\nSome of the reasons we don't feel like that's necessarily a good thing for us is that the\nshort exposure can sort of exacerbate what we call a whipsaw risk of markets when\nyou get a false positive and it can changing the sign there can have some, some big\nramifications.\nSo that's not what we're trying to do to add to necessarily have positive performance, so\nto speak, when the markets are selling off, we want to be able to just limit the losses.\nAnd we're not really trying to limit the one standard deviation type events.\nThose two and three standard deviation events that we're really focusing on and trying\nto mitigate the exposure there.\nAnd so that's how we've thought about it.\nSo if you're sitting down with an advisor that's already has a diversified model portfolio,\nwhere are you advising them to kind of slot the CTFN?\nYeah, so for domestic equities, obviously, everybody with equity exposure has some exposure\nto domestic equities, and it really depends on an advisor or a particular client's risk\nversion, right?\nSome folks have greater need, greater comfort with something as strategy with more downside\nprotection, so this can fill the entire domestic equity bucket for a particular allocation.\nNow, that's not necessarily everybody's speed, so we also say it's not zero, it doesn't\nhave to be 100%, but somewhere in there really, it's in a lot of times it's up to the\nadvisor to determine, all right, how much protection do I want to put in the portfolio?\nSo it's very customizable, we can think of it as being modular, right, to that specific\ntarget allocation that are common amongst most portfolios.\nSo the the fund is fairly new, I believe it launched in July.\nIs that right?\nYes.\nYes.\nYes.\nIt's fairly new.\nSo what I know a lot of thought goes into the decision to kind of launch a fund.\nSo what was it for kind of you in the team over an ocean park to say, look, let's\nget this thing out in an ETF wrapper, and let's go compete in the US tactical fund space.\nYes.\nOh, well, look, I think we saw what everybody else is seeing.\nIf you're an asset manager now, I think I've said this, that ETFs are almost table stakes,\nright?\nAnd it's still a fairly new universe, right?\nIt's only been since 2019 when the rule change happened and made active management more\nfeasible in an ETF, and we've seen a rush of products to the market, and right now,\nI think there's about 1600 products out there.\nWe know that there are advisors that only want to use ETFs for whatever reason, obviously\ntax efficiency benefits and so forth.\nBut there are advisors who would love to use our products, but if they're only available\nin mutual funds, then that obviously eliminates our ability to serve their clients.\nSo we're recognizing that reality, we said, okay, it's time to launch ETFs and give\na meet the demand where it is, and the demand is clearly in the ETF space right now.\nWe do think there's still plenty of room for mutual funds in the marketplace, but the\npuck is certainly heading in the direction of mutual funds.\nAnd that's where we came to the realization that we need to be able to deliver to those\nadvisors and clients that want ETF exposure.\nYeah, I couldn't agree more.\nAnd so again, like being new or this fun being, this particular fun being new, you guys have\nbeen around for very, very long time.\nHow do you go about, I think it's a very different sales process than selling solutions\nthan selling an ETF product.\nSo how is the team over there thinking about marketing and distribution of the CTF suite\nin kind of a different way than maybe the, you know, the model portfolio suite or the mutual\nfunds?\nI, you know, at least there are certainly differences, right?\nBut I think the core demand we've seen in our products for mutual funds and for the package\nsolutions.\nI've all been with meeting with financial advisors, right?\nMeeting, meeting them sort of hand-to-hand combat, bringing Belly to Belly trying to educate\nthem as to what the virtues of our strategy are.\nAnd we don't think that will necessarily change.\nI think that the ability, we've had a lot of success in the tamp world as a fun strategist.\nAnd I think that has to do with the fact that you give a solution to a advisor rather than\nletting them figure out how to do it on their own.\nAnd that's great, and we still want to allow that flexibility, but for those that want\noutsourced that decision, it will still be offering our solutions, our package solutions\nto give them an easy program to implement.\nWell, I think, too, just kind of staying on the topic of, you know, ETF creation and off\nthis off of the solution side business, it's, you know, it gives advisors a little bit\nmore flexibility in a couple of areas, like, you know, if you're blending your strategies\ntogether in a solution with other strategies, right?\nIt's going to help lower some of those model minimums to allow some entry.\nThe other thing, too, I think, in the solutions business, not to get too far off topic,\nlike that's almost erased as zero, right?\nAnd I think if you don't have, you know, ETFs out there to kind of support that business\nto allow, you know, a free model marketplace at some of these terms, you know, I think\nyou're going to have a hard time gathering assets, you know, probably later on down the\nline, it's not happening tomorrow, but I can see a world where that starts to become\na reality.\nYeah, look, I mean, our philosophy has been, again, meeting the demand where it is.\nAnd the reason we've had success on our mutual fund suite, and we think we'll have continued\nsuccess with ETFs is that we give advisors options to create solutions for their clients.\nAnd the, this fund strategist model makes it so easy for them to, to make those decisions,\nrather than trying to do, like I said, our 1,600 active ETFs out there.\nAnd we, by the way, our strategies also use outside funds and additional our own funds.\nSo it's just a conduit to our products that we think really allows the advisor to sort\nof toss the keys and say, all right, we can't necessarily figure out the right allocation\nto your domestic fund, your international fund, your diversity.\nSo there's, it's a complicated decision, and there's an easy way to solve for that.\nAnd I think, you know, you're just, it's just sort of a value add that I think more and\nmore asset managers are recognizing is sort of, again, more like a table stakes opportunity.\nWell, James, I really appreciate your time with me today before I let you go, where can\npeople learn more about Ocean Park, where can people learn more about your suite of funds?\nSure.\nOne good place would be Ocean Park AM, a dot com, and we, if you want to specifically look\nat the ETFs, there's Ocean Park ETFs dot com.\nSo either one of those sites will get you to a place where you can learn more about\nthe company and their individual funds.\nWell, again, James, thanks so much for being here.\nI appreciate you spending some time with me.\nThanks a lot for having a great year.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}