{
  "id": "15791286",
  "transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology, they are run on and you want more customization and flexibility.\nAs well as a AI-driven model marketplace, UX wealth partners is your destination.\nOn top of that, they have institutional trading.\nSo if you are an ETF issuer or an SMA provider looking for outsourced institutional trading, UX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and make your practice more efficient.\nWelcome to Behind the ticker.\nToday we have on Sylvia Jablonski.\nShe is the CEO and CIO over at Finance ETFs.\nThey have a variety of different product suites over there, whether it's levered stock, single stock ETFs, income products,\nas well as thematics and today we are focusing on their quantum computing ETF ticker QTUM.\nWe talk about why that space is exciting and how quantum computers can change the world and why it's an exciting place to maybe look at start investing some of your capital.\nNow one thing to note, we did lose about the last 20 seconds of audio.\nSo thank you Riverside FM.\nHowever, all you really missed was some thank yous and their website which is DefianceETFs.com.\nSo without further ado, please enjoy this episode with Sylvia Jablonski.\nHey Sylvia, welcome to the show.\nThanks so much for having me, happy to be here.\nSo before we get started, why don't you share everybody a bit about your background and how you eventually decided to kind of start to finance.\nAnd break away.\nYeah, sure.\nSo my background is pretty much, you know, you can't find hands from the start.\nI always had an interest in markets and investing, you know, even like pre high school time and always kind of new ways to do something related to markets.\nETS weren't so popular back then.\nSo it wasn't a job that I necessarily thought about, you know, when you're kind of in university you're thinking about like which banking program or you're going to get into.\nYou know, so I started working out at the banks and doing Delta one sales trading and learned about swaps, equity derivatives things like this.\nAnd I was covering the different ETF issuers and hedge funds for their different swap trades and so.\nI think it was like a round two thousand seven, two thousand eightish, which was like the finding, you know, he did the financial crash really.\nWhere, you know, I was really working a lot with swaps and and, you know, kind of like pro shares and direction and things like that and around that time, I just look like through having the knowledge of swaps and ETFs and stuff like that.\nI got the opportunity to join direction ETFs, which is the levered number of CTF issuers and I work there for like a decade or so.\nA little more than that actually and while I was there.\nMatt Bellski, who's the, you know, original founder and chairman of Defiance.\nWorks worked with me. So for, you know, years we travel around the country doing education ETFs, capital markets, stuff together.\nYou know, trying to get people to buy the ETFs, hold the, you know, hold the thematic ETFs trade the delivery ETFs, all that kind of stuff, but we just got to know each other.\nThe years and had developed this awesome kind of like report and trust and relationship and we always, you know, thought about doing something together.\nAnd, you know, he went and started defiance and, you know, shortly after I joined him at the firm.\nAnd so I guess it's been around four and a half years or so since I've been there and it's, you know, to your point, like, it is taking a plan.\nI'm sure you go for like from a big kind of stable institutional player to a start up and it's just been an awesome right so far.\nThat's great. So before you get too much into defiance, I always like to ask people, what do you like to do when you're not sitting behind the desk, any hobbies.\nOh gosh, well, I haven't we were talking about this little bit offline, but I have a three year old and a five year old. So there's some like my hobbies are kind of hiding in the closet, let's just say.\nI just have a tennis player. I mean, I absolutely love playing tennis. I love going to the US open. I love watching tennis.\nYou know, kind of all things tennis and then, you know, if you go kind of go down that list. I also like ping pong.\nYou know, it's like pickleball, you know, in general, rackets sports.\nBut, you know, other stuff too. I mean, kind of have like a knack for bar and languages, always like to travel and, you know, big, big reader too.\nBut my kids are kind of the hobby. They take over.\nFor sure. And that's the US open is on my, my bucket list of things I want to do. I've had a buddy, you said he loved it.\nYeah, it looks amazing.\nLike tennis or like thing, you know, like watch tennis, you'll get so, you'll get so into it. I mean, it's just so much fun to watch and it's just become this cool. Like, I don't know, it's Jay.\nI've gone every year, like, you know, for as long as I can remember now.\nAnd it's also turned into like this cool New York City, like celebrity athlete, spotting, you know, fashion event and, and yeah, and the tennis is tennis is getting really good again.\nLike after all the grades kind of started to fade off. Like now the younger players are getting to be, you know, super exciting and competitive to watch and so much fun. Got to go.\nYeah, it's definitely on my list. And it's, I never was into rackets sports. And then, for whatever reason, like I started watching all the majors and now I think,\nit might have been to that Netflix series. And then I really started to get into it. And now I watch like as many matches I can. But definitely on my list and something I want to do. So let's talk about kind of defiance as a whole. You have a pretty diversified line up of different ideas, right? You have an income suite, you have a thematic suite, you have a leverage suite. So you keep kind of talk about what goes into the decision of, you know, what are you going to launch?\nWhere are you going to launch and, and as you kind of come up with new product?\nYeah, sure. So in in 2018, there, you know, the market felt sort of like saturated in a lot of the ETFs that we're coming out where similar in style, similar in, you know, theme and I think, you know, around that time there was this kind of evolution of different types of a thematic ETFs that hit the market and kind of, you know, built their, built their spot.\nAnd investors portfolios and, you know, picked up some traction. So we started out with 5G and quantum. So now it's interesting because now there's been this like chat GPT moment.\nBut we're we're thinking about like in 2018 and 2019, that's those were the conversations we were having. We were like quantum computing machine learning AI like this is going to be the next big thing.\nIt's going to happen next year, you know, we were a little bit early for sure. But, you know, we just kind of like really believed in that theme and just saw that everything was, you know, everything was just kind of getting like automated, there were all these conversations about data, what to do with data, how to kind of make, you know, like, like Facebook changing to meta, you know, we kind of thought about that, like, well, what is that, what does that all mean?\nAnd, you know, so I think, you know, we had a couple of thematic ETFs that were like very timely and came when the market needed them. So 5G, it's now stickers now 6G because now we're kind of thinking about that next level of communications with like,\nStarlink and things like that. But, you know, when 5G came out, it was one of the hottest topics in the market.\nYou know, you had Howard Jones talking about it on CBC all the time and then COVID hit and when we were talking so much about like low latency, the ability to have connectivity and work well, you know, work efficiently in different places and things like that.\nAnd so I think those two ETFs really put us on the map and made us a company and then, you know, we kind of started going through the different sectors and saying, like, how do we replicate this if 5G is the future of communication.\nYou know, and quantum is the future of technology like what is the future of like of energy and efficient natural resources could it be hydrogen.\nYou know, what is the future of travel like what is really travel and and, you know, OOTD and things like that and, you know, we kind of came up with different ETFs to represent the themes.\nAnd then, you know, we realized that the market started to kind of go a little bit.\nBut not still, but it it seems like the hype around the Maddie ETFs was was dying and so we started thinking about like, well, what's next like, you know, flying taxis or.\nIs it going to be driving in this car, whatever it might be and I think, you know, with with some of the tech pullbacks that we have for sure COVID right in the 32 tech pullback and we are all tech and so, you know, our whiteboard moments were like, okay, we need to diversify the products we now right we're so heavily.\nI'm geared towards tech and AI which is amazing, but we need something else right so.\nAnd enter the enhanced income product suite and so, you know, we realize that there's this huge interest in in index base exposure with which with large monthly distribution payments.\nOr weekly distribution payments that investors are seeking and so we launched.\nYou know, the enhanced product suite like the KQI, IW, my jeffy and then the target income funds and those grew right away.\nYou know, we got lucky in terms of, you know, the awareness of those products and the amount of interest that came in right away.\nAnd then we continued to build out products and that's me because the market was asking for it.\nAnd then we saw, you know, what else is the market like and the market really, really liked single stock the video and, you know, and we thought that while a lot of people had filed for a single stock leverage ETFs,\nnot a lot of them had actually hit the market and the ones that hit the market, you know, kind of they're okay, but we thought, well, there's something else, you know, there's something else missing.\nAnd there's a couple of names that people with around all day that are kind of like volatile enough for day trading and interesting enough for for people to trade short term.\nAnd so, you know, we launched micro strategy brought comes super micro computer and lily in that space and that kind of put us on the map is a leopard fund.\nAnd so, you know, I guess like on the most basic level, we try to fit in and I know you guys do the same thing to like we all try to figure out what the, you have your brand and your DNA, of course.\nBut we are big on what is the market telling us? And we've launched a lot of products that didn't make it, right? Like we had an EV ETF, we had an inverse crypto ETF way too soon, right?\nIt didn't, it didn't trade a penny and now these things have billions of dollars in it too. So, you know, we tried to listen to the market, try to get the timing right and, and, you know, we, we went some and we lose some but luckily we've, you know, we've one more than we lost so it's been been pretty good.\nSo let's, let's stick on the those single stock levered theme for a moment, right? You mentioned micro strategy that's kind of also a little bit of a crypto play and it of itself.\nSo you actually recently filed to increase the leverage, I believe it was 1.75, it's now you're filing for two.\nSo what's the internal dialogue around like turning up that volume just a little bit and for the increase leverage is it just to make the product a little bit spicier is that what people are asking for like what's the thought processor on that?\nYeah, I mean, okay, you know, the product is probably one of the most successful ETF launches of the year, I mean it's certainly the most successful ETF launch for us and, you know, our biggest day was actually just just the other day on Monday, I think it traded, you know, close to 100 million.\nSo there's just so much interest in this and there are so many people in it and trading it and, you know, market makers and institutions and whatnot and they've just said that they'd be interested if we could get it a little bit higher than be interested in seeing that and so we're going to do that.\nAsk and you shall receive.\nYeah, hopefully you receive, you know.\nYeah, hopefully you received true, true, fair point, fair point.\nAnd I think that the, you know, caveat there and just pay me there is, of course, we seek regulatory approval to do it.\nYeah, that's right. We got it. We have to make the compliance people that will listen to this happening.\nExactly.\nNo guarantees in life, these are, you know, intentions.\nYeah, that's great. So actually let's stick on.\nSo I think you kind of touched on this, but I'm always curious because I've talked to other issuers that, you know, put out a single stock leverage your inverse.\nIs it, are you looking for like what's being traded or are you looking for what's being or a stock that's in.\nThat's popular, like, what goes into the decision of saying, like, yes, we want Lily or yes, we want micro strategies.\nIs it, yeah, can you talk about that a little bit?\nYeah, I mean, I think you hit the nail and the head is kind of all of that. So you look at, you know, like you look at like what are the most popular stocks that are also the most volatile stocks that, you know,\nalso have the highest level of volume. And that's kind of been the secret, just in my career and again, like, you know,\nMatt and I come from directions that we've been doing this a long time.\nAll of the products that we try to get really cute with it, we thought were phenomenal ideas, just like they would close and not trade, but\nAnd even thematic leverage products, like didn't do that well historically.\nBut all of the products that were just kind of like pure play sectors, volatile sectors, they were the most popular, like leverage semi-conductors,\nleverage tech, leverage, you know, coal miners, things like that. And so I think, you know, bar non semi-conductors are the most popular stocks this year.\nThey also happen to be very volatile. So when you have a two XDLE funds, those, you know, the underlying move and it's kind of the juicest day trader wants.\nAnd that's the key too, right? Like we're, we're catering to sophisticated traders who, you know, they, they make a decision every day as to whether or not they're going to hold in another day.\nThey're often day trading it, they're holding it for shorter periods of times or else, you know, if they hold it for longer period of time, they have a hedge, they have a rebound strategy, whatever it might be. So, you know, like I think with that crowd, it's very much that\nvolatile, you know, volatile kind of big adds volume.\nYep. So let's tell, we're here to actually talk about quantum qtum, which is your quantum computing thematic ETF.\nSo in a very high level, can you talk about what that fund is really trying to accomplish?\nYeah. So, you know, this was, you know, as I mentioned before, like when we thought about launching this fund, it was meant to be, you know, our take on what is machine learning,\nsuper computing and AI. And so we worked with, we worked with blue star on this and created this index is called, you know, essentially like, like quantum computing and machine learning.\nAnd within it, you have like all the different sectors that make up everything that goes into AI machine learning and super computing, right?\nSo you'll have everything from all the semiconductor companies, you'll have like my co-strategy in there and video in there, but then you have, you know,\nlike the Hewlett Packards in there that I've IBM is one of the top holdings because they're big investors in quantum computing.\nAnd it's just basically, you know, looking at the different looking at the broad-based sectors that touch machine learning quantum computing and AI and picking stocks that have, we're going to attribute 50% of their revenue or, you know, commercialization or, or, like research around the idea of super computing.\nLike research around the idea of super computing machine learning and AI. And so we construct this index that has 72 names, it's equal weighted, you know, kind of like runs between revounds is obviously.\nBut yeah, you're really just getting the top names in class of, you know, pure quantum computing AI and machine learning.\nSo without us, like, trying to figure out what the world's going to look like in, you know, five or 10 years.\nLook, what is so exciting about quantum computing? Why should people look at this as a theme that is exciting and investable and ripe for growth?\nYeah, I mean, so I think quantum computing can transform all of these, like, you know, things and, and, and evolution and innovations that we're all talking about right now, right? Like you have cloud computing.\nYou have data mining, you have the chat bots, you have research and data being done for drug companies. So quantum computers, quantum computers essentially, you know, allow allows data to process in two different states.\nAnd it allows this to happen very quickly faster than, you know, any other traditional computer can do a computation.\nSo if you just think about things like, you know, biomedical research, like cancer readers, all of this data has to be processed and has to be, you know, kind of parsed and has to be delivered.\nAnd so if you have a computer that's working, you know, and I just kind of like know a lot of people who do this for a living, right, and they might do cancer research.\nAnd so they'll kind of go out to, you know, a huge computer in Minnesota, and it'll take like seven days to process the data that they need in order to, you know, to do whatever particular research thing you're doing.\nAnd a quantum computer can do that in like a second, right? And so I think, you know, one of the issues and like why it's kind of not mainstream now is it's still an R&D, right?\nSo the computers have been known to, you know, like make errors or, you know, they're trying to kind of like sort out what the outputs will be.\nBut they're getting closer and closer to this and now there are systems like, you know, Microsoft has an algorithm that helps reduce the amount of errors and things like this.\nAnd so what I think will happen is that with with AI and you need data and you need, you know, that data to produce the correct information for the query that is being asked.\nAnd then if you, you know, on top of that, have a quantum computer that can work in two different states and do it very quickly, that all becomes more efficient.\nAnd then it trickles down to like, you know, creating smart cities, aerospace and defense, like having the ability to have more precise targets, right?\nDuring more time, it's, it's communications, it's, it's 6G, it's, it's making the chatbox more efficient, it's having customer service, you know, automation robotics things like this.\nI think, you know, quantum computers can really like change all of that, make it kind of like work faster and more efficiently.\nYeah, of course. And so you touched on this, you know, it kind of a high level, but the, the fond itself is.\nLooking at a, you know, a third party index, was it blue star, I think you said.\nSo yeah, yeah, so yeah, what, what are some of the things that it's kind of screening for in order to get inclusion in this index?\nLike what what kind of states have to be met in order for a company or yeah, a company to be included in quantum.\nYeah, sure. So it's basically like the leading global companies in research, commercialization of anything related to cloud computing.\nSo that could be like high powered computing data connectivity solutions. It could be cooling systems.\nIt could be, you know, companies that specialize in like perception and collection and management of data used in machine learning.\nIt can be semi-conductor companies that invest in super computing and high speed computing.\nAnd, and basically, you know, these are, and these all sound like foreign things, I guess, but you'll recognize a lot of the names in there, right?\nLike I said, you have like an HP and there you have an IBM in there, and then you have these kind of pure play quantum plays like an Ion Q or D wave.\nAnd you have, you know, like the visualization types of companies in there, you have names like we're getting competing in there.\nAnd so it's really capturing like the top 70 names that are most concentrated and highly dedicated to this kind of transformative super computing technology.\nAnd, or is there any, does the index do anything in terms of prioritization of those companies or you equally waiting everything?\nYeah, we're equally waiting. There's a, you know, they're subject to a liquidity overlay, but they're yes, they're equally weighted.\nAnd, you know, like the reconstitution is on the semi-annual basis. And so, you know, what's good about this too is that you have access to these small cabinet, you know, just thinking about like the rate cut yesterday, right?\nSo, this, this CTF is great because you have all the large caps in there, like the, and videos and the Google's and all that, like they're kind of like a, a ballast for the fun, right?\nThey're, they're kind of the companies that have the largest amount of money, you know, well capitalized and they're investing in quantum competing.\nBut then you have like the actual pure plays that are, they're more along the lines of like a small cap company and are going to grow into this space, and particularly, you know, with great cuts going a little bit lower, we're talking about small caps, you get a little bit of that small cap flavor in this too.\nSo, you'd mention right now the fun has about 70 names in it. Is that a target you want to be around that 70, or could you see as more companies are coming out, kind of, that number edging up is there's more people in the space.\nYeah, I think I could, I'd drop if, you know, I think you could, I'd drop if there are more names in the space that, that me, you know, the different liquidity requirements and things like that.\nSo, I think if you get new quantum players and there's a couple of them out there that definitely like D-wave is a reset inclusion, that's not a name that was in there.\nBetween 2018 and, and 2023 really, that actually just popped into the index now, right? And that's a pure play quantum competing company that's been around for a while, but just kind of wasn't liquid enough, right? Now they're growing and, you know, advancing and things like that, so that gets picked up in there.\nAnd then, you know, we're always looking at the IPOs in the space and, you know, just seeing if they fit the index methodology and so yeah, it could change.\nAre there any, are you finding within the index any country tilts, or is it a lot of it domestic here, US?\nNo, they're definitely, they're, yeah, they're definitely tilts. It's, it's, it's a global basket, and so, you know, you kind of have, yeah, I mean, you definitely have some Japanese exposure, you know, China exposure US exposure, those are probably the top three right now in terms of international exposure, but yeah, it's definitely a global fund.\nSo, the million dollar question is, you're sitting across, you know, from an advisor, they've got an already diversified model portfolio, where are you recommending that they use quantum inside the portfolio? Where would you sleep it?\nYeah, I mean, so the way that we see advisors use it is, you know, some of them use it as like a satellite allocation, right?\nMost advisors have like five to ten percent of their portfolio, where they're, they're either, you know, picking, picking like a, a flavor or a spice or arithmetic ETFs, or celebrity ETFs or things like this, and, you know, or alternative products and things like that.\nAnd so, we see them either putting it there, or as a compliment to their tech portfolio. So, you know, wherever they've kind of got broadways tech allocation slash some of my conductor allocation, that's where the CTF goes.\nSo, let's go back to the finance, I'd love to pick your brain. You guys are four people were five.\nYou start in 2018, so you're, you know, you're fairly new and you're still small and scrappy. So, kind of, there's a lot of new issuers hitting the market that kind of fit this bill, and you guys have had a lot of success.\nSo, can you talk about, you know, your experience over the years and, you know, maybe any advice you'd give to those like small scrappy new issuers to help them get to scale?\nYeah, I mean, I think we've learned that we have to be relentless, like we would have a good idea, and we would, you know, kind of sit and think on it and really kind of, you know, assess it out and, and, and, you know,\nto debate back and forth whether whether or not it's a good idea, and then some, you know, some make sure it would launch it, it would have a $3.\nAnd we missed the vote, you know, so I think, you know, like speed is your weapon for sure. So, I think I think speed and being relentless about scouring the market, what's missing, what isn't out there, what is out there.\nI think really giving up on, like, egos or anything that has to do with, like, I thought that was a great idea and it didn't work, you know, if it didn't work close it move on, like when you're a startup company, and people might criticize this comment,\nbut I think that when you're a startup and you're, you know, you're very focused on balance sheet and, and you want to build a profitable company both for your investors and, and, you know, for the people who hold your products and, and for yourselves, you have to cut your losses, right?\nIf an ETF comes out and it's been out for a year and people haven't treated the share of it, you know, you have to kind of close up shop as a startup and think of something new.\nI think bigger, you know, bigger issuers have a little more leniency in that stage.\nSo I would just say, you know, be manic about watching your balance sheet speed if you have a good idea, you know, but bet bet on yourself get it to market.\nAnd being relentless about products, like we had a product that was, you know, not performing well and we changed the methodology.\nSo I think just always trying to, you know, make sure you have the most efficient versions of your products out there, kind of your losses, managing your balance sheet really well and, and, you know, just being relentless about knowing that your competition is at your heels and ETF industry.\nAnd, and how do you guys think about, you know, distribution and marketing because, again, being small and being balanced sheet conscious marketing and distribution is expensive.\nSo, you know, how have you gotten creative or how have you, because the defiance name, you know, when I got an email about having you on the show, I mean, like I knew the defiance name, right?\nAnd so, can you talk about how you guys really focused on brand and how you worked on kind of marketing and distribution early on to get that brand recognition?\nYeah, so I don't know if a lot of people know this, but we actually, we consider ourselves, you know, experts in marketing and the way that the company structured is you have defiance holdings, which owns defiance ETFs and defiance analytics.\nWe built our own marketing, SaaS company, you know, digital marketing are, you know, in house advertising and house distribution, AI distribution.\nWe've really built it in house and so around COVID when, you know, you're a startup and don't have any salespeople that can go out and see anybody and to your point, we don't have budget, we can't spend money on ads and, and marketing companies and PR companies and things like that.\nAnd we, we found, you know, the best tech and marketing expert and his name is, you know, Jacob, he runs the marketing company and, you know, Matt tasked him with basically building the best and most robust marketing distribution platform and company that would, would market our ETFs.\nAnd so we started to your point, we started having success with getting our brand out there and then other ETF companies would call us and say, like, how on earth are you guys, how are you doing this? Like, you can't possibly have any money or so small, you have like two or three ETFs.\nAnd then they offered to hire us to do their marketing.\nAnd so, you know, we, we do marketing for some of the top ETF providers in the marketplace right now and that ended up turning into a business and so we separated it out from, because it was just kind of under defiance ETFs originally, we separated it out now.\nAnd so, you know, we have our own marketing company, we do marketing for ourselves and we do marketing for other ETF issuers, other, you know, massive asset managers.\nThank you.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}