{
  "id": "15834498",
  "transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology, they are run on and you want more customization and flexibility.\nAs well as AI-driven model marketplace, UX wealth partners is your destination.\nOn top of that, they have institutional trading.\nSo if you are an ETF issuer or an SMA provider looking for outsourced institutional trading, UX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and make your practice more efficient.\nWelcome to Behind the ticker.\nToday we have on Mike Venuto.\nHe is from Title, the ETF Masters.\nAnd they are one of the premier white labeling ETF shops in the market.\nIf you're looking to start an ETF, if you're looking to find out more information about starting an ETF title is a great place to start.\nI would highly recommend a conversation with somebody from their team.\nBut today we're talking about all things ETFs.\nMostly current events.\nWhat's going on?\nTalk about some regulatory things.\nTalk about the market as a whole.\nWhat is being launched?\nWhat do we think is going to be launched next?\nEverything ETFs.\nSo if you're an ETF nerd like myself and maybe Mike, then I think this episode will be interesting for you.\nSo please enjoy this episode with Mr. Mike Venuto.\nHey Mike, welcome back to the show.\nYeah, good to be back.\nSo why don't you just take a couple minutes refresh everybody who you are and tell everybody a little bit about title in your background.\nSure.\nSo my name is Mike Venuto.\nI'm the co-founder and CEO of Title Financial Group.\nPrimarily we help people launch and grow an operating ETFs.\nWe've done it now for, well, right now I think there's 162 funds that we're servicing on our platform.\nAs the CIO, I also get involved with a lot of structuring as well as actively managing a few funds for our clients.\nThe last time I was on your show, we talked a lot about block.\nThat's one of my passions.\nRecently, it took over managing Nancy and crews, which has been a lot of fun.\nSo, you know, basically we are a platform that can help you launch, grow an operating ETFs.\nAnd we do everything from, you know, kind of that boring compliance work to fund active management as well as creative marketing, all that fun stuff.\nWell, while you mentioned it, how is block going and just like maybe a little bit of an update there and it would be neat to hear.\nI think the listeners would enjoy hearing like, how do you go about finding and placing trades for Nancy and what, what's the other one, crews?\nYeah. Okay. So, both block and Nancy and crews, I manage with Dan Weiss cough and the rest of the investment committee.\nWe actually have specific meetings for each fund and then we have a 15 person investment committee that meets every Monday and covers not just the active stuff, but also the passive stuff.\nYou know, we also actively manage why max, which is the fund of funds for the yield max family.\nAnd a lot of it's tax optimization, all that fun stuff. So, we'll hit block first and we'll get a little bit into Nancy and crews.\nWith block, we're extremely active. I mean, we've, we've owned IPOs, we've owned convertible debt, we've owned Bitcoin through Canadian ETFs and through US ETFs.\nWe have Dan on the Bitcoin mining council, we speak to sailor all the time, Novigratz's crew, all the miners.\nSo, it's very much an understanding of the ecosystem, right? You could talk to all the blockchain companies you want. They're all going to tell you their story.\nBut really where you get into the weeds and get to know things in that ecosystem is by asking about the supply chain and who they're buying chips from and who they're storing with and all that.\nSo, block is having an extremely good year. Not a surprise considering the underlying commodity of Bitcoin has had a pretty good year as well.\nSo, you know, we're up north of 25% as of this recording, which is, I would say, a pretty good year.\nNancy and crews are very different. We're not meeting with management. We're not making a call on the business. What we're doing is we have a research agreement with unusual whales.\nAnd the partner in that is a company called subversive who set up everything originally and then they brought us into actively manage it.\nWhen they were managing it in the previous iteration, it was extremely, extremely diversified. One fund had Nancy had 700 stocks, plus and crews was like 400 plus.\nWhen we took over data and I as managers, we decided to work with Oscar over at unusual whales, really partial through the data and really hone in on patterns that are true signals.\nWhat I think, you know, if you just take the data and look at everything they own, well, some of these people hire, I don't know, parametrics to do direct indexing for them.\nThey don't really care about those three shares of STL. They don't really have any insight, but it gets thrown into the mix. So we've really tried to consolidate down into names where we see a pattern of multiple people buying or somebody on a specific committee that might have some information.\nBut for those who don't know, these two funds basically take the stock act, which requires that congressional members disclose what they've purchased.\nThe majority is congressional members are allowed to make investments in things where they would, for otherwise called insight information, right?\nLike there's really no way to show it.\nIt's the other way to say it.\nThey're legally allowed to make investments based on information that they receive that is not public to the rest of us.\nSome notable people out there that, you know, Twitter has pointed to, so the idea with Nancy is an ANC is to track the patterns and disclosures of members of Congress that are in the democratic party.\nAnd then cruise does the exact same thing, but it's members of Congress that are in their Republican party.\nThis year, Nancy is outpacing crews, but they both have very nice diversified returns for the year.\nI mean, we could probably do a whole episode on those two.\nI remember when they first came out and I got a good, I got a good laugh out of it.\nI didn't know you guys took them over, so I'm glad you brought that up.\nBut let's let's put it back to title.\nSure.\nWe got our friends over at Gregory FCA said, hey, title is is rebranding.\nI'll use that term loosely to the ETF master.\nSo what does that all about?\nYeah, I mean, it's a tagline, obviously, but the whole point of it was the experience, right?\nLike, before doing title, I was at a hedge fund.\nWe saw ETFs as a threat.\nThat's when I got involved with wisdom tree became an angel investor there.\nThen angel investor helped start up the merging global that I went over to global X, head of investments there.\nHe was at global X with me.\nHe had doing strategy.\nHe had Eric Falki said at the US bank and then direction for many years building those platforms.\nWe brought over Gavin from Barclays.\nI mean, this guy had a deal with VXX for years.\nSo the whole idea is title became a master.\nAnd does ETF stuff by making every mistake you can at other companies?\nSo the whole idea is if you come to us, we can help you launch growing operate.\nAnd I mean, you've been through this Brad pretty much everybody else stops at launch, right?\nAnd you kind of have to pull operate out of them and forget about asking them to help with growing, right?\nSo the concept of the ETF master is to convey that we've got the experience to help you not make the mistakes that we did in the past.\nYeah, so I guess that leads into my next question.\nSo, you know, what I've talked to other white label firms.\nThey're popping up all over the place.\nLike, what is it really at title that kind of separates you guys from the others?\nLike some of those intangibles that, I mean, you mentioned and noted the experience, which is deep.\nBut what are some of the things that you're really trying to do for clients to help keep them in the space and help them grow?\nYes, so the numbers really speak to it, right?\nThere's over 165 funds on our platform.\nOver 19 billion in AUM.\nThe funds that have been here over three years on average are $260 million, right?\nThere is some survivorship bias there.\nWe have a much lower open to closed ratio than the overall industry.\nWe have 75 employees dedicated to all of this.\nAnd that's not, you know, like armies of people trying to get us business.\nIt's calling us all day long. If you want to launch an ETF, just look up title, you'll find this will help you do it.\nWe have lawyers on staff.\nWe have the compliance on staff.\nWe have people who will check your ads before they go to your distributor so that you don't get stuck at the distributor for three days.\nLike everything done here is to make the life of an issue are so simple that their job is to manage their portfolio, unless they've hired me or Dan to do it.\nAnd get their message out.\nOther than that, they shouldn't have to deal with anything.\nSo that's really what makes it different.\nAnd you've been through this.\nA lot of us know how hard the ETF, Terrodome, as Eric,\nPelt Jonas likes to call it.\nIt's hard, right?\nSo removing all the other barriers and headaches.\nAnd then honing on the most important part, right?\nSo I mentioned we've got a lower closed ratio of the new overall industry.\nAnd that's because we don't just launch anything, right?\nIf you come to me and say, I've got an idea to do the 27th, I don't know, cyber security ETF.\nI want to charge twice as much as the others.\nI want to be passive.\nAnd my niche is, well, I don't have one, but I'm willing to write you a check for 200 grand to do it.\nSorry, the answer is still no.\nRight?\nWe want product that's going to succeed.\nI want to keep that three year number in that 200 plus.\nThat's success.\nThat's what we look for.\nSo, you know, where a platform that actually has a product development arm,\nwhere we literally work with our clients to take concepts to the end\nand make them into things that are actually doable.\nLike that's how yield max that I mentioned earlier came about.\nThat's how some of the new things we've been doing with Defiance have come about.\nRecently, we onboarded Cambria and Mebb, and then we brought him a partnership with Jerry Parker\nto help him launch M-foot the new managed futures fund.\nSo, like everything we do is collaborative to get the product right.\nBecause that's the most important thing to the growth.\nAnd then once you got the product right, then we have all these amazing tools.\nWe have Claire in this marketing team that, you know, can provide all these ways to help grow the fund.\nAnd it's just, it's kind of place where I wake up every day.\nAnd like excited to be here.\nYeah.\nOf course, it's funny you mentioned I just interviewed Sylvia yesterday from Defiance.\nAnd I noticed on your website you have a handful of your ETFs of their ETFs or with you guys.\nAnd I did talk to Jerry Parker and Mebb Faber on the show.\nSo, there's a lot of people using you guys to get product out to market.\nSo, you touched on all the things that you do.\nIf someone's coming and using you guys as terms of, you know,\nOh, call it a white label.\nAre they going to get economies of scale?\nBecause you do all of this stuff in house rather than try to piece it together.\nLike is there an overall, you know, long-term cost savings kind of using all of your internal processes?\nAbsolutely.\nSo, you know, if you want to start your OTTF company and you want to start your own trust,\nyou're looking at depending on how good you can negotiate with your lawyers somewhere between\n250 and a million dollars to start that trust.\nAnd it's going to take six, eight, nine months.\nAnd that's kind of best case scenario.\nRight?\nIf you come to us, most ETFs we can launch for under 70,000 and do it in less than four months.\nUnless it's complicated at which point we're going to walk you through all those complications and get you there.\nNumber two, everything that's coming to market and succeeding right now,\nall the launches this year that are working are active.\nAnd not only are they active, they're complex.\nAnd complex means, like we said, Jerry Parker or Yield Max or Corey Hofstein with return stack,\nthey're using things like options derivatives leverage.\nSylvia just had to hit with the leverage micro strategy and leverage Eli Lilly, all these things.\nAll of those things require program called ATNA4.\nOkay, that's the derivatives rule.\nYou have to have a var team.\nIt's complex requires expensive software.\nIt requires high-end people who can explain it and report it on a daily basis.\nDo you want to do any product like that in your own trust?\nAdd a whole bunch more expense.\nJust pile it on, right?\nThen you got trustees, right?\nAnd you've got to have these meetings and you've got to pay all these lawyers.\nSo, yes, but of course, I'll have to edit that out.\nThat's fine.\nYou got all the expenses there, right?\nWhat we do that takes it an extra notch is we smooth all the bills out, right?\nSo, the title clients are on a cruel accounting, meaning there are surprises every year.\nThat we can actually anticipate a printing or an audit, the annual audit, the fees can go up and down like this every month.\nAnd, you know, I had to fund it another white label one time.\nGood people, no complaints.\nBut one month my bill would be 12 grand and the next month it would be 35.\nI don't want my clients living with that.\nI don't want them even ever paying me a bill.\nI want them to have funds that are breaking even, right?\nThat's when we get the product, right?\nBut if there's small expenses, we smooth them out in the crew forum.\nSo, we want to make this so smooth that the only stress you have is how do I get more people to hear about my fund?\nOh, you go on Brad show and tell your story.\nYeah.\nYeah, I mean, I think we're on like episode 57.\nSo, like, we've been pumping them out.\nAnd so, no, that's good.\nAnd it is true, like, we operate our own trust.\nI think you know that.\nAnd, you know, one month, you pretty much have status quo then, you know, you hit your end.\nAnd you've got, you know, listing fees, indexing fees, audits, your board, you know, your final annual board meeting.\nAnd that you got to pay, you know, your board members and your travel and all the stuff.\nAnd like, next thing you know, and August, you know, you got to massive bill on your hand.\nYou got to plan for.\nSo, I know that all too well.\nYou guys launched a lot of funds.\nJust in general, I believe you.\nDid you launch like 32 funds last year?\nIs that right?\nYes.\nYeah.\nI mean, and this year, we're close to 60 that we've onboarded.\nIt's a lot.\nThe pipeline for the rest of the year.\nI've got some exciting stuff coming out.\nYeah.\nObviously, that's the stuff I can't talk about because it's all in registration.\nRight.\nBut I'm super excited about some of the things you guys are going to be seeing from the title platform in the next couple months.\nSo, without getting to, you know, I guess I'm trying to ask kind of a trends question here.\nLike, what is trending?\nYou'd mentioned like active is active is working.\nBut kind of what is trending?\nWhat are you seeing that people are trying to come to market with at this point?\nSo, we kind of get our business from three different places, right?\nSo, the one is like traditional business development going out and meeting people going to future proof\nand our New York Stock Exchange events and talking with folks that want to get into this business.\nAnd what we've seen is a trend this year in that call it vertical is larger institutions, right?\nSo, like, they take longer to sit down with the amount of giant name brands that we're speaking with right now\nthat don't have any TF presence that need to get in is amazing.\nRecently did Rockefeller, you know, we have so far was one of our early ones.\nBut you're going to see a couple of big brands from us and the next coming coming months.\nBut that trend of, I cannot have an ETF if I'm in asset management as now hit the larger level of institutions.\nSecond trend we're seeing is clients that have had a successful single idea with us are now branching it out into a family.\nSo, we're going from product to business.\nGreat examples of that, Corey Hoffstein and resolved with the return stack family.\nMebb expanding, Mebb became re-expanding the shareholder yield family, yield max every day.\nWe're launching a new yield max fund and, you know, going to a different places.\nMy sleeper hit that, you know, I feel like I always have to give them love because it was one of my first clients and everybody.\nGreatest success story, nobody's ever heard of.\nSo, there's this Sharia compliant RIA that we work with called SP funds.\nOur Sharia portfolio is when we met them, they had $80 million.\nThey now have four ETFs with us and then they have mutual funds as well and like $750 million.\nAnd so, cook bonds and reach, like four, it's just under four years.\nIt's amazing.\nBut that's the suite.\nThey just keep building on it, making more components so that people want to build Sharia compliant portfolios.\nHave all the pieces.\nI love that trend of clients going from product to business.\nAnd then the third one is conversions.\nWe're talking to a lot of people who have a good idea.\nThey've been managing it as an SMA and LP or mutual fund and they want to convert it to the best vehicle out there.\nLike, we don't get guarantees in the world of finance, but I can guarantee.\nAnd I can say this, the SEC can come back me on the head if they want to.\nBut I can guarantee that if you're a taxable investor and you're choosing between the same strategy and a mutual fund versus an ETF, 99% or 94% of the time you're going to be way more tax efficient in the ETF.\nYeah, of course.\nAnd I think that's why we've seen the explosion that we've seen.\nWe've also staying on this. What do you think like the next wave will be?\nLike we saw at least from my seat, you see a lot more than I do.\nLike I think we saw this wave of like defined outcome products.\nAnd then we saw this in a wave of thematics and then the wave of single stuff.\nLike what do you think that next like levered single stuff?\nLike what do you think that next wave might be as we kind of look over the next 24 months?\nYes, so if we're talking 24, I think you're we're not done with the single stock stuff.\nI think that a lot of it is you know so far with single stocks you've seen leverage inverse and yield.\nI think there's 20 more things that can be done and we're talking to a lot of people.\nThere's also not just single stock but concentrated right like you know roundhills done there mag seven.\nThere's micro baskets at the Greg Rex has done some stuff there.\nSo I think there's going to be a lot of giving people trading vehicles that are associated with things that they're excited about.\nI do think that my friend Wes at alpha architect hit on something interesting what box right like it does seem like there's this appetite for even more tax advantage strategies than just traditional ETFs.\nHaven't seen anybody else do anything quite like it yet.\nI'm sure there'll be iterations but I do think there's some opportunities there that could be a huge mega trend because it certainly seems like taxes are going up.\nI do think you're going to see way more options derivative futures based I mean you know that fund that you talked to Jerry Parker about that couldn't have been done four years ago.\nThe rules change the regulations of open the doors and I think anything that's truly liquid in a mutual fund wrapper today is going to be in an ETF wrapper.\nI don't know that private credit is truly liquid.\nI know everybody just filed for that will say it's funny what a future proof that was like 25 ETF issuers and like five or 10 mutual fund shops, but every one of those mutual fund shops had a private credit fund which just smells like bubble to me.\nYou've mentioned mutual fund conversions a couple of times like is that still hot just a hot topic and a hot discussion like we thought at least I thought you were going to see the world of mutual funds just rushed ETFs and it seems like some a lot of managers kind of want to stay in that space for a variety of different reasons.\nBut do you see that as a continuing trend like I thought it would happen faster than it did.\nSo who are the big success stories right at DFA and JP Morgan right I think I think West has one success to with chaos or something like that and there was like one new burger fund that did well or a lion's Bernstein fund that did well, but most of them have it.\nSo the question is why well basically you're cutting off your captive distribution channel right you're like you're in the alamo and you're walking out right like it doesn't make a lot of sense for a lot of these mutual funds to convert that's why you're seeing so much desire for the share class idea.\nI mean that that'll be a floodgates thing if the share class then gets through I think it's probably two years off but you know who am I to say.\nWe have done one mutual fund conversion and it was thoughtful meaning to convert a mutual fund you want to make sure that the bulk of the clients have not paid loans right because the platforms.\nThey're counting on those loads right so we converted a no load fund for Gotham now this no load fund happened to be a very active long short portfolio with a short biased in 2022 when the market was down it had a spectacular year.\nWho's buying a shorting fund mutual fund because they got a hold it for 30 days that these is more like a trading vehicle so we converted that with Gotham over into an ETF structure and one of the learnings of that is the conversions.\nNot that simple right like it's easy to do but if it's leaving somebody else's trust to come to years guess what they can kind of charge whatever they want on the way out right so so there's a lot of like nuances to getting this right.\nAnd we work with our clients on it I'm a big believer that people should look at their mutual fund families and look through for commonalities so you know you go look at the big brand like guru like mutual funds they usually have 20 different mutual funds.\nRight and they're all different asset classes or market caps and things like that but you'll find commonly that there's like seven or eight or ten maybe 15 stocks that kind of end up at every portfolio right because it's like they're darlings so I always go to those shops that I say no no let's not convert your mutual funds.\nIf you're assets are at Morgan Stanley or UBS you they're going to get upset and you're going to argue and then you're going to restart know that my suggestion them is always let's start the founders ETF or the your flagship ETF right and you make it a concentrated portfolio of your top picks and then you buy the ETF and your mutual fund so you.\nYou know your large cap fund might buy 10% in the ETF and your mid cap might only buy five but some of those ideas are in every one of your strategies.\nNow you also get to pass that tax efficiency onto your mutual fund investors right because if the ETF's not distributing gains then you don't have to distribute gains from that mutual fund.\nI love that idea I think there's many different ways to go from mutual fund to ETF that aren't let's pay lawyers 400 grand and see what happens.\nYeah you'd mentioned in their kind of the ETF share class I think it's maybe two years away like what is the current landscape and temperature around that ETF share class approval and you know kind of just an update of where we are in that process.\nSo what actually occurred so Vanguard had it right they had a very specific one that only applies to passive and it was all indexed and the concept of the tax efficiency really wasn't fully understood when they got it.\nAnd finally expired and then everybody starts applying the ones that are being applied for are a little more aggressive right they include active include shorting there's all kinds of aspects to it that are a little bit different than the very simple version that Vanguard was doing which by the way a lot of times the Vanguard one hurt not helped the tax efficiency.\nI think that the regulators are going to be slow because they don't know the taxable impact and how much they're going to gain they're not going to be like hey let's just do this real quick and and let this go since it worked for Vanguard now like this is.\nIf all the people applying for this were identical to Vanguard maybe it would get through quickly but you're talking about active mutual funds that have gains built up in them that could be 20 years old with you know $10 cost basis is on Amazon.\nAnd they're all of a sudden going to get the share class thing are they going to just immediately do a heartbeat trade and boom all this is gone right so they've made some good regulation lately right the ETF rule 611 great 18F4 it's not easy it's derivatives rule but it definitely broke up the the monopoly of only two companies being allowed to do leverage and it.\nPut a real strong cap on how far you can go right it the odds that we ever see another three x product right now under current law is pretty much zero so they make good decisions I think they were forced also to finally capitulate on crypto although that process was the most ass backwards thing I've ever seen in my life.\nAnd I just don't think they're going to rush into the share class thing because there's a lot of unknowns right and and they've just got to be careful and I worry that if they did rush and like the story you know I know it's going to come out there's always that one reporter that likes to beat up on ETFs I think they're in London.\nMaybe like oh as you see did this and there's new tax loophole for mutual funds and it's going to be just messy I don't want to messy there's no loophole in an ETF it's tax the way it should be you buy something you should be taxed on what you buy not what the cost basis is of somebody else and investors should be incentivized by our government for good investment behavior buy and hold and sit down if you want to go speculate.\nIf you want to go use a leverage micro strategy go be it but you're going to pay taxes or you know and you got to understand the risk.\nYeah, no that makes sense and one of the other things I want to ask you about that's like unrelated would be like at least thinking about the ETF space there's a lot of single issue funds or small fund families that might have ETFs that are you know 40 30 50 70 million dollars you see a world where you start to see some like M&A and consolidation and roll up in the ETF space like.\nIt's not going to be as clean and easy as like all of the roll ups and M&A that happen in the actual wealth management space but I can see a world where now that there are so many ETFs out there where.\nPrivate equities going to start to take a little bit of notice and there might be that you know consolidation roll up is that is that on the table at all are people having those discussions.\nYeah, you know somebody with 40 50 60 70 million in a single ETF the first thing I want to say to them is congratulations that's the hardest thing to get done right like that first 40 is so much harder than the next 100 100 200 whatever it is right so like they should first take a victory lap because they're probably very close to break even.\nAnd then you're just kind of waiting for the cycle to come to you and your shiny object moment right like the best thing and ETF is sure it could do to succeed is survive right.\nSo that's the first part second part is we see a lot of groups like that come to us and want to join the title platform because they did a lot of work to get there right and they want a partner to go to the next level like one thing that title does that we didn't talk about earlier we do finance a lot of our clients.\nAbout 40% of our clients 30 to 40 have elected for us to be a partner with them and it's pretty straightforward and simple we cover x% of the expenses including marketing and any expenses they have with the business.\nAnd we get that same percentage and profits right so it's a the simplest pair of a suit deal you can so we get a lot of people who get to those levels that you described and say.\nI want to take a little risk off the table but I also want to be on a platform where I can leverage other things I think that works better than fully buying it the this there's going to be you know I well let's just call it what it is.\nAccess tried exactly what you just described I don't like to speak ill of anyone but it doesn't look like it succeeded very well right because they've just recently completely pivoted away from that right and there hasn't been the economies of scale.\nYou know ETFs are sold by their champion we always want to keep the champion with it right so I like our little hey you want to come join the title family.\nGreat but it's still your fund.\nSo I'm going to ask this question you know selfishly.\nOf our fund has you know a couple of your track record it's done fairly well we've got assets in the door we're above break even we're approaching that like three year mark like so you've got a you've got a.\nI'm sure you have others on your platform that are in a similar situation like I feel like that that three years almost a pivot point like what advice I'm just going to ask itself.\nWhat advice would you give me right at approaching your three your your past break even you've had some success like what what do we need to be doing and looking forward to.\nTo start getting that kind of secondary level of distribution.\nYeah so number one don't stop all the other stuff right like these podcasts like like like maps built it to it at 2.8 billion dollar ETF company with his main thing being a podcast.\nRight so like find your niche get to your audience tell your story right don't stop any of that.\nI can say that.\nI think it's I did this paper last year Cynthia and I wrote a paper I think it's like 68% of all ETFs that close do it in the first two years right then you go to like year three in the number like drops massively.\nAnd there's a reason for that because it's usually three years is enough to hit one of your cycles and get to the break even and things like that.\nI see a lot of people get excited they go hit my three year number now morning stars going to rate me you know may there's some value there depends on the product you have.\nThere are a lot of platforms that really don't want to talk to you to your three years old so there's some value there as well.\nI don't think there's like a major change in what you should be doing I think it's do what you would what's been working and keep trying new things right like it just continue to iterate like.\nMan, a future proof I met a bunch of these social platforms blossom wolf.\nWe're doing some things with weble like being able to meet the investors where they are and not necessarily wasting all your time at.\nSchwab impact talking to the twenty guys who are never going to do anything other than VTI I mean that's that's the deficit of insanity right.\nIt's funny the seems to me like many of the advisors have adopted this VTI and chill you know I don't want to fight that battle right.\nI want to keep getting my content out there keep getting our stories out there keep finding things that people are excited about and then eventually the advisors.\nGet 10 calls from their clients saying hey over in my Schwab account or my public account or my sofa account I'm buying this why don't you have it.\nOh, that's not approved on our platform. Oh, why we we haven't done the due diligence okay sure right and they're looking at it going but it's a billion dollar fund.\nSo yeah, I'm not making any fun friends at the wires with this discussion.\nWell, that's fine. They probably want to shot it guys. I love you guys. I know there's it's true shit a product that you support bar I love you.\nWell, Mike, I always appreciate our time together and this is you know it's always good to get an update about you know what you guys are doing and what's going on in the industry.\nSo again, thanks for your time and where can people learn more about title if they're out there thinking about starting ETF.\nYeah, so the title ETF masters it's kind of hard not to find us we're all over social media.\nThe website is titlefg.com. That's the easy one. You go there. There's this nice big blue button that says build your ETF.\nIt'll like take you through like at RFP and get Brittany or somebody on our team Matt to call you back and walk you through the process.\nOur first calls are very consultative. They're we're not a hard sell. If anything, we're trying to push you away from doing it and make you sure that you know how hard it's going to be.\nI like Wes always says, you know, his first call is to scare the shit out of them and see if they're going to come call them back a second time.\nI don't quite go that far, but I'm not as militant.\nYou're right. Yeah, good word. Yeah, titles easy to find and we'd love to help you launch grow and operate at ETF.\nWell, again, Mike, thanks so much and good luck with the rest of the year with the remaining launches. And I'm sure I'll.\nI'm sure I'll catch you on the conference circuit is that starts to kick up in 2025 again sounds good. Thank you.\nThank you.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}