{
  "id": "15873205",
  "transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology they are run on\nand you want more customization and flexibility, as well as a AI-driven model marketplace,\nUX wealth partners is your destination.\nOn top of that they have institutional trading, so if you are an ETF issuer or an SMA provider\nlooking for outsourced institutional trading, UX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and\nmake your practice more efficient.\nWelcome to Behind the ticker.\nToday we have Nancy Davis.\nShe is the founder and CIO of Quadratic Capital.\nWe are here to talk about their interest rate volatility and inflation hedge ETF.\nI've all ticker IVO L. I've always really designed to provide investors exposure to tips\nin the rates market, offering inflation protection and interest rate volatility, volatility\nhedging.\nAs you can see, it's a bit of a mouthful and it's a very institutional feeling product.\nThis is not a product generally easily available to retail investors, so Nancy and her\nteam at Quadratic have wrapped this into an ETF for you.\nSo I think you'll find this product very interesting as a compliment to traditional\nfixed income or a ag exposure.\nSo without further ado, please welcome Ms. Nancy Davis.\nHey, Nancy, welcome to the show.\nThanks for having me.\nSo before we get started, I'd love for you to share your background and how you eventually\ndecided and founded Quadratic Capital.\nWell, before founding Quadratic, I was with Goldman Sachs for the majority of my career.\nI was there about 10 years.\nAnd I'm proud to say that I've been running Quadratic more than 10 years at this point.\nI founded the firm in 2013.\nAnd so what made you kind of make that leap?\nYou know, what from I'm sure everybody in our world would love to have that job at Goldman\nright?\nAnd so you were there for 10 years.\nWhat made you kind of go that entrepreneurial route?\nI think it is the American dream.\nI always just kind of wanted to start my own firm and just, you know, sometimes you\nnever know, like so many firms start and they don't make it.\nSo I think I would definitely encourage all entrepreneurs out there to just go for it, right?\nIt's sort of like you'll live once and it's been just some amazing experience, but a lot\nof the things that you do when you start a firm, you've never done before in your life.\nYou know, so it's a huge learning opportunity and also kind of knowing when something's\nnot working and when to stop doing it.\nYou know, like how to pivot.\nYeah, sometimes those are the hardest decisions to make because, you know, you come up with\na good idea and then it's hard to kind of pivot and move.\nBut you guys have had a lot of success and we'll talk about the success of particularly\nI've all here later in the show, but before we, you know, get too into business, I always\nlike to ask any hobbies.\nWhat do you like to do when you're not behind the desk?\nWell, I'm a big sailor, so it's not, yeah, it's a very negative, carry high-tale\nrisk strategy.\nYou know, it's kind of hobby to have us, but I did it growing up and just love it.\nHow about you, Bradley, would you, would you, would you believe?\nWell, right now, I'm a taxi driver for soccer practice, mostly what I've been spending\nmy time on.\nBut if I get out on the golf course, that's, man, and it's funny, I don't know what it\nis about ETF issuers or finance, but you're probably the sixth person on the show that\nhas been a sailor.\nOh, you, I know Katie Stockton's a big sailor, I forget who else I talked to that's\nreally in the voting, but it must be popular with what the ETF space, so yeah, it's\na very serene, you know, it's quiet, right?\nSome people with motor voting is kind of so different because you go, you go more to like\na destination, but it's loud, sounds just really chill, it's very quiet.\nI've never tried it, it looks fun, it's probably something that has a major learning curve,\nit doesn't look like it's something that's super easy to do.\nSo, not about it's about the journey, not the destination because you don't really go very far\nor very fast.\nYeah, yeah, I could see, I don't, I don't know if I'd want to go too fast in one of those\nthings, but let's talk about quadratic capital kind of holistically.\nYou mentioned some pit, so did the firm start out to be an ETF issuers or other things\nthat you guys do for clients, like holistically, can you talk about the firm?\nYeah, so we're a RA, and initially when we started, we were managing separate accounts,\nand then we started a hedge fund as well, and then we got into ETFs in really, you know,\n2018 is kind of when I really was like looking to have a better, you know, you always hear\nabout the tax efficiencies of ETFs, and I was just like curious and wanted to learn\nmore about the ETF wrapper and kind of how to use it.\nI almost thought it was like a, as a fin technology, and then it was just like, wow, this\nis just such a great package to use, and we can harvest all these tax efficiencies, and\nit's just a really, I think a great solution for clients, because in the bond side of the\nportfolio, there's really like everybody is just, you know, short optionality because of\nthe then-betted short option in mortgages, you know, if you think about it, like, if you\nhave a mortgage, you're along the option to prepay, so if somebody owns a financial mortgage\nin their bond portfolio, they're short options to homeowners, and I just thought it would\nbe a really great way to give people choices so they're not only short-fixed income volatility\nin their bond portfolio.\nYeah, let's talk, let's talk about Ival right now, it's your interest rate volatility\ninflation hedge ETF, so like at a very high level, let's just talk about what that\nfunds trying to accomplish, and then we'll dive a little bit deeper into it.\nYeah, so it's trying to fix some of the problems and be more of a solution for investors\nto the ag index on its own. A lot of people have the ag, because they want, you know, they're not\ntrying to take a view on the Fed, or where interest rates are going to go, they just want\ncore fixed income exposure, and the big problem with the ag is that over a quarter of it is\nmortgages, which are short optionality, as we just talked about, and then there's no inflation\nat all inside the ag, there's no inflation-productive bonds, there's no exposure to the rate market,\nso we just thought this would be a good way for investors to access the rate market, and it's\nsomething that most people just can't do on their own. Most people have stocks and bonds in\ntheir financial portfolio, but the biggest asset cost in the world is interest rate, so we really\nsee it as an access vehicle. So would you hold this kind of, because my next question was kind of about\nthe ag exposure and same goes for tips, so like is this going to encompass kind of\nbroad exposure to both of those in a way, right, like you'll get the inflation protection,\nyou'll get the interest rate head, like can you talk about why someone would want to use\nIVOL as either a replacement or kind of a supplement to those two, because ag and tips,\nyou know, those two ETFs, AGG and TIPS are like really heavily used, so can you just kind of talk\nabout why someone would want to look at IVOL as either a substitute or complement to the both of those.\nYeah, so we see it more as like a completion portfolio to the AG, so the AG has no tips and\nside of it, and then it only has short optionality through the mortgages, which is about 26%,\nso a lot of people take their poor holding the AG, and then they add IVOL on top of it, so IVOL\nis 80% of the fund is TIPS, which are type of treasury bond, they're treasury inflation protected\nsecurities, but the two problems that you have with TIPS by themselves is number one, the only\nindex used to reset inflation inside of TIPS is the consumer price index. That's just an index,\nright, nobody in the equity world would use, you know, the Russell or the Nasdaq or the Jaljoans\nand say, Tadah, I have the equity market, and you know, we keep hearing from Jay Powell, like\neven the Fed doesn't use just the CPI as it's only measure of inflation out there, so it seems\nsilly for investors to only use CPI, especially because so much of the basket is the owner occupied\nrent, so it's a huge component about third is rent. So let's talk about how this portfolio is\nconstructed while we're on that, so we understand how you know, AG and TIPs are constructed,\nlike, so how are you constructing I've all, what could people, what are people finding in\nas kind of general holdings inside the portfolio? So the fund is pretty different because that\naccesses the rates market, most investors can't do that on their own because it is a\nover-the-counter market. I like to compare it to mortgages prior to mortgages getting QCept\nbefore the savings and loan crisis, the whole mortgage market was OTC, so I see as QCept being the\nrates market by giving access to interest rates. TIPs are a pretty new market, it's just\nimportant for people to understand the treasury only started issuing inflation protected bonds\nin the late 90s. The only index is CPI and a lot of people just say, okay here's our core holding\nin the AG and we're going to add I-Gaw on top of that to add exposure to TIPs and also exposure\nto inflation expectations outside CPI. So correlation, I was looking at your correlation matrix,\nit's extremely attractive, so if you're sitting down with, you know, a portfolio manager that\nhas an already diversified portfolio, where are you recommending I-Gaw gets a seat? I mean,\nit could, you could do it in a handful of different ways. I've just wondering like, what is the\nbest utilization of I-Gaw on your opinion? So it usually sets in the fixing home side of the portfolio,\na lot of people will use it as a completion portfolio to the AG so they'll take whatever they have\nexposure to the AG and they'll say, okay, you know, maybe simple math, like 26% of the AG is\nmortgages, mortgages are short options to home owners so we'll take, you know, 26% in that,\nI-Gaw to help reduce that short volatility exposure in our bond portfolio and also add inflation\nand inflation expectations outside of CPI. The people who have I-Gaw as a larger weight and their\nfixing portfolio are usually the ones who are pretty bearish on credit. You know, very simply if you\nhave a stock portfolio and then you have a bond portfolio with a lot of corporate credit risk,\nyou know, it's just takes a loan Apple stock and Apple bonds. You really have the same corporate\nbeta and credit spreads right now are super, super tight, like, let's see, I'm looking at my\nBloomberg right now and the investment grade to your CDX index is 22 basis points. So it's impossible\nto go to zero, right? Because it's got to have some spread and so if you own a bond with credit\nrisk, you want credit spreads to tighten but when they're already at 22 basis points,\nthere's not a lot of room to actually have a appreciation and credit spreads can widen and they\ntypically do when equity's sell off because they are corporate beta, right? They're just a different\npart of the cap structure and so I think the clients that have I-Gaw is a bigger weight in their\nfixed income portfolio are the ones that tend to be a little bit more concerned about credits\nspreads widening or maybe if they want to take their corporate risk, they'd rather take the\nrisk reward in equities and use I've all as a potential carry trade instead of credit.\nSee, and you walk me right into my next question. So I've all, you would want to, I'm assuming\nthat in periods of equity risk off or the potential for equity risk off, you're going to be\nwant to increase in your exposure to I've all as that correct? Yeah, it kind of depends. So I\nall doesn't have anything to do with equities inside of it but it is long interest rate volatility.\nSo volatility, you know, when markets become stressed, volatility tends to increase and\nwe don't have the vix. It actually, I'm very proud to say we have very, very low correlation to\nthe vix or not correlated at all but it's another type of in a risk off environment. We can benefit\nfrom the fed cutting rates more than what's already expected in the market. So kind of like March\n2020, we had positive performance in March 2020 when tips alone or down and that's because we can\nbenefit from either fed cuts or from rising interest rate volatility because we we own options.\nSo when you own an option, you're long-ball. We happen to own interest rate ball so it's just\nsomething else and I think that goes back to your point Bradley about the correlation. It doesn't\nlook like everything else, right? It's not another strategy that's plus or minus 25 basis points\nto a benchmark index. It's truly something different. So it's not always going to make money,\nyou know, investing definitely involves risk but something that gives you access to something that\nyou probably don't already have inside your portfolio. Yeah, it's the products extremely unique.\nIt's probably why you've had so much success in raising capital in it. It feels very institutional\nquality in nature, right? A lot of the ETF plays are, you know, kind of in this space, in indexy,\nand this has some flavor to it. With that underlying exposure, how often are you reconstituting\nthat portfolio or are you on a weekly or monthly cadence? Is it active, annual, how often are\nyou making changes inside the holdings of the ETF? Yeah, so we aren't actively managed ETF,\nso we can make changes whenever we're fiduciaries for our shareholders, so whenever we think\nit's appropriate. I think, you know, we tend to trade, we tend to take profits more when the\noptions are making money and working, like for instance Silicon Valley Bank Week, you know,\nI've always up 16% in, you know, a couple days. We did take profits, like in hindsight, I wish we\ntook more profit off the table, but we tend to profit take more when, because we're long options,\nthe amount we can lose is to find on the options piece to the premium that we have it risk,\nthe premium that we pay, and then there's never an obligation to fund for more cash unlike\nother linear derivatives. This is options, long options only, but when they work, we can have\nasymmetric amounts of potential upside, and so I think that's really the trick is more about\ntrying to monetize those moves and take advantage of those, but also keep the exposure\nas we see fit. Got it. So is Ival also, can you use as an income play as well? Do you guys have\na month or do you have a distribution cadence? Is there yield in the portfolio?\nYes, so the SEC is pretty particular about the word yield, so we talk about the 30-day SEC yield,\nwhich you can see on the website. We have paid a 30 basis point monthly distribution for over\nfive years, so sometimes tip CTFs, if you look at, you know, various tip CTFs, they don't pay\ndistributions at certain periods of time. We have, you know, for over five years, every month\npaid at least 30 basis points. So it's something to look at if you're looking for monthly\ndistributions, but I try to be careful about the word yield and income because it's a distribution,\nand it's really a question of how that distribution gets taxed at the end of the year, too.\nWe try to be really, really greedy with every single basis point and be as tax-efficient as possible.\nWe even use a Bloomberg tips index inside of our ETF to do our treasury trading and kind.\nI've actually, I'm curious, Bradley, if you've ever seen another ETF do that, I've never seen another\none, but we've been able to do all of our treasury trading and kind, whereas if we bought the\ntreasuries directly, every time we sold them for a game, treasuries are capital assets and they\nwould generate capital gains. Like I alluded to, you know, five minutes ago, the institutional\nfeel of this product and what you guys are doing is definitely a level above, it probably goes back\nto, you know, your time at Goldman and also your time running funds, so or a hedge fund, but yeah,\nfeels very well-thought out and very institutional. If it's okay with you, I want to flip over to\nbe NDD, which is your deflation ETF. Same question as I've all, what does this ETF\ntrying to accomplish holistically kind of for a big picture? So a lot of people to get, so\nbe NDD is nominal treasuries, it's long duration, very long duration, nominal treasuries, whereas\nI've all used this inflation protected treasuries. So that's real yields versus B&D, it's sort of like\npeople would own, you know, TLT and TIP, right? They're not, they're not opposite. They're just different\nexposures to the treasuries market. Our big issue is, you know, we're not big fans of linear\nderivatives, so anything like a linear derivative of the future, a forward swap, it goes up a dollar\ndown a dollar. I like to think of it as almost like a credit card exposure, because you're not\nreally paying for it, you're just paying like a little bit of margin, and I think part of the problem\nthe bond market is a lot of people use leverage. It's all over the place, so B&D and I've all\ndo not use leverage in the sense that we're not borrowing money, we don't have margin calls,\nbecause we don't have, you know, everything is fully funded and paid for, but we do have a symmetry\nfor when bonds move. So B&D does well when either the Fed is hiking rates, or when long-dated\nyields are falling, meaning treasuries, long-dated treasuries are rallying, so it's had its benchmark\nis the long-term treasuries bond, and it's had tremendous outperformance during this very crazy period.\nYou know, there's no guarantee that it's going to continue to outperform as much as it has,\nbut it also pays a 30-based viewpoint monthly distribution at minimum, and then we've had higher\ndistributions as well, because of the gains that we've made from the options piece.\nYeah, so I think you just answered this, so what environment, well let me ask you a different\nway, so is there a certain environment you want to own B&D, and also is that the flip side,\nthe other environment or the opposite of that environment, would you want to own I've all,\nare they complimentary in any way? Yeah, it's not one or the other, I know inflation and deflation,\nI'm kind of like their mirror images of each other, they do different things.\nSomebody could be the biggest, say you have a ton of mag seven text stocks, you're super\nbold up in that space, you might want to have, I've all there, just in case we have more inflationary\npressures, so just because you have not everybody has one view in a portfolio, the whole point of\nthe art of portfolio, diversification and asset allocation is to not have everything go up and down\ntogether all at once, that's when your portfolio becomes correlated, and when you have a problem\nespecially in sell-offs, so I think these are both tools for investors to look at to say what\nare needs, what are our goals, what are we, how are the tilts in the portfolio, how might we\nwant to counteract this? In my personal opinion, I think everybody should own I've all,\nin my opinion, because most people are benchmarked to the ag, and the ag is only short options,\nbecause of that, you know, 25 over 25% being mortgages, and the Fed is said, they don't want\nto own mortgages long-term in their balance sheet, 35% in their balance sheet is mortgages,\nand I just feel like we live in a real world, right, no matter what industry you're in or what\njob you have, like you could be a school bus driver or a finance bro, like whatever your job is,\nyou have some amount of life savings, right, and the goal at the end of the day is to make sure\nthat when we get to retirement, we have enough income and enough money to maintain our lifestyle,\nand I think Ronald Reagan said inflation is the thief in the night, and right now inflation\nmarkets are priced really, really low, just like at my Bloomberg terminal, like the two-year\nbreak even, just to pick a number is 1.76. So the market is already pricing that inflation will\nbelow that 2% target in the future, and so to me, I think it's just a great opportunity to say,\nlook, interest rate ball doubt is down tremendously since Silicon Valley Bank. Nothing has really\nfundamentally changed at all, right, all those same issues exist of anything we're kind of facing\na bigger fiscal situation, no matter who wins in November, nobody is talking about reducing\nour debt, right? It's just a question of where we're going to spend money, so I think it's a\ngreat time to help diversify the ag and have some exposure to inflation and inflation expectations\nin the future outside of CPI, because CPI is only calculated by the Bureau of Labor Statistics\nand a third of that index is rent, and then I just personally, I just don't like only being short\nvolatility in my bond portfolio, like it makes me uneasy at night, and I don't think a lot of people\nrealize that mortgages, although there is single case product, close your eyes, homeowners along\nthe option, if you own the financial mortgage, you are short options to homeowners, and whenever\nyour short options, your short ball, it's not equity ball, it's not the vix, it's actually fixed\nincome ball. So I think it's appropriate for a lot of different people, but I think that's where\nI'm a portfolio manager, not a financial advisor, and that's where you should talk to your financial\nadvisor and see if it is appropriate for you. Yeah, thanks for that was super helpful. Staying on\nBNDD, how is this portfolio constructed? Like, what are the holdings that you're going to\ngenerally find that are going to be different than I ball? Yeah, so it is different, because it's\nstill treasury bonds, so 80% of both funds are treasury bonds, but we use different types of\ntreasuries. I ball is inflation protected treasuries, sometimes called tips, and then BNDD is\nlong-term nominal treasuries, so new reset to inflation, it's a really, really long end, so it's like\nsuper super duration, so it's BND, deflation, or super extra long duration. So we talked about this\nwith I ball, but again, you said you're not a financial advisor, but you know how portfolio management\nworks? Are you slaughting BNDD again, and your fixed income sleeve? Is this where you're putting it?\nThat's what I, again, I'm not a financial advisor, and I don't construct client portfolios. I just\nmanaged that I'm the PM for both of these funds, and so I think the trick is always like, you know,\nwhere does it go? It does go in fixed income. How do you use it? How do you size it? Those are always\nkind of the tricky questions. Once you get past the appropriateness, that fund, it kind of depends\nlike how much duration people want, but I'd say with I ball, I think you're gonna have a larger\nallocation, in my opinion, because inflation expectations are so low, and it's not in the ag,\nwhere is the ag a big component of it is treasuries, so you just have to be careful that you're not,\nyou're not taking too much treasurer duration. Got it. Well, Nancy, I thank you very much for\nexplaining all of this to me. It's definitely complex, and looking at it, it definitely, you know,\nyou guys have had a ton of success in I ball, that fund, if you've only launched it in 2018,\nis done very well in terms of gathering assets, and it had some very good years, so congratulations\non that. Before I let you go, though, where can people learn more about both of these funds,\nwhere can people learn more about you and quadratic capital? Well, both funds have a website,\nso it's either I ball, ETF.com, or B&D, ETF.com, or you can also look at the KFA page to get more\ninformation on the funds, and I think, you know, we do try to, it is different, right? It is something,\nit's not like another, you know, another fund that's doing the same old stocks or, you know,\ncutting up an index, so it's something truly different, and it definitely takes, I think,\nmore intellectual curiosity and more time to learn about it and see if it's something appropriate,\nbut we try to do our best with our materials to really describe, you know, in a symmetric way,\nwhat the risks are and what the potential rewards are. Yeah, I was actually on the website,\nthere's some white papers on there as well as some presentations on there. I think people\nafter listening to this should take the time to, to check out because it does walk you through\nkind of in a very systematic way, like who you are, what the product is, where it works, where it\nmight not work, and what environments it's favorable, and kind of, so you guys have done a really\ngood job, I think, in terms of investor education on what can be, you know, a more complex area\nthat I would say most finance people are focused on equities or just fixed income and a whole,\nas a whole, where this is, you know, diving more into, you know, interest rates and other things,\nwhich I think confuses people sometimes. So go check out their website to find out or to read\nthose white papers and also go through those presentations because they were helpful for me when I was\ntrying to, to learn about everything you guys do, but again, Nancy, I thank you so much for your\ntime and appreciate you being here with me today. Thanks for having me on, it's really been a pleasure.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}