{
  "id": "15916284",
  "transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology they are run on\nand you want more customization and flexibility, as well as a AI-driven model marketplace,\nUX wealth partners is your destination.\nOn top of that they have institutional trading, so if you are an ETF issuer or an SMA provider\nlooking for outsourced institutional trading, UX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and\nmake your practice more efficient.\nWelcome to Behind the ticker.\nToday we have on Federico Brokate, he's the head of UX business at 21 shares and we are\ntalking about digital assets.\nThey have the Spot Bitcoin ETF, ArcB, ARKB, and a Spot Ethereum, CEETH.\nSo we talk about those products in a bit of detail how they work.\nAnd importantly, we talk about crypto as a whole, talk a little bit about the ecosystem,\nwhat's next for crypto ETFs and how to be using and looking at these products in a holistic\ndiversified model portfolio and how they can be useful.\nSo without further ado, please welcome Mr. Federico Brokate.\nHey Federico, welcome to the show.\nHey Brad, thanks for having me.\nSo before we get started, always like to ask about your background and how you eventually\nended up over 21 shares.\nAbsolutely.\nAbsolutely.\nSo for those who may not know my name is Federico Brokate, head of the UX business at 21\nshares and I joined about three months ago.\nPrior to 21 shares, I spent about 10 years in my career at BlackRock, where it was mainly\nfocused on the U.S. ETF business, but since moving to 21 shares, it's been a really exciting\nride.\nWe've been launching a few products in the UX market, 21 shares for those who don't know\nas primarily a zurt-based asset manager, focus on digital asset space, and so our mission\nis to help make digital assets more accessible to everyone.\nAt this point, we have over six years of experience running digital asset ETPs with over\n50 products around the world, covering 16 global markets, and most recently entering\nthe US one.\nYeah, I mean, it's an exciting time.\nI want to kind of talk about a little bit later, what that landscape looks like, but before\nwe get into business, I always like to ask, any hobbies, what do you like to do when\nyou're not beyond the desk?\nYeah, a great question.\nI will say the first few months of starting any job as you can imagine, it's primarily\nfocused on work, but this summer, I'm an avid soccer football fan, so the great summer\nfrom that perspective, that's about fan myself as well, and I have a lot of family and\nsiblings here in the new city area, so it keeps me busy for sure.\nIt's great.\nI was never a soccer player, my daughter who was seven is like a soccer freak and now\nI'm finding like finding that I'm spending like three hours a weekend at the soccer fields,\nwhich is fine, she loves it, but it is a great sport.\nIt is.\nIt is.\nI grew up playing myself, I'm from South America, Columbia, so it's a religion for us,\nreally.\nYeah, no, it's great.\nI'm getting more into it.\nI'm learning.\nSo, let's talk about 21 shares as a whole.\nI mean, you touched on it a little bit at a high level, but you do more than just, you know,\nyou're two ETFs that are here listed in the U.S. and available, so you can talk about\nkind of the business as a whole and how you're serving clients, holistically.\nYeah, absolutely.\nSo, our business actually started around 2016 when our two founders, their long-term\nfriends, and they had an interesting founding story, which was their moms actually had done\na little bit of research on Bitcoin, and they kind of went to them and said, hey, you guys\nseem to know about this, how can I add this into my investment portfolio?\nAnd back then, the easy answer was there was no way to do that unless you wanted to learn\nabout wallet, to keys and encryption, and so our founders said, I found this mission of launching\na digital asset ETP company to make it easy and accessible for all types of investors to add\ndigital assets to their portfolios.\nAnd so, originally, we started the business in Zurich at that point, had clear regulations\naround what could be wrapped in an ETP, and so our founders moved there, they started launching\nsome products, and quickly realized that there was a huge need in the market for these types of\nsolutions that really bridged traditional assets and digital assets, if you will.\nAnd so, since then, you know, we've been expanding rapidly, like I mentioned earlier,\n50 global products with the most recent being the U.S. market that we entered through the\nspot Bitcoin, launching in January, and most recently we actually launched our first 21 shows\nReddit product here as well for Ethereum spot in ETS.\nYeah, so why don't we talk about kind of like a general digital asset landscape update?\nI think the last time we had someone on was probably in January talking about kind of the Bitcoin space.\nSo, how is advisor adoption going? How is a regulatory landscape like in general?\nIt seems like it's opening up a little bit, but how's it going?\nLook, the short answer to that question is, it's been a tremendous success.\nRight, I think if we look at the top half of the digital asset league table,\nthe top four products are included, are amongst the four fastest growing ETS and the history\nof the ETS market, right? And so this level of success was definitely not expected, I think,\nbut by the entirety of the digital asset ecosystem, but has been a tremendous upside\nsurprise and something that we're really proud and excited about. When it comes to adoption\nby different types of clients, we tend to bucket them at the three big buckets.\nFirst, we'll be retelling investors or individuals that trade on their own.\nThe second would be both advisory worlds. So, you know, financial advisors, home offices,\nthat are in charge of managing assets on behalf of other clients, and then the third big\nbucket is going to be institutional investors or asset owners or hedge funds that might\nhave different use cases for these products as well. And so, when I break it down into those three,\nwe're seeing tremendous progress across all of them. You know, retail investors have been\nrapidly adopting these products in the early endings and we continue to see that.\nI think we're particularly excited about that because they're really the fire that has gone\ndigital assets become mainstream as you will. So, we're around 75 to 80% of all digital\nor Bitcoin ETF assets are held by retail today. And so, when you think about that and\ncomparison to the rest of capital markets, it's a quite the embrace, right? I think so,\naround 80% of traditional assets are owned by institutions or by local advisors. And so,\nretail has been a tremendous driver of demand and we expect that going forward as well.\nWell, I think it's just real quick, is I think Bitcoin, I've been in the industry for probably\n2018 years now in the asset management industry. And so, it's one of those bitcoins,\nthe only asset class I can ever remember that it wasn't the advisor bringing the idea,\nit was the client bringing the idea and also the frustration of the client that's like,\nwhat do you mean you can't give me access to this? Yes, and the ETFs are really on\nlocking that access to your point. I talked to the advisors all the time that are saying,\nhey, I actually don't know too much about Bitcoin or Ethereum myself, but my clients are asking\nforward in their portfolios. And so, I need to educate myself and I need to educate the firm on how\nthese can fit, how you know which ones we should pick and all the questions that go into\nETFs election. Yeah, and this is more, I feel like going to, a lot of advisors,\nlisten to the show and I think the advisor landscape is, and you hit the nail in the head,\nit is all about education and now that you have ease of access, like trying to educate them\non how to get access is now easy, right? You have your spot products, but it's the education on\nwhy that I think is really important and where you guys really have the heavy lifting to do.\nAbsolutely. And when it comes to the heavy lifting, I think 21 years of the firm\nis one that really relies on our research capabilities and those educational tools, right?\nOver the last few years, we've been able to build up our research team that really,\nfrom my perspective, is second to none. And we're able to share some of those resources with advisors\nand with all types of clients who want to educate themselves on the technology itself,\non the portfolio fit, the client's suitability, right? And we can talk through all the\ndifferent topics with advisors. Sure. So like, what do you think is it's all going to come\ndown to regulatory, but what do you think or what are the ideas that are being thrown around kind\nof the Bitcoin ETF or Ethereum ETF space, right? And I kind of liken it to the SMP where,\nokay, you can get, you can buy SPY, but I can also buy to find outcome products on SPY,\ncan also buy leverage products. I can also buy inverse products. What is your industry talking\nabout as a whole that they kind of like to start seeing next and come down that pipeline?\nYeah, you're, you're talking about product innovation in our category and that's something that\nwe're extremely excited about. I typically look at Europe as a good benchmark for where the industry\nin the US could be headed towards on the road. And if I think about our European product suite,\nwe have exactly what you just listed right. We have levered products, we have inverse products,\nwe have baskets that are indexed. We have multi-assid offerings as well and also\nfocus on a digital asset space. And so ultimately to your point, it is a regulatory conversation\nin the US, but we've seen this story before in other markets where you know, you start using\na little bit and use a lot of Bitcoin and Ethereum products initially Ethereum without staking,\nthen you kind of go to the Ethereum with staking and then you kind of enter some of the broader\nof Bitcoin world as well. So just like curiosity, because I don't follow the European markets\nat all, how those, some of these, you know, levered or inverse, is it mostly retail trading\nproducts? I mean, how, like, how heavily are they being utilized? How popular have they become?\nOr is still kind of that spot Bitcoin exposure king?\nYeah, so look, it depends by markets and Europe is a diverse continent for sure.\nBut I would say it's a really all types of clients. So from hedge funds all the way down to retail\ninvestors. And what we see is kind of differing demand for spot products. You know, in Europe,\nwe have one of the largest Solana ETFs in the market, which is a very popular product in that region.\nWe also have a basket product toggle in Europe, which, you know, is in available in the US today,\nbut also is very attractive from a European client perspective. And so we're really seeing adoption\nacross the board of all sorts of different types of strategies. On the inverse and the leverage\nspace, typically more of a retail or into products, but still we're seeing some, some institutions\ncome in and participate as well. Interesting. So what's the overall temperature right now kind of\nacross the Bitcoin community? It's quite a down. At least that Mike Twitter's quite a down. Seems like\nBitcoin has been a bit choppy over the last few months. Like, what is the community excited about\nto give it that next catalyst to kind of get the excitement ramp back up in the Bitcoin space?\nYeah, you know, that's a great question. And I think the ETF industry as a whole has\nper set perhaps been a little bit slower the last couple of summer months, right? This is something\nthat we typically see every year. You know, from this college, July, August, that tend to be slower\nmonths for ETFs closed. But what we're looking towards is really, some of these longer-term adoption\nmetrics, right? Independent of the daily slows, you know, we're actually starting to see pick up\nquite significantly for Bitcoin ETFs. We're looking at, you know, who is actually allowing\nthese products on their platforms? So when it comes to both advisors, we recently saw these\nfrom Morgan Stanley, allowing a couple of products to be, you know, sold to some high net worth\nclients. And we're looking similarly for other types of lost platforms to allow that as well.\nWe're also looking at its biggest institutions and asset owners in terms of who's adopting\nthese products and who's actually starting to invest. Most recently, the pension funds for the\nstate of Michigan actually started participating in our RP product or stop Bitcoin product.\nAnd some of them are just dipping their toes into the water, right? These are small trades,\nbut what we look toward is, you know, as the activity there is the adoption there and in\nour things headed in the right direction. So in your opinion, those bigger broker dealers, I mean,\nlike, you know, you mentioned Morgan Stanley, but let's use Wells Fargo or whoever\nwhat is, what is the sticking point there? Is it compliance? What, like, what is it take for\nthem to kind of get over the hurdle? Is it more education? Like, how can that move faster?\nYeah. Usually, you know, when it comes to these large wealth platforms, they wait at\nat least a year, minimum to see how these products are performing and how they're operating in the\nmarket. They like to have the concrete proof points that they're behaving, how they should,\nthat, you know, prices are reacting and the spreads are tight across the products and that\nfrom an operational perspective, they're set up correctly. That at the same time goes along with\na lot of education and it lengthy the due diligence process that they employ to make sure that\nthey're providing their clients to the products available, right? And so we're coming up on that\nyear mark, you know, towards January of next year. And we're, we're looking for is an increase in\nterms of opening of the gates, if you will, from these wealth platforms for these products.\nSo before we kind of touch on your, your spot products,\noperationally, how has it been meaning it appears to me that you've checked all those boxes\nin terms of spread in terms of adherence to NAV, like, how's it gone? Because I think everybody\nwas a wait and see and it seems like it's gone pretty perfectly. It's gone, I mean, not on wood,\nright? But it's gone very, very well. These products are performing well,\nours and ours and our competitors included. And I think what we're excited about is being able to\npoint to a robust industry that has, you know, not just our products with strong operational\ncontrols and other sites, but for everyone else in the market as well. And really the more\nconfidence that we can still and digital assets as an ecosystem, I think the better for some\nof these more institutionalized advisors and investors. That said, you know, there's a concrete\nproof point in August when we saw some of the market volatility and pullback around some of the\nnegative numbers that were coming out of the U.S. and some of the concerns around the\nJapan, the energy carried trade and these products responded perfectly. And so we're at 21,\nwhich is really excited about being able to point to some of these concrete moments and markets\nand how our products respond. So you've got two spot ETFs available. One is your spot Bitcoin\nproduct that is RPA, ARKB, and you also have Ethereum, which is CETH. First, can you talk about\nthe ETF structure for a second? I mean, how trading and custody is all facilitated in these\nproducts? It's slightly different than maybe a traditional equity ETF. Can you just talk about\nfrom a structure perspective? How these products achieve all the things you just mentioned that they\nachieve? Yeah. I think it all starts with institutional credit custody, right? We have top of the\nline to start Instagram products and actually I love that you bring this up because our operational\nsetup is one of the key differentiators for our products versus others. We are the only assure\nmarket today that offers a multi-custodial model. And so what that means in layman terms is we work\nwith multiple custodians for each one of our products. Our ARKB product comes with Coinbase,\ncomes with Anchorage, and comes with Thicco, as the three custodians, same goes for our CETH product.\nAnd the benefit to advisors and to all clients really here is that we're illuminating the\nsingle point of failure, right? And so now by having multiple custodians that can support our product,\nwe can spread around assets and it can be a little bit more above robust operational setup for\nour products. The other thing that we do that is a big differentiator on the operational side\nis that we make sure that we provide our clients with full transparency into what our products are\nholding. We are in a partnership chain link and through the proof of reserve system,\nany one of our investors can actually go straight up to the blockchain through the chain link website\nand verify the exact Bitcoin held by each one of our tickers across all our custodians,\nsame goes for Ethereum. And so this level of transparency really helps give confidence for our\ninvestors that the products are operating how they should and that they're holding the assets\nthat they say they are. And a lot of this comes from our experience and in Europe and in our\nexperience managing digital asset, ETP is more broadly. We've been through multiple market cycles\nright since 2017, 2018 we've seen both markets we've seen bear markets and we've managed multiple\ntypes of strategies and we've been able to successfully kind of navigate the different types of\nlandscapes. That's great. So maybe you can get a little bit more in the weeds there just out of my\ncuriosity because I haven't done the research. So the team, I'm used to the traditional\ncreator team process in a traditional ETF. So is it different in the Bitcoin space and then\non top of that you mentioned multiple custodians? Is there what is the decision making on\nwhere it gets custodyed or is it all split evenly? Can you just go a little bit deeper there?\nYeah. So to be completely transparent with you, these products operate very similar to a\ngoal DTS, right? These are 33 active products. And so they, to your point, they are slightly\ndifferent from a traditional U.S. equity product. But in the same way that you would trade an\nIDV or another product that tracks the S&D 500 DTS or an index, we have market makers, we have\na piece, we have transfer agents that are all in the back end making sure that these products are\noperating correctly. And there's a system, an elaborate system checks and bonds is here that are\ngoing to help make sure that there are no errors, if you will, from an operational perspective.\nOn the custody side, we started like everybody else with Coinbase as a primary custodian for\nthese products. Since then, we've onboarded Anchorage and Bitcoin, as I mentioned earlier,\nand some of these assets will begin to move over to our new custody partners, but really it's\nall focused on how we can make sure that we're guaranteeing that these products are operationally\nsound. And so you will sort of see some of these assets move from Coinbase over to Anchorage and\nBitcoin, but at different rates, I would say. Got it. So let's talk about your Ethereum product,\nCE, for CE, TH. What do you think is the reason that these Ethereum products have not taken off\nas much as kind of the Bitcoin products? I know Bitcoin is so much more popular, so much more\nwidely utilized, but there's a lot of potential with Ethereum. And it's just the delta between\nthe AUM in your Bitcoin product, not just yours, but everybody's. And the Ethereum product\nis pretty wide. So what's holding up adoption there? Yeah, I mean, comparing it to Bitcoin,\nit's a crime, all of us for Ethereum, because it's hard to stack up to that level of success.\nBut really, I think there's a combination of things impacting Ethereum flows, and\nthey have been disappointing just given the successors on Bitcoin. But some of them are related to\nEthereum and some of them are actually a little bit more macro. But the first thing I would say is\nin the US market, there's just a lower brand awareness for Ethereum versus Bitcoin. Bitcoin is\nthe flag bearer for the digital asset industry in the US. There is no doubt about that. And it\nhas a simpler narrative, right? People seem to identify the fact that it operates as digital\ngold wealth versus Ethereum is much more of a growth equity play that can take different shapes\nand forms depending on who you're speaking to. The second thing I would point to here from an Ethereum\nperspective is the lack of staking, right? For those who may not know, staking is, you know,\none of the key value propositions of Ethereum, and it provides this additional source of yields,\nyou know, an exchange for help and quality transactions. It's basically passive income. And so\nwhen I think about who would be an early adopter for this product, it would really be that\ncrypto native or that crypto adjacent crowd that was looking to provide this exposure to the portfolio.\nBut perhaps because of the lack of staking, they stayed on the sidelines so far. And the third\nthing that I mentioned a little bit earlier was some of this macro point where, you know, if I\nlook at QQQ for example, as a proxy for growth equity is especially in the US prices are largely\nmoved sideways for the last few months, right? And I typically view Ethereum as more of a growth equity\nstory. And so when I'm looking at performance there, I'll compare it to other US equity products\nand it really is moved quite similarly since it launched. So I think these couple of things, you know,\nthat are near-chimp headwinds, they'll dissipate and ultimately along to potential, I absolutely agree\nit is very strong and it remains there for Ethereum. You know, most of the most prominent blockchain\nuse cases, including stable coins or real-world assets, or defy, all live on Ethereum today.\nSo you also, so I think in order to help flows, you guys waved all fees,\nup into a certain date, wind or a certain dollar amount, are you the only ones that have done\nthat? Is anybody else done that? No multiple, multiple issues in the market have done so,\nand everyone has kind of a slightly different way of doing it. But the idea being that, you know,\nit's those early adopters are able to come in early to the product. They will have some sort of\nfee benefit to doing so. But ultimately, as long-term investors, I myself consider myself to be one,\nwe look at the T-E-R price and kind of gauge it that way. Got it. So you kind of answered my next\nquestion, which is what happens? What do we need to see happen to kind of increase Ethereum flows?\nAnd so let's just pivot to your Bitcoin product, ARCB, ARCB, massive adoption, congratulations.\nCan you talk with? Talk about what needed to happen in the early days to get market share because\nit was everybody had their eyeballs on it and it was definitely a race. So, you know, what are\nyou guys doing over 21 shares? Now, what did you do? In that January, I know you weren't there,\nbut I'm sure you had your eyes on the space. What needed to happen to get that adoption going?\nYeah, look, I think we had to be very active in the market from the early days. And we had to\nmake sure that we were using our voice to kind of educate clients before even the product launched\non some of the key benefits and how it could fit into their portfolio. But we counted on was a strong\ntrack record in Europe that we were able to kind of leverage here in the US market and especially\nsome clients that are cross regional, right? We were able to position our US product early on with them,\nbut also just being very very active with the retail product. I think this was a part of the market\nthat was very quick attention to these products and was a huge driver of demand and flows,\nespecially in the first few obviously the first quarter, really of trading. And so we were\nfortunate to count with the strong client based from both the social side and from the retail side\nfrom the early days. Now, there's a lot of great successful Bitcoin products in the market today,\nbut I think what we were able to do differently was really lead into that research capability\nthat we've developed over the last few years and some of those educational content series that we\nhave to help educate retail investors too. No, that's great. There's, I mean, there's still a lot\nof competition and is there still a bit of a fee war in the space occurring or is that kind of\nslowed down? I think it slowed down. You know, the most recent fee related news that we saw\nwith the launch of preschool minis, the Bitcoin and their Ethereum product that 15 bits,\nbut we really haven't seen the TR's be a big driver of decision-making by investors so far.\nAnd the delta between one product and the other at this point is somewhat small. And so we're able\nto kind of tell clients the total cost of ownership story, where we're able to leverage our\noperational excellence to drive actual total costs for the client down, even relative to some of\nsome of the bigger players. And so that's what's been able to set us apart and that operational\nexpertise and an experience is really valuable for the client. So here's the million dollar question\nright? You're sitting down with advisor. How are you from your perspective? How are you kind of\nputting out the benefit of adding crypto ETFs to an already diversified model portfolio?\nKind of the whole story of, you know, why is it beneficial? Where should I put it? How much should I have?\nI know that is going to be totally dependent, but I know that there's some guard rails there.\nWhat's the story you're telling to start to get wider adoption in that space?\nYeah, I think there's a couple of things. First is explaining to the advisor why they should\ncare inherently about Bitcoin in the first place, right? And I think what's you make the place for\nthe need for an asset like Bitcoin? The second part of the conversation becomes much easier,\nwhich is, okay, if I add Bitcoin to my portfolio, the first thing they'll think about is the\nincrease in volatility. But what does it do to my risk of just the returns on a full year basis, right?\nAnd so what we're able to demonstrate through data is adding a certain percentage depending on the\nportfolio, a Bitcoin whole day to their existing assets, can actually improve their return profile\nand a risk of just the basis of the long-term. And so it's making this case with copied numbers\nand demonstrating, you know, where you did the math has really been super helpful. But really\nlike I mentioned earlier, it's a two-pronged approach of like, look, this is the case for Bitcoin\nmore broadly, but then when it comes to your clients and their assets, this is how it actually\nimproves their outcomes. So before we wrap up, why don't you take a minute to explain that first point?\nWhat is the benefit of Bitcoin more broadly? What is that story that you're telling to advisors?\nHow can it benefit their clients? Well, I think the first thing to point to right is that Bitcoin\nis an uncorrelated asset versus traditional assets, right? And I think it has its own individual\nset of risk and return drivers that might not actually apply to some of the traditional\nasset classes. And so, you know, there's been a lot of talk recently in the market about, you know,\nis Bitcoin risk on? Is it risk off? Is it neutral? Is it different? I think it's just that matrix\nor that framework for assessing Bitcoin. It doesn't really work. If I think about a comparison\nversus text docs, it's quite misleading. We see, you know, correlations versus acute acute\nfor example are actually negatives. In some cases, there are some periods of time. And so\nwhat we promote Bitcoin as is a hedge against, you know, inflation, against monetary\ndebasement against geopolitical risk. And so showing how again, Bitcoin is a risky asset,\nbut combining the use case plus the performance or risk adjusted performance numbers,\nthat's where you really hit the sweet spot. Well, Federico, I really appreciate your time. I love\ntalking about this kind of stuff. Before I let you go, where can people learn more about 21 shares,\nall the things you do in your two products? Anyone shares.com? We have fantastic research up there,\nfor completely for free. We also produce newsletters that keep you up to date on what is going on\nin the digital asset community. So, please go free to look at, look us up on our website and sign\nup for our newsletters. Oh, again, thank you so much for being with me. Thank you, Greg.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}