{"transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology, they are run on and you want more customization and flexibility.\nAs well as a AI-driven model marketplace, UX wealth partners is your destination.\nOn top of that, they have institutional trading.\nSo if you are an ETF issuer or an SMA provider looking for outsourced institutional trading, UX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and make your practice more efficient.\nWell, come to behind the ticker.\nToday we have on David Allen.\nHe is the founder of Octane and we are talking about their all-cap value energy ETF ticker OCTA.\nIt is a fun structure around a all-cap value strategy, investing in energy companies with stable earnings, strong balance sheets,\nand a commitment to returning capital.\nWe talk about the opportunity in the energy sector.\nThere's been a lot of focus on sustainability and renewable energy, and while those are important,\nDavid and I both are on the same page when it comes to seeing that there is still a ton of opportunity in traditional energy sectors\nand how there is an underallocation in broader indices to this particular sector.\nSo without further ado, please welcome Mr. David Allen.\nDavid, welcome to the show.\nGood morning, Brad.\nThanks so much for having me.\nGreat to be here.\nBefore we get started, always like to ask, can you tell everybody about your background, how you got into this,\nand how eventually you went out and started Octane investments?\nThank you.\nIt's great.\nI will date myself a little bit.\nI noticed that you went to Duke Han University.\nSo in 1992, I was a dollar-dorchmark trader at a place called Maryland.\nAnd it was a really good, really good trading desk.\nAnd I was there when Stanley Druckenbiller and George Sorrell's broke the Bank of England.\nNow way back when there were only about 25 or 30 billion in hedge fund assets.\nAnd that day they made a billion dollars for their LPs by breaking the Bank of England.\nWe thought it was all the money in the world.\nAnd then today, hedge fund assets, depending how you counter four or five trillion dollars.\nSo I sort of fell in love with geopolitics way back when and started watching crude, obviously,\nwith intent back then.\nAnd even in the 80s when I was in college.\nSo what kind of led you from those experiences that kind of decide to go out on your own and start the firm?\nWell, I saw gigantic opportunity.\nSo a gigantic vacuum in the market created mostly by investment.\nSo when you look at, you know, there are a lot of allocators, a lot of public funds in the US.\nThey started investing from, let's say, thermal coal and Canadian tar sands.\nAnd eventually they started getting out of all of traditional energy stocks.\nAnd the way they count it, the way the UN pension, for example, counts it, is scope one and scope two emissions.\nSo by rough calculation of octane, when you add up the people who signed up for the Paris Accord,\nplus on on the, on the biceite, people who signed up for G fans, you're talking about 50 to 60 trillion dollars\nwho have either divested or or planted investment the next 10 years.\nWhat that does is, it creates a real vacuum.\nAnd that's one of the premiums that that octane is, is meant to, to gather for investors,\nwhich is the carbon risk premium.\nAnd on top of that, there are other risk premiums.\nObviously the equity risk premium, there's the small cap premium.\nWe are an all cap value shop and of course the value premium.\nSo this, we think there's a gigantic white space in the market.\nWe don't want to see a world in which there are no, there's no traditional energy.\nI think Jamie Diamond himself told Congress that it would be a hell of scale.\nIf we lived in a world without the ability to burn hydrocarbons.\nAnd so I launched the firm to, as a pure reaction, a market reaction to this\nbirth of capital that's going to these publicly traded companies.\nSo before we get to into the weeds on the energy sector and the ETF,\nwhat do you like to do when you're not working and when you're not behind the desk?\nAny hobbies, things you love to do?\nAbsolutely.\nSummers, when I'm not doing such things as launching an ETF,\nand I see that you launched one a few days ago, congratulations.\nI rent sailboats out of Newport, Rhode Island and take one or two or three weeks.\nIt's called bear boating when you rent a sailboat and you don't need a skipper.\nBecause I'm the skipper.\nAnd it's just fantastic.\nThe year 2020, I had a sailboat for the entire month of August.\nAnd that's a lot of fun.\nAnd the other thing, I am a bit of an amateur writer.\nI had a screenplay that apparently got to the head of a major studio.\nAnd then the pandemic happened.\nAnd I didn't hear from them again.\nBut I've really learned a lot about structuring a story.\nAnd I think that's going to help me as I roll up a CTF and start marketing it.\nIt's great.\nSo you're the first screenwriter we've had on.\nBut it's funny.\nI just, I had on Nancy Davis from quadratic.\nHer episode will be actually coming out.\nIt, somebody, they've already heard it by the time they hear yours.\nShe, um, she runs eyeball.\nShe's an avid sailor too.\nI had on Katie stopped and she's an avid sailor.\nI'm like, I'm trying to create a correlation between ETF issuers and sailing.\nBecause it seems like it's the biggest hobby in this business for some reason.\nThat's cool.\nWell, there's something about.\nSorry, good.\nNo, I was good.\nI just, um, I've never done it.\nI think I, well, I should say I've never done it.\nWe rented a house in Jamaica 10 years ago and I had one of those little dingy sailboats.\nI made it probably 25 feet.\nUm, but it is fun.\nAnd I think I would learn to do it.\nLove to learn to do it.\nWell, what's, I think you would take to it.\nUh, as a, as a fish takes the water.\nBecause when you're sailing, uh, you're at the helm or you're skippering a boat.\nIt could be with one passenger or it could be just you.\nAnd I sailed for eight years in the bay.\nI was out in San Francisco with Alliance Bernstein for eight years.\nUm, it's a lot about risk management.\nAnd it's a lot about being in the flow of things.\nAnd it's interesting.\nThere's an, there's an old expression in sailing.\nWhen do you reef the sails?\nIn other words, when you depower the sails.\nAnd the old saw is you depower the sails as soon as you think of it.\nAnd I sort of, I'm in a very wildly volatile market now.\nUm, if there's an upstream company that has maybe a little bit more death than we would rather.\nWe would rather, we would rather have.\nUh, then it's probably time to trim.\nSo it's, uh, interesting trim.\nThere's a, there's a, there's a, and they're cor, corollary words to sailing sailing.\nBut I think you'd love it.\nAnd you should let me know when you're out here.\nYeah.\nNo, that would be great.\nSo let's get back to the company.\nUm, so octane.\nYou have a single issue ETF right now.\nOTCA, which we're going to talk about in depth today.\nUm, but the fun is fairly new.\nSo can you talk about why you went to ETF route?\nYeah.\nAnd a little bit about your experience.\nLaunching the ETF from kind of ideation to launch.\nBecause it's fresh in your mind and it is a big undertaking.\nYes.\nThanks for asking.\nSo I came up with the idea about three and a half years ago when these,\nand I was, I was in, um, I was in in social sails at my last job.\nAnd last time I traded and took risk was the first bird of my career.\nWhen the effects market was truly volatile.\nAnd I learned a lifetime doing it then.\nBut some of the biggest clients that I had mainly East Coast public funds were going whole\nsale out of traditional energy companies.\nAnd, you know, I'd have these, these long and polite respectful conversations with them\nto say, okay, you know, the reason the US has a smaller footprint today.\nThat's called this 2021.\nThe reason the US has a smaller carbon footprint today than in 2005 is because of these companies.\nBut you're selling.\nYou're selling these companies.\nThey're trading at six and a half price up rings.\nThey're making a lot of money.\nWell, Wall Street got smart about sending blind money to the oil patch after 2015,\n2016.\nThere were tens of billions of Wall Street dollars went down.\nThat this was a pioneer days of Aubrey McLendon.\nAnd they bought really expensive acreage.\nAnd all they cared about was production.\nAnd, you know, a third of them went out of business.\nThere was a knife fight between the Permian and the Saudis in 2015, 2016.\nThe second episode happened during the pandemic.\nAnd I wasn't really interested in the space until after the pandemic.\nAnd the C-Suite in the oil patch actually got real about returning capital as shareholders.\nSo, it's interesting you asked me the question, you know, I was doing my homework.\nI was still at my other firm.\nAnd I would call these quotes that I know a lot of them.\nI'm currently, I currently serve as chair of the CFA Society of New York.\nWe have 11,000 members.\nWe were co-founded by Benjamin Graham in the 1930s.\nAnd I called these quotes.\nAnd I said, here's what I want to do.\nI want to have a long, only equity portfolio.\nI think I want to do all cap value.\nAnd we can talk about that too.\nThe utility and efficacy is there, Brad.\nAnd I would call them and they say, well, yeah, we can put something together.\nWe'll have some quarters put together.\nAnd I said, I don't want to black box.\nFor a couple of reasons, first of all,\nto sign a black rock and invent something much better overnight.\nAnd updated a lot better.\nIn more importantly, I can't sell a black box if I didn't design it.\nSo, I went back to the very basics.\nAnd I built a very simple decision tree.\nAnd the decision tree may be something like what you'd build.\nIf you had a greenfield's approach to investing in the energy sector.\nThe first node is PE.\nWe want relatively stable E and a cheap P.\nSo, that's the first basket.\nWe got a data feed from empirical research partners.\nIt's curated data feed on about 170 names that trade in the US.\nWe buy AVRs, but only of developed world companies.\nSo, however much I'd love to be in Petroprough or their gorgeous field.\nI don't want to lose 500 basis points overnight.\nIf the people in Brazil change their minds about Petroprough.\nSo, with that all-camp value approach,\nthe first decision tree node is price earnings.\nWe want cheap price earnings.\nThe second is probably the most important node,\nwhich is do they have a strong balance sheet.\nNow, by definition, grant all of these companies are price takers.\nSo, if you're an upstream company, you're selling into,\nyou're selling into a commoditized market,\nvery volatile commoditized market.\nIf you're refiner, you're selling into a wholesale gasoline or diesel market.\nThen the third decision tree, which is really important as well.\nAnd I alluded to this before I started the business.\nI wanted to make sure that the oil patch companies are doing this.\nThe third decision tree is are they returning capital to shareholder.\nAnd what we've seen is most of them have,\nyou know, one way to do that is to bring down share count.\nAnother way, obviously, is to eliminate debt.\nYou know, we have some companies in the portfolio that had,\nyou know, 40, 50% debt equity.\nAnd now they're actually have negative debt.\nIn other words, they've paid down almost all their debt\nand they have excess cash in their balance sheet.\nThese are really nice situations that be in.\nAnd it's also a situation where they can really weather\nthe commodity storm.\nAnd let me just go back to, you know, I mentioned the upstream.\nI also mentioned refiner's, if I were describing what we do to an\nand Sally who doesn't have a PhD in finance, I would say,\nyou know, you may have a great company, large capital\nintegrated company, oil company,\nthat's trading at 13 or 14 times price earnings.\nIt probably should be there.\nIt should probably should traded a premium.\nWhat we're trying to do at octane is replicate,\nor at least approximate the financial exposures of that company.\nBut do it piecemeal.\nAnd I wrote a white paper on that called somewhere under the radar.\nAnd that's not about energy, but it's about the most important thing\nthat I think's happened in my career, which is the rise of passive.\nSo I grew up eight minutes from Vanguard's headquarters in Valley\nForge.\nAnd in somewhere under the radar, I talk about a widget conglomerate.\nIt's trading at a $100 million market cap.\nIt's in every big index.\nWhen the German pension fund buys a global equity beta through\nMSCI world, they're putting, you know, 80 cents into this widget conglomerate.\nBut the widget conglomerate, you can replicate their business\nby taking pieces of that and putting them together.\nSo what I've manufactured in this 30 stock portfolio in octa\nand it is probably more volatile than you're integrated company.\nBut what I've done is I've taken the cheaper pieces, put them together\nso that there is some modicum of balance in the broader portfolio\nwhile getting a major discount to the mega caps that have been\ndriven up from this passive act of world that we live in.\nSo you, I'm glad you use the term under the radar\nbecause this is one of the questions I have.\nCan you talk about how your team is finding and\ndeeming these companies under the radar?\nSo you went through your three nodes.\nYou have a screening process to get to your 30.\nAnd then you team them under the radar by them being stable earnings\nand the price is just really attractive.\nIs it really that simple?\nIt's pretty simple, but there's a little bit of art in above the science.\nLet's say we start with about 170 names.\nThese are traded in the US.\nThey are north of a billion dollars.\nAnd of course, we weed out the non-OECD companies.\nAnd so let's say we start with about 150 names.\nWe try to take the top roughly one-third of those names\nfrom a forward PE ratio and from an introsectoral valuation.\nAnd so let's say we come up with call in 50 or 60 names.\nAnd then we do the debt to equity test.\nNow this is where a little bit of art comes into the science.\nBecause if we're looking at six or seven sub-sectors,\nif you have let's say a scale refiner,\na household name refiner that ends up in, for example, cows\nand other successful ETFs, you create cash flow,\ngreat buybacks.\nYou probably know that they're building a lot of refining capacity\nin China and even the Middle East.\nBut here they're not building any more refinders.\nCalifornia wants to either take theirs over or have them go away.\nNot sure where they're going to get their fuel, but that's beside the point.\nSo within these different sub-categories,\nyou basically get a feeling for what sort of debt load they can handle.\nSo a refiner with all that in the ground equipment,\nsort of irreplaceable from a footprint standpoint,\ncan actually take on more debt than a pure upstream plug.\nSo we're looking at, we're looking at relative debt to equity ratios\nwithin the sub-categories.\nThe other thing that we try to do,\nwe try to lean into categories,\nwhich we think have a very stable and can do really well\neven if crude suffers.\nSo today is a really good example.\nIt's about 3% and we're kind of flat.\nAnd the reason we are is refiners have a bid to them today.\nWhy? If you have a soft upstream cost,\nyour crack spread looks relatively decent.\nThe other thing we've gotten into,\nas really a picks and shovels play,\nis we've got about a 15% exposure to tankers.\nNow it's really funny, you know, Mr. Market.\nI know you know this brand, Mr. Market is omnipotent,\nbut not omniscient, right?\nSo when crude is falling out of bed,\nWall Street in general sort of hates all the broad category.\nBut when you look, when you look at,\nokay, we've got a six month,\na nine month, a 12 month time horizon,\nwhich we certainly do.\nCertainly anybody buying these ETFs should have an equity like time horizon,\nbecause this stuff can be volatile.\nWe look at, if you've got a soft,\nyou've got soft commodity prices for the hydrocarbons.\nThat's really good for tankers.\nWhy? Because the arm of getting these stuff,\nthe stuff from a streetsport, Louisiana,\nto mainland China, or even to Indonesia,\nthe arm goes higher, and the tankers will make their money.\nThe other thing about, you know,\nthat if you've been through a couple of capital markets cycle,\nthe thing that destroys tankers' margin is an overbuild.\nWe don't believe there's an overbuild in that category.\nSo the tankers is a beautiful place, both clean and dirty,\nwhere we've put, as I said, 15% of the portfolio.\nWe also have 16% in coal, as Australia and the UK,\nare winding down and shoveling their very last coal plants.\nChina has 300 brand new coal facilities on the books,\nand these will have at least 40 year lives.\nBrad, we still get about 10 or 11% of our grid that's powered by coal.\nI know we're retiring them,\nbut if we spend a little bit more money,\nwe can scrub them, make them a little bit cleaner.\nSo we still like coal.\nThe developing world is, to the developing world,\ncoal is the hydrocarbon of their future.\nAnd I'm not saying that time when cheap, it's just a fact of light.\nOne more thing about, when you look into the micro-economic\nto these companies, there's one holding that we have,\nthat's just six years ago, two thirds of its business was domestic,\nand one third seaborn thermal coal.\nThey flip that on to you.\nSo these people are dumb.\nThey see the retirement of these coal plants,\nand they're cash flowing just beautifully,\npaid down almost all their debt.\nSo there's some really cool stories when you open up this broad category\nthat the world seems to hate.\nAnd the other thing I published a video yesterday\non how behavioral, behavioral finance,\nwhen you tack on the idea of behavioral finance\ninto the sustainability movement and g-fans,\nwhich is a Glasgow financial accord for net zero,\nit's not gonna happen.\nAnd about 30 blocks away from me at the UN,\nthere are a bunch of dignitaries that flew in on big fancy jets,\nand they're talking about how the plumber and Ohio\nshouldn't ride around in a big diesel truck.\nAnd it's a bizarre thing.\nOne more thing if I made about sustainability,\nI know the UN pension very well.\nIn fact, one of my advisors at Octane\nand he's up on the Octane website, Octane.\nOctane.NYC, was the former head of sustainability\nat the $80 billion UN pension plan.\nAnd we're trying to be very apolitical at Octane.\nWe really try to be.\nThe odd thing is all the people sitting\nit's climate we care in New York\nand everybody's here for the UN General Assembly next week.\nWe talk a lot of people talk about\nthe United Nations principles for responsible investing\nand the United Nations 17 sustainable development goals.\nAnd it's not a trick question,\nbut I ask these people,\nand I run to them all the time,\ndo you remember what the number one SDG is?\nThe number one sustainable development goal of the United Nations is.\nI'll tell you what it is.\nIt's reduced global poverty.\nNow, if somebody can reduce global poverty\nand end fossil fuels,\nthat would be a wonderful miracle.\nIt's not going to happen.\nIt's not going to happen for another 90 years.\nI hope technology happens,\nbut it's not going to happen now,\nwhich is why we're quite comfortable,\nfor example, with a 16% exposure to coal.\nYeah, I agree with that entire sentiment,\nplus I have a couple of coal broker buddies\nthat do well,\nand I like to see their business continue to grow.\nNice.\nBrett, can I ask you a question?\nI'm going to interrupt later,\nand I want to flip the script up on May.\nSo congratulations.\nI'm pretty sure you launched\nyour second ETF and index rotation ETF on Monday.\nWas it in this week?\nIt was in this week.\nIt was in this week or later, but I got it.\nWell, I just, I didn't push about.\nPlease, your generous to have me on.\nI'm going to flip the script and ask you.\nCan you give us the,\nwhat's the 90 seconds, sort of elevator pitch,\nand why are you excited about the launch?\nWell, you know,\nthank you for the airtime.\nI'll take the airtime.\nWe're really excited about it because we,\nwe build portfolios for people\nthat are very simple for them to explain to their clients.\nAnd this is probably our most simple strategy\nthat we've ever put together,\nwhich is it invests equal weight in the big three indices.\nSPY, the Dow, and then the Nasdaq 100,\nyou know, better represented by QQQ to equal weight exposure.\nRight.\nWe run our,\nour models over top of those three names.\nSo in periods of time,\nyou might get a value tilt and periods of time.\nYou might get a growth tilt.\nBut our big belief here is,\nwe're a, you know,\nwe're a low-vol manager and we're risk managers.\nAnd if things get ugly and volatile periods,\nwe have no problem moving into cash.\nWe're parts of the portfolio into cash,\nlike instruments or money markets.\nAnd so we want to give the advisor,\nan ETF option,\nboth for market cap weighted indexes,\nlike THIR is the index rotation.\nAnd like the other ETF THLV,\nwhich is an equal weight sector approach\nto kind of pair it along their large cap equity exposure\nand know that there are kind of true low-vol products\nthat can help turn down the volatility quite dramatically\nin periods of volatility.\nThe only reason we built the suite we brought it out to market\nis because traditional low-vol.\nI don't, I'm not picking on anybody,\nso I'll pick two,\nbut the two big titans,\nthe USMVs and your SPLVs,\nthe world.\nIf you look at 2020,\nif you look at 22,\nthey experience the same drawdown as the S&P.\nAnd that's not what people think low-vol is.\nLow beta.\nRight.\nTeams to be acting.\nBeta doesn't matter in our opinion\nwhen the market falls apart.\nIt seems that everybody dumps everything anymore.\nAnd so, that's really what the product is.\nCoruscited one.\nYeah.\nYeah.\nIt really turns into a correlation of one.\nAnd so, we, yeah,\nwe're excited about it.\nAnd hope to, we've had some success early.\nI think we've been out for 48 hours,\nnow there's about 17 million in there\nand hoping to get this thing\nshamanalong and yeah.\nSo we're excited.\nThat's really nice.\nSo let's say you're talking to a $2 billion RIA.\nIs this a six month buyer?\nOr does this earn a,\nis your hypothesis that it earns\nalmost quasi-permanent place at the $2 billion RIA?\nThat's generally 60-40.\nYeah.\nWe believe it deserves a,\nquasi-permanent place as a satellite\nto your large cap equity investments.\nAnd we think holding both makes sense\nbecause we're in a period now\nwhere, you know,\nmarket cap weighted indexes\nabsolutely below the doors off of equal weight.\nRight?\nBut even I both know that equal weight\nat some point will come back,\noutperform market cap weighted\nand kind of get that.\nSo I like both exposures,\nbut we like to kind of satellite it in there.\nIf you're holding SPY,\nif you're holding DIA,\nor if you're in the Vanguard suite,\nyou're just holding the S&P gear large cap,\nwhich a lot of people do.\nWe think it's a quasi-permanent holding\nto just bold on.\nI don't think timing our products is the right thing.\nBecause if you can time,\nthen you might as well do what we're doing yourself.\nI think the vast majority of the time,\nthe vast majority of the time\nour products are fully invested.\nSo it's not like,\nyou know,\nthese things are turning off the off switch a lot.\nThey're going to turn off the off switch\nwhen, you know,\nmarkets are going to go through that like,\nsnap drawdown 15,\n20, 25, 30 percent.\nThat's when you're really going to love us.\nIt sounds really cool.\nIt sounds, to me,\njust bringing back a sailing analogy.\nThis is good ballast sort of active ballast.\nAnd when you're,\nwhen you're, you know,\nS&P 500 exposure looks really top heavy with big tech\nthat your ballast can have a real stabilizing factor\nto the rest of the portfolio.\nRest of the equity beta.\nIt's exactly how we view,\nwe don't view us as a holistic.\nWe view us as,\nhey,\nblend us in with everything else that you're doing.\nWe fit nicely in a diversified portfolio\nand we can,\nyou know, these,\nthese models have been out since,\nyou know,\n2019 running in SMAs.\nAnd so we have some cycles in there,\nright?\nWe've got 2020,\nwe've got 2022.\nAnd they hold up well and do what they're supposed to do.\nSo I appreciate you,\nyou've flipping the script on me,\nbut we're going to go back to,\nOTCA because I have a couple more questions\nor we're coming up on time here a little bit.\nSo I want to make sure we,\nwe get to them.\nReally quickly,\nwe're going to talk about how you're,\nyou're running the screen.\nHow often are you re-running the screen?\nIs it an annual,\nis it an annual screen?\nIs it a month like,\nhow often are you kind of re-scrubbing your list?\nWeekly.\nWeekly.\nOkay. Yeah.\nAnd then weekly.\nAnd then, of course,\nwe look at prices all the time.\nYeah.\nAnd the fund is all cap.\nSo what is kind of,\nI know it can change,\nespecially with a weekly screen.\nIs there kind of a mix that you're looking to achieve\nin terms of small,\nmid, large cap?\nHow does the underlying kind of fit in,\nin that mix in your all cap portfolio?\nWell, it's, it's a great question and speaking of balance.\nI mean, we've had,\nit's been really good to own,\nwe talked about other risk premium.\nThere's a European risk premium right now.\nAnd so we own three of the European integrates.\nYou probably saw one of the,\none of the,\none of the big continental integrates\nabout two months ago talked about,\nactually listing on the New York Stock Exchange.\nAnd so with an all cap value lens,\nwe've,\nit's been really good getting some cheaper balanced\nfrom the European mega caps,\nwhich peranially traded 25% discount\nto the excellent US integrates.\nAnd the other cool thing about the value lens is,\nis look on,\nlook on Morningstar Pro,\nwho owns a lot.\nAnd there's a company called Oxy.\nWe don't own it.\nIt's no longer a value stock.\nAnd you look at all the,\nthe,\nthe one organization is buying it.\nIt's Berkshire Hathaway.\nAnd chase it up to about,\nI'm not sure what it is.\nMaybe 13, 14, 15 times price to forward earnings.\nAnd you see all the huge,\nall the large cap value managers,\ndodging cops,\nall the great ones go,\njust do this step down function.\nAnd because Berkshire Hathaway is so big,\nwhere do they have trillion dollars\nthat,\nanything they touch is no longer value.\nIt's a very,\nvery interesting dynamic.\nBut to your point,\nwe're sort of diagnostic is where we,\nwhere we lie in all cap.\nYou know,\nthere,\nthere really are a lot of opportunities.\nAnd speaking of all cap,\nand I asked you what your hypothesis was for\nTHIR.\nI think we've got more than a hypothesis.\nIt's not easy,\nbut it's simple.\nThere are 38 billion dollars\nof holders of the XLE.\nAnd the XLE,\nas you know,\nis the subset of,\nthat's been about 100 in energy.\nAnd Octa was built to be the little brother\nof your XLE allocation.\nAnd so we're talking to RAs now.\nThey've got big allocation to XLE,\nbecause they recognize\na systematic and structural underweight energy.\nAnd most of my career since 87,\nit's been between,\nlet's call it,\n6 and 16%\nof the SPW,\nin 1980,\nit was 27%.\nAnd today it's less than 3.7%.\nAnd you can't have a conversation on Wall Street,\nwithout talking about AI,\ndata centers.\nI'm sorry,\nthese things don't run in windmills.\nI'm sorry, you and they don't run in windmills.\nSo we need more and more traditional energy.\nI love nuclear.\nNuclear does not,\nit's not,\nit does not have a place in this portfolio now.\nHowever much I love nuclear,\nbut if you hate carbon in the atmosphere,\nyou've got to love nuclear.\nBut it's sort of a,\na long way of saying,\nthe opportunities are great,\nbecause we can't build big tech\nwithout cheap,\ndependable reliable energy.\nSo we think it's a nice tailwind for us,\nand the structural underweight is something,\nagain, a political,\na lot of people out there in RAA land,\nand even institutional allocator land,\nacknowledge they want to get that beautiful,\ncheap, bait exposure to US growth,\nthat comes with a cost,\nright?\nYou may have gaps in your portfolio.\nSo we don't think energies can add it.\nWe think it's fundamental,\nand we think that most people out there have a structural underweight.\nYeah, no, I agree.\nI was kind of reading some of that stuff on your website.\nI had questions about that,\nso I'm glad you touched on it.\nMy last question about the fund itself is,\nhow are you approaching kind of the weighting decision?\nIt doesn't look like it's pure equal weight,\nbut it looks like some of these are pretty close.\nSo I guess what's your methodology around portfolio weighting?\nYeah, that's a key question,\nand it's a big differentiator, again,\nto the actually,\nif I talk to somebody who owns actually the first thing\nout of their mouths is,\nyeah, we like it,\nbut it's 40% in two names.\nBy the way, there's a great names,\nbut it's 40% in two names.\nSo by design,\nwe have a 500 basis point initial position limit,\nand an 800 basis point limit,\nand it's not that we really want to be so equal weighted,\nbut if we're trying to approximate these big rich integrates,\nwe want a lot of micronutrients,\nand because also we're dealing in all cap,\nwe're going to get a lot of midcap and small cap names,\nand they're cost of capitals higher,\nand when crude gets ugly,\nwhen cost of borrowing goes up,\nthose are more volatile than others.\nSo we really did want to tamp down\nit used to be a synthetic risk,\nand by doing that,\nwe have the X ante limit of 500 basis points,\nwhen we put our new position.\nDoes that make sense?\nYeah, it makes a ton of sense.\nSo in the last one.\nYeah, well, so leg into something, right?\nSo the market could really hate something,\nit could really hate,\nlet's say, a midcap refiner for whatever reason,\nnone of us like to catch falling knives,\nbut with a value lens,\nwe can catch butter knives.\nA butter knife is,\nlet's put 75 basis points on.\nThis thing is going,\nthis thing's down,\n12% in a week,\nlet's put a 75 basis point position on,\nand then it goes sideways.\nLet's put another 75 basis points on.\nYou know,\nthe drunken mullers of the world,\nknow that you can leg into a position,\nas long as the market's agreeing with you.\nNow let's say we've got 300 basis points,\nit looks a little bit more bid,\nthen we can complete with the other 200 basis points.\nSo, and the flip side is true also,\nyou know,\nwe can let the market come to us.\nAnd what's crazy about the way the market's trading with,\nwith momentum,\nwe've own stocks in the separate account for the ETF,\nthat have reached like a little bit beyond our price target,\nwe've sold all of it.\nAnd I think,\nyou know,\nthe point 75 basis points,\nthen I think,\nyou know,\nthe point 72's in two sigma,\nget a hold of the momentum,\nand it goes up another 20% and you just sit there and say,\nwell,\nif we had a long short fund,\nwe'd probably be selling now,\nbut the market's so much fun every day's different.\nI know you know that.\nYeah,\nit's so David,\nI really appreciate your time.\nI thank you for being with me today.\nBefore I let you go,\nwhere can people learn more about the firm\nand learn more about the ETF?\nThank you so much.\nPlease go to our website,\nit's octane.nyc.\nYou can also find me on LinkedIn,\nDavid Allen,\nCFA,\nand pretty sure I'm the only one there.\nAnd got a couple of videos up there and\nstay tuned to the website.\nWe're going to add a lot more.\nAnd we've got some research coming out about\nwastewater and a permeant,\nwhich we think will be interesting news in the next week or two.\nThanks for having me.\nReally appreciate meeting you.\nYeah, thanks.\nIt's good luck with THIR.\nThank you so much.\nWe'll see you soon.\nThanks, Fred.\nThank you.\n"}
