{"transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology they are run on\nand you want more customization and flexibility, as well as a AI-driven model marketplace,\nUX wealth partners is your destination.\nOn top of that they have institutional trading, so if you are an ETF issuer or an SMA provider\nlooking for outsourced institutional trading, UX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and\nmake your practice more efficient.\nWelcome to Behind the ticker.\nToday we have on Joel Ben Wall.\nHe is a portfolio manager at Grimes and Company.\nWe are talking about a collaboration there and with little harbor advisors to launch\nthe ETF, the LHA risk-managed income, ETF ticker, RMIF, really.\nThis ETF was kind of originated out of the response to the post 2008 low-interest rate\nenvironment and they are looking for an alternative to core fixed income exposure.\nWhat they've come up with is a fully tactical and unconstrained approach to fixed income,\nlooking at positive trends in yield and price and really aiming to generate consistent\nincome while preserving capital and managing that downside risk.\nWithout further ado, please welcome Mr. Joel Ben Wall.\nHey Joel, welcome to the show.\nBrad, great.\nThanks for having me.\nSo before we get started, if you could, would you give everybody a bit about your background\nand how you eventually ended up at Grimes and Company?\nSure.\nYes.\nSo grew up in Southern New Hampshire, went to college down in Rhode Island and then\nmajor in finance and then my junior in college just started looking around for a job like\na lot of people.\nI knew I wanted to stay somewhat local to where I grew up and then interviewed for a bunch\nof jobs.\nGrimes was at a point where they were starting to hire and grow a bit more at that point\nin time.\nSo I interviewed, took the job as a research assistant back then and then sort of just\nworked my way up to portfolio and management where I am today.\nYeah, that's great.\nGood for you.\nSo I always liked to ask before we get into the nitty gritty stuff, the business stuff,\nin the ETF.\nWhat do you like to do when you're not behind the desk when you're not working?\nAny hobbies?\nYeah.\nSo I still probably against my wife's wishes.\nI still do play basketball, so I'm going to immense basketball league.\nSo I still enjoy doing that.\nThat's something I always did growing up through high school, recreationally in college\nand then still continue to do.\nThat's not as much as I'd like to, you know, a lot of my time these days, I have two\nkids and 11 year old in the nine year old.\nSo most of my weekends are found on a baseball field soccer field basketball court either\ncoaching or just watching them do what they enjoy doing, which is fun to see.\nYeah, that's great.\nI find myself spending too many hours on the soccer field even now as we head into\nfall.\nBut yeah, I mean, your wife has some merit.\nI don't know how old you are, Joel, but I mean, pick up racially basketball, screams, knee injury\nto me.\nYeah, yeah.\nI had a round number birthday this past March, so now that I'm 40, it's, I maybe\nshort lived, but I still enjoy doing it, so it's fun while it lasts.\nYeah, good for you.\nI was a hockey player and I, even into like my late 20s and early 30s, I said, I'm going\nto just, this, I'm going to be in the ER, it's probably better for me to just hang it\nup.\nYeah.\nThat's smart.\nYeah.\nSo why don't we talk about Grimes and Company, like as a whole, what's the firm's philosophy\naround investing?\nHow do you guys help in clients?\nYeah.\nSo we are, we're an RA, registered investment advisor, firm was founded by\nTim Grimes in the 80s.\nToday we managed north of $5 billion in total AUM have probably 55 or so employees, as a discretionary\nmoney manager, you know, we, for a lot of our clients, we managed balanced portfolios.\nSo we have stock strategies, we have 16 come strategies, we manage some alternative\nstrategies.\nSo, you know, we, we try to take for most of our clients, we try to take a holistic approach.\nSome clients will hire us just for one area and they've got other people that are taking\ncare of the other sides of their portfolio for them, but, you know, generally speaking\nfor a lot of our clients, we're trying to be holistic in nature.\nWe have a full financial planning staff in house that will do retirement income projections\nand things like that, and then we have a seven member investment team here that handles\nall the investment sides of the investments are centralized here at Grimes through my team,\nKevin Grimes is our president in CIO, so he leads, he leads my team, but we handle, so we\nhandle all the investment sides, and, you know, we have, you know, clients from individuals,\nfoundations and dominance, things like that.\nThat's great.\nAnd so you guys are actually acting as sub-advisor for another firm called Little Harbor\nAdvisors on this particular ETF, which we're going to talk about, which is the Little\nHarbor Advisors or LHA risk-managed income ETF.\nBut can you speak about their firm at all?\nI was on their website, it looks like they do some cool stuff, almost.\nLooks like it's a fully tactical investment, sub-advisory firm or model delivery, can you\ntalk about their firm at all?\nYeah, so Little Harbor, so they're geographically there, somewhat close to us.\nWe're both in Massachusetts, they're, they're headquartered up in Marblehead, which is\nabout an hour away from where our office is.\nBut we were, we were connected with them internally, somebody that works here, had connected\nwith somebody at Little Harbor, and, you know, one thing led to the next, they just started\ntalking about their investment philosophies.\nSo, you know, what they have, they've had some tactical equity ETFs in the marketplace\nfor a little while, and they were, they were looking for somebody to tactically manage something\non the fixed income side for them.\nAnd we've had a tactical fixed income strategy for 12, 13 plus years that we've managed\ninternally in client accounts.\nSo, you know, that's, that just lended itself to, you know, they were looking for a sub-advisor\nto launch a tactical fixed income ETF.\nWe had a strategy that we were doing, so it's just natural, I think, made sense for us\nto partner, up and, and do that together.\nYeah, no, it's, it sounds great, you're actually, I think this is probably, by time we're\ndone getting all the episodes out, episode 60 something, but this is the first sub-advisory\nrelationship that we've had on the show.\nSo, if you, if you would, can you talk about kind of how the relationships and general\nresponsibilities work between, you know, what is LH, what is LH, HA have to do, and kind\nof what is your responsibility as sub-advisory?\nYou're just passing on investment allocation, and they take care of the rest.\nI mean, can you talk about how that sub-advisory relationship works?\nSure, yeah.\nSo, I'm sure every relationship is slightly different, the way that we've worked with\nLittle Harbor is, you know, but before the ETF was launched, all the set-up legal, all\nthat stuff was handled by Little Harbor, there were certainly areas where we had to get involved\nbut Little Harbor, so they, they largely handled the set-up of the ETF pre-launch, you know,\nthey set up their arrangements with, you know, AP's market makers, trading firms, things\nlike that.\nReally, all, all we've had to do by and large is just managed the portfolio.\nSo, you know, when, when there are trades that we have to do, you know, we are leveraging\nLittle Harbor's trading relationships to execute the trades that we need to do.\nWhen Little Harbor does marketing efforts that they want to loop the portfolio management\nteam in on, we'll do, you know, webinars, zooms, things like that with Little Harbor, you know,\nLittle Harbor handles the distribution, so they've, they've got marketing folks that are\nout there telling the story.\nSo, from, from our standpoint, you know, it was really our investment team here at Grimes,\njust continuing to do what, what we're doing in many of our client accounts that utilized\nthis strategy, just just in an ETF wrapper, which was unique to us and something we hadn't\ndone up until that point.\nWell, let's talk about the ETF, which is the ticker's RMIF, which, again, is the LHA risk\nmanage income ETF, before we kind of get into the nuts and bolts, just like a high level,\nwhat is this fund really trying to accomplish?\nYeah.\nSo, we're really, with our risk managing income strategy, we're really trying to accomplish\na few main things, you know, we're trying to generate a reasonable level of yield for clients,\nwe're trying to do it while managing the downside risk or preserving capital, and we're\ntrying to do it while also maintaining daily liquidity.\nYou know, the strategy itself, really, it sort of was something that we came up with after\nthe global financial crisis in 2008, so at Grimes, you know, for 20 plus years, we had been\nflattering out high quality individual bonds for clients, and that worked really, really well\nfor a long time, and, you know, once we entered the post global financial crisis period,\nright, interest rates, interest rates had bottomed out, and, you know, we were just sitting\naround looking and saying, okay, where can we generate a reasonable level of yield for\nclients while still offering the stability that you would expect from the fixed income\nside of your portfolio, because it was very challenging to do after 2008 just because rates\nwere so low.\nSo, you know, we spent really, you know, a good part of a year, a year and a half developing\nwhat ended up being the risk managing income strategy, and, you know, the idea was to try\nto find something that could behave like fixed income had on a go-forward basis, you know,\nand that's really what, where RMI was sort of born way back on.\nSo, you know, it appears that the fund is using some sort of momentum based or price-based\nsignal to kind of derive risk on risk off on all the underlying holdings.\nCan you talk about some of those factors that come into play in order to make those decisions?\nSure.\nSo, really, you know, we are, we're really looking at a couple of different things.\nThe big things we're looking at are where price trends, where's volatility, and then\nfrom there we're looking at what the yield profile of certain areas that come through\nthose filters are.\nSo, at the highest level price trends, you know, it's not a momentum strategy, per\nsay what we're, what we're not doing is looking for things that are going up the most.\nIt's, you know, at the end of the day, this is a fixed income strategy, what we're trying\nto do, all things can all things equal or trying to do is just generate yield, right?\nYou know, what do people expect out of their fixed income portfolio?\nThey expect to earn some income and have it act as a balanced one when volatility picks\nup, typically on the other side of the portfolio on the equity side.\nSo, you know, we're looking at where price trends, if price trends are positive, we just\nwant to maximize the yield that we can.\nSo, it's a fully unconstrained strategy.\nWe can be 100% in any one area.\nWe can be 100% in high yield, bank loans, merger market debt, preferred stock, 100% in cash,\ndepending on what's going on in the market.\nSo, it's fully unconstrained.\nWe're really looking at, you know, our trends positive or negative, if trends are positive,\nshow us the things that have the highest yield and that's really just how we're building\nout the portfolio.\nSo, you mentioned, you know, the unconstrained nature of the strategy.\nCan you talk about, like, mechanically, what happens during periods of change in trend meeting?\nHow does asset allocation change if everything is, you know, in positive trend?\nWhat happens if there are things, you know, you're getting, you know, mixed signals,\nsome things are in positive trends, some things are in negative or everything's negative.\nCan you just talk about mechanically, what did investor would expect to see at certain\nrebalance periods as, as price trends change?\nAbsolutely.\nYes, so, you know, it is a tactical strategy, but internally we say that the goal is not\nto trade.\nIt's, it's not a very high turnover strategy.\nYou know, if trends are positive in some of our higher yielding areas of the market, like\ndomestic high yields, then we'll continue to own that until either the volatility in\nhigh yield picks up such that we have to start de-risking the portfolio or if the yield\nprofile and the market changes that something else might overtake it from a yield stem\nfund.\nI think a good, a good recent, you know, point to make there is, you know, over the last\ncouple of years, things like bank loans, you know, bank loans have relatively high yields\nto them and when interest rates, pick up the yields that investors receive in those\nbank loans go up with it.\nSo, you know, bank loans have been an area of focus in the strategy for the last couple\nof years, whereas historically they had not played a huge role.\nSo, you know, what we try to do with the strategy is cast a wide net.\nThere's, there's definitely areas of fixed income that will not be owned in the portfolio\nfor an extended period of time, just depending on what the yield of those underlying investments\nare or what the volatility profile of that particular segment within fixed income is.\nBut so, if, if price trends are stable, we're going to look to maximize yield when volatility\nstarts to pick up in the market, you know, if you see credit in fixed income start to\nact more volatile, the portfolio will start to de-risk depending on how severe the, the\ndrawdown would be on the credit side using high yield.\nFor example, we could de-risk completely to a safer area, it could be cash, it could\nbe high-quality fixed income, things like short duration treasuries, things like that.\nIt really depends every market's going to behave slightly differently.\nThere's been markets in the past where we've started to de-risk only for the volatility\nto fade and we start putting physicians back on.\nThere's, there's been periods like 2022 is very bad for fixed income where trends were\njust negative everywhere, so we owned cash for an extended period of time.\nTypically, I would say over over the life of this strategy, the tip of this, the portfolio\nis usually more invested than not, and it's typically tilted towards some of the higher\nyielding areas of the market.\nWell, so let's stay on on the, because I kind of looked at one of your, your white papers\nyou bring up this process, this yield ranking process.\nSo, after everything you've just said, help me make sure I understand is you're looking\nat the universe of fixed income, if the price trends of, you know, those underlying fixed\nincome investments are stable or good, you're then going to buy the highest yield or\nfavor the highest yielding investments, is that about the simplest form or is there more\nof a science to it?\nYeah, no, if, if trends are positive, we're just going to look, so the underlying portfolio,\nso within the ETF, it's an ETF of ETF, so the underlying investments are\nETF, so what, what we're doing is we're looking at the yields of the underlying ETFs,\nif if price trends are positive, we're ranking that by yield, it's, you know, it's a bit\nmore nuanced than that, but at the highest level, it's, it's as simple as that, if trends\nare stable, show us the highest yielding areas, and that's where we're going to put\nthe portfolio.\nSo, about how many ETFs are in the portfolio at any given time, and like how are, when\nyou get to that number, you know, how are waiting decisions determined?\nYeah, so the underlying investments are equally weighted, so right now we own, there's\nfive positions in the ETF, so each ETF's 20%, and, you know, of those five ETFs,\nthree of them are in one area, and that's bank loans right now, and there's two positions\nin high yields, some short duration high yield, so, you know, when, when we think about\nthe ETF sizing, it's, it's really, we're sort of thinking of them as buckets, so when\nthe portfolio puts risk on and takes risk off, we want it to be done in such a manner that\nthere's not a ton of turnover within the strategy that has to happen when we're doing that,\nso typically, or up until, you know, we've, we've always had the allocations to be similar\nto right now, it happens to be five funds, you know, when we first started this strategy\nyears ago, it was, it was four funds, so it was four funds at 25% now it's five funds at 20%\nso that the number of funds over time will, will likely change just depending on some underlying\nfactors, things like the liquidity of the underlying ETFs and things like that, but from a portfolio\nmanagement standpoint, we've, we've made the decision that keeping them the underlying ETF\nposition sizes equal just allows us to move the portfolio a little bit more efficiently when,\nwhen the markets are moving. Yeah, so you said something interesting there, like three of your\nfive or in one area, do you have any guardrails around, like, over concentration, like, is there a\nmaximum number of ETFs that can be in a certain space, or does it not matter to you, yes?\nSo, so for this strategy, it doesn't matter, so that, you know, it grinds, we manage, you know,\nmore fundamentally rooted, fixing, come strategies and for things like that, I think for strategies,\nlike those were were much more mindful to some traditional diversification approaches that\nthat many people have for this particular strategy, because it's, it's tactical and can\nde-risk pretty quickly. For, for that reason, we allow the strategy to be more heavily concentrated\nin any one area versus if it was more fundamentally rooted. And is the strategy, like, completely\nactive, you can make a trade any day, any time, or do you have it on, like, a rebalance cadence,\nwhether that's, you know, weekly, monthly, whatever it is? Nope, so we can trade, you know,\nwe can trade whenever the markets tell us that we need to trade is the best way that we\ndescribe it. So, as, as an investment team, we sit down every Monday and do a quote-unquote\ndeep dive into the signals just making sure that the portfolio looks good, everything still fine,\nand then we've built dashboards internally that allow us every day to monitor the portfolio in real\ntime, and if, you know, if something were to happen midweek and we were to see a spike in volatility\nin one of the positions that we own, and we had to trade on Wednesday, Thursday, Friday,\nwhatever the case may be, we certainly have the ability to trade whenever, but it's a weekly,\ndeep dive, and then from there, it's daily monitoring of the, of the underlying positions that are\nin the portfolio. Got it, and of course, it's an income targeted portfolio, like, so how often\nyou guys click and kick and off distributions, and I know that it's going to be very, it's going to\nbe variable in terms of what that distribution is going to be given the active nature of the strategy,\nbut, you know, do you guys have internally, like, any sort of, like, target or is just the highest\nlevel of income given what the market is giving to us today? Yeah, so the, the ETF, so RMIF pays out\nincome monthly, and that's going back to some of the, the underlying responsibilities of us versus\nlittle harbour. So, it's a little harbour is tasked with figuring out the income and paying it\nout of the ETF. The, the underlying ETFs within RMIF obviously pay dividends, most of them pay monthly,\nthe cadence is to which each of them pay a differ based on which date the, the fund families pay them out.\nBut, yes, little harbour every month, little harbour will figure out what the income level was\nand, and they'll pay it out to shareholders. As far as a target yield, we don't, you know,\nwe at the portfolio and management level don't set a target yield obviously, you know, yields are\nvariable depending on the environment. I, you know, from an absolute standpoint yields, you know,\nyields are going to be higher today or a year ago than they would have been at, you know,\nany point in time, five or 10 years ago. So, so the yield profile largely depends on the,\nthe underlying fixed income environment and, and the other, the other thing that's complicated with\na tactical strategy, if we were to have a yield threshold that we were trying to meet is,\nwhen the portfolio derisks, if the portfolio were to derisk in be a hundred percent in cash,\nfor example, like it has been at points in time, you know, money markets have yield today,\nwhich is great. But, you know, if you think back to much of the last 10 or 15 years,\nmoney market rates were zero. So, when we would have to derisk in the past, you know,\nit was one of those things where we were accepting the trade off of zero yield versus losing\nprinciple in some of the fixed income areas that were that were going down in value. So,\nwith yields, with yields low, you know, if you get a credit event or you get one of these\ndig duration moves that can happen quickly in these markets, the price move can easily overwhelm\nthe yield that you were receiving in that particular investment. So, so there were plenty of\npoints in time where we were just opting for the safety of cash, even though it had no yield\nbecause it wasn't going down in value. So, so for those few reasons, we don't set a yield\ntarget per se in the strategy, but it has been somewhat consistent over the life of the\nstrategy, even though at any point in time it may not exactly be, you know, what people would\nwant it to be over a full market cycle. Sure, understood. So, if I'm a financial advisor,\nI've got an already diversified model portfolio. Like, where does RMIF like fit inside that portfolio?\nLike, where would you slot it? What would you maybe, what holding would you maybe replace in order\nto add this to the portfolio? Like, how do you think about portfolio construction using this?\nYeah. So, I think there's a few unique use cases for it. So, going back to the history of\nRMIF and when we built it. So, when we built the strategy in 2010, 2011, you know, we,\nwe were trying to look for something that could replicate the yield and volatility profile of\ncore fixed income. So, at the time, we, we were sort of thinking it as a, you know, maybe not a\nfull blown replacement for core fixed income, but something that would behave very similar to\ncore fixed income. So, so that was, it was sort of built with that use case in mind.\nHaving said that, I think where, where we've seen some good applications of the strategy is\nas a conditional credit type investment. So, with yields back to, you know, reasonable levels these\ndays, you know, there's, there's plenty of use cases for the traditional core fixed income,\nyou know, lettering out high quality bonds at this point. So, where RMIF could also be slotted in\nis as conditional credit. So, if you've got a portfolio of traditional core fixed income,\nyou know, you could use this strategy as your conditional credit. So, when, when, you know,\nthings are good in the credit markets and volatility is low, it's going to be invested in some\nof those higher yielding segments for you. And, but you also know that if volatility were to\nstart picking up in the markets that the portfolio is going to shift. So, so those, I think, are some\nthose are the two big use cases that that I think we see for the strategy these days.\nYeah, no, I would agree. Well, Joel, I really appreciate you taking some time with me to talk\nabout this today. Before I let you go, can you tell people where to find more information about the fund\nand, you know, Grime and Grimes and Company and also little hardware advisors? Sure, I think if you\nhave, you know, for people looking for more information on RMIF, you can contact the the folks\nthat little hardware advisors, you know, their, their contact information can be found online,\ntheir, you know, they've got, they've got a staff of marketing distribution sales people that\nthey can handle any questions for you. They also schedule periodic webinars with us at Grimes\nand we do sort of a deep dive walking through the process. So, I think they would, they would be the\nbest place for somebody to start that's looking for more information on it. It's great.\nWell, again, Joel, thanks so much for your time today. Appreciate you being with me. Great. Thanks, Brad.\n"}
