{"transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology, they are run on and you want more customization and flexibility.\nAs well as a AI-driven model marketplace, UX wealth partners is your destination.\nOn top of that, they have institutional trading.\nSo if you are an ETF issuer or an SMA provider looking for outsourced institutional trading,\nUX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and make your practice more efficient.\nWelcome to Behind the ticker.\nWe are live from the ultimate client summit down in Texas.\nAnd I have the pleasure of catching up with the handful of people there.\nBut today we have on Petra, Bacca Silva.\nShe is from Hall Tactical and we are talking about their Hall Tactical asset allocation ETF.\nWe have ticker HTUS.\nThis is an active strategy using 40 different indicators in order to create a hedge fund like product.\nAlthough the returns I would say are really appealing compared to a lot of hedge fund replication strategies.\nThis is a pure tactical strategy I think definitely has merit for you to take a look at.\nSo we talk about the details, nerd out a little bit on some of the indicators on how the product works.\nBut without further ado, please enjoy this episode with Petra Bacca Silva.\nHey Petra, welcome to the show.\nHi Brad, thanks for having me.\nSo before we get started, why don't you tell everybody just a little bit about your background and how you got into your current role today over at Hall?\nSure sounds good.\nSo my name is Petra Bacca Silva.\nAnd right now I serve as the CEO of Hall Tactical asset allocation, who is the advisor to the HTUS ETF.\nAnd funny enough, last week I actually celebrated my 10 year work anniversary with Hall.\nSo I've been there for a long time.\nSo if you're doing the math about my 10 year and the length of the fund,\nlife, you will know that I've been there since before the fund has launched.\nAnd so if we take a step back about how I ended up at Hall, before Hall I worked for two different trading property trading firms in Chicago,\nmy background was in Applied Math.\nI got a financial mathematics master's degree at the University of Chicago, and then two trading firms later.\nI'm not saying I wasn't excited about high frequency market making,\nbut I was looking to do something a little bit different,\neven though Hall initially hired me to work for their property trading market making operation.\nAs soon as I started, there was this project that was sort of on the side.\nThey had this ETF that they wanted to launch.\nAnd they were not sure if it was going to get approved.\nAnd then about two months after I started, we got approved.\nAnd then so things got real.\nOkay, so now we're launching this ETF and they needed some people to work on it.\nI was the new quant, so I was like raising my hand trying to get a little bit of profile.\nAnd then 10 years later, I'm still working on this fund.\nOh, that's great.\nYou and I have similar backgrounds.\nI did the high frequency thing for a little bit.\nI don't think I've ever been so stressed out in my life,\nbecause everything moves so fast and you're constantly keeping an eye on everything.\nBut before we kind of get into all of those all the stuff and all the things you do at Hall,\nI always like to ask people any hobbies outside of work.\nWhat do you like to do when you're not working?\nI am a huge triathlon, not so I could spend the next two and a half hours talking about triathlon,\nso please don't let me go there.\nI think I could do the running and biking parts.\nThe swimming part is not for me.\nI mean, that's kind of where I am.\nI do not have a swim background, but I'd like to think I'm getting better,\nor at least that's what I tell myself.\nNo, that's great.\nSo let's talk about Hall as a whole.\nI know that there's a really unique and interesting background to the firm.\nSo what all do you do for clients?\nHow do you help clients?\nAnd kind of secondly, can you talk about the firm's founding?\nOkay, yes, so maybe let's start with a little bit of our story.\nAnd I think the story will explain a lot about our investment philosophy,\nand it will explain a lot about why the fund looks the way it looks,\nand how we go about running it.\nSo if we go, you know, we're named whole tactical asset allocation.\nAfter our founder, Blair Hall, who most of your listeners would probably know\nas a, you know, market wizard, one of the most famous options traders of all time,\nbut what they may not know is that before he was a famous option trader,\nhe was a blackjack player.\nSo his, you know, he describes it as his first investment experience,\nwas in casinos, counting cards at blackjack tables,\nand would thus translate into what we do now.\nI mean, there are a couple principles that his team embraced.\nSo one of the principles was,\nmake a lot of bits.\nThey would play 60 hands every hour,\nand they would play, you know, just hundreds and thousands of hands per weekend.\nAnd so bet often, bet proportionally to your advantage,\nso as they would count the cards,\nthey would sort of have a better idea about what's remaining in the deck.\nSo as the advantage grew, they grew the size of their bets,\nand then the third main principle will stay in the game.\nSo don't blow up, stay disciplined.\nAnd I think we sort of embraced all of the three principles with the firm,\nand with the fund.\nSo we do bet often.\nWe rebalanced the portfolio once a day,\nand then we do bet proportional to our advantage.\nAnd once we go more into what's under the hood,\nI can talk more about like how we estimate our advantage on daily basis,\nand then third, you know, staying the game.\nSo risk management is a big part of what we do,\nand what we pride ourselves on.\nSo even though like our strategy includes futures and includes options,\nI do think one of our key advantages is our experience in risk management.\nWell, I mean, first of all, I like Mr. Hall already.\nIt sounds like a fun way to kind of get started.\nI love Blackjack, but I'm not a card counter,\nso they still let me in the casinos.\nThe other thing too, you know,\nI really get interested in tactical funds.\nI think the science and the mathematics behind trying to build models\nis really cool.\nSo, you know, the fund, which we're going to talk about at length,\nlength today, HTUS, has a really impressive track record.\nAnd I want to say, you know, say that publicly because when I looked up the fund,\na lot of these long short tactical funds don't have impressive track records.\nAnd so you guys have done a wonderful job.\nSo, can you kind of walk us through the key components of the investment process\nand what really makes your approach unique?\nAbsolutely.\nSo, I think, you know, what we do, and we're open about it,\nyou know, there has been a stigma with market timing,\nand we're openly admitting to market timing,\nor tactical asset allocation, if you will.\nSo, basically, but before we do that,\nwe start with the understanding that it is good to have a US equity exposure.\nSo, I think this is like a pretty well-accepted fact,\nif you will, in the investment industry, and we agree with that.\nSo, basically, we collect about 40 or so different\npublicly available indicators, and then we combine these indicators\ninto different models, and evaluate what we think the market is going to do.\nBut on average, if our models don't give us a strong signal either way,\nwe will be 100% invested in the S&P 500.\nSo, our co-explicory exposure will be by an old.\nAnd then, if we start getting signals, either bullish signals or berry signals,\nwe will deviate from this 100% exposures.\nFor example, today we're 93% long, and we can talk about, you know,\nof the indicators, are giving us berry signals to get 293%.\nOn other days, we might be 120% long.\nSo, the fund does have a pretty long leash,\nin theory, we could go up to 200% long,\nand we could go completely flat, we could go short.\nBut if you look at the history of our signals,\nand we do publish our weights on our website,\nwe rarely get outside of the 50 to 150 range.\nSo, I saw, when I was kind of mulling around your website,\nI saw the sediment indicator on your website.\nSo, does that sediment indicator direct correlation\nof the S&P exposure that you want to hold?\nOr how does that kind of play into the investment process?\nYes, yes.\nSo, would we publish on the website as the sentiment meter?\nThat is basically our recommended exposure to the S&P 500.\nSo, that will update once a day.\nOnce we update all of our signals with, you know,\nmost recent market data.\nSo, your signals, so, let's go backwards a little bit.\nSo, you're taking many different indicators.\nYou're combining them into a single signal,\nor are you looking, or are you combining maybe\ntronches of them and have multiple signals?\nOh, is it a multifaceted decision-making tree?\nOr do you basically have one signal that spits out\nthat says, okay, this is the exposure we want to take?\nSure.\nSo, we can start starting at the top.\nSo, if we're 93% long today,\nthat number came out of an ensemble of four different models.\nSo, we do have four different models under the hood right now.\nAnd sometimes, you know, we develop new models\nand weight them differently.\nSometimes, we merge two models into one.\nBut, basically, what goes into the models,\nI've said 40 or so indicators,\nand broadly speaking, you can categorize them into four categories.\nSo, we would have macro indicators.\nThese would be things like inflation, unemployment.\nWe would have fundamental indicators.\nSo, 40 S&P 500 universe,\nwe aggregate earnings,\nwe aggregate dividend yields,\nor totally yields,\nwhen we add up dividends and buybacks,\nor indicators like book to price.\nAnd then the third categories will be called anomalies.\nAnd these would be all the technical indicators,\nseasonal indicators,\nthings that don't really have economic explanation,\nbut they have just worked for, you know, four or five decades.\nAnd then the last category would be sentiment.\nSo, we do have some access to sentiment surveys.\nWe use whole bird survey.\nWe use net Davis as one of our sentiment providers.\nWe work with a firm called MarketSyke.\nThat aggregates both like social media sentiment\nand the new sentiment,\nso that's kind of the fourth broad category of indicators.\nAnd then the reason why we don't have everything in one model,\na lot of these indicators work for different horizons.\nSo, like, for example,\nif you look at some short-term change in sentiment,\nor short-term change in volatility,\nor some kind of a complex interaction of a recent market move\nand volatility move,\nthat may give you a really good insight about what's going to happen tomorrow.\nIf you're looking at things like inflation,\nor if you're looking at, you know,\nsome of these like valuations ratios,\nthey offer more information about what might happen over the next six months.\nAnd if we try to just throw everything in one model,\nwe may not get the type of smooth and reasonable contributions that we want to see.\nYeah, no, that makes a ton of sense.\nSo, just staying on this for a little bit longer,\nso I would assume each of those four models have a weight given to them\nbased on what you guys want to accomplish.\nAnd so, do you ever change those weights\nor have you kind of gone back in history and figured out\nlike the robustness of each signal and what you're trying to accomplish\nover the long-term or is that something that, you know,\nyou're continually optimizing or looking at tweaking?\nSo, this is an evolving process.\nAnd the weighting these models is like every portfolio manager could tell you\nthat's kind of one of the bigger challenges\nbecause, you know, even though some of these indicators may have\n50 years of history, some of these indicators may have five.\nAnd some of these models may have, you know,\na 20 year back test, but even the back test,\nlike you always take every back test with the grain of salt.\nSo, like then we have traded history,\nso, you know, giving the constraints of the data\nand giving the constraints and the belief we have in the data,\nit's kind of a blended process.\nSo, we will calculate the optimal weights, you know,\ndoing some kind of a Markowitz portfolio optimization\nand we'll calculate optimal weights using some kind of\na utility function and grid search algorithms.\nAnd at the end of the day, you know,\nwe have an investment committee that gets together\nand looks at all these optimized weights versus what we have now\nand makes a decision about whether or not to make a change.\nOkay, great. So, that was going to be one of my questions.\nLet's talk about that.\nSo, it sounds like almost everything you do\nis completely computer-driven.\nHowever, at the end of the day,\nthere is an investment committee that says\nwe are willing or not willing to maybe\nchange the weighting of our models.\nYeah, and I think that's, you know,\nI would say, like,\nin the perfect world,\neventually we will gather more and more data points\nand we will have more and more like true\nout sample results in the decisions of the\ninvestment committee will deviate less and less\nfrom what the model recommends.\nAnd I wouldn't say, like, we deviate a lot.\nThis is more.\nI would say it's more of like,\noperational risk level in terms of,\nokay, so are we suspecting that, like,\none of the data sources might be bad?\nAre we suspecting that, you know,\none of the signals might be deteriorating?\nSo, we try not to, you know,\nput in our opinions.\nIt's meant to be more of like a risk management layer.\nYeah, no, I love it.\nAnd I think Quant works best when you have\na little bit of oversight,\ninstead of just like letting it run wild.\nSo, I thanks for sharing all that with me.\nIt's super interesting.\nSo, let's talk specifically about HTUS.\nI mean, we've talked about the investment\nprocess behind it, but like,\nat a high level,\nwhat is the fund really trying to accomplish\nor deliver two investors?\nYeah, so basically our investment premise,\nand so our goal is we say,\nwe aim to outperform the SNP500\nwithout exceeding the volatility of the SNP500.\nAnd that's where we see ourselves in clients portfolio.\nSo, almost everybody who has any kind of\ninvestment portfolio in the US\nwill have exposure to the SNP500.\nAnd basically what we're saying is,\nyes, it's good to have the\nexposure to SNP500,\nand we also think you can do a little bit better.\nSo, maybe take away a little piece of your SNP500\nexposure and give it to the HTUS.\nAnd you will have a very similar experience,\nhopefully somewhat more enjoyable experience\nwith our fund in your portfolio.\nSo, it kind of kind of talking about the process,\nyou know, you answered a lot of my questions,\nbut like, given HTUS,\nand we know like reading and you had said,\ncan take long and short positions.\nSo, when can you talk about the portfolio mechanics\nof when you are getting short\nand there is volatility?\nLike, what is the fund investing in?\nSo, I don't want to make an assumption there.\nAre you options, futures?\nLike, how are you setting up your short positions?\nYes.\nSo, generally speaking, we will only hold\na very few different assets,\nso we will have cash or cash instruments.\nSo, things like money market funds or t-bills.\nAnd then we will have the spy ETF.\nI have to give us SNP500 exposure\nor any futures that also gives us SNP500 exposure.\nAnd then blended with our core market timing strategies.\nWe also have two options strategies,\nwhich will invest in SPX options.\nAnd those will be anywhere from zero DTE\nto about a one month expiration.\nSo, is your short exposure?\nAre you ever taking long term short exposure\nor meaning like you're taking a cycle bat?\nOr is the fund going to be short\nand like very little windows?\nSo, one of the components that goes into the ensemble\nis a six month equity risk premium model.\nSo, in theory, a six month equity risk premium\ncould have a bearish view\non what happens over the next six months.\nSo, we could be on average under invested\nfor as long as that model is giving us a short exposure.\nSo, if you're sitting down with an advisor\nand you're trying to get exposure to HTUS\nand how are you positioning it?\nLike, how are you explaining it to an advisor?\nBecause it seems complicated, but it really isn't.\nAt the end of the day, meaning everything you do back here\nis complicated, but the deployment of the strategy\nis quite easy to understand.\nSo, how are you kind of explaining it to advisors\nif you're sitting down with one and where are you\nadvising that they kind of put this exposure\nand how much?\nAnd I know that varies, but just general.\nYes.\nYeah, generally speaking, again, we're going to the advisors\nand basically the three use cases\nwas actually seen from advisors for HTUS.\nOne was, you know, people are just looking for\ndifferent alternatives to the, you know,\nlarge cap core ETFs.\nPeople are asking, okay, is there something other than\nspy I could be buying?\nAnd some advisors might be interested in offering\nthis as an alternative.\nThe second option is a lot of clients\nare interested in these quantitative strategies.\nThere is a segment of clients who are interested in,\nyou know, it's in terms of like the research under the hood,\nbut this is a hedge fund style strategy.\nLike we are closely tied to the SNP500,\nso we're not an absolute return hedge fund,\nbut in terms of the data we analyze and the techniques we use,\nthis is a pretty sophisticated strategy.\nSo a lot of clients are interested in that,\nand especially if we can offer it an ETF wrapper\nfor ETF style fees, that is a very interesting proposal\nfor a lot of advisors.\nAnd then as an active fund,\nwe actually do end up paying out a lot of our,\nor most of our gains in form of dividend.\nSo that's both a warning for a lot of the advisors,\na fair warning, you know,\nif you have clients in that tax shelter to counts,\nthey will be incurring potentially large dividends every year,\nbut for some people who are in tax shelter to accounts,\nor people who are seeking income,\nI've heard people be interested in this strategy\nfor that specific reason.\nSo I should have asked this earlier,\nis this strategy only available through the ETF,\nor do you have SMAs?\nDo you guys offer,\ndo you sell research?\nDid you have a hedge fund at one point?\nOr do you still have one?\nWe never had a hedge fund.\nWe sort of have a SMA program.\nWe open the SMA program to potential large clients,\nbut our number one focus is the ETF.\nGot it.\nSo with the ETF, you know,\nit's one thing to have phenomenal returns\nand awesome story.\nWhat is your strategy going forward\nin terms of continuing to grow the fund,\nmarketing distribution?\nWhat are your strategies or how are you thinking about that?\nSo there's a few different strategies.\nSo one of the strategies is just telling the story.\nAs we both know,\nmarket timing has had some stigma against it\nin the previous years,\nand we're sort of telling the stories like,\nokay, there's a difference between what people did\nand what we were doing now.\nIn the seven, these people thought you could just beat\nthe market with one indicator,\nand we're saying you can.\nThis is why we have 40s,\nand we call them micro-alphas,\nbecause we think, okay,\nthey give you signals,\nbut individually,\neach of these signals is very weak.\nSo that's why we need all these sophisticated\nmodeling techniques to actually extract\nthe information in some kind of a robust way.\nSo part of it is just explaining what we do\nand educating advisors and working with advisors,\nso that they can explain the strategy to their clients.\nAnd sort of the second,\nyou know, big focus for us is continual research.\nSo like we don't think we're done.\nWe don't think the strategy five years from now\nwill look the same way as it looks now.\nWe want to add, you know, more signals,\nmaybe, you know, kind of going back to like one of our\nprinciples, bit more often.\nLike can we find signals throughout the day?\nCan we rebalance the portfolio throughout the day\nand generate additional return?\nSo, you know, we sort of understand the limitations of this approach.\nAs much as we're excited about how we have done,\nwe do think there's room for improvement.\nWe want to get to a point where we're outperforming the SNP 500,\nyou know, as often as we can.\nSo the continual research is the third approach,\nand then, you know, hopefully, you know, we just started\nas some distribution marketing efforts earlier this year.\nSo, you know, we're excited about that,\nand we're hoping to grow the ALM.\nSo continuing to talk about like that development.\nHave you guys started down the AI path yet?\nAre you considering the AI path yet?\nWhere are you in that lifecycle?\nSo we've always been sort of on the AI path,\ndepending on how you define AI.\nThere's some conversations with a few folks at this conference,\nand it's really interesting because depending on who you ask,\nlike, you can get really extreme.\nSome people will say, okay, AI is just large language models,\nand everything short of that is not AI,\nand some people will take you to the extreme\nand say, like, an Excel macro is AI.\nSo, I'm sort of laughing because, you know,\nit's about everybody's definition,\nbut, you know, we have been sort of the machine learning realm,\npretty much since inception of the fund.\nWe have always gone past of, you know,\nsimple regression approaches,\nand we have explored, you know,\nregularized regressions along lassoes.\nWe have always looked into Kenya's neighbor's models,\ntree models and neural nets.\nSo we're definitely going down this path\nof these like nonlinear kind of black boxy models.\nAnd then, you know, obviously,\nsome of the social media data that we get\ndigested by our partners.\nI'm sure that use LLMs to analyze their data.\nYeah, it's funny.\nIt kind of goes back to, you know,\nthe point you made earlier where, you know,\nany given signal,\nthere's no perfect signal, right?\nAnd there's people out there in the AI space right now,\nwe're starting to see, you know,\nthis wave of AI fund starting to be launched,\nand, you know,\nsome of them are just sentiment only, right?\nThey're only looking at social sentiment,\nand they're making bets,\nhow many of them are, you know,\nfractal speckling and pattern recognition.\nOnly, and that's only what they're looking at.\nSo I think your approach is really interesting.\nI really,\nI've said it once and I'll say it again,\nyou know,\nthe people who listen to the show go back\nand take a look at the track record\nbecause it is very impressive.\nAnd so with that being said,\nI really appreciate your time with me.\nBut before I let you go,\nwhere can people learn more about,\nyou where can people learn more about Hall and H2US?\nAbsolutely. So I would say, come talk to us. And we have two websites. We have the\nfun website, www.autacticalfunds.com or the advisory website,\nwholetactical.com. We do have a somewhat active Twitter page. We've been blogging a lot\nthis year. So we probably put out a blog about once a week. So if you want to\nunderstand a little more about like what's going on inside our heads, that's a good\nplace. And then reach out. So you'll find our contact info. Give us a call, come\nsee us. We're in Chicago. We're always happy to talk. We will never get bored of\ntalking about the strategy. So we would love to talk to your listeners. Well,\nPatrick, thank you so much for spending some time with me today. Wonderful. Thank you,\n"}
