{"transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology, they are run on and you want more customization and flexibility.\nAs well as a AI-driven model marketplace, UX wealth partners is your destination.\nOn top of that, they have institutional trading.\nSo if you are an ETF issuer or an SMA provider looking for outsourced institutional trading, UX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and make your practice more efficient.\nWelcome to Behind the ticker.\nToday we have on Brett Ikenberger.\nHe is from Conan Company and we are talking about auditing and accounting in the important function that it has in the ETF ecosystem.\nIt's often sometimes overlooked as an important function but it is something that gives shareholders a lot of trust in the products that they are buying.\nSo without further ado, please enjoy this episode with Mr. Brett Ikenberger.\nHey Brett, welcome to the show.\nThanks for having me appreciate being here today.\nSo before we get started, why don't you give everybody a bit about your background and your current role at Conan Company.\nGreat.\nAgain, thanks for having me here at Brett Ikenberger.\nBased out of our Cleveland office, Conan Company is about a 800 person firm have offices in 13 different states and working in the mutual fund ETF closed and interval fund space now for over 19 years.\nStarted my career as an intern at Conan Company and kind of worked my way up building the business to where we are at today.\nConan Company today audits over 1800 registered funds.\nSo that's mutual funds ETFs closed and funds interval funds and collective investment trust.\nThat puts us as the fourth largest auditor of registered funds in the country and actually number two in the ETF space.\nSo if you look at that kind of as a whole, we look at not only the number of funds that we audit but the number of advisors we work with.\nAnd if you look at the number of unique advisors work we work with we actually work with more advisors than any other firm in the country.\nSo see a lot of different products in this space.\nI'm sure you guys do your R auditor.\nSo thank you for all the work that you do for us, but I always like to ask somebody before we get into like the nitty gritty of the world of auditing.\nAny hobbies? What do you like to do when you're not working?\nGood good question. I have three girls. So they keep me pretty busy 14 12 and six.\nIf I'm not on the sports field during the weekend, usually working out running spending time outdoors.\nYou know, working working in the yard, doing anything to keep my mind busy.\nThe other thing I like to do is ski me and my wife and the kids enjoy getting out on the slopes and the winners.\nSo that's one of our favorite hobbies.\nGreat. We try to do the same thing. I about broke my back trying to do ski with a two year old last year, but he's getting there.\nAnd but my daughter's pretty good at it. So at least I don't have to, I mean, I still have to watch her, but I'm hoping he's a little bit.\nYou know, his ankles are a little stronger. So I'm not bent over in an L shape for two hours trying to get him down the slope.\nYeah, but it'll pay off in the end. You start him young and next thing you know, there are six years old going down the hill by themselves.\nSo my, uh, there's a payoff. Yeah, my, my whole thing in my head is, uh, if you can ski, you can skate. So I want to get him on on hockey skates as soon as possible.\nSo, um, all right. Let's talk about auditing. It is, it is a very important subject.\nPeople kind of look at it as, you know, when, you know, something that might be a nuisance to them or something that's bad, but really, it's a really, really important aspect of the TF space.\nI think it helps with, um, you know, making sure everything in the space runs very, very smoothly.\nSo first, like, how does the auditing process for ETFs differ from, let's say, traditional mutual funds or other financial products?\nYeah, it is really important for the public trust when you think about, you know, our capital markets.\nObviously, I'm biased, but you're right, the audit process is important.\nWhen you look at the audit of an investment company, it's very specific.\nWe can talk about ETFs, mutual funds, but there's very nuanced rules and auditing these types of products.\nThe number one most important piece is really the valuation of the securities that underline the portfolio.\nThat's, you know, 95% of the assets in the fund are made up of security. So it's really important that we understand the valuation policies and procedures of the investment company,\nand making sure that they're following those for different types of securities.\nThat's what we've spent a lot of our time when you think about some of the differences between ETFs and mutual funds.\nThere are some nuances ETFs report out both total return on an AV basis, that asset value basis.\nBut also because they're traded on the secondary markets, we also report out market value total return.\nSo that's a new one similar to like a closed-end fund that you'd see in ETF versus a mutual fund.\nSome of the other differences that you'll see is the capital activity process.\nIn a mutual fund, you have individuals buying and selling shares directly with the fund at an AV.\nWell, you still have an AV as the basis for buying and selling of the ETF, but they're done via creation units.\nAnd these are with authorized participants, not individual shareholders.\nSo that's a big difference and that changes the audit aspects of the capital activity of the ETF and how we look at that.\nBecause generally these are in kind as well in an ETF versus a mutual fund.\nSo you've got securities coming in kind of securities going out in kind associated with the capital activity.\nSo you really look at the capital activity along with the portfolio basket as well because that's how shares are created and redeemed within a ETF structure.\nKind of nuance that you'll have with an ETF different from a mutual fund is mutual funds generally have multiple classes ETFs don't.\nThey usually have just one class.\nThey also ETFs don't have like a dividend reinvestment into the actual fund.\nThe dividend just get paid out to the shareholders.\nThere's no mechanism for reinvesting directly into the ETFs.\nThat's a little bit of a nuance as well.\nInteresting. So when we look at some of the accounting challenges with ETFs like how like what are some of the most common accounting challenges and like really how do you address them.\nSo the accounting challenges number one as I mentioned earlier is around valuation.\nSo making sure that whether you're holding equities or bonds or derivatives whether it's options or swaps or effects contracts that or or even.\nTo return swaps that there's a solid valuation policies and procedures in place and a good methodology for valiant each of those securities a lot of times we're using independent pricing services.\nBut you want to make sure that you have good due diligence over those pricing services that it's the right pricing service for that type of security.\nAnd that's a really important piece of of the portfolio on a day to day basis when you talk about accounting challenges as well.\nYou know when I think of like a fixed income portfolio, amortization and accretion and the way that that gets accounted for when your buying bonds at a discount which we've seen over the last couple years which haven't seen in a while versus buying bonds at premium.\nYou know and just the different book and tax rules associated with how the fund accounting systems report that amortization and accretion.\nSo that's an area we spend a lot of time on complex corporate actions.\nYou know there's if you hold an international portfolio you're going to see a number of different corporate actions throughout the year and then how those get reported.\nWell from a gap perspective and a tax perspective as well is really important because that could impact how you distribute out distributions to your shareholders.\nSo that's an area we spent a lot of time on to.\nAnd so I think I mean I touched on this earlier, but like the audit process really kind of ensures like the transparency and the regulatory compliance which gives people you know the trust in these products.\nSo can you walk us through like your role as an ETF auditor ensuring that transparency and you know strict regulatory compliance.\nWe're we're not only independently valuing all the positions held in the portfolio.\nWe're also confirming all of those positions that they're held in custody that they're the assets of the fund.\nWe're also looking at as you mentioned some of the regulatory compliance.\nSo you're looking at for Rick you're looking at sub chapter M testing so making sure that the fund has qualified income you have to have 90% of your income from qualified income.\nThat's you know investments in securities you can't have direct real estate or other non qualified income coming into the fund.\nSo that's that's important for transparency.\nWe're also looking at to make sure that the funds properly diversified from a sub chapter M.\nSome funds are diversified for SEC purposes, which means you know more than 75% of their assets are in different less than 5% securities.\nAnd so we're looking at that also testing on a quarterly basis that's a quarterly test that's done by not only the administrators that oversee on a daily basis the ETFs, but also independently by the auditors as well.\nWell, I think too there's another element of that as well that it not only not only is it just coming down to the numbers, but it also comes down to when I sit down with your auditing team like just speaking from experience they also want to know.\nDifferent facets of the operational side of the business as well like that's just as important as a not.\nIt is so we get an understanding both of the control environment not only at your third party administrator from a fund accounting perspective TA perspective, but also the advisor.\nWhat are your controls in place to oversee the portfolio on a daily basis are you reconciling all the positions on a daily basis?\nHow are you valuing those securities? How are you looking at corporate actions? How are you looking at, you know, securities that may be impaired from evaluation perspective or unusual income that you might receive from a particular investment?\nHow are your controls in place to oversee that on a daily basis because every day we're striking an ad for for an investment company so that that's an important process as well.\nYeah, and too I think it really when you start to look at some of these things really takes a firm that might not be super institutionalized in nature and almost forces that institutionalization to make sure that like you're doing the right things on a daily basis because the worst thing that can happen to you in my opinion.\nOutside of you know, blowing up a portfolio would be an audit a bad audit report.\nYeah, you know what that there's there's you know there's things that we'd have to disclose associated with that you could have you know you could go into a.\nA scenario where you'd have a material weakness internal controls if there was a problem within the.\nThe audit of the financial statement so it's an it's an important piece and with the ETF structure as well when you think about it.\nDifferent shops are set up for trading as well some do the trading themselves some outsource the trading.\nSo you may be the investment advisor but you may have a sub advisor that's doing the trading of the portfolio.\nSo then the question becomes what are you doing as the advisor to oversee that sub advisor to make sure they're doing all their proper reconciliation as well.\nSo there's a you know the thing about the ETF industry those are really good ecosystem and a lot of checks and balances in place to make sure things are done properly.\nNot only from your administrator your sub advisor the advisor but also the custodian is well and your distributor.\nSo let's talk about the the recent rise of thematic niche niche and active.\nSo these have to pose like some unique challenges from an accounting and auditing perspective outside of you know the traditional passive products so what goes into that audit process might be a little bit more unique.\nWe've seen a lot of products that are.\nInvesting maybe in Bitcoin futures we see products that are investing in maybe complex derivatives with those types of products there's more work that goes in on the the front end from the advisor standpoint with their legal counsel.\nIf if you're going to have non qualified income in your portfolio do you need a blocker controlled foreign corporation blocker that's put in place to invest in certain securities whether that be.\nBit going because it's not considered a security or a commodity so we see you know if you're in a commodity ETF and you want exposure to different futures contracts you'd have to do those within your controlled foreign corporation what that does.\nYou don't need to do 25% of the fund in that but it allows that income to be qualified income when it gets paid from the CFC up into the parent fund so we'll see that structure put in place.\nWith some of the other things that we see I mentioned earlier about sub chapter M some of these more niche products you know making sure you have proper diversification whether you're investing in certain options.\nOr swaps total return swaps or credit default swaps the collateral requirements associated with investing in swaps you know it's different between each broker proper tri party agreements in place between your broker and your custodian.\nReally important from a reconciliation standpoint moving collateral back and forth so there's some operational challenges with those types of products and the other thing we see is if you're in a niche product something maybe that has.\nForeign investments in it some of those names that you might be investing in and could be less liquid or less traded such as monitoring that to make sure that.\nSo you have a proper valuation for those securities and that is your money monitoring the liquidity underneath those individual positions as well can be a challenge to.\nLet's move to the other side of the table with you know you mentioned you know non traded securities and low liquidity.\nSo let's talk about times of market volatility right so how do you ensure that ETFs are you know adequately priced during those high volatile periods.\nWell a lot of ETF the one nice thing about ETFs is that most of them are in fairly liquid investments and and and open and funds are also you know restricted to so many percent of their assets being and non liquid investments 15%.\nSo that's a good start for ETFs generally the when you're when you're putting together an ETF you're going to talk to your market makers you're going to want to make sure the names in your portfolio or liquid so when it comes to ETFs overall valuations generally better.\nWhen you're talking about periods of market volatility though you want to make sure your primary pricing service that you oversee that to make sure that the prices you're getting on those securities are proper.\nYou may even want to have a secondary pricing source and times of market volatility as a second check to see if there's a difference between those two pricing services and if you have if you come to the conclusion that you might have to do a price challenge or price override you want to make sure you have really good documentation for those for those reasons.\nThat's what we see and we also see in periods of high market volatility is that when you're talking about this ETF trading all day long price all day long on an exchange versus a mutual fund that prices once a day.\nYou're actually getting potentially more price discovery in an ETF product than than some other products so that's an interesting nuance to ETFs.\nSo we're seeing firms of all types right adopt technology and we're seeing it happen quite rapidly so.\nYou know what role does technology play right now in the auditing and accounting process and like how do you see that maybe evolving in the future and yes this is kind of an AI question well we're it's moving quickly.\nI don't know if the standards will keep up with the the change in technology but.\nWe're already implementing it in our audit processes we sit today and have been for the last couple of years so just to give you some examples when you think about auditing you know used to be more done on a sample basis right select samples of transactions that you're going to test.\nAnd sampling has its you know has its faults because you could be missing an important piece so what we're trying to go towards is more of a.\n100% testing so you think about all the dividends that the fund receives during the year we use our data team to go and independently pull those rates from an independent source and test 100% of that activity.\nThat's what we're working towards when you think about fixed income securities and interest income that is earned by those underlying bonds being able to test near 100% of the income that's coming from those underlying bonds is a better audit outcome than sampling as well and we're working on that towards.\nRealize gain losses as well being able to look at the activity that comes from the underlying fund accounting records and not only.\nLook at maybe the trade ticket for the trade that took place but also pulling underlying pricing services to see what that security was trading that on the day that you sold it.\nDid it meet the high and low of that day and then also what you paid for it and looking at the high and low of that day to see if there are any exceptions in that testing we're also using a new.\nTechnology that looks at the financial statements and a PDF format and what we used to do is you need to have your 10 key and you're.\nWe call it footing you know orders love to foot you put your entire SOI and you tie it to the balance sheet and then you flip the balance sheet and tie it to the statement of changes in that assets.\nWe have some new technology that looks at that PDF and automatically sums all of those columns and shows you the formulas that are in in there and comes up with what they should be not only does it do that but you could get a new draft and it's still looking at that same.\nData to see if it changed from the previous draft and do all those numbers that need to take and tie it and use another audit term between the statements match so we're using some technology like that we're also using that technology when you think about.\nWe select a number of transactions throughout the year for purchases and sales of securities.\nWe're able to have that Excel document look at the underlying whether it's a trade ticket or electronic trade ticket and see that it matches and then embed that underlying documentation within the audit file so some of those things that we're taking us a long time before.\nWe can do instantly and that's where we're working towards we have to embrace the technology and we have to continue to get a higher quality audit there's also a new.\nPCOB auditing standard out there QC 1000 that looks at your firms quality control policies and procedures in place so we're going to be implementing that as well and that's you know kind of the the oversight of the entire audit process and the accounting firm and how they go about.\nAuditing investment companies are really any type of company QC 1000 won't be specific for investment companies, but that that's some of the stuff we're working on.\nYou brought me back to my childhood there for a minute.\nMy dad is still a CPA and accountant or auditor and the 10 key, but he had the adding machine and I can still hear the sound of that thing in my you know dining room during tax season.\nBut I got pretty good at it and I I still you know I don't the the downside of the Mac is you don't have your number pad so I still hook a number pad into my Mac because I like to have it as well, but gosh.\nHim and that adding machine I can still hear it today.\nWe used to put together a firm Olympics event in one of the one of the contest was the 10 key race.\nSo it was a whole page of mathematical numbers that you had to foot and who was able to do it.\nThe fastest and then pull the tape off of the machine to show that you had the backup for it.\nAnd then you got to tape it and tie it when I first started I mean it's kind of crazy doesn't seem like that long ago, but it's over 19 years ago when I first joined the firm.\nCertain individuals at the firm that were printing out the financial statements, footing them and attaching that that tape that actual financial statements.\nWell, I mean that was that's a very accounting office thing to do is to have a 10 key race so I love it.\nLet's get back into the ETF space just a couple more things you know really what are some of these red flags and key risks that you guys are looking for when you're kind of looking at the ETF structure or you know our financials.\nYeah, we're looking at a number of things you know there's some risks and big some of the nuances of in kind transactions.\nSo making sure those are reported properly both for tax and book purposes.\nSo you know breaking out the in kind gain loss within the financial statements.\nPortfolio turnover for ETFs a little bit unique because in kind transactions doesn't affect the portfolio turnover ratio.\nSo making sure the in kind transactions are are pulled out from that when you have transaction fees associated with certain creations and redemptions.\nSometimes those are if it's a cash in lieu or if it's certain securities that you can't do in kind.\nThen there's a fee generally associated with that that goes into the fund.\nThat transaction fee to cover the costs of buying and selling those positions and that shows up in a couple different places one on the statement of changes and one on the financial highlights.\nSo we see that and when you think about the valuation of derivatives really important and also there's certain securities that you can't do in kind.\nSo maybe international securities are one of those that you can't do in kind because of the way those trade and certain derivative transactions.\nCertain options you can do in kind certain ones you can't and so just being cognizant of all those kind of nuances when you think about the ETF structure the other one we see is for international funds.\nYour valuation policy.\nSome funds might use what they call a fair value factor which takes into account kind of the market movement between the clothes of the US and other markets and some may not.\nSo either one is incorrect but just some nuances of kind of the policies and procedures of an ETF some things to look out for.\nSo you know what's on the horizon here what kind of trends or regulatory changes I'm sure you guys really follow those quite closely.\nCould you foresee that would have like a significant impact on ETF accounting you know maybe in the next couple years.\nSo there's nothing you know I mentioned the QC 1000 making sure that standards keep up with technology.\nThere's nothing too specific to be honest with you on the standards front that are will affect ETFs you know things that things that could change is if you know you know we see we see more.\nSo you know you know those are generally in 33 act fund products though the grant or trust structure for funds that hold a bit coin directly.\nBut we'll also see derivative products based on those so when you think about ETF it could start investing in another ETF that has exposure to Bitcoin or it could invest directly into the 33 act product that holds Bitcoin.\nSo I think I start watching for some of those how those affect your underlying fund is what what kind of exposure you could potentially have from Bitcoin being a say a fund of funds structure that you didn't you don't hold it directly in your fund but you have exposure to it.\nSo so those are some of the things to think about is we think about Ethereum coming to market and other currencies coming to market as well so that's that's on the horizon too.\nBut I think we're going to continue to see you know more transparency in the ETF product structure the other thing we could potentially see on the horizon is an ETF share class of mutual funds.\nSo it's when obviously the Vanguard's had that for many many years now over 20 years where we've seen a lot of exemptive reliefs filed for this and you know they're they're filing it for their mutual fund they could have a ETF share class and we're also seeing it on the other side where you have a ETF like yours that could then potentially offer a mutual fund share class.\nGot it. So it's the last thing here is you know how it's it's very it's very difficult as a new issue or as someone coming to market to like pick who their service providers are going to be.\nSo if there are definitely people listening to this right now they're thinking about launching an ETF their money manager like how should they be thinking about evaluating and choosing the right auditing firm.\nIt's something you should spend a you know it's some timeline understanding you know what are the qualifications that firm.\nHow long have they been in that marketplace do they have similar clients to me I'm launching a strategy that's going to be an option overlay base.\nWhat other clients do you have in that marketplace I'm going to do international fixed income security so can you tell us about some of the clients that you have in the space in your experience.\nBecause I think that's really important from you know their expertise level to make sure that they're qualified to make sure that you know that they can help catch some issues that come up.\nWhether it's on the gap side that we talked about earlier on some of those items or or on the tax side as well and making sure that you have a provider that understands the niche nuances of the industry both from.\nI know investment company itself but also the the ETF wrapper are really important but in and taxes really important obviously for ETFs as well so making sure that.\nYou know understand there what what tax partner would be on the job with you.\nYou know what type of interaction would you have with them what are their experience with working with your other service providers do they have experience working with your sub advisor do they have experience working with your administrator.\nYour custodian all the that entire ETF ecosystem and the market makers that exchanges what's their experience and from earlier level with those industry individuals as well.\nWell Brett I really appreciate you spending some time with me here we're live at the ultimate client clients summit so again thank you very much before let you go where can people learn more about you and cone and company.\nSo you can learn more about cone and company of cone CPA dot com you can also sign up for our quarterly newsletter that we have related specifically to the investment company industry.\nYou can find me on LinkedIn and you can also find me on our website as the market leader of our registered funds practice.\nWe'll get Brett thank you so much.\nThank you.\nThank you.\n"}
