{"transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology they are run on\nand you want more customization and flexibility, as well as a AI-driven model marketplace,\nUX wealth partners is your destination.\nOn top of that they have institutional trading, so if you are an ETF issuer or an SMA provider\nlooking for outsourced institutional trading, UX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and\nmake your practice more efficient.\nWelcome to Behind the ticker.\nToday we have on Garrett Stevens and Rich Mollinowski.\nThey are from exchange traded concepts and we are still live.\nAt the ultimate client summit down in Dallas, really focus our conversation today on what's\nhappening and moving in the ETF industry, some of the trends, the two of them are\nseeing and really for those of you who are thinking about white labeling and starting\nan ETF, some of the best practices in order to have a successful launch.\nSo without further ado, please welcome Mr. Garrett Stevens and Rich Mollinowski.\nHey Garrett, welcome back to the show.\nThanks for having me.\nHappy to be here.\nSo it's been a minute since we had you on, so you are from exchange traded concepts.\nSo if you could, why don't you just update everybody who you are and what ETC does for clients?\nYou bet.\nSo ETC, we are the very first white label ETF issuer in the world to our knowledge.\nWe handle everything that somebody might need to launch an ETF.\nSo we offer a full turn key platform where we handle all the legal and regulatory work.\nWe build custom websites, handle all the portfolio management, course all the regulatory\nfilings and for folks who don't need all of that, we also do those services individually.\nSo we actually act as sub-advisor for quite a few ETFs out in the marketplace, handling\ntheir portfolio management work for them, but also can offer marketing services and custom\nwebsites and everything somebody might need.\nWe've been around about 13 years at this point.\nI think we've launched North of 100 ETFs during this time period, about seven and a half\nbillion dollars and just about any type of fund the SEC will allow, we either have done\nor can do at this point.\nWell, we are actually here live at the ultimate client summit and I met one of your partners\nhere, Rich and so Rich, why don't I give you the opportunity to give your background and\nsay hello to everybody and kind of where you fit in over at ETC?\nSure, Brad.\nRich Malenowski, I'm currently ETC's general counsel with Garrett and our lead portfolio\nmanager, we're also the executive committee of the company and run the firm and the business.\nMy background, so I've been in the Assmanagement space for about 18 years now, primarily\non the legal side the entire time, so I've been with a number of service providers through\nthe years, started as a paralegal and migrated to attorney and here I am.\nSo Rich, what do you think is kind of one of the major differentiators that ETC offers?\nI mean, there's now we're seeing kind of a boom of white lablers out there as the ETF\nindustry has really started to ramp up.\nSo what do you think?\nOne of the key things that you guys are super proud of over at ETC kind of differentiates\nyou guys from the rest?\nFrom our perspective, I think it's a combination of experience and service.\nAs Garrett mentioned, the firm is the first one to do this.\nThe ETF industry overall is still fairly young, so I think having length of track record\nis important and just having the overall experience in seeing what others have done and getting\na feel of where things might play out if you try to launch a particular type of ETF.\nAnd then where we place a lot of emphasis is on service and quality.\nWe strive for a qualitative experience with other clients when we say full service and\nturn key, we mean it, we try to do everything possible to improve the client experience\nand make sure that we can guarantee the best outcome for them that we can.\nSo Garrett, you and I were talking prior and you had mentioned, you know, you're starting\nto see this unique trend of advisors starting to kind of launch their own ETFs rather\nthan, you know, the traditional issue we're having to build a product that you think\nthe advisors are going to want and adopt.\nSo, you know, what are you seeing on that side of the fence and, you know, why would advisors\nwant to be launching their own product?\nYeah, so it's a great tool for them.\nI mean, if you think back to the beginning of the industry, it was really index-based\nproducts and it was really just, you know, the massive issuers.\nAnd so what, you know, our business has done is we've really kind of democratized this\nwhole ETF space to make it easy for somebody to launch funds.\nWe have launched funds for some of the largest financial services companies on Earth and\nwe have clients that are a one-person shop and we can work with everybody in between.\nThis, the newest, you know, kind of phenomenon that we're seeing and it makes all the\nsense in the world is that, you know, a wealth management firm can launch their own product\nbased on an existing strategy that they run and they can give their clients a more tax-efficient\nvehicle.\nThey can do everything that they're doing in an SMA account, but do it for them in a tax-friendly\nway.\nMany of our clients are not even trying to market their products at this point publicly.\nThey really just want to use it as a tool for themselves.\nTheir clients want the tax advantages, they like the intraday trading, they like the liquidity.\nAnd so it's a really good tool for them to have to offer to an existing book of business.\nAnd it really differentiates them from their competitors to say we can do this in an SMA,\nwe can do it in an ETF whatever works best for your situation.\nSo just set a curiosity, because I haven't, I mean, I haven't been following this as close\nas you have obviously, but are they, you know, naming their ETFs after their firm or\nthey're giving them, you know, a unique name, like, I guess, like, visually, how to, or\noptically, how do these things look when they come out?\nYeah, so they, they do, they'll put their name on it, they'll put the firm name on it,\nand name it the strategy that they may have, and maybe marketing in a different, you know,\ndifferent wrapper, but it's a great marketing tool for their firm.\nAnd, you know, ETFs being so publicly traded, you can pull them up on Google or Yahoo\nFinance, any way that a retail investor might see it.\nSo it gives your firm a lot of, you know, visibility and credibility to have this publicly\ntraded product out there.\nYeah, no, that's great.\nAnd I think that the other thing that we've been seeing in the space, at least hearing\nin the space, this might be a question for Rich, is, you know, are we seeing any more movement\nin this, like, mutual fund conversion space?\nLike, I'm hearing it might be a couple of years now, like, have you heard any updates\nas far as what the SEC is looking at, or, you know, what's going on with this conversion\nor ETF share class?\nRight.\nSo back when I was with Altimus, we did a, our first mutual fund conversion about three\nyears ago now.\nAnd it was quite a process, definitely a learning experience, it got done, successfully\nconverted, mutual fund with multiple share classes, consolidated, all of that, moved it over\nand now it's an exchange traded product.\nI think the trend has slowed down, mostly as a lot of the intermediaries and gatekeepers,\ndon't seem to be fans of it.\nAt the same time, there's still questions about who's holding the products and how\nwill they hold them after a conversion that leave some questions on answered.\nAnd then you've got all of the recent share class applications with the SEC to copy the\nVanguard model and offer either an ETF share class of a mutual fund or a mutual fund share\nclass of an ETF.\nAnd I think the outcome of that is really going to end up dictating where conversions end\nup going.\nWe could definitely see a lot of current active products not having to undergo a whole transformation\nif they can simply bolt on ETF abilities to a current mutual fund.\nSo would you mention, like the gatekeeper, are you talking about the custodians?\nYeah, the custodians, the RIA platforms, you know, basically the predominant place where mutual\nfund shares are held and sold right now.\nAnd that's a summing has to do with money.\nProbably.\nSalesperson compensation is I'm sure a concern to someone.\nYeah, I would think so too.\nWell, so we're like I said, we're here at Altimus.\nThere's a lot of talk about ETFs.\nWe're talking about a number of things.\nSo look, I know this is a hard question, but what do you think is next?\nLike we've had this wave of derivative and defined outcome products recently hit the market\nin a big way.\nWe've seen a ton of thematics.\nWe've seen, we're now seeing, you know, levered single stock, whether that's inverse or,\nyou know, to the upside.\nSo again, difficult question.\nNeither of you have a single ball or a crystal ball, but what do you think could be\nreally next we could see?\nYou know, it's tough to predict the future, but I think the unpredictability is probably\none of the great features of the ETF landscape because an ETF is sure can bring anything\nto market to meet customer demand.\nAnd we've seen this with wave after wave.\nWe've seen the thematics.\nWe've seen the option products now.\nWe've seen ESG, you know, these are trends that come.\nAnd I think the industry is definitely meeting customer demand.\nWith that said, I have no idea what's going to come down next on the pike, but at the\nsame time, whenever that idea comes up, I'm fairly certain that the industry is going\nto be pretty quick to respond to it.\nGary, do you have any ideas around that?\nI mean, what we're seeing is certainly the trend is more towards active.\nAt this point, I think 75% or something of new funds being launched are active at this\npoint, rather than the index based stuff.\nThis industry is great at taking a good idea and beating it to death.\nYou know, I think the themes have largely been covered at this point.\nAs soon as I say that, someone will call us with a new idea that we haven't nobody's\ndone yet.\nBut, you know, you can only kind of slice and dice some of the indexes so thin.\nAnd so I think this move toward active is really just starting to ramp up when you compare\nthe assets.\nObviously, the ETF world to the mutual fund world, we have a long ways to go.\nSo for being such a big industry, it is still very new.\nIt's just not that old of an industry, only been around 21 years or something at this\npoint.\nSo there's a lot of upside left, I think, in the active world that you're just going to\nsee more and more of.\nWe walk me right into my next question, which is, you know, we know that the active\nactively managed ETF space is growing significantly.\nLike, how do you see the balance now between kind of passive products and active?\nAt least what I'm viewing, I have a little bit of a lens in the R.I. space.\nAs you're seeing them, you're seeing advisors build traditional passive model portfolios,\nbut they're bolting on some of these actives for whatever reason, whether it's to help\ndampen volatility, maybe it's to juice returns, like, what are you hearing seeing?\nAnd, you know, where do you think the balance is now is, you know, these actively managed\nETFs are really hitting the market?\nYeah, I think for a long time we saw a lot of that kind of core and satellite approach.\nAnd I think now, you know, this move towards active is where you have an advisor who can\ntake that kind of core and active approach that they were doing, just putting the whole thing\ninto an ETF.\nSo, you know, you're getting their active stock selection, you're getting their, you know,\nsector allocations, all in one vehicle, rather than having to own a bunch of different ETFs,\nor a bunch of stocks and some ETFs, as that advisor might have been doing before for\ntheir client, they can put it in one.\nAnd it makes it a lot easier for them operationally, just to have one product to trade\nfor a client, one portfolio for them to trade, and then, you know, obviously the, all the\nother benefits of the ETF itself.\nSo, I'm just trying to think from an RA is perspective, more from the clients perspective,\nlike, optically, how do you, I mean, I would have a hard time seeing a client being, I get\nthe approach, I get why it's operationally better, I get to get why it's more tax\nvision, I get why it's beneficial, but does that just come down to education to the client\nto say, hey, look, there's a lot, you have a highly diversified portfolio, and we're doing\nit all on one wrapper.\nIt does, yeah, it does that, but you're also, you know, especially, you know, again, back\nto the tax benefits, you can tell them that, you know, here were the capital gains that\nyou got last year in this wrapper, and let's put it in 20 TF, and you're not going\nto have that.\nI mean, I think for all of the products that we're running, I don't know that we paid\nany substantial capital gains taxes out in the last year or two for these funds.\nSo, you know, it's been a, it's a lot of education, two advisors, and then for them to\ntheir clients to let them know why, you know, this is a better approach, but what you're\nseeing is that the advisor can take their taxable money and put it in the ETF, they're\nnon-taxable accounts, they can leave in separate accounts if they want, but it just\nis another arrow in their quiver when they're talking to clients.\nAnd just thinking about it, I would add that when you look at passes, generally the type\nof strategy and as a component of a client's portfolio, you know, the passive is a thing\nthat they invest in.\nIt's a specific index, industry, sector, you know, cap range, whatever it might be, foreign\ndomestic, however you want to slice it.\nBut when you look at the growth of active, you know, there's that manager component, and\nit's how the money's managed, and, you know, it can cross out as a class as it can rotate\nsectors, it can do whatever, but you're selling a management style as part of the product,\nand I think that's what a lot of managers that come to us, you know, are trying to market\nis also not just what they're investing in, but how they're doing it.\nGot it.\nSo as far as, like, kind of next waves go, I think, you know, we've heard a lot about AI and\nmachine learning, obviously, you've got the biggest performing and best performing stocks\nin the world in that space, are you guys starting to get calls from managers that have,\nyou know, machine learning or AI strategies that they want to employ inside of an ETF,\nis if you started to see that wave start?\nYeah, for sure.\nActually, we have a full suite of products already that our AI done.\nSo, you know, there's a technology company in South Korea, actually, called craft that we've\nbeen working with for a long time, and we've had products for them for several years,\nand they're completely, all security selection is done by artificial intelligence.\nIt's been, it's been great to watch, and we have more and more of those conversations\nwith people who are, you know, either utilizing AI in their process, or in this case,\nAI is running the whole thing, and it's definitely here to stay.\nSo, let's flip on to a different part of the ETF space, which is kind of the growth of\nsemi-transparent and non-transparent ETFs, the nice thing about ETFs is you generally\ncan see what's inside of them.\nSo, do you think this is going to start to gain broader acceptance among investors?\nAnd I think, too, I'm starting to hear, you know, how can we get private equity or private\nequity like products inside of ETFs as well?\nAnd I would assume those would be, you know, pre-semire non-transparent.\nSo, how do you view the growth, or how do we gain broader acceptance among investors\nwith these types of products?\nYou know, I think that it, I think investors and advisors and the people bringing those\nare accepting them.\nI think there's a lot of operational nuance to the, to the non-transparent or semi-transparent.\nYou have the whole market making community.\nYou have gatekeepers at various wirehouses and things who are maybe less inclined to be\nin favor of the non-transparent.\nIt's harder for them in a lot of cases, understandably.\nAnd so, I think that is what has slowed kind of the acceptance of the non-transparent\nand semi-transparent, you know, like you said, the benefit of ETFs for so long has been transparency.\nAnd that's kind of what people think of when they think of this.\nAnd it's a problem for some products, you know, you're dealing with, you know, potentially a small\ncap ETF, for instance.\nAnd it may take a manager days or weeks to work into or out of positions like that.\nIn an ETF, you know, that's, that's not always easy to do, because people can see it and\npotentially pick it off if, pick those trades off if, if it's not done right.\nSo, you know, I think, I think it will continue to grow.\nBut I think it's just, it's got a little bit of a headwind on it.\nSo, last kind of question about, you know, the ETF market and the ETF industry, we, you know,\nit's been such an explosion, right?\nDo you think we're at the beginning?\nDo you think we're at the middle?\nI mean, does it slow down?\nAre we just going to continue to see, you know, product launches after product launches year over\nyear? I mean, the growth, I forget how many product launches there were last year, but I believe\nlike Nizi broke the record for, for launches.\nSo, what do you think we are in the cycle of actually getting product market or are we not even close to\ndone? I think we're not close to done. I think the industry is maturing, right?\nI think that, you know, we always talk about it and when we talk with people about kind of the early\ndays of the internet, right? So, this is, is not the very first days of it, everyone, you know,\nhas a computer, right? So, it's not, you know, the very beginning of the ETF industry anymore,\nbut it's still early innings. There's a lot of innovation yet to come. There's a lot of acceptance\nand uptake that will be happening over time, but I think that there's still a really long ways to go.\nYeah. So, I kind of want to just pivot for a minute and take some time.\nWhenever I have guys like you on who see a ton of, you know, issuers and managers and people\nentering the space, like, you know, what advice would you have for them is they kind of sit around\nand think about whether or not they're ready to launch a product, they're getting to that point.\nYou know, a, who are you talking out of launching product and why? And kind of be,\nwhat do they, what should their expectations be? You know, once they get a product to market,\nit's out there, you know, the first, you know, six months and first year, that product hits market.\nRight. So, first and foremost, and, you know, I got to wear my legal hat for this,\nbut it's still your diligence. Right. You're getting into a new business and you need to have a\npretty good understanding where you're getting into. You know, that's just a general comment.\nSpecifically, you know, I think what, it's not that you want to discourage anyone, but you,\nyou've got to manage expectations too. I think in some cases, you know, and, and particularly\nwith more of folks that are launching with something that's really invoked and popular at the\nmoment is that they're going to register launch and, you know, billions of dollars are going to\nflow in and this is just a gem of an idea and it's not launching an ETF is not to get rich,\nquick scheme. Right. You launch it. You list it. You have to establish performance. It's got to have\na trade record of it. It takes time to really bring a successful product to market.\nYou've got, you know, the importance of a track record is as important for an ETF as it is for a\nmutual fund. Right. You have to show how you're doing. And that's, I think that's part of it is just\nthe educational explanation to people that it's going to take some time and you've got to\nfinance it and work it. And in the end, if you've checked off every box, you, you know, hopefully\nyou're successful. Well, in that, you know, finance it and work it, like, you know, Garrett, what do\nyou think people need to be doing, you know, on a daily basis in order to make sure that they're\nnot going to be exiting the ETF business in that first 12 or 18 months. Everybody sitting in the\ntable knows it's not cheap to run an ETF. So, you know, what do they need to be doing to make\nsure they keep the lights on and this is a profitable endeavor for them? Well, I think the biggest\nthing that that we're seeing and that we talked to people about and to Rich's point, you know,\nthat this is a change is to try and make sure that when you bring the fund to market, you bring it\nwith some assets. You know, I think the days of launching a fund with, you know, a couple hundred\nthousand dollars in it and it grows to a billion. Those days are those products are fewer and far\nbetween than they used to be. Unless it's Bitcoin. Unless it's Bitcoin. The occasionally you get\none that catches fire and just blows up and takes off, but that's, you know, that's not the norm,\nthe way it used to be. And, you know, we hear a lot of different ideas when we talk to people,\nsome are better than others. And, you know, as more of these kind of levered and inverse,\nyou know, products like your mentioned have been launching, those are definitely hot money products.\nAnd the money goes out just as fast as it comes in. And so, depending on the type of product\nyou're launching, you've got to be prepared for both sides of that coin. But to the extent that\nyou can launch with some amount of assets, you know, the break even on a new product is somewhere\nin the $30 million range. You know, it's kind of the industry norm, I think. And so,\nyou really need to have that as your target to bring the fund to market is to have those assets in it,\nso that you can make sure that it's going to live. And you can build that track record.\nThat's the biggest difference we've seen too between asset, passive and active is the fact that\npassive products are easier to market and sell. Historically, because you're talking to somebody\nabout a theme, you're saying you should buy this because robotics are hot, so buy all of the\nstocks in the robotics industry. That's an easy conversation for an advisor to have with a client.\nWe should have exposure to this. With an active product, it's the same as in the other active\nstrategy. It's really easy to tell the advisor how great it is. And for them to say, you know what,\nthat's cool. I'm going to keep an eye on that. That's not allocating to it. They want to see\nperformance just like any other vehicle. So, you got to be prepared for a little longer runway\nwith most of the active strategies. So, you've got to keep getting the word out. I think,\nyou know, ETFs are one of these products that are sold, not bought, especially in the active space.\nSo, you have to be constantly creating awareness, whether that's through digital advertising,\nsocial media, those kind of things keep the product out there in front of other potential buyers.\nBut, really focus on trying to have some assets when you launch. Yeah, I think it's important I\ntalk to people who are considering launching an ETF. They just come to pick my brain sometimes\nand ask how my experience was. And I said, well, we're going to get the first, you know, 30 million.\nAnd they're like, well, we've got, you know, two or three from friends and family and I'm like,\nwell, that's not going to work. It's not going to cut it or you okay with stroke and checks\nto keep this thing alive and hopes of it. So, I'm going to ask a selfish question because\nI get to sit with two people that have been in the industry for a very long time. We launched\nour product about two and a half years ago. So, what do we need to be doing? We've got some experience,\nbut to really institutionalize ourselves to make sure that when we get to that broker-dealer\ndoor, when we get our three-year numbers that we look and feel as if they're somebody that they're\ncomfortable putting on their platform. So, this is where it's important to talk about the\nthe relationships that make your product run, right? It's not just you. It's not just one or two\nof you at your shop, right? You have bigger firms behind you. You have, you know, your administrator,\nyour accountant, your auditors, your, you know, the funds distributor. These are very big firms who've\nbeen doing this for a very long time. Give them that comfort level that this is not just a,\nyou know, a one or two product shop. You have a lot of infrastructure behind you to run this thing\ncorrectly. Number one. But then it's really about telling your story and, you know, having the ability\nto, you know, when you go to the big wirehouses and try and get in the door, one of the things\nthat they're going to ask is, okay, if I have a thousand advisors out of our 300,000 who want to\ntalk to you, how are you going to answer all those calls? How are you going to be that customer service\nthat they need? So, you've got to have, by the time you're ready to get in there and you meet the\nasset thresholds, you meet the time thresholds to get in there. You've got to be able to answer\nthose questions. If yes, we can support your advisors. And so, you need to have the marketing\ncollateral, you need to have when people Google your fun name, stuff needs to come up, right?\nYou've got to be prepared and have that, have that presence out there. Well, guys, I really appreciate\nboth your time. I, you know, it's always great to get an update on what's going on in the industry.\nIt's always good to see, you know, the both of you. And before I let you go there, where can people\nlearn more about exchange traded concepts? Our website exchangetradedconcepts.com is the best place.\nYou can contact us right through the website. We are on Twitter, I think we're at ETCETF,\nposting contents on there pretty regularly these days as well. So, we'd love to hear from\nanybody who has questions. Well, again, Rich and Gerard, thank you so much. It's great.\n"}
