{"transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology, they are run on and you want more customization and flexibility.\nAs well as a AI driven model marketplace, UX wealth partners is your destination.\nOn top of that, they have institutional trading.\nSo if you are an ETF issuer or an SMA provider looking for outsourced institutional trading, UX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and make your practice more efficient.\nWelcome to Behind the ticker.\nToday we have on Ray Holst.\nHe is from practice and he is an attorney specializing in 351 exchanges.\nWe're reading a little bit more about the power of a 351 exchange.\nWe go through why you would want to do one.\nWhat are some of the best examples of where you would choose to do a 351 exchange and we talk about some of the rules and intricacies that help facilitate these transactions.\nSo without further ado, please welcome Mr. Ray Holst.\nHey Ray, welcome to the show.\nGlad to be here. Thanks for inviting me.\nSo before we get started, why don't you tell everybody a little bit about your background and how you ended up at practice?\nSure.\nSo I've been practicing tax laws since 2002.\nWorked at some of the largest New York firms did a stint at Morgan Stanley.\nSo my primary background has always been in financial products, financial institutions, taxation.\nRecently, and by recently, I mean, summer 2023, I joined practice, which has a very strong focus in the ETF.\nMutual fund market, you know, what lawyers call 40-act companies.\nSo with my expertise and experience and other aspects of financial products and financial institutions, it was a really good fit.\nRegarding practice, we're about 60 attorneys were completely virtual.\nSo we're located all around the United States.\nI have partners in Chicago, San Francisco, New York, Miami.\nAnd it was founded, the original genesis was something called the 40-act group.\nAnd I think that would go back to about 2011, maybe 2013.\nBut with COVID and the use of zoom and models, I think clients have really understood that it can be done virtually.\nAnd, you know, it just affords us the opportunities to work from wherever we want, whenever we want.\nSo I found it a really great experience.\nIt also saves on the high price real estate.\nThat's exactly right.\nYou know, instead of funding your favorite real estate owners, summer home, hopefully you can keep a little bit more for your mortgage.\nYeah, I love it.\nSo I always like, before we get into the nitty gritty here, I always like to ask, what do you like to do when you're not working?\nIt depends on what season is.\nBut generally, I do two things for fun.\nI ski in the winter and I fish in the summer.\nI do a lot of offshore fishing with a lot of guys I grew up with.\nWe're on based in Huntington along Island.\nSo we go out of the South Shore through Fire Island in Lad and we fish the Hudson Canyon.\nAnd we do a lot of tuna fishing, a lot of sort fishing.\nYou know, for the winners, it's wherever the snow takes me.\nSo yeah, I've skated multiple places, but that's what I do for fun.\nYeah, I love it.\nIt's getting to be skis season in the Northeast.\nI geared up this weekend and getting ready for that.\nI mean, I heard it's snowed in upstate New York this week.\nAnd I don't think I'm ready for that.\nI heard Vermont got about a footage snow.\nSo yeah, it's coming.\nSo we're going to focus on three fifty one exchanges today.\nThere's been a lot kind of in the ETF, you know, sphere about them recently with meb favor, you know, launching his new fund.\nAnd so let's just start at the very top.\nWhat is a three fifty one exchange and how does it apply to an ETF?\nWell, being taxolors, we always need to speak in code.\nSo what is three fifty one?\nThree fifty one is simply the provision in internal revenue code, which is used to create a corporation.\nAnd I'll give you a simple example.\nI have fifty dollars.\nYou have a property with a fair market value of fifty dollars.\nWe both contributed that into the corporation exchange for corporate corporate shares.\nIt's fifty fifty because we've contributed equal value.\nHowever, you bought that property.\nLet's say five years ago for twenty five dollars.\nSo you have twenty five dollars of built-in gain in that property that you're contributing.\nAnd if you meet the requirements of three fifty one, what it says is when you contribute that property,\nyou don't have to recognize that gain at that time.\nWhat happens is you get a carryover basis in the shares that you receive.\nSo with respect to an ETF and doing the initial seeding,\nthe idea is you're an asset manager and you have separately managed accounts or maybe you have a private fund.\nAnd you want to sort of take the next step and move those into a public vehicle.\nAnd ETF wrapper is a great way to do that.\nSo you have managed this portfolio.\nIt's done great.\nYou have a lot of built-in gain.\nSo when you want to get your clients into that ETF,\nyou don't want to have them experience a taxable event.\nSo a three fifty one in this space generally has two requirements.\nFirst one's really simple to meet.\nIt says the transfer or is meeting the people putting property into the corporation,\nhalf to own eighty percent of vote and value of the corporation after the transfer.\nGenerally it's a hundred percent because everyone's participating at the same time.\nEveryone transfers in their existing securities portfolios.\nThey take ETF shares back.\nSo it's a hundred percent.\nSo we never really run into problems.\nThere are some outliers, but we never run into problems with that problem.\nThe other prong is that what is being contributed needs to be a,\nif it's marketable securities, needs to be a diversified portfolio.\nAnd what that means is there's two tests.\nThey're generally referred to as the twenty five fifty tests.\nAnd so you look at each, each transfer.\nSo if you're running separately managed accounts,\nyou have fifty accounts, you have to look at each account individually.\nIt's not the aggregate portfolio, but you look at each person that's considered a transfer or.\nAnd as I said for the diversification test, there are two tests.\nThe largest securities position that is being transferred can't be greater than 25 percent of the total.\nAnd the top five holdings of the securities that the client has can't be greater than 50 percent.\nNow cash and cash like items aren't included in that denominator,\nbecause you know, you could see how you could gain the system by, you know,\njust pumping and cash.\nSo we're looking at actual securities.\nNot to get too technical, but if your client has an existing mutual fund that's going to get transferred.\nIn the three fifty one, generally we look through that mutual fund to the underlying.\nOwning the underlying holdings and treat the transfer as owning their priority share as that as well.\nBut those those are really the required the two requirements from a tax perspective.\nIt's, you know, a tried and true technology.\nNothing, nothing all that novel about it.\nEven the documentation that is used to make this happen is fairly simple.\nThe actual heavy lift comes from the fact that,\nbecause you have clients that are transferring securities to the ETF,\nall that tax information has to go from the current custodied into the new fund administrator.\nAnd the ETF shares that the transfer receives have to be held in a brokerage account.\nSo make sure, you know, if you're dealing with SMAs, they all have brokerage account.\nAnd they get what's called a carryover tax basis.\nSo whatever their securities were, if they had, you know, fifty dollars of basis and Apple,\nhundred dollars of basis and IBM, all that basis now has to be allocated to the shares that they've received.\nAnd holding periods, you know, deal with the fact of long-term gains and short-term gains,\ngenerally you need to hold property longer than a year to get the twenty percent long-term capital gains rate.\nSo the 351, you know, edits core is just a tax play, really.\nI wouldn't use the word play, but it's a mechanism by which you can see it in ETF without the recognition of gain for your clients.\nAnd so when you're seeding an ETF using a 351 exchange,\nhow does that kind of, does it change the structure of the ETF at all or like,\nyou would, you would gone on about how the cost basis moves over,\nbut are there any other additional steps as far as a 351 that you'd have to pay attention to?\nFrom the actual legal perspective, it's a fairly straightforward transaction.\nYou know, what is really important is anyone considering such a transaction,\nyou know, they need to partner with someone that's done these before that can bring all the constituents to the table\nand working on these transactions we generally hold in the beginning by weekly calls and then we got a weekly calls.\nBecause you want to make sure all that information that needs to be exchanged,\nthat's all been done sort of beforehand and it's hardwired.\nSo when you get ready to push the button and execute the trade, it doesn't blow up.\nAll the information flows properly, everyone has what they need.\nSo that's why it's important to actually have people that you're working with that have done these transactions.\nI think practice now is done close to 100 of these transactions.\nSo you want people that have done them before because we have seen issues crop up,\nso I'm not saying we've seen every issue that's come along, but I think we've seen most of them.\nSo are there any specific asset classes or types of, you know,\nSMA or mutual fund strategies where 351 exchanges like particularly beneficial or even more commonly used?\nI did the 351 aspect of it will not limit what assets come in.\nI think what assets the ETF can hold will depend upon the market maker for the ETF because you do\nthat in kind create redeems and they need to be able to sell those underlying assets.\nSo generally and it's not really a tax reason, but it's for those market maker reasons that you need a marketable security that goes into the ETF.\nAnd an ETF is allowed to own other ETFs and mutual funds.\nSo those sorts of securities don't present a problem.\nCould 351 exchange influence like the liquidity or even the tax efficiency of an ETF post launch?\nNo, the 351 is just the mechanism to see the ETF.\nGoing forward once it's up and running, you have the same sort of requirements and market ecosystem that you have in any other ETF.\nSo it's really about seeding the ETF getting your clients into that vehicle, which, you know, we believe there are a number of advantages of getting the clients into that as opposed to keeping them outside an ETF.\nOne being tax efficiency, which is probably the biggest one, but it's really about just getting the ETF up and running.\nSo as we look at the ETF industry as a whole, right, how do you believe and I know this a broad question?\nHow do you think the ability to do a 351 exchange in an ETF impacted kind of like the overall growth of the ETF industry, particularly in new product launches and conversions?\nYeah, I think it gives asset managers that have been building their book of business or AUM.\nIt gives them a mechanism by which they can take the next step in their career development by going to a publicly traded vehicle that offers their clients liquidity,\nand ability to easily margin the ETF shares.\nAnd, you know, the difference between ETF and historic mutual funds is the tax efficiency of an ETF.\nThat's really what I believe is driving the explosive growth in the ETF market, not to get too deep into the weeds,\nbut ETFs have the ability to sort of rebalance their portfolios and whether it's an active strategy or passive strategy doesn't matter,\nbut they have generally the ability to rebalance their portfolios without having a taxable event.\nIf you have an SMA account and you want to get at IBM and go into Apple, well, when you sell those IBM shares, obviously you have gain or loss, you take the proceeds of that, which, you know, is taking a 20% taxid probably.\nAnd so now you only have $80 to go into the other security with respect to ETFs.\nCan generally rebalance their portfolios using technology in the marketplace that it isn't a taxable event, so they can sell the $100 the IBM and move that $100 value into Apple without recognizing any tax.\nSo, you know, the entire ETF space is pumping tax efficiency of, you know, having an ETF over an SMA or in a mutual fund rate.\nSo, looking ahead, do you see any changes in tax law or regulation that could impact the use of 351 exchanges in the ETF market?\nYou know, people take varying positions as whether, you know, what I'm speaking of, these create redeems and it's under code section 852B6 for the tax skicks out there.\nBut, you know, people take various positions whether it's a good thing, bad thing, I'm not going to comment on that, but to give you, you know, some background in that.\nSenator Widen, who I think was heading up maybe the finance committee at the time in 2021, he put forth a proposal to do away with this code section 852B6, which the ICI pushed back on tremendously, as well they should basically saying you're going to blow up the ETF industry.\nIf you remove this, ETFs are, you know, being used by common investors, this isn't something that you guys should be pursuing.\nAnd I don't think, you know, the current proposal has, you know, has much, has any legs, but it's out there.\nSo, the idea is who knows what the future holds, but for now, ETFs can generally be much more tax efficient than your average mutual fund.\nSo, for we have a lot of asset managers and even financial advisors who some of these financial advisors are actually thinking about launching ETFs on their own because they've got client accounts and they want that tax efficiency.\nSo, for for them who are thinking about getting into the ETF space, could you kind of walk us through a simple real world example of, you know, how a three fifty one exchange might work and also the steps that they need to take in order to properly facilitate it.\nRight. So, I generally deal with, you know, the tax aspects of it.\nAnd although, you know, we do our diligence, make sure that the diversification tests are met.\nThere are, there's very few documents involved from the actual tax side.\nProbably the biggest left if you're thinking about it is, you know, filing your perspectives with with the SEC going through that approval process.\nYou know, I think the minimum, and I'm not a security lawyer, but I think the minimum time period on that is seventy five days.\nSo, you know, you need to consider all that if you're shooting for a specific time as to when to launch.\nReally, you know, there are a lot of funded administrators out there that you want to partner with.\nYou want to find someone that has done this transaction before that can show you that it's been successful.\nYou don't want to launch a fund and then, you know, two years later you're closing it because you haven't had market makers that are interested in it.\nYou're, you know, a whole host of reasons why funds closed down. You want to get to market. You want to obviously have good performance and increase your AUM.\nThat's, you know, that's what most managers want to do.\nSo, if they're, you know, again, looking at this process in terms of creating their ETF is facilitating a three fifty one exchange going to cost more money.\nLike more time, you know, can you maybe get into that a little bit?\nYeah, so, you know, obviously there are costs for all your providers.\nYou know, when you reach out to your funded administrator, they're going to charge a certain amount to get the fund up and running.\nObviously, you're going to need lawyers. You're going to need securities lawyers. They're going to charge a certain amount.\nYou're going to need accountants. So, you have to figure in all those costs into your cost benefit analysis.\nBut the idea is, look, at the end of the day, what are you doing for your clients?\nYou're giving your clients an ETF share that they can monetize at any time on the marketplace.\nThey can margin it. And what's good from you is, if an SMA account holder wants a redemption, well, guess what?\nYou have to sell their securities and give them cash.\nAnd that takes AUM out from your pool. But with an ETF, they're selling that share in a secondary market.\nSo, it's going from party A to party B. It's not a redemption against the fund.\nSo, the ETF itself maintains that asset base, the AUM under management.\nSo, and in addition, obviously, the tax efficiency of the ETF structure is really what's driving the explosive growth.\nYeah, I mean, so I'm just as I'm listening to you in the pros and cons, right?\nI think for an advisor, the pro here is I think it gives you, you know, you're going to spend more money,\nbut it's going to give you a pool of assets and a story to be able to move those assets.\nAnd really for the client, you know, in order for them to move, it makes it less difficult because they're not going to have,\nyou know, an immediate tax liability because they want to, you know, be an original investor or first-time investor in your ETF.\nThat's exactly right. I mean, if you have long-term clients and they've been with you and they really appreciate the strategy that you've been executing and the returns they've been saying.\nYou're just moving that account into a new wrapper and you're going to continue to execute that strategy.\nSo, you know, they're going to stay with you.\nIt's frictional, it's frictionless to them, so they're okay with it.\nAnd it gives them certain advantages, namely that if that portfolio needs to be rebalanced,\nit can be done in such a way that there isn't a tax hit to them at that time.\nObviously, as the portfolio continue, hopefully the strategy produces positive returns,\nthat's going to increase the NAV and the price at which the ETF shares are traded,\nbut you're not going to recognize that tax until you actually sell the ETF shares.\nSo, let me ask one final question I probably should have asked earlier.\nSo, and this goes back to maybe walking through a real-world example, let's say,\nI'm going to try to make this very simple. I have an SMAM only running Apple.\nIt's 50% allocated Apple and it's 50% allocated in a video, right?\nAnd I convert it into the ETF and I take my basis with me.\nOkay? Now, as part of the ETF rebalance, I sell one of those positions.\nLet's say I sell Apple and I buy IBM, right?\nHow do they continue to monitor and follow basis adjustments?\nAnd this might be too technical over time, so that when the client does eventually sell the ETF,\nthey have to realize the game.\nSure. So, let's start with your example first.\nYour example wouldn't work in a 3501 simply because you're transferring two positions.\nIf you're transferring two positions, one's got to be greater than 50%.\nSo, putting that aside, let's say you put it in a diversified portfolio because that's what we need for the past the 3501 test.\nSo, whatever your tax basis is in all those securities, it's called tax slots.\nYou may have bought Apple at 100 years ago at 75 dollars, right?\nAnd now it's, I don't even know what they're trying to do.\nYeah, a thousand, let's say, and you buy it again.\nWell, now you have two different tax slots, and you have Apple, you have IBM,\nand you have Walmart, you know, whole bunch of different securities.\nSo, you'll have a whole bunch of different tax slots.\nAnd those individual tax slots get sort of aggregated and broken up\namong the ETF shares that you receive.\nSo, when you do sell those ETF shares down the road,\nit would be based on that historic tax basis that you had in the underlying securities.\nSimilarly, when the ETF takes those securities,\nit's going to take a carryover basis for those securities.\nHowever, the disposition of those securities with the tax efficiency means it could be done without recognizing tax.\nSo, although they need that information, it generally won't be relevant\nbecause they'll dispose of those securities and create redeemed without recognizing the tax.\nSo, simply stated, I think I understand this on the date of launch.\nLet's see your launch in it.\nNabs 25, right?\nYour cost basis might be reflective of a nav,\nand I'm making up a number lower than 25, right?\nAnd will that show your tax basis?\nExactly.\nYou know, so ETF's generally launched at $25 a share,\nand let's say I have, you know, $2,500 in value.\nSo, I'm going to put $2,500 in the $3.51 exchange in exchange.\nI'm going to get 100 shares.\nSo, I'm going to have 100 shares of the ETF.\nNow, I have to take all my historic tax information\nand allocate it to those 100 shares.\nAnd that's really, in, in, in,\ntransacting a 350 one exchange.\nThat's really where the heavy lift is.\nAnd you have to make sure your custodians are at the plate.\nThe, uh, funded administrators at the plate,\nyour advisors are at the plate,\nbecause it is a huge information exchange.\nUm, but, you know, outside of that,\nit's a fairly simple process going forward.\nAll right. Well, I got it now.\nSo, well, Ray, I really appreciate your time.\nBefore I let you go, where can people learn more about you\nand learn more about the firm?\nSo, the firm is, uh, practice LLP.\nIt's practice.com.\nPractice is spelled PRACTUS.\nI'm told the genesis of that was practice with us.\nWas a, was a marketing thing.\nUm, but, yeah, like I said, we,\nwe are a completely virtual law firm.\nWe have a male drop in Kansas,\nour IT, our, our marketing,\nyou know, few other departments,\nbut the actual attorneys sit all around the country.\nUm, we're easily accessible.\nWe've all worked at big law firms.\nUm, we're very familiar with the spaces that we practice in.\nAnd it's, it's a great place to work.\nUh, you know, I'll make a pitch for lawyers out there\nthat are listening to this.\nIf you're thinking about making a move\nand trying something different, reach out to us.\nIt's a great place to work.\nWell, Ray, again, thank you so much for spending some time with me today.\nThank you.\nI'll read that.\nThank you.\n"}
