{"transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology, they are run on and you want more customization and flexibility.\nAs well as a AI-driven model marketplace, UX wealth partners is your destination.\nOn top of that, they have institutional trading.\nSo if you are an ETF issuer or an SMA provider looking for outsourced institutional trading, UX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and make your practice more efficient.\nWelcome to Behind the ticker.\nToday we have on Al Chu, he is a portfolio manager at the man group and they are the sub-advisor for the American Beacon GLG Natural Resources ETF.\nThis is an active equity-based approach to natural resources and a little bit different approach than your traditional commodities ETF that rely on futures or fund funds.\nWe talk about the process really begins with identifying commodity cycles and drilling down into specific sub-sectors.\nThen finding the best companies in those sub-sectors.\nAl and I had a great discussion. I think you will find this a very unique product and so without further ado, please welcome Mr. Al Chu.\nHey Al welcome to the show.\nHi Brad, thanks for having me.\nSo before we get started, why don't we take a little bit of time, learn a little bit about you and a bit about your background.\nI'm a portfolio manager at ManGLG. That sits within the broader man groups discretionary investment unit.\nThis is an alpha focus alternative manager listed out of the UK.\nAs a part of that, I leave the Natural Resources strategy out of the New York office.\nI've been doing investing in natural resources for a little bit over two decades now.\nBefore Man Group, I ran the Natural Resources strategy at B&W Mellon and a various hedge funds.\nIt's been a really exciting past year because we were able to launch with American beacon a Natural Resources ETF into the market.\nYeah, and we're going to talk about that explicitly today.\nBefore we get too much into the business side, I'd always like to ask people, you know, when you're not behind the desk, when you're not working, any hobbies really like doing for fun.\nOh, yeah, I have two part-time hobbies. One is a part-time bank teller and the AS show for basically paying for stuff for my kids and driving them around.\nSo unfortunately, I'm as bored about as boring as you can get.\nYeah, that seems to be the consensus for those of us with kids recently is the Uber to practice in friends, but.\nSo let's talk about the man group as well. It's an interesting business. So like you touched on it briefly, but what all do you do to kind of help clients and you do a variety of different things.\nSo if you talk about the firm as a whole.\nRight, the firm as a whole, I think there's actually a wide variety of strategies.\nI think the main cornerstone is that it's active management and we are very focused on alpha generation, you know,\nthat's involved are things like mine, you know, active commodity, equities, we have private credit, a lot of fixed income.\nOne of the biggest systematic strategies out there.\nSo really, I think runs the gamut and I think the cornerstone again really is alpha generation and delivering that value to our investors.\nSo I was actually reading on the website.\nYou guys have a connection to the Oxford Research Lab, which does a lot of machine learning.\nJust had on, you know, some AI driven strategies as well. So like, how are you, if at all, right, incorporating any of that data into your research or into your investment process?\nRight, no, that's a great question. I think as the investment world has been changing, I think it really is a hybridization, right, combining big data and kind of leading edge analysis.\nAnd I think man group has been on a lot of the forefronts of that, right, because of the systematic strategies.\nI think we were some of the early doctors of big data.\nYou know, even myself where I run a very fundamental strategy and process focus on, you know, supplying demand and company analysis.\nWe are back by, you know, a very large team of data scientists.\nWe lot of data that the purposes and just really cutting edge technology to help with every day job.\nAnd I think it is that kind of evolution where I think we're really delivering a lot of you unique access.\nYou know, returns to investors.\nSo it's part of like, and I know you're not on the systematic team.\nYou're on the natural resources side, but are they allowing kind of that type of research to really run this entire strategy and evolve it?\nOr there's still some kind of human inputs involved, it's just curious.\nYeah, no, the strategy itself is often the mental right.\nI've been doing this for 20 plus years.\nAnd, you know, at the end of the day, I still think that, you know, my opinion and my judgment would be the most important factor.\nBut then again, it is that we do utilize every, every data that the firm gives us, right, it's a combination, right.\nWe don't rely on these systematic screens or anything.\nIt is at the end of the day.\nData human analysis, human judgment.\nBut we do make it a very data-driven process, right.\nMeaning it's not, well, I feel like this is going to do well or not do well.\nIt has, you know, I like for my opinions and my decision points to be backed by actual data points.\nYeah.\nSo the ETF we're going to talk about today is an American beach.\nAmerican beach and natural resources ETF.\nBut can you talk about behind the scenes?\nLike, what does your role look like as kind of purely, you know, the sub advisor and portfolio manager to a fund that's run, kind of under, under somebody else's banner, if you will.\nLike, what are your day-to-day roles and responsibilities as, you know, PM and how, how are you working collaboratively with them to help, you know, get the fund out there, get it distributed, get it in people's portfolio.\nSure, so I manage it within man group, I manage a team of three animals and myself.\nThat's directly works with this fund and then obviously I'm backed by a big team of traders and the data scientists and whatnot.\nAmerican beach and it's been great partners, there are distributor in the United States.\nYou know, I think one of the things that I really liked about them when I started launching this fund was that, you know, they, I view them as kind of the experts in,\nin, in, in active ETFs, right, given their background with with a cat.\nIt was in the art products.\nI think these guys are having way ahead of the curve and way ahead of the ball in terms of getting in front of the active ETF movement.\nSo they've been fantastic partners.\nSo man group, man geology, man group.\nWe do all the investing, running the actual portfolio and then American beach and helps us with the distribution.\nSure, got it.\nSo let's talk about the ETF, which is MGNR.\nIt's the American beacon, natural resources ETF.\nYou know, at a very high level, can you explain the investment strategy and what this fund is really trying to accomplish?\nSure, so the, we, this is a, a long, only equity product.\nThere's no derivatives, no leverage.\nAnd what we invest in is natural resources, equities.\nNow, this is different from a lot of the other products that are in the market and that one, it's an active ETF, right?\nI think a lot of the natural resources strategies out there are either passive or passive plus.\nAnd I think that is not the optimal roadway to invest in natural resources.\nAnd two is that this is instead of investing in the underlying futures, this invest in the, the underlying equities, right?\nSo for example, rather than investing in oil futures, this would invest in the oil producers or oilfield services companies.\nAnd I think there are a lot, a lot of pros and advantages to investing in the equities that you can look and obviously hung on later.\nYeah, so can you, so at being an equities fund, which is a little bit different.\nCan you walk us through kind of the investment selection process?\nHow are you identifying investment opportunities?\nI know you kind of alluded that it was fundamental in nature, but can you kind of dive a little bit deeper into your investment process?\nSure thing.\nThe, I think the core system to tend the main tenant of this fund really is alpha generation, right?\nAnd I think being an alternative, you know, asset manager, I think that that point is really prevalent across.\nI think the investors tend to think of commodities as they owe it's a broader beta play correlation of one.\nThere's no, all goes up and it all goes down and that really is just not the case, right?\nIf we look at the benchmark, the S&T global natural resources index or any benchmark, a commodities benchmark, he used to become index or the GSEI.\nIf we take the, you know, one year back, three year back, a 10 year back, do good markets at bank market and you separate out the top 50% health versus the bottom 50% health and returns, right?\nThat dispersion of return on average is over 40%.\nRight?\nMeaning there are huge winners and losers in commodities and I think the last couple of years have been the great reminder of people, right?\nYou know, through 22, 21, 22 period natural gas, you know, double tripled, right?\nOn very idiosyncratic natural gas issues, right?\nPipelines, LNG, Russian being Ukraine, petrochemical facilities starting up and on the other side that doing the same time frame, right?\nDoing the same economics, systemic backdrop, right?\nIron ore, what would be the biggest metals by volume and dollar traded was down over 50% at one point, right?\nAnd now that's alpha.\nSo understanding the commodities that's supplying demand drives that dispersion return really is the first lever that we pull, right?\nIt's a commodities first.\nAny given year, there's something that's going up something that's going down.\nThis year, gold has been a fantastic performer contrasted up to oil, for example.\nYou know, another major commodity that has struggled all year.\nThere's alpha to be generated from the commodities, right?\nThen the next step is really to tick the next level of analysis, right?\nIt's to pick the right sub-sector.\nWell, if you do like a minor or if you do like a...\nLet's just say energy.\nYou like what part of the sub-sector do you pick?\nYou pick a producer at oilful services producer, a tanker company, a midstream,\nbecause the pull position returns really changes for the sub-sectors as well, right?\nWe call it right after COVID.\nRefined, it was a big outperformer versus the rest of energy.\nAnd then you fast forward a couple years later, then oilful services start outperforming.\nAnd then the final lever of alpha, the final lens really is just the bottoms up.\nYou know, kick going out there, kick in the tire, understanding the companies, right?\nWhich companies have the best assets, best management team, best portfolio, the rate of change, right?\nAnd then when you combine all three of those, that really gives you something's very powerful,\ndrivers of performance.\nSo just kind of maybe oversimplifying that, to make sure I haven't read it,\nas you're looking for the commodity, favorable commodity cycle at the commodity level,\nthen driving down even deeper to say, okay, which particular part of that,\nlet's just use gold, for an example, which particular part of gold is going to do well\nand then identifying the best companies in that sub-sector.\nThat's exactly right, right?\nSo we're taking more granularity because there is that dispersion, right?\nSometimes we go into different regions, different assets, different parts of supply chain,\nbut that's absolutely correct.\nAnd I think it's that operating and financial leverage, taking by the company,\nthat that really can create access returns.\nSo just about how many holdings is the fund allocated to it any given time?\nI know it's active, but you kind of have a target or can it go anywhere?\nI think a fairly concentrated approach, meaning concentrated meaning,\nif there are 90, 200 names in the benchmark, I run 40 to 50.\nAnd that each position I add on that position is individual positions,\nget over 5%, and then we don't over, you know, concentrate into one specific sector,\nmeaning you won't wake up in, you know, say, oh, wow, everything's energy, right?\nTwo thirds of a sector is the maximum, and then within a sub-sector,\nso let's just say, medals will be a sector, will be over two thirds of the fund,\nand then within a sub-sector, something like copper or gold,\nwon't get over 25% of the fund, and then on an individual position basis,\nit's 5%.\nBecause obviously coming from a alternative management background,\nrisk management is paramount, right?\nI mean, that that's one of the key tenants about what investing is to manage your risk.\nAnd a lot of that is by don't overly concentrate.\nYou want to concentrate to generate returns, or, you know,\nto put it where you have the most conviction,\nbut you also don't want to put all your eggs in one basket.\nSure.\nStaying on waiting for a minute, you know, hearing that, you know,\nmaximum position size is 5% in any one name.\nI'm sure that that doesn't happen, you know,\nI'm sure you're not equally waiting every name,\nand if 5% of some acts from you're going to go,\nso how are you making those kind of minor asset allocation,\nwaiting decisions, once you've decided on\nthe sector sub sector company, is that a conviction thing,\ndata, how are you making that decision?\nThat's a great question.\nIt's a combination, right?\nOne is liquidity.\nIt's rare to find a very small cab,\nill-liquid name in the top holdings,\njust because again, is that, you know,\ninvesting is all about managing the times you're wrong,\nas much as it is about managing what you're right.\nSo if we're wrong, we have to be able to get out.\nThat's liquidity, that's risk management.\nTwo is the conviction level as well, right?\nOftentimes, getting conviction to a name is a process, right?\nIt's a journey.\nIt's not a, oh, suddenly, all the work's done,\nyou know, tease across and eyes are dotted,\nand you know, there we go.\nLet's take a big position in, right?\nSo you put a position in it.\nIt's kind of like a kind of a minor league baseball, right?\nIt's a feeder system, right?\nYou have a lot of potentials, it's a pyramid, right?\nYou build a lot of positions,\nyou build baskets of exposure.\nA lot of times what we do do is that when we do like a theme,\nwe don't take one single stock.\nWe take a basket of names, right?\nBecause oftentimes, if you look at commodities,\nif they earthquake hits a certain area,\nwhatever assets in that region,\nobviously, you would not have a very good day,\nbut then the other parts of the basket\nwill do very well because that's how commodities work.\nSo you want to isolate risk that you can not forecast.\nSo it is part of that, and that will be, you know,\nthat will also affect the different wings and stocks.\nBut it's also kind of the feeder system where you do take,\noh, this is a good idea within a lot of work on it.\nIt deserves inclusion into the fund, right?\nAnd as the data points build for the case,\nit gets bigger, we can add to it,\nor sometimes we're wrong,\nand the data points are telling you to get out.\nAnd that that's part of running the discipline data\nin the process is that the data doesn't lie.\nHuman sentiment, human emotions will,\nbut if you focus on the data,\nit oftentimes that will give you a very correct path\nto up your bets or lower your bets.\nOne more question on kind of waiting\nand where things kind of can get allocated.\nDoes there any guardrails on regional exposure\nin terms of, you know, over exposure,\nor U.S., or Europe, or wherever?\nDo you have guardrails on geographic allocation as well?\nSure.\nI try to keep this as vanilla as possible,\nmeaning I love OECD.\nI love rule laws.\nVery developed and very deep liquid markets.\n80 to 90% of the listings are OECD,\nU.S., Canada, Australia, Western Europe.\nThere is very little EM and no frontier market exposure.\nThis is one of those I want to keep the risk\nas concentrated into the commodities and natural resources world\nfor us is taking something I'm intended\nto like a sovereign risk for my investors.\nSo as you mentioned earlier,\nthe fund is active.\nSo how often is it?\nI mean, are you looking at this daily changing weights?\nI mean, how often are you looking at different shifts\nin the portfolio in terms of sector,\nare you doing that weekly monthly daily?\nHow often are you?\nRight.\nNow, that's a, we review a daily.\nObviously, data is nonstop, right?\nIt's 24 hours, seven.\nSo, you know, if the thesis is developed,\nobviously, we don't think, you know,\na one-day-to-point is going to change everything.\nBut, you know, it is a fluid market in commodities.\nYou can do have to be active.\nYou do have to be tactical because supply and demand changes\ndoes happen.\nSo we review it on a daily, you know,\nhourly basis if you want to save.\nTypical turnover that was about 60 to 80%.\nAnd that really is just a function of, you know,\nthe commodity cycles, right?\nWe're making various bets, some work out, you know,\nat different time frames and then just natural trimming\nand an uping of conviction or lowering of conviction.\nBut typically, 60 to 80%.\nBecause this is a very active strategy.\nSo, you kind of mentioned it there as well.\nIt leads me into my next question,\nwhich is, you know, commodities can be at times,\nlike fairly volatile.\nSo, like, how does the fund handle some of those\nvolatile periods?\nAnd I guess, as well, if there's nothing really\nthat attractive in the marketplace at any time,\nlike, how would you get the fund to be\na little bit more defensive in nature?\nYeah, I'll answer the last questions first, right?\nI think, you know, my experience with the\ncommodities world is that there's typically always\nsomething working, there's always a bull\nand bear market going on somewhere.\nSo, if I don't think there's something that's working,\nit's probably because I'm not trying hard enough.\nTypically, there's always something where, you know,\nI think there could be alpha or there could be\nan interesting opportunity.\nIn terms of volatility, you absolutely, right?\nIf this is a, you know, commodities is not a\ntrending low-volt product, right?\nBut that said, I think that volatility can also be,\nit's two folds, right?\nOne is that it generates opportunity for\nactive managers like myself.\nWe don't show away from volatility.\nNow, in that said, though, my historical volatility\nis, you know, it's hired in the benchmark,\nbut not meaningfully hired, right?\nIt's a little bit hired in the benchmark,\nbecause I am trafficking in large-cap,\ndeveloped markets in investments, right?\nBut a lot of times, the volatility is what\ndrives accessory terms or access opportunities, right?\nOne of the, my things that I would probably,\nnot like to say, we're just a trending market where\neverything works at once, right?\nTypically, volatility is something that, you know,\nI look forward for.\nI don't know when it's honestly the,\nI think the investor base I've gone really sophisticated\nover the years, right?\nThey understand that the same volatility that can be\nview negatively is also a source of the low correlations\nthat commodities can give it portfolio, right?\nThat volatility is backed by, you know,\nafter it was in credit events,\nand the most of the investors,\nI think you manage it by sizing it, right?\nYou're not going to run into a lot of investors\nsaying, you know, I have 50% of my holdings in commodities.\nRather, it's a, you know, it's a hedge,\nit's a real asset exposure, it's a alternative asset.\nIt's a low correlation asset.\nSo it's managed to do various ways and view various ways.\nSo let's, let's back up and kind of look at commodities\nand natural resources as a whole,\nlike what long-term trends are even like future trends\nin that space, you're most excited about kind of,\non the go-for basis.\nSure.\nAnd then one of the things that investors often forget\nis that, you know, through, throughout the history of,\nyou know, mankind, we consume a lot of commodities, right?\nCommodities just really doesn't really go down.\nIt, we look at a long-term chart of, you know, agriculture, for example.\nIt's a pretty steady line to the right.\nEven if we look at something like oil,\nthey're there, but the lips obviously,\nduring the, you know, credit crisis,\nand during COVID, but it's a fairly,\nlike, you say the trending line, right?\nWe tend to eat more drive more consume more build more,\neverything is more.\nAnd if you look at the longer trends that\ngone show for the next two, three decades,\nwe're adding two plus billion people to the world.\nWell, the fact is that, you know,\nthey're going to want to emulate the,\nthe developed market lifestyle, right?\nYeah, we look at one of the things that's been happening\nthat over the last decade plus is that\nduring the commodities downturn, right,\nafter the China's Supercycle Boom,\nis that people stop investing, right?\nYou know, in typically, most CEOs are reluctant to say,\nhey, you know, let's invest in a 15 year developing\na copper mine, or let's build a nuclear power plant\nthat costs 20 plus years to take, or a refinery, right?\nI think there's a tendency for investors\nand for, I think, the common person to underestimate\nhow much commodities we need and how much we consume,\nand that if you underinvest in something,\neventually that under supply will catch up, right?\nAnd, come on, you know, it's actually a fairly,\nyou know, it's any elastic good.\nIt's really hard to drive less, eat less, consume less.\nA lot of times, it's that the path of least resistance\nis just higher prices.\nAnd I don't really believe that.\nI think anything, a lot of long-term themes,\nright, decarbonization, you know,\nwe're shortening all of these things,\nor are underlying its inflationary,\nand it will drive higher demand.\nSo, do you ever see a day where, you know,\nyou would incorporate, as things kind of transition\ninto, you know, renewable energy,\nthat being kind of a section of the portfolio\nyou might be investing in, some of these companies\nthat are, their whole business is renewable energy.\nLike, could you view that as potentially an inclusion\nas a, I know it's on a commodity,\nbut as an inclusionary into the portfolio at all?\nAbsolutely.\nYou know, when I think about energy,\nI tend to think of it holistically, right?\nI think the misperception is that what energy\nis just oil, or it's just natural gas and coal.\nRealistically, energy is everything, right?\nIt's the food we eat.\nIt's anything that powers us.\nSo, renewable, renewable is like, you know,\nit's going to be an important part of the power stack\nof the energy supply chain going forward, right?\nWhether we, people agree with it or not,\nis that over the next, however many years,\nrenewable's will gain more and more market share.\nIt is going to be another arm under the energy, you know,\nstool.\nSo, we do invest in that, and then we invest across the supply chain\nthere, right?\nIt, you know, generation equipment,\nwe actual renewable companies, you know,\npower companies.\nSo, we tend to look at the whole supply chain.\nGot it. So, if you're sitting down,\nyou or your distributor, somebody, you know,\nselling this fund, right?\nAnd advisor has an already diversified model portfolio.\nHow are you advising them or recommending that they use,\nthey use this ETF for, how would you even recommend\nthat they, you know, pull out a portion of the allocation\ntowards commodity exposure?\nSure.\nOne of the things I always like to do with somebody selling\nor distributing this product is, you know,\nrather than starting with,\nthis is a natural resources like commodity fund.\nI describe the characteristics, right?\nSo, here is a very large liquid asset class,\none of the most, you know, largest and most liquid in the world, right?\nIt's a real asset class, low correlations, right?\nLow to very low correlations, not positive,\nnot negative to both that and equity.\nIt's a positive yielding asset, right?\nThis is one of the highest alpha generation potential\nthat, like I said mentioned earlier,\nand it's actually a very effective inflation hedge.\nAnd usually when I list those qualities out,\nOwen is a very easy to invest instrument.\nAnd when I list those qualities out,\npeople are like, oh, that's great.\nThat's same to you.\nBut what is it?\nAnd then it's, well, it's natural resources ETF.\nAnd then they're like, oh, okay.\nAnd then they really have to think about it.\nAnd, you know, each one of those points is actually,\nyou know, does describe the natural resources.\nYeah, a lot of times now, you know,\nI think the investor base is getting smarter and more,\nyou know, well, educated, right?\nI think it's kind of the winding down of this traditional 6040 model,\nwhere they're like, well, you know, the more actually,\nif we add alternatives in or we add real assets in,\nit really does move the portfolio, you know,\ninvestment curve, you know, higher in a better level.\nIt comes from a various, from various sources of funds, right?\nWhen people think about real assets,\nit's typically infrastructure or real estate,\nand increasingly people are realizing,\nwhat commodities can actually add,\na very interesting component to that.\nOr a lot of folks look at it from a value perspective, right?\nWe think about the periods over the last several years,\nwhere value strategies have worked.\nYou know, a lot of times you'd be disaggregate the performance,\ntypically, well, their allocation to energy materials or financials.\nIt's only a couple of sectors, a couple of drivers,\nthat really makes the asset class work,\nand I think the investor base is really starting to think,\nwell, is there a more dollar efficient way,\nrather than buying a basket of every value name out there,\ncan I just concentrate it in X?\nAnd then some people do use it as a geopolitical hedge, right?\nIf we look at, think one of the biggest,\nI think mega trends now,\nlooking at increasing geopolitical fragmentation.\nAnd that's, you know, domestic foreign.\nAnd this shows no signs of evading.\nAnd if we think about, well, how do you hedge it,\nor how can you effectively invest in it?\nNatural resources is actually a fairly elegant way of doing it.\nYeah, and the other thing that makes your fund unique is that\nit's getting the exposure via equity, right?\nA lot of the other commodity funds out there,\nyou know, are buying futures or they might even be fund funds of commodities, right?\nSo I think you even have a more interesting story\nto grab like a larger market share inside of a model portfolio,\nrather than just kind of being viewed as like an alt, right?\nRight, right, right.\nThere a lot of pros to investing in the equities, right?\nOftentimes, you get the same commodity correlation, right?\nA oil company falls oil.\nIt doesn't really, you know,\nthe correlation is higher to oil than the overall market,\nbut yet you get some equity premium to it.\nThere's always a dividend yields don't go below zero, right?\nSo you always have to get that potential zero to positive dividend yield.\nFor ESC concerns, it's, you know, it's easier to, you know,\nto push for change and to manage and traceability\nfrom a company viewpoint versus a generic futures, right?\nAnd honestly, it is the alpha potential, right?\nThe ability to pick sub sectors to pick individual stories\nwhen you write about the commodity.\nSo the equity, I think there's a lot of elegance to it, you know,\nin many ways, it's a very good outstrap.\nYeah, well, I really, really appreciate your time with us today,\nbut before I let you go, where can people learn more about you?\nWhere can people learn more about the fund?\nThey can, man group, our website will have the fund.\nI have a lot of literature on there as well, white papers\nand blogs that written on various topics.\nAmerican Beacon website, the Result and American Beacon website\nwill also have a lot of the papers and the findings and whatnot.\nWell, again, I'll take you so much, ladies and gentlemen.\n"}
