{"transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology, they are run on and you want more customization and flexibility.\nAs well as a AI-driven model marketplace, UX wealth partners is your destination.\nOn top of that, they have institutional trading.\nSo if you are an ETF issuer or an SMA provider looking for outsourced institutional trading, UX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and make your practice more efficient.\nWelcome to Behind the ticker.\nIt is a special edition episode.\nAs we do not do episodes in December, it gets too hard with people traveling.\nThey're at holiday parties.\nYou know, getting this thing out every single week,\nduring this time of year is almost impossible.\nSo this will be the only episode for December.\nAnd it is a great episode for December.\nIt's a little bit of a longer listen.\nIt was recorded at the UT Cat 2024 global analytics conference on AI in finance.\nAnd I have the pleasure of moderating the panel with three guests.\nWe're going to hear from all three today.\nTao Schwartz, who is the CEO and founder of AI funds.\nYou have studio hola, who is the CEO and founder of my stock DNA.\nAnd you have Kyle Wigs.\nWho is the CEO and founder of UX wealth partners?\nWho is the sponsor of this show?\nSo we're going to have really, if you count myself, four people who have a significant amount of experience in the AI space,\nwhether that's delivering models or actually implementing these into client accounts and delivering them to advisors.\nSo this is a really great discussion.\nWe could have talked for five or six hours, but you get an hour here.\nSo without further ado, please enjoy this special edition episode of Behind the Ticker.\nHi, everyone.\nThanks for joining us again.\nNext, we have an exciting panel on the future of smart investment strategies.\nAnd how AI is going to play a central role in this future.\nLet's invite our moderator, Brad Roth.\nBrad is a founding principal and chief investment officer at Thor Financial Technologies, which launched DHLV, a low-voltality ETF in September 2022.\nWith over a decade of experience in creating operations and financial advisory, Brad has extensive expertise in investment strategies and fund management.\nPreviously, he was a managing partner at Sardonex Capital managing a quantitative securities fund.\nBrad also holds the behind the Ticker podcast featuring interviews with ETF issuers and service providers.\nHe holds a bachelor's with honors from DuCain University and completed his coursework at NYU for certified financial planner designation.\nAdditionally, he holds CD's 66 and CD's T licenses.\nBrad, welcome.\nWell, thank you.\nAnd that sure was a lot there.\nI don't know if it's all that was needed, but hello, everybody.\nAnd thank you to coming to our discussion today.\nLet me turn my video on along with everybody else.\nYou know, we're here to talk about the future of AI investing and how we are delivering those solutions to clients.\nSo, look, we've all known we've been making using computers to make investment decisions for a very long time.\nBut it seems like that trajectory has really started to pick up here over the last handful of years.\nAnd it's only getting more exciting.\nBut today I have on three really special people with me.\nI consider all three of them friends.\nI have Kyle Wigs from UXWELF.\nI have CDRHOLA for my stock DNA and tile swartz from AI funds.\nSo, gentlemen, thank you very much for being here today.\nAnd why don't we go down the line, maybe starting with Kyle.\nGive a bit about your background and the company that you're here in the company that you're working for.\nYeah, thanks, Brad.\nThank you, Kumar.\nIt's good to be with everybody.\nSo, my name is Kyle Wigs.\nI am the co-founder and CEO of a company called UXWELF Partners.\nJust a brief bit of background.\nBeen almost 20 years in the wealth management industry.\nSpending a lot of time with financial advisors who work with the community,\ntaking their feedback and ultimately running, you know,\nbroker-doer platforms from technology to investments to sales and distribution.\nAnd it was a long Mac journey that I realized our industry was not keeping up with other industries\nin terms of bringing things like artificial intelligence to the clients that we ultimately serve.\nAnd so we launched UXWELF Partners as really a dedicated platform.\nBringing trading, billing, reporting.\nTo be able to support and service some of the strategies that you're going to hear about today.\nBecause a lot of the legacy technology providers that exist,\njust really don't have the capability to deliver some of the modern strategies that you're going to hear about today.\nThanks, Kyle.\nMaybe we can go over to the studio.\nHi, everyone.\nMy name is Sathir Hola.\nI do need to get a better camera.\nThese guys are looking better than me.\nI am the founder and CEO of my stock DNA.\nBefore founding my stock DNA, I was a managing director with Accenture.\nAnd my career has essentially spent the crossroads of technology,\ndata science, artificial intelligence, and all finance.\nAs my stock DNA, we were formed on a basic, simple but elegant premise of winning by not losing.\nAnd what does that mean?\nI mean, if I were to translate into that in the financial market terms,\nI mean, is that you manage this so effectively,\nthat even a blindfolded chip picking stocks can outperform the S&P 500.\nNow, I understand this might sound counterintuitive to many who believe that reducing risk may mean,\nyou know, also lower returns.\nBut that's what we, that's what we leveraged AI for,\nto be able to manage risk so effectively that has a by-product to get higher returns.\nAnd look forward to talking about that later in the talk in the session.\nThank you, studio.\nCiao.\nThank you everyone.\nIt's a pleasure to be here.\nBrief back on to myself.\nI, let's see.\nGot a peach Dean finance for Cornell.\nTodd is a finance professor at the few different universities in the hall.\nAnd a few others.\nI was a quantitative researcher at a few different hedge funds that could have been sitting down.\nAnd I had my own startup.\nAnd then in 2018, was deciding what I want to do next.\nAnd realize it was a big opportunity with AI and finance, which was my, my love.\nSo, decide to start AI funds.\nWhat the idea, the vision at least, is that AI really is destined to manage most of the assets that are investible.\nAnd the reason I believe that is because, and this is before tragic picking everything else,\nis because I saw what AI is able to do with narrow AI in many, many different domains.\nAnd, and the fact that it was able to exceed human ability in games and other areas.\nSo, the idea was, why can't it not do that also in finance?\nSo, that's the reason we started AI funds with idea that this is really the biggest trend that's going to happen over the next few decades.\nAnd it's an opportunity that we all need to take advantage of.\nGreat.\nWell, hey, I think before we get into, I really want to open this up as a discussion session, but I think before we do that,\nI think let's kind of answer the overarching question, which is, you know, I'd like to get each one of your perspective on how you really see AI redefining the investment landscape.\nAnd really that's now and also in the future, because again, it's happening fast.\nThere's a lot of changes going on.\nSo, maybe let's just take that same order and start with Kyle and maybe give your, give your perspective on, you know, how AI is redefining a landscape.\nSo, as I think about it through the lens of the financial advisor community.\nI guess Brad, I would break it down into three categories. What I see somewhat working effectively today.\nThe second part would be where I think we're making a bit of a mistake as an industry, and I think to tiles comments, what's the opportunity?\nWhere are we missing it today? And what does that future look like?\nI think in terms of where we sit today, what's my observation of what's effective is you think about like a client resource management system.\nPresumably most people, you know, and today's session are familiar with like a sales force.\nWe're seeing the utilization of artificial intelligence to gather and organize data and information, but I think is effective.\nI think it can always get better in terms of how these various technologies interact and potentially integrate with one another, but that to me is effective.\nYou think about things like gathering large volumes of data and creating real time insights. You know, you're walking into a client meeting.\nLet's say you're preparing for tomorrow, and you've got an overwhelming, you know, volume of data and information.\nAnd I think going through that organizing and pulling out real time insights certainly works.\nAnd as effective today, and then the last one is is tile talked about things like chat, GPT, we're starting to see some of the advisory community.\nReally, I think improve their communication capabilities, and so I think that is working well today can always obviously get better.\nOne of the huge mistakes that we are observing is none of us like to get into a service call where we get into an AI loop.\nThis has created a lot of frustration. There are some firms that are in the industry today that are scoring really poorly in terms of customer service.\nAnd I think there is still that human component that's really important that some of the ways AI is being utilized today is ineffective.\nWhat's the opportunity and where we had it.\nIt's the investment piece and we're going to talk a lot about that today, but when when I travel the country and I sit down with your traditional chief investment officer that's running a multi billion dollar firm and they have an investment committee.\nThey are still using old ways to try to solve new problems.\nThey're sitting down, they're pouring through information and data and they're using humans to make investment decisions.\nAnd ultimately, when you really unpack that, you know, the conversation with the CIO or the investment committee, they are viewing these tools that you're going to hear about today as a threat to their job.\nAs opposed to thinking about man versus machine, it's really the idea of man and machine, how do we bring AI within the investment decision making realm to the client, the advisor, ultimately their customer to make better decisions long term.\nThat's for the opportunity to realize and that's where I think the miss is today.\nThat's great Kyle and I think you're perspective from more of a tamp and a software is helpful and sometimes we're only thinking about the investment side rather than how it can help from a service side.\nSo, studio and towel, I think you're going to be able to talk on that at length today.\nSo, studio, why don't you go first, like how do you see AI redefining the investment landscape and kind of where are we going in the future?\nI agree with everything that Guy said.\nBut seriously, I mean, he makes, he made some very valid points and I think we would all agree with them.\nI think basically with each wave of innovation that you see, whether it's with calculators, spreadsheets, internet computers, high frequency trading.\nYou're essentially going to see, at least on finance, I see the impact on three different dimensions.\nOne is the data and the analytics front, the second is efficiency and the third is, which I don't think it's talked about often is the human emotion part of it.\nThe data part of it is pretty straightforward.\nSo, democratizing access to large volumes of data and then use that decision to enable decision making at higher scale and speed then was done before and then you use that to drive decision making.\nEfficiency, this is again straightforward, right?\nSo, I mean, just like computers have you being more efficient, AI is going to help you being even more efficient.\nYou'll replace the capabilities of an entry level analyst and that's where we see a lot of the focus of AI, especially right now in finance being.\nWe're improving the efficiency.\nThe third aspect, which is managing emotions, now like it or not for both more most of the retail investors, which is what our community deals with the financial advisors.\nFinancial markets are a lot about emotions. It's about the emotion of fear and greed, right?\nSo fear when the market is going down, what the hell is happening, what's going to happen to my profile, portfolio and so on and so forth and greed when somebody else is making money or anybody is making money and then you have the, you have the case of envy.\nLike everybody in Bitcoin today, right?\nThat's, that's, that's right. And then, you know, before the elections was, I won't happen to the market market because now it's like why not in the market.\nSo it is a lot of emotion which guides that decision making in the financial markets.\nAnd I think artificial intelligence has a potential to significantly reduce the impact of emotions on decision making and be able to do that fast, right?\nSo now as my stock DNA, we built our AI, it's called Darwin and we built that on one guiding principle which is to win by not losing.\nNow, if you imagine the stock market like a, like a hill that you're running on, right? You run up the hill, you run down the hill, run down the hill, run down the hill. What that essentially means for us that is that if you avoid going down the hill, you don't have to spend as much of an effort digging your way out of the hill.\nSo that's that's equivalent of managing managing risk.\nNow for us, within my stock DNA, what we are leveraging AI for is primary, the first dimension, which is taking into account large volumes of data to account for whether we should, you know, whether it's a small nature of big ditch and how should we avoid the ditch.\nAnd the second is being able to unemotionally take that decision.\nSo the emotion part of it, you know, is a significant component in what we are better.\nTell us the, the same question to you for the third time, you know, AI, how do you see redefining the landscape down in the future?\nOkay, so when I look at the landscape today, really when you look at it from a perspective of the strategies that investors have available to them.\nYou have under one hand passive strategies, where essentially you mimic an index, usually a capitalization weighted index, and then you have the active strategies, which today are mostly human run active strategies.\nMeaning there's a portfolio manager making a decisions about when to come in and out of the market and how much risk exposure to take and what assets to invest in.\nNow, if you look statistically at the active strategies, you can see that they statistically underperformed the benchmark.\nIf you look at the large cap investor human investors, something like 85% of them underperformed.\nAnd this is published data by SMB standard course, so we know that humans tend to underperform the benchmark, okay, and the reason has to do like so dear said has a lot to do with emotions, okay, because unfortunately we were not designed to play the stock market we're designed to, you know,\nif the revolution to survive in the Savannah and when we see a lie and we know we need to run away so when the market starts falling guess what we want to run away.\nAnd that ends up hurting our performance as human managers.\nAnd this would be mentioned AI does not have emotions, so it's actually able to take advantage of those situations and actually generate alpha during those situations.\nSo I think the biggest opportunity for AI today is really on the active side because there there's already underperformance and people are still there's more active investing than passive although passive has grown a lot over the past few years.\nBut there's a huge opportunity there because AI can un-outperform, which potentially outperform human managers and I think that's really the direction the market is going to go first.\nSimply because AI for a bunch of reasons one it can process a lot more data than humans can it makes unemotional decisions and it's able to make predictions that are much more sophisticated using sophisticated machine learning models.\nThey do a better job predicting both potential return and potential risk and as a result you're able to build smarter portfolios that will do better both in up markets and down markets.\nSo that's a high level view of where things are going at least in my view and we can dive deep into how specifically we think we can help make that happen.\nWell you led me perfectly into our discussion segment we're going to do four segments the first is the role of AI in portfolio management so tell I'll come back to you you know what doesn't AI portfolio look like an actual practice.\nIt's one thing to build a portfolio it's one thing to have a bunch of data it's another thing it's another thing to actually implement them and to allow an investor to actually act on these these changes of what AI wants to do.\nSo you know what does it look like in practice and can you talk about your you know particular respective approach when it comes to portfolio management.\nSo basically the AI we build is called baila baila stands for Bayesian AI learning algorithm and baila really tries to do two roles that typically you see inside investment houses.\nThe first role is that of a macro strategist and the second role is a portfolio manager.\nThe macro strategist aspect is trying to figure out what type of environment are we in is this a bull market are we in a bear market okay and you see a lot of famous.\nThe macro strategist from famous investment houses making predictions about whether we're in a bull market or bear market and sometimes they get it right and sometimes they get it wrong.\nBut usually what they're doing is they're looking at the current economy and they're saying interest rates higher inflation higher stock markets doing this and so on.\nA bunch of these indicators they go back through time and they find what is the most similar time to today and based on that they make a prediction about what's going to happen now.\nSo they usually take a one or two or three data points from the past and try to do that by using visual analysis or something of that nature.\nAnd what we've done with baila is actually trying to do that an systematic basis so that we don't just take one or two times we take every similar time over the last 50 years.\nSo in the sense you're getting a distribution now if you take the most similar fingerprint of the macro economy today and you match it to the past.\nYou end up figuring out that you know the match is not on you know it's not just a 1979 it's also 1973 and 1968 and so on.\nSo there's a lot of times in the past and sometimes the market went up and sometimes it went down so you get a distribution and then you can make a prediction.\nSo the macro side can actually tell you over the next few weeks and that's the horizon that we're making a prediction over the next few weeks one to four weeks usually.\nIs the market more likely to go higher or go lower okay once you know that once the prediction is made and this is a statistical prediction it's not 100% right.\nBut it's trying to make a prediction about bigger drawdown so drawdowns a 5% or more so you know if it's small blip down that happens all the time it's the big ones you're trying to avoid right.\nSo it's making a prediction on that and then the next stage is now we have a portfolio optimization that figures given what we know where the market is going.\nThen what is the right portfolio okay what is the right mix of assets given the clients risk level.\nSo we match it to different risk levels and then we have a particular portfolio that's designed for that okay so it's designed with the right mix of assets.\nAnd you know and you know we have the traditional 6040 portfolio for and you know a investor that may be in the middle range of risk a version.\nWhat you tell the I will given that level of volatility what is the right mix and sometimes it doesn't 40% in bonds but many times it doesn't it has other assets that offset the correlations and reduce risk.\nYou can talk more about what is risk really for investors it's really the downside risk so you have to also optimize for that in a smarter way.\nSo there's a lot of things we can do is as you know the AI can do to help us build portfolios that are smarter.\nSo you have those two parts that they will do is put the macro strategies the portfolio manager and at the end you get a better overall portfolio performance out of sample not just in back testing but also in real time performance.\nSo tell with with all of that being said right you get an output so how then does that output get put into practice right meaning.\nHow often are your portfolios changing their investment outlook and how often are you then delivering that to the client.\nSo typically we run so baila adjusts it's posture every week so every week it's looking ahead one to four weeks into the future.\nUsually the posture stays the same it's you know as the market usually risk on okay so stays risk on and it's been risk on for many weeks once in a while you get a risk off event where you see okay does a risk here.\nFor example this year we had the risk off event on April 1st of bailo and risk off it said this is a bearish environment it went risk off for just three weeks and then went risk on back on and and during that period.\nThe market was down a little bit over five percent so we're able to avoid that and then come back in and capture the upside.\nSo that was this year every year it's a different I can give you an example in 2022 it went risk off many many more times it was a downward year and bail out was I think out of the market much more than was in the market okay.\nSo really depends on the year and the level of volatility and you know and the signals that it's seeing in the different indicators it's looking at.\nBut typically it's every week and and in general does a rebalance once every four weeks because the patterns and the underlying assets of change and it's typically not opportunity to improve the portfolio performance by rebalancing every four weeks so these are active strategies.\nThey don't necessarily trade every week but they trade about once a month typically and then they go usually risk off twice a year and average I would say.\nAnd then average year but it changes year to year this year was only once so far and we've been bullish to hit the entire year great so.\nYou know there's not always just one size fits all in terms of approaches here so city or Darwin takes a slightly different approach to how you're using AI so.\nPlease why don't you let all of us know a little bit inside the back end of what you're doing over there with my stock DNA.\nYeah sure I mean it's it's interesting to mention bailers so I built bailers boyfriend Darwin.\nSo Darwin as you said Darwin has a slightly different way of looking at the market slightly differently a lot of the the concepts are very similar.\nAnd the way I would describe it is you know I use this analogy often right so think of it as basically let's say.\nYou know you're driving from Austin to Dallas and you have a choice of multiple lanes to pick to get to your destination.\nYou have to take into account the weather conditions you have to select the right vehicles you have to be able to change lanes at the right at the right moment and so on and so forth.\nNow imagine your portfolio to be somewhat similar where instead of lanes you have different asset classes and stocks and instead of the.\nInstead of the weather conditions you have market conditions to many were but the challenge remains the same you need to get to your destination not just fast but also safe.\nSo Darwin as an AI does something similar what it does is it takes into account these all of these.\nThe market conditions those different lanes that you're navigating and increases the and tries to maximize the the the return to rest which means you want you to get to your destination.\nFaster but also safer.\nNow if it's possible in the in the technology world to kind of take the leap of faith of self driving cars.\nThen the same analogy holds true for your portfolio if you if you've constructed in a similar to a construct of a video game.\nAnd that's what AI does it it for us it navigates the different asset classes and lanes and tries to get to its destination.\nAnd I'll perform the index in the process of doing so it's great.\nI think back to Kyle's earlier point with man and machine I trust myself driving car about 90% of the time but every once in a while I got to hit the break and turn it off but.\nThanks for that both of you so look we've got very complex strategies that are spitting out weekly signals.\nKyle sits on the other end where UX partners has to enable an actual incline.\nTo implement these signals trade these signals right it seems easy on the surface but actually you know it's it's quite difficult so Kyle with you know the the twenty some thousand accounts that you have over at UX that are.\nTaking in these signals on a weekly basis sometimes a daily basis you know what needs to be implemented in order to handle strategies like these.\nYeah so one of the great joys but also challenges is taking the complexity of what talent suit dear and others have built and how do you get that into the actual client account.\nTo get from there to theirs is actually really complex problem to try to solve that maybe an analogy for the group to think about.\nThere are some brilliant architects in the world and sometimes they design things but then the general contractor has the task or the role of building it and sometimes the the concept as an architect is wonderful but it's not always something that can be implemented.\nAnd then they try to eliminate as many of those sort of friction or pain points as possible is what UX is solving for in the marketplace how do we get what these guys just described as closely as humanly possible into the end client account.\nAnd then you start to ask questions around how do you do it at scale think about all the custodians that are available.\nI won't name them all but you've got the shawbs and the fidelitys of the world the apex the axos you know the list is is very long.\nThey all have their own parameters and so we have to think about how can we deliver how can we grab all the data grab the strategy and then execute that.\nSometimes we might get a strategy that says listen we got to execute this at five minutes to close across six custodians and 15,000 accounts.\nYou have to think about how to implement that things that oftentimes Brad get overlooked we have to think about things like model minimum some of these strategies have.\nIn some cases a hundred thousand dollar minimum so that we can fill the orders because if you take a custodium like Charles Schwab they don't allow for fractional shares you have to buy a whole share of everything in the model whereas you could go to other custodians.\nYou know maybe it's a folio where you do allow for fractional share so we have different minimums that we have to adhere to you think about things like liquidity constraints some of these ETFs have you know very high you know minimums just to access the ETF itself let alone the strategy.\nAnd then you start thinking about things that maybe not a lot of folks would think about I have a signal that comes in perhaps it's individual activities maybe it's a basket of ETFs.\nWhat's the trade risk of trading these you know particularly when we're dealing with a market environment where the markets are really volatile and how do we do that how do we rebalance these accounts and minimize the best possible ability to trade risk associated with that.\nBecause if you make a mistake some of these mistakes I've seen you know not unintentionally but there could be a trader that could happen that could cost you know several hundred thousand dollars.\nAnd then you start thinking about maybe Brad the last two options which we've heard two things to consider which would be what are the tax considerations I know you at bore have built out some ETFs and there's other discussions of how do we take a strategy in an ETF structure.\nAnd minimize some of the tax implications or how do we use AI as an overlay to manage tax lots and and locate those tax positions in a way that is most tax efficient to the specific client.\nAnd then the last one would just be speeding quality of execution trust me when I tell you you know your counterparty is not there to do you any favors when you're executing these securities and so knowing exactly who you're trading with.\nHow quickly you can execute across various custodians and the quality of that execution all of those I think broader factors and delivering the best experience for the client to try to implement the strategies that these guys are running great.\nSo let's move on to segment two and I'm going to open the floor up to all three of you so anybody can jump in here and I'd like to keep this a little bit more conversational which would be look we just learned how AI can create really sophisticated strategies.\nWe touched on some of the main benefits, but really how is AI solving some of the many pain points for investors that traditional investment paradigms just can't solve for anybody is welcome to take that one first I can jump in.\nSo putting on my professor a finance hat.\nI think we still live in a paradigm that was built in the 1950s which is Markowitz portfolio optimization for those of you would don't know Harry Markowitz.\nOne Nobel Prize for his innovation which was amazing in the 1950s essentially what he did is said you know.\nWhat we try to optimize his investors is risk versus return and or maximize return versus risk and risk is stand deviation of volatility in the market.\nAnd back then he didn't have computers so he could still get a solve solve a close form solution for volatility and actually solve it out and figure out what is the optimal portfolio turns out it's portfolio and something called efficient frontier.\nAnd there we're taught I used to teach just the MBA students we teach that as an investor you need to get to the efficient frontier need to get to the high point meaning the point with the highest return and the lowest risk and that's volatility well guess what.\nThat was an amazing innovation but since then we've learned a lot we've learned that humans don't really try to optimize volatility in fact what you're trying to do is minimize downside risk.\nSo the downside volatility and they don't mind upside volatility in fact they like it so the more volatility is on the upside the better.\nSo really what we're looking for is type of an asymmetric return and as it turns out that's extremely difficult to do by hand in fact you need machine learning and artificial intelligence to solve these type of models.\nSo once you figure that out you realize you know really to match what we as human investors are looking to optimize for which is this asymmetric return where we're trying to maximize the upside volatility and minimize the downside volatility or the downside risk or the drawdown or whatever way you like to think about that risk.\nThat's really what we want to do and the only way to really do it is the computers because it's extremely complicated.\nEspecially when you have a universe of many assets and you're trying to build a portfolio and when you look at the math of it.\nWhere you have every asset and you have hundreds of assets and every asset can have a different weight turns out the universe of potential portfolios is huge it's more than the number of sands of grain and planet earth.\nSo it's a huge number and you can only really do it with a computer and machine learning can solve for those portfolios.\nIt's very hard to do but it's possible. So that's kind of I think an area and that's why this paradigm shift needs to happen because too many portfolio managers are still running portfolios and min various optimization.\nThey might look at a certain erasure which looks at the downside risk but typically.\nThey don't really know how to optimize for that or for much more sophisticated ratios of risk and return.\nSo I think that's that's the direction we can go. So dear to you.\nI wanted to completely agree with you and I think I think we have Professor Kumar that he's also going to agree.\nSo see the Markovic efficient frontier made sense at a point in time, right?\nBut then you can see the sense in the 6040 both stocks bonds which has been kind of taken as the dictat and you saw how that performed in 2022.\nSo the point is the correlations between these asset classes the things change and they evolve.\nBut for me, I want to talk about this so what you know it kind of hit a nail on the head there.\nSo I want to talk about this emotional risk frontier that I talk about, right? So we talk about AI for data analysis, but I want to talk about AI for managing emotions.\nThe emotional risk frontier is the level at which an individual investor will start panicking, right?\nOh man, Markovic is going down. I need to switch. I don't like this advisor or I don't like this manager or I don't like this portfolio.\nThey kind of start switching across different asset classes or different portfolios.\nAnd in the process, they kind of they destroy their own data.\nNow is it possible using AI to scale portfolios to such a level where you cater to individualized emotional risk frontier?\nSo the level at which, let's say, Brad, you will panic will be very different from the level at which say a Kyle will panic or a Tal will promise or a retail investor will panic.\nCan I create portfolios managed to return risk profile that we talked about in such a way that it caters to your individual emotional risk frontier?\nAnd I think that's something for me at least that becomes very interesting.\nYeah, just quickly. So we actually produced a piece of the evolution of investing and to what these guys are talking about.\nI actually met Harry Markovic and you never really intended for his thesis.\nI mean, it was created in a vacuum in a fact. It was an academic paper to become the standalone thesis to how we manage money.\nAnd we're still doing it by in large 70 years later.\nIt is absolutely mind-blowing when you think about what other things in your lives today or do you think are operating in a fact the same way they were in the 50s.\nAnd I'd be hard pressed to find something.\nAnd so we have a piece that really speaks to how technology has redefined every industry.\nYou think about this meeting today. This meeting in the current construct doesn't happen when Markovic rolled out with his theory.\nAnd so we've seen so much sort of evolution if you well. I think it's time that our industry really embraces it. We did a paper at a prior stop.\nFor me, probably about 10 years ago, it was done by one of the portfolio managers at a company I was at and the title of the paper was volatility is not risk.\nAnd the analogy that he drew was he went out and he surveyed thousands of investors and he gave him basically two options.\nAnd in these options he said, which of these two outcomes would you be more likely to trade your money for?\nAnd in a fact, if I could simplify it, it was the idea that in one portfolio scenario, you had more drawdowns.\nYou ended up with, in effect, the same result. But in the other portfolio scenario, you had massive drawdowns and the potential to lose a lot of your wealth.\nAnd what he found statistically and overwhelmingly was like 95% is most people are afraid of losing their money. They're not afraid of volatility and the analogy towel that he talked about.\nAnd we've talked about this paper is he compared it to flying. There are people that are terrified of flying. And anytime there's turbulence in a flight, they start to react emotionally to that turbulence.\nWhen in reality, turbulence is a sort of everyday part of flying. What they're really reacting to is they're telling you they don't want to crash and die.\nAnd they in their brains have made the connection between turbulence, bad turbulence crash.\nAnd what really we're talking about here is that volatility is a normal part.\nCal talked about it earlier of investing. But what investors are really telling us is they don't want to lose everything.\nAnd that's where I think the emotional component of using AI to manage substantial drawdowns is something that humans have proven as we talked about.\nThey're just ineffective at doing. And I think that's really the potential.\nYeah. Well, I'm gotten use of turbulence coming in and out of Denver to see you, Kyle. So, but talking about crashing here. This is more for studio and towel, which is building an AI system based off of what's happened in the past learning from that and building signal going forward is one thing.\nBut like, what are the challenges in designing your particular, you know, mouse traps, if I could, they can, they can help it respond to unprecedented market events and, you know, really ugly volatility. So, either of you, happy to take that first.\nI'll if you don't mind, I'll go first on this. This is a favorite topic of my because I keep getting this thrown and even if I give you look at the question and answer, there's a lot of questions around that as well saying that.\nLook, how do you know, this is going to perform, right? I mean, you know, what performed in the past, how do you know for sure that it'll, it's going to perform in the future.\nIt's not, you don't know for sure, right? So, there's, there's an industry joke that there isn't a back test that, that, that, that, you know, the, this typical large advisors haven't seen that they love, right? It's very easy to create a portfolio now, which shows a fantastic greater and if you put NVIDIA and Amazon back in the day and say, look, I mean, fantastic results, my portfolio performs great.\nAnd that's really the, the the the biggest challenge as we go on. So, whether you call it back testing curve fitting forward bias server bias, you can use a whole lot of terms.\nBut these terms are just as have implications for AI as much as it is for humans, right? So, as humans as well, we tend to make biases based on what we have learned in the past.\nSo, one thing that I want to emphasize here is that it's not that you can eliminate forward bias or server bias or the curve fitting. You can reduce the impact of that and reducing the impact of that has a combination of two things.\nAI can be used to predict AI can be used to react. Everyone in the, in the last two days have talked about predicting predicting the earnings predicting the next stock predicting how the market will do in the future.\nThe acting is as important and reacting using AI is more important is as important as well. So, I don't know if you guys have heard this, this, this experiment, which was done called the turtle traders.\nSo, it was Richard Dennis as a trader who basically trained several novice guys out of the street and within a couple of weeks, he trained them to become to manage their portfolio and they're pretty successful.\nSo, so for me, it is about not just addressing the prediction part of it, but being able to address the forward bias, server bias and so on and so forth in the reaction part of it.\nSo, what we've done on the my stock DNA side is we have two monkeys. We have the blindfolded chip, which essentially picks stocks at random and then so the theory is that if a model can perform well with random stocks, you can be reasonably certain that it performs well in the future if you're throwing random events at it.\nAnd the second is a netflix inspired chaos monkey. So, what we do in this is we essentially go and randomly change returns from positive to negative returns and that's again to test the efficiency of the model in terms of managing the downside risk.\nSo, as long as you balance these two, the prediction versus reaction and you're able to do it, I think that addresses the the point that we were talking about that.\nTell anything to add there.\nYeah, I do. I mean, with bailout what we do essentially is we train it over time to learn what are the patterns that indicate that the market is more likely to go down than no.\nSo, in a sense, it's doing what a classical machine learning a paradigm of classification. And this is something that's very, it's a classical thing, but the way to solve it for the market turns out not to be classical at all because it's a very chaotic system.\nSo, you need something that's extremely robust and in some ways because it's robust, that's what makes it more successful because if it does find a pattern, it's more likely to be repeated.\nNow, it's still statistical. So, what that means is, yeah, it worked in 2008, it predicted that, it predicted 2018 and 2001.\nAnd in between, it also sometimes predicts things that don't happen.\nAnd sometimes it predicts things, it misses some drawdowns that do happen, but if it could capture most of them using this evolving and learning paradigm, then it's more likely to work in the future.\nNow, there's no guarantee, obviously, but you can kind of, you build confidence over time because you can see that the patterns, it detects tend to repeat.\nThat always repeat the same, too, because the factors change over time, because what's important today wasn't important even a year or two years ago.\nAnd so, you know, inflation now is relatively high, but it's lower than was a year ago, but it's still higher than was two years ago.\nSo, it's, it things change and what's important to the model also evolves over time.\nSo, I think that's important because it's not exactly, it's an evolving system that's learning over time, that will be done with the, the L and Bala.\nAnd the idea is that it's trying to find those patterns, the tend to repeat, but at the same time, they have to be extremely robust because because you don't want things to change to quickly over time, because these things, you know, they need to work now and they also need to work, you know, five and ten years and 15 years ago.\nSo, you want something like that to work for you and really it's a statistical game at the end of the day.\nIt's not going to get everything right, but it's going to get enough of the drawdowns right, it's going to make a big difference for your portfolio.\nThat's the expectation and that's what we train it to do.\nIf you don't mind, I want to add on to that. So, we, I'm not a study of of all the famous analysts that we have heard of right, I mean, so it did the list and I did a study on terms of how accurate they were their predictions for the following year.\nSo, at the end of 2019 for 2020, at the end of 2020 to 2021 and so on and so forth and we did this with metal lunch, Bank of America and so on and so forth and these are well known firms are making a significant amount of money in the market, right.\nSo, the, so the test that we were trying to do is to whether the, the efficacy of their prediction has an impact on their results.\nTurns out that there were seven analysts out of having 15 that we studied who got it right in 2020.\nThere was seven analysts who got it right in 2021.\nThere were four analysts who got it right in 2022, but there was zero analysts who got it right both in 2021 and 2020.\nThe problem is that most of them had their inherent buzz, the analysts who were bullish, were bullish throughout analysts who were bearish.\nThey ended to be bearish throughout. So, half glass full glass empty. I mean, you, you continue to be that.\nSo, if these guys are making money, it's not just because they're predicting something right or wrong.\nIt's also they're able to react when their prediction goes wrong.\nAnd the ability to, so by, I'll talk about, right, you can look at past patterns and you can predict, but what is also important is saying, okay, you recognize the fact that, okay, what have predicted hasn't turned out true. So how do you react? How do you learn and how do you morph?\nAnd I think that's that's important as well.\nYeah, no, it's, it's really important. Actually, I ran into Stan Drunken Miller this, this weekend famous hedge fund manager.\nAnd that's his whole thing. He's got to be, you have to, if your prediction is wrong, you got to be really quick to make sure that you can change your mind quickly.\nAnd so, I take that point quite well. Look, I could talk to you guys for six hours about this, but we're going to have to start taking questions in about six minutes. So I'm going to ask this question directly to Kyle, which is, you know, AI is AI democratizing access to sophisticated investment strategies.\nI know you're working towards making AI strategies available to a broader retail market, or is this just still the benefit for the large institutional investor?\nThe answer is it depends. I mean, there's no doubt that some of the large institutions are now utilizing AI to, I think, organize unstructured data in a way that they can make intelligent, you know, decisions. That is happening and that's happening at scale for them.\nBut I think to your question, we talked, we touched on this earlier, Brad, which is, how do we take, I'll give you for instance, take towel. So towel runs the strategies, but he does it in a hedge fund.\nSo when we sit there and we say the concept of baila, we know is highly effective in an understanding market state.\nOnce we then take that, it's about the application. What's the delivery mechanism? And that's really your questions. How do we democratize the delivery mechanism? So we take something that towels made accessible to a accredited qualified investor.\nAnd we say, okay, now, how do we take the same concept and deliver it in more of a democratized fashion? That's some of the work that we've done. And that's the pieces I was talking about where you're looking at liquidity, you're looking at custodians, you're looking at delivery.\nSo we can take something where, you know, in some cases he has, you know, maybe a million dollar access point to a hedge fund.\nAnd yes, there are some nuance differences, maybe it's leverage and some other factors, but you can now gain access to some of his strategies for his lowest $5,000.\nAnd I think that's some of the work that will continue to do.\nSo really quickly, CDR, I wanted to touch on this because I think it's a really cool project that myself, you as well as is towels involved in is you're using my stock DNA and Darwin to take blends of different AI managers with different thoughts and blending them together in a portfolio matching someone's risk.\nSo in about two minutes, could you kind of explain that project and how it can benefit the end retail or client.\nSure, so the idea that both talent idealized is that he's got a different brain, I've got a different brain, right, and it's the same with AI engines as well. So baila works differently, Darwin works differently, baila looks at a different set of data, Darwin looks at a different set of data.\nThere are other AI engines out there which look at earnings release and so on and so forth. So there's no one perspective or one way to look at the market, right.\nNow, when we talked about forward bars and back testing, it's important to understand that a player who performed well in the past, say Mike Tyson Mike, the center of the past doesn't mean that you can, you can predict that he's going to perform well in the future as well.\nAnd it happens, it'll happen with talent, it'll happen with me, it'll happen with anyone else, and this we evolve.\nIt's not all of our strategies are going to survive in the future, right, and we don't want to be emotionally fed to emotionally link to those strategies.\nRight now for an advisor when he goes in, he puts his trust on a model. He says, I want to pick manager A or manager B or manager C, simply because they have a reputation, they've done spent a lot on marketing and so on and so forth.\nWhat if we change that paradigm to say that tell me and the other managers out there, which is including youth or and the other AI managers, we compete for the right to manage money in a portfolio.\nIf we do well, we get more money to manage, if we don't do well, we get less money to manage.\nAnd what if this competition is governed by AI as opposed to a bureaucratic investment committee, which is basically taking into account a lot of other emotional variables in terms of who they're helping who they're not hurting in terms of taking the decision.\nWhat if we are emotionally take the decision or to which manager do we allocate funds to and how much and that's the, that's the logic which, which we're coming up hopefully soon along with with UX wealth and all star team consisting of all of these managers who are essentially all these AI managers were essentially competing with each other for a position in the team.\nAnd then once they're in the team, the idea is that they collaborate with each other to increase the the alpha and reduce the beta for the portfolio.\nYeah, no, it's definitely an exciting project and I think at the end of the day, it's only to the benefit of of the client.\nLast question before I open up the Florida questions, we have more questions than I thought we'd get so I want to leave enough time.\nSo to all of you is a group kind of briefly looking ahead, what do you what do you see is the next big breakthrough in AI for investment management and how do you foresee, you know, the landscape changing in the next five to 10 years.\nCan I talk about the business item go for it.\nAll right, so okay, and this may this may hurt some sentiments out there, but but I and that's this is me, I'm old, so I can I can afford to make these statements.\nTo me, a big part of this investment word, which is which hurts me to say this are 401k accounts, which a lot of investors have put their money in is the most bureaucratic and inefficient setup I have seen in a 401k account, you can afford to be the most active.\nUsually the least active and the and the money managers are probably the the structure works in such a way that it introduces a lot of inefficiency in the process.\nSo where I would love to see AI make a big headway is in terms of democratizing that 401k process.\nBecause by virtue of doing that, you're making going to make an impact on a generation, which is going to be going to be able to retire early simply because you managed funds well.\nBeating the SNP 500 according to me is not a problem anyone with a little bit of common sense and the knowledge I can train them to do that.\nBut doing that effectively by managing your emotions is a big thing and then getting past all of this.\nWhat do you call it this marketing terminology right when you get a brokerate statement you get like hundred lines of saying okay this that.\nGetting past that and using AI to do that is would be my brain project right now.\nYeah, I think I think I think so they're unable that it's it's really if you're talking about in the short run and I'm saying the next five to ten years is short run.\nAI can already in my opinion do better than active human investors.\nSo I think there's a huge opportunity there and because these are active strategy generally they generate they could potentially generate short term capital gains.\nSo in a deal place for them are in tax advantage accounts and that's why for all in case.\nAnd and I are as a really good place for these strategies but unfortunately today.\nMost investors can access them from those types of accounts.\nSo I think that kind of shift will happen and those strategies will grow in those retirement accounts.\nAnd I think what you'll see over time at least my vision is that AI will penetrate and will take more and more assets also for the passive investors.\nAnd this will happen over the next few decades finance is a very conservative industry.\nSo I think it's going to take time until assets move over.\nBut it will happen and you'll see that more and more also in areas like ETFs and others.\nSo I think that's that's really the path that this is we're on and we're really just at the beginning because also the AI we have today is still.\nI mean you have to say that other people in the I say this this is the dumbest thing will ever be so there's still they're pretty dumb right now.\nAnd it's really the narrow AI this very very smart today and that the general AI is still very dumb.\nSo it's still going to take a while until you see generally I can replace a human I think that's not going to happen for a while and I think the human is still in the loop for quite a long time for decades to come.\nSo I think it's a combination of human plus AI that we're going to have here for a long time.\nBut you will see a eye managing assets in a much more a bigger way over the next few years and it will grow to billions and trillions over time.\nOh, any last thoughts are you ready to move to questions just quickly.\nI think the big idea is is how can we as a community and as an industry penetrate the bureaucracy that exists.\nSo one of the things that we have to tackle is the regulatory environment related to AI and the problem that we face is that the black rocks of the world have so much money that they influence the politicians and they influence everybody that makes the decisions and the reason they do that is because of where we started which is they're afraid of the AI that it's going to take their job.\nAnd I view it as somewhat of an industry problem as almost like an industry version of the deep state how do we show the benefits and regulate this because over the long run it will be better for the investor.\nThat's me as the big idea that we have to try to figure out how to solve.\nOkay, well, we've got twenty eight questions.\nI don't think we have time to get to all of them so go ahead and give us your best questions.\nThank you Brad, our thanks a ton you've you've all given us a ton of things to think about.\nI'm going to I'm going to find you need some questions with there.\nThere's this kind of general interest so let's start with this.\nSo given that we all understand that AI is essentially leveraging on historical data and you've all touched upon this several times especially when you discussed about the limitations of Markov, it's portfolio and things like that.\nSo we all understand that at best the past being a good predictor of the future can be thought of as a good assumption.\nNow, digging on this a little further and given that you're all lying on past data, do you worry about AI's ability to predict specifically black swan even so events that have never happened to the past.\nThere are bound to happen because there's the same events that have never happened to the past always happened.\nRight, so are we hedging for that at all or are we completely dismissing out and saying okay if it happens we're going to be surprised so be it.\nSo I can tell you for my experience we were running baila in 2001 during COVID and we went.\nWe reduced risk during that period so baila noticed that something was happening I don't know what is what the patterns exactly that it noticed that back I think it was an early February.\nIt actually noticed of 2001 it noticed something was going on and it reduced risk and when it wasn't 100% risk off it was low risk right before the market corrected and it went back in you know a few weeks later.\nSame thing happened in 2022 where there was a decline it wasn't risk off the whole year but it was risk off for major parts of the year.\nSo now you're saying you know COVID never happened before but guess what a lot of the patterns in financial markets were similar before COVID happened or at least waves were happening.\nThere were it you can call it ripples in the financial data that that AI could detect and say you know what something here is happening.\nI'm not it of course you can tell me what's COVID you could tell me that there's a higher risk of a 5% or higher drawdown during this period so I want to reduce risk exposure so that's something it can detect it can detect those patterns.\nIt's not necessarily that the risk is the same with the black swan event is the same but many times the market already showing you know the market are some of the best predictions.\nSo and it takes a while for investors to switch mindsets but some investors could tell something was happening with COVID so they were doing some things in the market.\nThey weren't having so they were creating some patterns so you can't see those patterns so at least the AI can see it.\nI'm not sure a human could see it but the AI could see it and could actually react accordingly.\nSo I think that's that's my answer why it could potentially detect these black swan events that will detect the next one.\nI don't know there's no guarantee it's only a probabilistic system right.\nI would say the probability is is positive that it would but no guarantee.\nSo for me the answer would be slightly different so I mean imagine the matrix movie where there are bullets flying around and I use this analogy of it.\nSo there are two ways of avoiding the bullet one is you have complete confidence in your prediction ability to dodge the bullets get in the room and dodge and the second is don't get in the room itself.\nOr you can also do the thing of getting in the room and getting shot by a bullet and then deciding this is not it I mean I it is not safe and I I want to stay out of the room.\nNow it's the same with AI if as long as your AI is not vetted to its prediction and is able to manage the fact that its prediction can and will be wrong.\nAnd you have the reaction ability to be able to react your safe.\nNow can it dodge a black swan event like the Yellowstone erupting or something like that probably not not.\nBut can it dodge a blackstone event a black swan event like the market crashing 10 to 20% you know in the next one month yes it can.\nSo it's a it's a probability.\nOkay, so moving on maybe a couple of questions.\nSo managing money as you've kind of touched upon is a two-sided job one is how does the money getting messed in the market.\nAnd when a human actually managed money does this other big part of managing your clients.\nAnd so you've touched upon this the clients and motions particularly greed versus a fear kind of emotions handling them.\nNow we've talked a lot about how AI is going to manage money in the investment science aside have you all thought about or you know or aware of any work on how AI can be used to manage clients that emotions reporting you know that kind of stuff.\nCome on the the the the bald patch here.\nThat comes from managing emotions.\nBut but Anna Anna serious not so it's so emotions are individual specific right so you are emotions and how you react to the market is going to be very different from somebody how somebody else react.\nSo my hypothesis here is that it would be impossible for AI to manage your emotions but it would be extremely possible for AI to build something.\nThat caters to your emotion right so I cannot influence your emotion I can educate you I can educate an investor.\nBut it's going to be but that education can only go so much distance.\nSo I think a large part of what AI can do in the future is also construct a portfolio or a product which caters to how you emotionally react to things.\nAnd that's where I think it can help.\nYeah, if I can a point on that.\nCome on just just over so briefly what we've talked about largely is AI driving investment decisions and where that can improve over time.\nThis to me brings us back to the discussion man and machine the role of the human the advisor that the person that's talking is to understand the nuance of the client sitting across the table.\nAnd the problem in the mistake that I think we want to avoid here is comparing to a relative benchmark all the time because that's where we get into this.\nCompared to analysis that evokes emotion I think so let's say you and I are training for an Ironman that's a long distance goal and objective assume the Ironman is retirement.\nWe're going to have checks along the way and I think where we could use AI is to again take unstructured data.\nAttach it to a goal and rather than saying you're down 10 the S&P's down 12 and having an emotional discussion there it's.\n95% on track to hit your long term target we're good to go is there anything else I should know about your life and you've moved on I think that's an important component of this.\nYeah, I think I think the human here in the loop is the most important part with emotions because really need the human connection with the end investor.\nAnd and I think that the AI what it gives you is the confidence that the decisions are being made in an unemotional way.\nSo you can always tell the client look AI is statistical we have our goal where we want to go here's the probability of where you're going here's the path we can mark you can run a Monte Carlo simulation and show you exactly.\nHow you're going towards that path and what's likely what if you're making a there.\nBut they ended the day you have to trust that the AI is making the right decision the right time and here's the here's the statistical performance so far and talk about all those numbers.\nAnd I think when you talk about it that way you take the emotion out they realize you know there's nothing really I need to do here because guess what the AI is making a better decision than I or my advisor could probably make because it's unemotional and it's based on statistics and then the end of the day that's the best we can do.\nWith with investing so I think that's that's a stronger case than the advisors saying look I just made this decision I know it's losing money but trust me because it's it's we know that humans underperform in these situations so I think that's the better discussion.\nOne last question and this is an interesting note so we've talked about AI replacing lower level skill sets in the investing industry and we do understand that to be able to get to a higher level of skill sets and expertise we do need humans to go through this lower level to graduate and you know get to the higher level.\nWe're talking about a world bad air is going to replace all the lower level you know skill acquiring or skill learning positions will be able to actually go you know have humans.\nI gained the experience to get to the top.\nIt's a good it's a good question so I think look we're still in the early stages of AI and the influence of society and see I think we're seeing sell the effects today.\nSo today AI is not replacing coders it's making coders more efficient so if you're the developer you can develop much much better code but it's not yet developing software and its own.\nYou know if you're looking in some areas yes AI is giving us a boost in terms of our abilities things that we can do and it's natural and in finance that's an area where it's you know it's all statistics and numbers that's an area where AI and machine learning.\nShould do better than humans because we're not the best and figuring out numbers and doing all that stuff in our head especially when there's billions of data points to work with.\nSo that's that's an area where I would expect you to do really well and I think there's some areas like that where AI is going to augment us and make us better just like your phone makes you better right.\nSo it's another piece of technology that improves our lives that's the way I like to think about it and I think human passion for different areas it's going to drive really what we go and learn and study.\nI'm passionate about portfolio optimization and AI so that's an area that I excel in and I think each person here has no level of passion of what they what they care about most that's going to be the motivation that we look fundamental motivation of what drives us at the end of the day.\nWell, so dear unfortunately we don't have any more time I loved this conversation like I said I've could have gone for hours.\nTal Kyle, so dear thank you so much for having this discussion with me and thank you for all the all the viewers here listening.\nThank you.\nThank you.\nThank you.\nOkay folks we'll begin in just about a minute.\nThe next session.\nThank you.\n"}
