{"transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology, they are run on and you want more customization and flexibility.\nAs well as a AI-driven model marketplace, UX wealth partners is your destination.\nOn top of that, they have institutional trading.\nSo if you are an ETF issuer or an SMA provider looking for outsourced institutional trading, UX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and make your practice more efficient.\nWelcome to Beyond the ticker.\nToday we have on David J.Kansky.\nHe is from Quantify Funds and we are talking about their stacked Bitcoin and gold ETF ticker BTGD.\nI'm glad we had them on. This is our last episode of 2024.\nWe are going to take a winter break but I thought this episode is extremely timely with everything going on in the Bitcoin space.\nAnd so David and I talked a lot about that.\nWe also talked about this innovative stacked product that for every dollar you put in a dollar goes to Bitcoin and a dollar goes to gold.\nAutomatically rebalance to keep that 50-50 split.\nSo again, a very cool and innovative product.\nI think it fits well in your portfolio as you know,\nhedging mechanism or as that like alt pocket if you will.\nSo without further ado, please welcome Mr. David J.Kansky.\nHey, David, welcome to the show.\nThanks so much for happy bread.\nSo before we get started, I want to give everybody a bit about your background and how you ended up here at Quantify Funds.\nAbsolutely. So my name is David J.Kansky.\nI'm the founder and CEO of Quantify Funds.\nI've been in the investment in ETF world for gosh about 17 years.\nThe last 11 years I was a partner and portfolio manager at title financial group platform to help institutional managers bring ETFs to the marketplace.\nTook the jump and moved over to the client side and I'm now partnering with both title and another client of titles.\nThe return stack ETF folks to bring you this stack lineup we have here,\nbut they're first offering being the STKD Bitcoin and Gold ETF ticker BTGD.\nYeah, and we're going to get into the ETF for sure.\nBefore we do that, though, I always like to ask any hobbies.\nWhat do you like doing when you're not working?\nGosh, I love hiking in the mountains, escaping to beaches.\nI'm a born and raised New Yorker.\nSo I like doing the exact opposite of everything you can find in New York City.\nFind a beach with without a person from my all or the middle of a mountain top is having for me.\nSo yeah, I think I'd take a beach right about now.\nIt's snowing already and I'm not ready for it.\nYeah, New York is has not really felt the true effects of winter yet, but I'm sure it is coming.\nYeah, I was just there a couple of weeks ago and you can, it's always worse when you turn down the one street that's just an absolute wind tunnel.\nAnd it's just brutal. You can't get out of it.\nYeah, winter is no fun in cities. You get the wind tunnels.\nYou get the dirty snow. You don't get to the glistening white effects of the snow everywhere.\nIt's no fun to be in the city during this time.\nSo let's get straight into the ETF.\nI mean, this is a really interesting product.\nI'm glad we were able to connect.\nI think it's timely right with everything going on.\nBitcoin breaking 100,000.\nSo the ETF, as you'd mentioned, is BTGD,\nwhich is the SKSTKD Bitcoin and gold ETF.\nSo first, give me a high level of what this fund is and really what is trying to accomplish.\nAbsolutely. So STKD is short for stacked.\nThis is a stacked ETF.\nWe stack two different assets on top of each other.\nIn this case, we're stacking Bitcoin on top of gold.\nSo for every dollar you put in the ETF, you get a $1 exposure to Bitcoin and a $1 exposure to gold.\nAlternatively, you can also think of it as a poor\nportfolio that is a 50, 50 mix of Bitcoin gold times two.\nSo this is a new way to do leverage ETFs, where we're not just leveraging the same asset\non top of itself, which allows for what we'd like to call leverage for the long run,\nleverage with less path dependency and potential for decay.\nLeverage that can be structurally implemented into your model portfolios.\nSo let's talk about how you kind of manufacture the product on the back end.\nSo what type of investments are you using really to drive or derive your underlying exposure?\nI'm assuming you're using futures as well as some other things.\nYeah.\nCurrently we're using futures and the exchange traded products in both your Bitcoin and gold space.\nWe use the futures to get the most optimal form of leverage on these two asset classes.\nAnd then we use the ETFs to allow us to have a cost effective way to balance on drift\nbetween the two applications of Bitcoin and gold.\nSo we can stay on target to that one to one ratio between the two assets.\nSo let's talk about that like rebalance schedule.\nAre you bringing this portfolio back to for any drift on a daily basis?\nI'm assuming with the volatility that Bitcoin brings,\nyou're going to have to be kind of pulling these back in line fairly often.\nYeah. So this is an actively managed portfolio.\nSo we have no specific mandate on that.\nWe are targeting about a five to seven percent rebalance drift.\nAnd we'll oftentimes rebalance more frequently with creates.\nBut it's a game of rebalancing versus trading costs and minimizing the drag that over trading\nportfolio could have.\nSo we very much like that five to seven percent range,\nwhich ends up resulting in usually about a trade maybe a trade and a half a week.\nGot it.\nSo let's talk about like the overall rationale, right?\nLike what is the rationale behind combining Bitcoin and gold within a single investment vehicle?\nYeah, it's it's so funny.\nSome people struggle to seek the connection and some people see it instantaneously.\nAnd we found actually the lack of correlation between the two assets.\nSometimes makes it difficult for people to conceptualize them as a similar concept.\nThe concept here is these are two assets that are deemed scarcity assets.\nGold has been a store value for as far as long as history has been around.\nBitcoin in its simplest form is digital gold.\nThese are two assets that mine at a rate that is much smaller than the rate at which paper currency's print.\nDevelop nations print about seven to nine percent of currencies and circulation each year.\nBitcoin mines at about 0.86% a year,\nwhereas gold mines at about 1.75% a year.\nSo in its simplest form at what pace will develop,\nmarkets around the world print their currency and the bet is that it's going to be over that 2% mark.\nAnd these will continue to be scarcity assets that should appreciate as global currency depreciated.\nSo this is what we like to think of as almost a two-for-one pre-packaged currency debasement hedge in one.\nGot it.\nI mean, it makes total sense to me.\nSo in your experience and kind of following these two assets over time,\nhow does the volatility of Bitcoin and then gold's relative stability interact within this portfolio?\nHistorically, Bitcoin is about three times as volatile as gold.\nWhat we find most intriguing in this pair is the correlation tends to range from as high as,\nyou know, just over 50% to lower than minus 20%.\nAnd it is the swings in that that is most interesting that allows for balancing between these two assets.\nI always ask, I think there's actually a lot of people that I'll get to both Bitcoin and gold in their portfolio already.\nBut I always ask them in the last like two months.\nHave you trimmed Bitcoin at all for gold?\nAnd doing that difficult trade is oftentimes easier said in practice than it is to actually implement in reality.\nIn terms of historical data, if you look at the last two big crypto winters, gold held up exceptionally well in both of them.\nThe first crypto winter, gold was down a little less than 2% the second crypto winter, gold was down in the midfores.\nBut most beneficial was that gold was actually up in the first half of both of those crypto winters.\nSo the rebalancing mechanism of staying close to target of a one-to-one ratio between the two always allowed you to harvest something from the gold side.\nTo allocate further to the Bitcoin.\nIf you did a back test of Bitcoin and gold futures at minus the cost of financing, you'll see that the drawdown during both crypto winters was not so significantly greater than just Bitcoin alone.\nIt was one to 2% larger.\nAnd that's really just because of the diversification benefits that gold port trade during those two significant volatile environments in the crypto space.\nAnd we have no reason to believe that wouldn't exist again in future crypto winters.\nI think what you've seen post-election is almost proving that up in real time the correlation between Bitcoin and gold is absolutely plummeting.\nBitcoin is trading a lot more like risk assets.\nGold is trading a lot more like fixed income.\nTreasury bonds both assets or both sides of the table are really moving in response to what they think inflation will be with the new administration with tariffs and things of that sorts.\nBut we'd like to think of it as if one of them is more scarce equities and one of them is more scarce fixed income.\nThis is our preferred 6040 vehicle of choice versus traditional stocks and bonds.\nYeah, and you know, I have advisors ask me all the time.\nLike, you know, what is or discussions around Bitcoin's correlation.\nAnd it's it's funny. It was like not correlated to anything. Then it got pre-correlated to, you know, attacker or large cab growth.\nAnd you know, I just think over time Bitcoin just really beats to its own draw.\nI think we're trying to figure out a appropriate correlation number to, you know, equities to gold to treasuries.\nAnd I just I just don't think Bitcoin cares about any of it. Is that the fair fair view point.\nYeah, correlation versus causation. If you looked at what Bitcoin did during Silicon Valley think the ASCO, it was performing much like much more like a scarcity asset.\nI think the real bet is not necessarily what it is correlated to today, but what it will trend towards correlation wise in the future.\nAnd we believe that's going to be more and more in the camp of scarcity assets, especially if we ever get into another cycle where we're going to have to unleash the quantitative easing back onto the market.\nSo I go, that's when you're really going to see this thesis take off because just the mismatch between supply is going to skyrocket.\nAnd truthfully, I think a lot of this is due to the fact that most Americans until the last five years had no idea what inflation really felt like or very few of them.\nVery few participating members of economy still remember what inflation felt like.\nSo I think the idea of what is the government doing with our dollars, how much are they printing? How are they using it as much more top of mind?\nBecause we all feel inflation, at least in the US for the first time at a long time.\nYeah.\nSo simple question, but it's the more I thought about what the harder it is to answer is that like if I'm an investor measuring the performance of the CTF, like what is your benchmark?\nIs it, are you just blending and creating a benchmark or are you benchmarking yourself again?\nIt's a big coin, but that would be unfair. Like how do you look at kind of evaluating the performance of the CTF against a benchmark?\nYeah, you do have to look at each kind of piece individually and then subtract the cost of financing between the two.\nSo unfortunately, the best benchmark is book bitcoin and gold minus the cost of financing, which is very cost effective in today's markets through futures.\nBut I think you could also just benchmark this specifically against bitcoin, especially because gold is so much less volatile than bitcoin.\nSo that instance gold just really needs to perform the cost of financing to warrant the leverage on top of bitcoin to allocate to as well.\nBut we also think this is something that people have in their portfolios as individual assets as well. And yes, the whole advisory space is going to need to catch up on performance tools and comparison tools to start.\nIncorporating some of these new stack products, these we think are really some of the first tools that are really acceptable in advisor models.\nThese unlike the daily use leverage ETFs don't come with warnings of daily use.\nThey should be much less of a compliance nightmare in advisors models, but the second you have an advisor who through underlying ETF starts managing a portfolio that is 110% overall exposure.\nIt's unfortunately not just our security, but the whole book on a performance basis that becomes a little bit trickier to benchmark.\nGot it. So oftentimes people look at gold as a potential hedge in their portfolio.\nDo you think this ETF could kind of fit into that same category as an overall hedge? How do you view it in terms of where this would kind of fit in and how advisors should be talking about it?\nYeah, this is a debasement hedge. Gold could be an alternative to fixing them. You could go as we alluded to is very correlated and fixing them and has his much more scarce than treasury bonds.\nThen they do gold, but long-term we view both these assets as a protective asset, even though Bitcoin and in this case until recent gold have both risen alongside the rise of the US dollar this year in past years.\nSo many allocators have turned it so far towards just the US only equity portfolio that they're actually so dependent on the strength of the US dollar that we think if there's like one hedge to hedge your your primarily US equity portfolio against declining dollar, which could happen for a number of reasons.\nYou should think this is an ideal vehicle to mix both Bitcoin and Gold in one to hedge against that drawdown potential in the US US dollar.\nGot it. So how do you, as I read today, you know, black rock could kind of come out with their one to two percent allocation recommendation for Bitcoin across a well diversified model portfolio.\nBut given that this has gold exposure, I think in your mind, you probably could get a little bit away with a little bit more overall exposure in a portfolio.\nSo like how do you talk about allocation percentage in, you know, an already well diversified portfolio, are you looking at, you know, 5% maybe up to 10% allocation like where do you see this fitting and how.\nI mean, we think anywhere from like a two to five percent allocation in Bitcoin and gold makes sense and can protect a portfolio.\nI saw that article that you're referencing that black rock alluded to.\nThe recommendation band of one to two percent in Bitcoin.\nI don't know if you want to take a friendly way, Jeremy, we can read you this podcast in 12 months like how much do you want to bet that that ranges higher next year.\nTo 2026.\nYeah, I would agree with that.\nSo this feels like the first step into that range. I mean, first and foremost, speak to your financial advisor before making any of these decisions at all whatsoever.\nBut I do think, you know, anywhere under a five to seven percent allocation is warranted.\nAnd some people go much higher than that as well.\nBut that really allows you to get some protection against volatility that could come from other parts of your market.\nIf the driving force of a downturn is the strength of the US dollar.\nAnd the other thing with this to is, you know, you have advisors like to have the bucket conversation, right, we've all heard it.\nWhere are you kind of bucketing this product, you know, if you kind of putting it in that other where where do you like to try when you're talking to advisors to kind of have them place this in that overall diversity model portfolio.\nI think for some allocators, this is an alternative.\nInvestments some look at it within like almost like an alternative commodity sleeve or as you reference to an other sleeve.\nThe thesis here is the currency debasement thing what we've seen in the ETF landscape, especially being with a platform such as title for so long that while there is a huge adoption in the alt space.\nIf I just don't like alt that don't move your alt needs to have some volatility and the reason is nobody wants to put 15% into an alternative that may or may not work without any real rhyme or reason other than well.\nThe box didn't work this year, right, there's no economic rationale to explain why a managed futures or a long short might have performed that a client can fully understand.\nAnd so what's worked in adoption is higher volatility alternatives that can still move the needle in your portfolio in a smaller allocation.\nAnd that's what we're doing here, this doesn't need to be 15% of your portfolio to really have an impact on your portfolio.\nA high-volve alternative that thesis here is currency debasements against the U.S. dollar or alt currencies.\nDoes that make sense?\nYeah, makes a ton of sense.\nAnd the other thing I wanted to like kind of pick your brain on to and is you know Bitcoin and you know in my since me being in the industry is the first real asset class that it seems like the retail channel has more education and understanding around than their advisor.\nThey're generally taking this idea at least over the last handful of years taking this idea to the advisor and saying, you know, how do I get exposure to this and can you get me exposure to this.\nSo the name of the game here really for, you know, people like you as well as some of the others that have come out with Bitcoin or crypto ETFs is that advisor education.\nSo how do you approach when you're sitting down with an advisor and making the case for BTGD like how are you helping them understand Bitcoin better?\nHow are you viewing education like overall how are you approaching advisors but not only this product but with the overall idea that this is a necessary investment to have an portfolio.\nYeah, we tried to focus on the education of like what is stacked how do we achieve this stacked and that's what in truth.\nIn truth, I don't actually think the advisors need as much education in the Bitcoin spaces people think I do think there's a lot more knowledge in the retail space than some people get credit for but I think we've been in a political environment where advisors and pro-perdealers have been handcuffed and terrified away from getting anywhere close to making a recommendation to a client from on a fiduciary basis to allocate to Bitcoin.\nI think obviously there's going to be some education for the masses but I think it's really been lack of clarity of what they're allowed to do or not allowed to do that is really cause most of these institutions to tell their financial advisors to stay away.\nBut we're not in that world anymore we have the most Bitcoin friendly government that we could have potentially had.\nLarry think the CEO of the largest asset manager in the world just recommended a one to person one to two percent allocation sleeve in this.\nAcross your entire model allocation that was don't believe that was meant just for an aggressive growth portfolio.\nI think that's actually the most alarming not alarming but interesting thing of that statement is this is not just a growth asset this is a protection asset.\nThey didn't say put this in your Roth IRA they said one to two percent across the board.\nSo I think advisors have more knowledge than they're able to lead on because they're not allowed to really voice that opinion or that knowledge to the marketplace or specifically to their clients.\nIn an environment where we have a very crypto friendly president a crypto ZAR.\nAnd Larry think is recommending a one to two percent allocation in Bitcoin.\nAt some point advisors are going to look at himself in the mirror or the clients are going to just question them and say are you really sure you want to bet your career.\nAnd this not being helpful is a one percent allocation in your portfolio.\nAnd I think we're going to start seeing the cascading effects of that occur over the coming months five six seven months.\nYeah, you're you're timing here is definitely you know very good.\nI agree with all the things you you just mentioned there.\nThis is a fairly new ETF I'm not sure when when did you launch exactly sorry.\nWe launched on October 16 got it so again fairly new.\nYou've been in the ETF space you know working with titles so you understand you know the business with any new ETF right.\nSo the name of the game is is distribution and so how are you guys you know viewing internally distributing the product.\nYou know how are you going to try to raise as much assets as you possibly can in this thing over the next 12 and 24 months.\nYeah, we started off with some really amazing Twitter spaces.\nThe launch we had Peter Lynch and Lynn Alden discussing and arguing Bitcoin versus gold.\nWe plan on producing a lot more video and research content to distribute to the advisor community outside of that.\nJust more traditional blocking attack on line advertising which we just started to kick off in the last week or so.\nYou'd be surprised how much of this world is really just like seeing and add a couple times then letting it be dispersed amongst the message boards.\nI think that would be within an RAA or discord or what's that group.\nSo much of this world moves on these small little chats whether it's in bread it or we both post, etc.\nSo just getting on to all these little platforms and building awareness is stage one and building a database of resources for advisors to fully understand our product once they find us on our website.\nI think it's a cool product. I really do and I like the idea of continually keeping these things in line.\nYou know, it's 50 50 it makes it a ton of sense to me and so you mentioned your website before let you go David.\nI need to ask where can people learn more about BTGD and you know, your firm is all.\nYeah, and again, Brad, thank you so much for having us on.\nWe are quantify funds. You can find more information at quantifyfunds.com or quantify funds on Twitter.\nSoon to be quantify funds on YouTube as well. We have a LinkedIn channel as well.\nSo we're going to be producing a lot more content on that side. Brad, it's been a pleasure and thank you so much for having us on.\nYeah, David. Thanks for spending some time with me.\nHave a great afternoon.\nThank you.\n"}
