{
  "id": "16419024",
  "transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology, they are run on and you want more customization and flexibility.\nAs well as a AI-driven model marketplace, UX wealth partners is your destination.\nOn top of that, they have institutional trading.\nSo if you are an ETF issuer or an SMA provider looking for outsourced institutional trading, UX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and make your practice more efficient.\nWelcome to Behind the ticker.\nWe are glad to be back for 2025 and we start the year off with a great guest, Kevin Carter.\nHe is the founder of EMQQ Global and we are talking about their Indian Internet ETF.\nThe vast majority of this episode is Kevin going through how the Indian economy is the perfect emerging market, how they've structured all of their what he calls the stack to enable a really tech forward society.\nSo for just education purposes but also for really what I believe after listening to Kevin a great investment opportunity, I think you're really going to enjoy this episode.\nSo without further ado, please enjoy this episode with Mr. Kevin Carter.\nHey Kevin, welcome to the show.\nThanks for having me.\nSo before we get started, I want to tell everybody a bit about your background, it's an interesting one and then how eventually you became a founder of EMQQ Global.\nOkay, well I'll go fast.\nI started in the investment business in 1992 in January here in San Francisco at a company called Robertson Stevens in company and after my interview they said you can start Monday and I said I don't really know anything.\nHow can I start Monday and they said to go buy this book and they wrote down a random walk down Wall Street, which I picked up at the bookstore on the way home and read over the weekend in 1992.\nAnd that was a pretty important event in my life that book.\nI'm sure some of your listeners are familiar with it.\nIt was first written 50 years ago and when it was first written, there were no index funds in the author.\nPrinceton economist Bert Malkiel basically in three paragraphs laid out his idea for a new type of fund which was an index fund that owned everything it didn't trade and had low fees.\nAnd he suggested the New York Stock Exchange make this index fund but they did not do it and his friend.\nJohn Bogel did and started Vanguard.\nSo I started by reading about indexing and efficient markets.\nBut I quickly became an Omaha person when it comes to thinking about investing.\nAnd what happened was in 1999 I had my own idea for a better way brokerage so you could buy five dollars of a stock or ten dollars of a stock.\nAnd I developed a system filed a patent on it and built a company called the E Investing which we sold to each trade in the year 2000.\nBut I asked Dr. Bert Malkiel the author of a random walk to be an advisor to that company.\nAnd so that's when I first started working with Bert.\nSo I've had sort of one foot in the active world in one foot in the indexing world for about 25 years now.\nAnd after we sold that to each trade we invented another idea which has gone very much mainstream called direct indexing.\nWe actually called it active indexing when we started our company active index advisors.\nAnd this is making your own custom S&P 500 strategy where you own the stocks directly and can customize and lost harvest and so forth.\nBut what happened was we sold that company active index advisors to the Texas asset management at the very end of 2004.\nBut just before that Google went public and when they did that they asked my partner Bert to give a talk to the employees about investing.\nAnd I wasn't invited but a few months later a person from Google called me and said they wanted to you know invest with us.\nAnd so I agreed to sort of as a side job be an advisor to this individual.\nAnd then he started introducing me to other individuals at Google. So in 2005 I was going to Google pretty much every week.\nBut by partner Burton started going to China and he wrote a book about investing in China.\nAnd Google called me and said hey can Burton come talk about China and I said sure.\nAnd 20 years ago I picked him up at the airport and drove to Mountain View.\nHe gave a talk about China and then all these people at Google looked at me and said they wanted to invest in China.\nSo I didn't plan this but for the last you know 20 years.\nMy entire focus has been on emerging markets and not just China but India and the rest of emerging markets.\nAnd you know what I learned pretty early was that the thing that's actually emerging in emerging markets are six and a billion people.\nAnd they want all the things we've got. They want more food better clothing.\nThey want air conditioners and heaters. They want to go to movies. Take a vacation.\nGet an automobile and have their kids go to Harvard.\nSo I've been focused on that the whole time.\nThe what McKinsey calls the biggest growth opportunity ever.\nBut about 11 years ago you know again the consumer companies was my focus food companies clothing companies.\nIt's et cetera. But then all of a sudden the smartphone showed up and changed the way people consumed.\nAnd so that was really the the inspiration for my founding EMQQ which is our broad emerging market strategy.\nAnd then in the first you know seven or eight years of this business.\nMost of the story was China's growth and the Alibaba and Tencent and the other Chinese companies.\nBut we launched INQQ about three years ago when the Indian internet companies finally started to go public. So INQQ.\nYou know we've been waiting for India for a long time.\nBut now India's it's here and it's happening and it's still very very early and we expect the same thing to happen in India that's happened to China and the happen in the US which is the Fang stocks if you will.\nYou know take over the the world of the stock market.\nWell I'm super interested to talk about INQQ and and you have an incredible background foundations for how people are looking at managing money today came came out of a lot of those ideas.\nSo but before we jump into the meat of what we want to talk about which is your ETFs and and India always like to ask people what do you like to do outside of work any hobbies or interests when you're not thinking about new financial products.\nWell first of all you know I love my work I don't consider my work work.\nI get to you know go deep into places like India and spend time on the ground with the founders and the investors and the you know consumers.\nAnd then I you know after I spend you know a month in India I come back and I you know prepare report and then I go to you know New York and London and Milan and talk to investors about what I saw in India so it's.\nYou know it's it's fun for me but what do I do when I'm not doing that when I'm when I'm here in San Francisco I I write my bike usually an hour in the morning in an hour the afternoon that's my my principal not work activity that I couldn't.\nThat I could list yeah so let's let's talk about MQQ global as a whole you have a couple other funds like I said we're going to focus on India today but.\nYou know what all do you have in terms of offerings like what's the sweet look like.\nSure well the you know the name of our company is EMQQ global and and EMQQ is the name of our broad strategy which again is all emerging markets.\nAnd frontier markets which is about 45 countries total and again we invest just in the internet companies the the Fang stocks of Brazil of.\nIndia Indonesia Vietnam etc and so EMQQ includes China and again as I said you know China is still an emerging market in a traditional sense but when it comes to.\nYou know the EMQQ story the smartphone and e-commerce China's now the most developed country in the world and so it it's so much bigger than everything else that we launched a second strategy which is called FM QQ.\nAlso a little over three years ago and and so FMQQ is the same thing as EMQQ but it just leaves out China now obviously there's a lot of investors that don't want China exposure for any number of reasons but.\nAlso just a different story because because the the e-commerce story in Brazil and Mexico and India it's just it's just getting started whereas China's e-commerce market is now the largest in the world by a lot so.\nThe EMQQ is the whole universe leave out China and you have FMQQ and I and QQ is just the India part so it's just one universe one big story but you can break it out into a couple of different pieces if you want FMQQ leaves up China as I said and then if you just want India alone.\nWhich I think is not you know that's I think a pretty sensible thing for a lot of investors.\nTom I and QQ does that.\nLet's get into I and QQ it is it is your your India internet ETF and you and I had a great chat prior this is actually probably a couple months ago now I mean.\nTime moves fast but you're very passionate you have a very strong bullish thesis on India so wanting to just take the time lay it all out the table is yours what is so exciting about the internet space in India.\nSure well let me start with India itself because you know it.\nThe India story on multiple levels is it it's a great story and it it you know it has everything you want in an emerging market and.\nAnd you know what I've started to say is that India is the perfect emerging market and I think that's true in fact I know it's true.\nAt least on paper because if you go back to the high level of wire investors interested in emerging markets in the first place there's four things on the list the first is they have most of the world's people.\nAnd it's really a big percentage of the world lives in emerging markets they have better demographics there are a lot younger than the developed countries.\nThey have faster growth.\nAnd that's driving a booming consumption which again it that is the thing that's emerging and if that's the list of why you're investing in emerging markets.\nIt's really a question India is definitely perfect or at least it's as good as you can get because it not only has a large population it has the largest population in the world.\nIt passed China two years ago and China's demographics are now more like a European country so it isn't growing.\nIndia's population is growing and every day India sets a record as the largest population ever tomorrow it'll set a record the day after that it'll set a record because it has a huge number of births every year still so it's a growing population.\nI believe out China India is bigger than every other emerging market combined so number two would be Indonesia so it's the biggest five far and it can't really there really won't be another country with this population and any of our lifetimes.\nIt has incredible demographics it has the dependency ratio of young people the old people is about the best in the world.\nIt has about 750 million people under the age of 30 so twice as many people twice as many young people as we have population so it's the biggest ever the youngest ever.\nIt has the fastest growing GDP at about six and a half percent and that's driving consumption just like we saw in China in the last 20 years now this is happening in India.\nSo on paper it India is perfect biggest ever youngest fastest growing and if you look at the you know all of these things combined and project out to the future as you know a lot of economists have done it looks like India will have the biggest consumption market so on paper India is as good as you're ever going to get if you're a emerging market investor now what also makes.\nI think India uniquely appealing is that it's also the world's largest democracy and the leader of that democracy prime minister Modi has really I think in many ways.\nSo you know can take credit for getting India to where it is today because in his first ten years he's Modi has served two five year term so far he's just started third five year term but in his first ten years he's run the country like a business you know.\nIndia without going into all of his history it you know it's only been a free country for about seventy five years and independent country after the British left and and they had a whole lot and they still have a lot of bureaucracy.\nSocialism and what Modi has done in the first ten years is take out a machete and try to chop all the red tape and make it easier to do business to start businesses to close businesses.\nJust as importantly he's also doubled the country's physical infrastructure I mean one of the problems India's had for so long was the roads were terrible.\nThe infrastructure was you know dilapidated in many ways the power didn't even work consistently so there was brownouts at the factories and so it wasn't really.\nYou know the foundation wasn't very good for for the country to grow but in his first ten years he basically doubled the physical infrastructure of India and they're not anywhere near done they have a one point two trillion dollar master plan and.\nSo they were finally you know getting the power to work you know efficiently and I just you know November spent the month in India and you got to see it to believe I mean I've been doing a lot of emerging markets I've seen a lot of infrastructure I started going to China 20 years ago when they were in the middle of this but.\nThe scale of this the number of projects it's just mind blowing and it's you know visually hard to capture in pictures or words.\nYou really have to see it to believe it but the city of of Mumbai or Bombay.\nIs is absolutely amazing what's happening in that city and all of the other major cities as this infrastructure work goes on and one of the things that was in you know encouraging as you'd expect.\nJust in the you know 12 months since my last trip to India before.\nA lot of these projects are now online so we benefited saved you know 30 minutes every time we drove from one part of Mumbai to another because of some of the.\nprojects that have opened so so the reason it is happening now is because of.\nThis leader Modi I think in many ways gets the credit for that but then on top of all of these great things you have two more things that really.\nJust set India above and beyond anything else in emerging markets again leaving out China China's you know got a lot of great things as well but it also has you know different issues that people are well aware of.\nBut here's what makes India just even more compelling India has the best human capital on the planet if you look at India's.\nTechnology sector first of all it's older than I am taught talk computer systems was formed in 1968 the year before I was.\nAnd so you have these large publicly traded tech companies in photos.\nFor example that have created billionaire founders and this is again this is these are 40 50 year old companies are you know new startups you've been around for a long time.\nThey're publicly traded they've employed you know hundreds of thousands of.\nUh technologists and management talent again kind of a low tech tech 1.0.\nUm but a tech sector nonetheless you're not going to find a 50 year old tech sector and you know if Vietnam or.\nYou also have an educational system at the top that produces world class talent and I'm talking about the.\nThe Indian Institute of Technology and the Indian Institute of Management over 20 of each of those and.\nAnd they produce some of the world's best leaders and you don't have to look very far.\nThe CEOs of Google and Microsoft both came from those institutions there's 25 SNP 500 companies that have Indian CEO so.\nYou know again this is very important you can have all this you know scale and youth and things on paper but you need people to execute and and.\nWhat is happening right now which is very important is.\nYou know historically the best talent didn't want to come and work in Silicon Valley work for Microsoft or work for Google.\nUm and if they didn't come to the US lot of them just wanted to get a job working for the government be part of the bureaucracy because it was a safe and steady thing.\nBut just in the last seven years entrepreneurship has exploded in India a number of startups seven years ago was 500.\nThe number today 120,000 so you have just an incredible explosion of talent indeed has their own shark tank now which is going into its.\nFourth season and and what is also happening another one of my findings that I'm just crafting into my report from my trip.\nIs all of these things that India has are now spreading so it's you know that the venture investors many of whom I.\nMet with all my trip including one of the sharks from shark take India they all reported to me that the now the best entrepreneurs they're finding are not from the IITs necessarily.\nBut from second and third tier colleges and second and third tier city so you've unleashed.\nEntrepreneurship anecdotally here reports about you know Indian talent in Silicon Valley that it has you know for the first time started to say I'm going to go home.\nTo India and start a company in fact one of the more exciting companies we'll talk about here in a moment is called Zepto.\nAnd it was founded by two kids that dropped out of Stanford not to go start a company here but to go home and start this amazing.\nUnicorn Zepto so so you have unmatched human capital in India and I can't stress enough how important that is.\nAnd then India has one other part of the story that nobody really knows I mean that a begging a black and white obviously a lot of you'll know about it but but for my experience most investors 99% of them.\nThey have no idea about this next part which is called the India stack and it is I think a cheap code if you will or a secret weapon that that no other country has that that really sets the country apart.\nWell what is that stack or.\nWell let me let me tell you what this stack is to be totally honest I knew about the stack for a lot longer than I knew what it was so I started hearing about this India stack I don't know seventy nine ten years ago.\nAnd only about three or four years ago that I roll up my sleeves and figure out what was the India stack so let me let me try to make it simple.\nIndia stack is what they call India's homemade digital public infrastructure okay so now digital public infrastructure sounds really boring and probably one of the reasons I didn't dive into this deeper before was because it sounded like something that would put me to sleep quickly.\nBut let me explain with digital public infrastructure is it's it's really not a mystery we're using it right now.\nPeople use it every day they just don't think about it as digital public infrastructure the best example is the internet it's digital.\nIt's public it's free anyone can use it I don't get a bill from the internet company you know necessarily.\nAnd it's the infrastructure for the information age you know it's not the telephone lines and the pipes but it's like the pipes.\nFor example of digital public infrastructure or or DPI is GPS no no you didn't launch any satellites and I didn't launch any satellites and I don't even know who did but all I know is if I push a button on my phone.\nThe person will come pick me up and bring me to the airport I don't even have to tell them where I'm going so we have digital public infrastructure we use it all the time it's obviously very valuable.\nIndia has the internet and GPS but it also has some of its own digital public infrastructure which is called the stack because if you made a picture of it it's like a you know it's a layer of different.\nTechnology platforms that the Indian government has built.\nAnd it is genius and so let me tell you about how it started and how it you know what these pieces are the most important piece of this the bottom of the stack.\nThe foundation is called foundation it's actually called odd art which is the Indian word for foundation so the foundation of the stack is called odd art and it's a national.\nIdentity card program and it's a digital identity card program and here's how this started so one of the India's biggest problems in getting into gear into developing.\nWas that nobody had identification it was kind of a free for only about 40% of the people even had a birth certificate so a lot of people didn't even know what their birthday was.\nSo this was a problem they knew was a problem and in 2009 they finally decided they had to address the problem.\nAnd they wanted to start a program that would give everybody in the country.\nA physical ID card like a driver's license if you're able to visualize it and it would have their picture and their name and their information but also give each person their own 12 digit number like a social security number a unique.\nIdentification number and so that was the idea.\nAnd they asked this guy this guy of important person.\nNenden no Connie who's one of the founders of Infosis and he's currently chairman of the board of Infosis they asked him if he would be in charge of this national identification card program.\nHe agreed to be in charge of it but he insisted that if they were going to do it they were going to use a lot of technology and that when people registered to get their physical card.\nThey would also scan their fingers and their eyes so that the database would have biometric information that would allow anybody to be authenticated in a matter of seconds at almost no cost.\nSo this was all voluntary nobody was required to register and get a card and be in the database.\nThey launched it in 2010. Now I knew about this program but I didn't really pay attention to it because there just wasn't any Indian internet stocks to invest in.\nSo I added the logo of this program on our to my coming soon slide that I had for India.\nBut I didn't pay attention until again a few years ago.\nAnd what I saw a few years ago when I came back to see how this honor was was going I was blown away by what I saw.\nWhat I what I realized was 95% of India 95% of the population 1.4 billion people are now registered in this database.\nThey have a lot of physical card but they also can authenticate themselves with just their fingers and their eyes.\nAnd I one thing I didn't know until a few years ago was that in 2014 they added some functionality to the to the database.\nAnd they put in a no your customer layer and they started a program with the banks and they said if you're registered in odd are.\nYou can walk into a bank and open a digital bank account in a matter of two minutes with no paperwork.\nI don't remember hearing about that but when I looked at the numbers a few years ago I realized that not only is 95% of the population in the database.\nBut about 800 million of them have gone into a bank and opened their first bank account.\nSo you've taken almost a billion people 800 million people whose entire lives were paper based cash they didn't have any bank account.\nAnd you've taken them into financial inclusion on a in a digital way in only a handful of years so.\nAnd this was the first aha moment for the staff that using this system to digitize their financial system by by bringing people again into financial inclusion.\nIf you will this would have taken 60 or 70 years in the old world they managed to do it in only seven so.\nNow the entire stack and I'll talk about a couple of the other layers but all of these programs have open apis meaning that it's not just for the government to use but private companies can use it just as.\nUber is built on GPS or or a door dash you know is built on the internet and GPS.\nYou can build on top of these things and the the commercial aha moment for odd arc was in 2016 and the 2016.\nReally turned out to be the big bang year for the India digitization story so in April of 2016 the database reached 1 billion people it's now 1.4 billion but in 2016 April they they register the 1 billion.\nOdd arc and a week later or later that fall rather.\nGeo which is part of reliance industries launched the first 4G network in India and at the time there was about 10 different mobile carriers but all of them were on 2G and they were all in a vicious price war and none of them had any money to invest in 3G.\nGeo comes in and spends 25 billion dollars to buy the 4G airwaves and build a brand new physical network covering all of India with state of the art hardware ready for 5G and 6G.\nAnd when they launched they had a pretty compelling offer and they had a big goal they wanted to sign up 100 million people in the first 12 months now that would have been impossible.\nFor one of the competitors because if you went into one of the competitor stores it took about you know 3 hours to 7 days to get a new phone.\nBut the geostores put in place a sign up system that was on top of the odd arc KYC that know your customer layer and they took that 3 hour sign up time and made it 5 minutes and they managed to sell a million.\nAnd they signed up 100 million in about 3 months so that was another aha moment it wasn't just you know the government and the banking system that could leverage this but it was private companies could.\nNow geo has 500 million subscribers that all 5G available across the country India has the lowest cost data in the world so the Indian smartphone bill if you pay a dollar they pay 2 cents the price per gigabyte is.\nA fraction of what we pay here actually it's.\nYeah about 3 cents versus you know we pay we pay 30 times as much for our data as the Indian smartphone users so you've used this staff.\nThis identification layer to bring 800 million people to the banking system 500 million people not just.\nYou know online but 5G capabilities and the lowest cost data you've done this is 7 years so.\nThat's the first layer of the stack now the second layer of the stack is a payments layer unified payments interface which also launched in 2016 now this was another program that got a lot of coverage in the media and I you know.\nCouldn't it was all over my my feed if you will and I didn't understand the height for this unified payments interface because.\nIt was basically QR code based payments which wasn't really a cutting edge thing in China you know everything had a QR code on it and same in Brazil already for payments and so I thought okay well you'll give you a small clap for launching QR code based payments but I didn't appreciate the details.\nThis isn't Apple pay the unified payments interface to UPI the second layer of the stack this is instant and free transfer of money from one account to another I send you a thousand rubies it's instantly in your account.\nAnd it's a thousand rupees and you could send it to me again we could send it to all of our friends a million times and it would still be 1000 rupees and it would move.\nFrom one account to the next instantly now I didn't appreciate the details of that but.\nLet me tell you what has happened since that launched in since 2016 so the UPI payments now.\nI have absolutely exploded I if you find a chart of this is the absolute hockey stick and it's still in many ways and it's earliest you know days right now the UPI payments per month in India are 15 billion.\nThat's about 50% of the entire world's instant payments and it has the slope of the curve is 55% added it's not shown any sign of deterioration still only about 20 or 25% of the countries using it and it has taken the entire economy.\nIn you know seven years ago was 95% paper based cash 95% of the entire economy.\nAnd you can't pay with cash you can but but a lot of the storekeepers won't be happy if you try to do that some of them won't allow it.\nBehind this the entire Indian economy has gotten formalized you had a very gray economy a lot of black money gray money.\nYeah, money also in 2016 forced all the large determination bills back in to the banks and took them out of circulation again to help formalize the economy.\nNow people are paying their taxes digitally and so the tax collections are growing faster than the economy so this digital foundation this digital operating system that is the India stack this is a secret weapon and it is added so much efficiency and.\nYou know removed so much corruption from this financial system that it is a real gain changer and there's no other country in the world that has.\nThis not a developed country already merging market and I've only scratched the surface I mean the foundation is the foundation and it you know is called that for a reason it is the most important part of this.\nIndia stack with the payments layers important and there's other layers there's a commerce layer.\nImportantly there's a layer now that's going to allow for credit to grow consumer credit and small business credit have been very hard to get in India.\nHistorically and that's going to change very quickly with now everybody has a digital track record they can create their own credit score by sharing their their digital financial track record with.\nSo the India stack really is an incredibly powerful and again I've only touched on a little piece of this I'm applying this to health they're applying it to.\nCars and and you know the fast tags going through tools but I think people would be shocked if they realized how digital India's become in the last seven years because of the stack.\nWell I'm shocked I mean that's why I'm glad I asked about it because it just seems so much more efficient and speed in which they were able to do it is even more impressive.\nWith that many it would take you know here in the US.\nI couldn't imagine how long it would take to get most of the population to do business this way but it just seems extremely efficient it plays into your thesis right.\nThank you QQ is you know you're looking at India Indian internet companies so with all of that being said and I'm so grateful you went through that it was a wealth of knowledge and really I think lays out a very compelling investment case for I and QQ so.\nWhen when now you you have this this thesis built you got to put some holdings inside of the ETFs.\nCan you walk us through kind of the primary criteria for a company to be included in your index and in your ETF.\nSure well you know to be included first you need to be an Indian internet company and.\nThe reality is though that.\nAnd I'll try not to go too much into details but you know the way that.\nIndex is work in the stock market works is every company is in a database and they're they're categorized.\nUnder a system called the geeks the global industry global industry classification system.\nAnd that starts at the top level with the 11 sectors.\nTechnology telecommunications consumer discretionary materials etc.\nThere's no box called the internet so a lot of our work is you know going through and and uncovering which which.\nAre the internet company so for example we own a company called pay TM which is the payments leader.\nI one of the payments leaders in India it's a financial services company there's a lot of other you know traditional.\nFinancial service companies but we don't want to own the the wells far goes of the world we want to own.\nYou know the online version so the the first thing is to to you know identify.\nWhich are the publicly traded Indian internet company so the little.\nYou know discretion involved in in determining that.\nAnd as long as it is public and it isn't Indian internet company and it meets our market cap and liquidity.\nMinimum's that will include it so we own you know everything that is in the sector as we define it and.\nOther than it's pretty straightforward from there we rebalance twice a year.\nIt's market cap weighted with a with an 8% limit on the largest.\nHolding and.\nAnd the list is growing we you know we have 30 holdings now he there's been.\nA lot of IPOs in India this year again you know four years ago there was only two.\nAnd the internet companies and then in 2021 there was a you know couple dozen IPOs and that there was also an Indian internet bubble importantly.\nThat burst in November of 2021.\nBut you know after and this is happening all over the world after tightening things up you know these companies got themselves profitable and.\nYou know continued to grow and and so the companies that the stock returns every covered from the the big sell off.\nAnd and with that recovery.\nThe IPO market reopened so just.\nYou know a couple weeks ago we did our rebalance we picked up five more Indian internet companies.\nWhich I'm excited about one of them swiggy.\nIs part of this quick commerce thing that I mentioned to you earlier.\nYou know a theoretical question as are you going to well this fun remain kind of indexed in nature or as the Indian economy grows there's more IPOs there's more things available for you to invest in.\nYou know do you see it morphing into something that you're going to have a little bit more.\nYou know you know this is a good question I think about this a lot you know.\nAs I said earlier I'm an Omaha person first and foremost and so I'm always.\nLooking at things through that lens but but the reality is that.\nYou know even in Omaha the right way to do this is to buy and hold and and buy the right things.\nAnd hold them and so even if we started to go that direction it wouldn't it won't change what we do much at all.\nBut.\nAgain, sometimes this also gray areas you know around the edges that that requires some judgment but you know it's a it's a fast evolving market so we'll see how it plays out but for right now our our main goal is to.\nYou know give given investors exposure to the sector that we are very confident will have.\nI think that's a very fast disc growth and includes multiple companies that I believe will be multibaggers in the coming decades because it really is in.\nOne of the other things that makes it so compelling right now is it's so early and there's.\nEverywhere for these companies to grow and you don't.\nYou know for example like online travel we have.\nSeveral companies now that are part of the online travel market in India make my trip.\nThe largest one and actually one of the two companies that we owned starting 10 years ago I won one public alone.\nIt's also one of the only companies that trades in the United States most of the Indian internet companies.\nIt's only trading India and so there's almost impossible for US investors to buy the the names directly make my trip trades on the NASDAQ but but when it comes to the travel sector.\nYou know right now only 3% of Indians fly on airplanes on any regular basis only 3% and so.\nThat number can double and it will still be early it can triple and it will still be relatively early so there's green fields in almost every direction but that's.\nYou know again one of the.\nArea that's going to have a huge amount of growth because you know one of the first luxuries that an emerging market consumer.\nThe largest on is the 19 dollar air ticket to go on their first flight ever so again more food better clothing.\nPliances go to a movie.\nGet on an airplane and so this travel market in India is exploding.\nThe the largest airline in to go for example.\nThey have 1200 airplanes ordered that's one and a half times the number of airplanes that Southwest has so they're waiting on one and a half times.\nThe size of Southwest fleet in new airplanes.\nAnd so it it's just very very early in in all of these different verticals including you know things like travel.\nKevin I can't thank you enough this has been like I said such an educational.\nYou know 45 minutes for I believe everybody that's going to be listening to it I think it.\nIt gets overlooked everybody wants to lump emerging markets in the end of one basket and and sometimes there's very unique compelling opportunities out there that.\nI deserve their own spot in a diversified portfolio and I think you laid out the thesis beautifully so before I let you go though where can people learn more about EMQQ Global and get information specifically on the fun that we talked about today.\nEMQQ Global.com just as you said it.\nwww. EMQQ Global.com is where you'll find all of our stuff and you can of course find me on LinkedIn or wherever as well.\nKevin thank you so much for your time I appreciate you doing this with me.\nOkay thanks so much Brad.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}