{
  "id": "16463751",
  "transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology they are run on\nand you want more customization and flexibility, as well as a AI-driven model marketplace,\nUX wealth partners is your destination.\nOn top of that they have institutional trading, so if you are an ETF issuer or an SMA provider\nlooking for outsourced institutional trading, UX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and\nmake your practice more efficient.\nWelcome to Behind the ticker.\nToday we have on Katherine LaGraw, she's an asset allocation strategist over at GMO and we\nare talking about their newly released VALUE ETF, US value ETF, ticker GMOV.\nIt's a really differentiated from traditional passive value.\nI think you'll find our conversation very interesting, they play their own accounting principles\nto really find the underlying value of a lot of these names that might not be uncovered.\nSo we talk a bit about that, but without further ado, please enjoy this episode with Katherine\nLaGraw.\nHey, Katherine, welcome to the show.\nWell, thanks for including me.\nSo before we get started, you know, while you take a little bit of time, tell everybody\na bit about your background and how you eventually ended up here at GMO.\nYes, I am an asset allocation strategist at GMO.\nThe asset allocation function is maybe a bit different than how you think about most investment\nroles.\nA lot of folks in the investment industry are focusing on specific securities, looking\nat particular stocks and bonds.\nI'm looking at things top down at the asset class level and looking for great opportunities\nfrom evaluation perspective on asset classes or groups of stocks.\nAnd then my team runs multi asset portfolios where we're dynamically shifting the allocation\nas opportunities change, valuation is really our guide in picking these allocation changes.\nI joined GMO in 2013.\nPrior to joining GMO, I had followed the firm for quite some time.\nI read the quarterly letters.\nI followed the forecast on the website.\nAnd I think what drew me to GMO was in particular beyond that thought leadership.\nI love the GMO's private partnership where employee owned.\nSo we answer only two our clients into ourselves.\nAnd I also love this valuation philosophy, which permeates throughout the firm across all\ninvestors and strategies.\nIt's a really unifying philosophy.\nPrior to joining GMO, I worked at BlackRock and BlackRock's chartercessor firm.\nYou wish you may or may not recall Barclays Global Investors, DGI.\nBoth were a wonderful prod introduction to the investment management industry.\nGreat places to get started.\nAnd my very first job out of the school was I was an investment banking analyst at Barsterns.\nOkay, that's great.\nAwesome background and thanks for sharing it with me.\nBut before we jump into all things value in GMO and the firm, I got to ask.\nWe are not behind the desk.\nWhat do you like to do?\nAny hobbies?\nThings you enjoy?\nI do love to get away from the desk.\nAnd I like to literally go outside.\nI love hiking.\nI think it's a great way to disconnect and clear your mind.\nI particularly like exploring new and different trails.\nSo that's a favorite hobby to buy.\nYeah, no hiking for me for the foreseeable future.\nIt is freezing cold in Pittsburgh.\nAnd I cannot.\nI'm not a cold guy, but somehow I still live here.\nSo.\nI strap on the snow shoes or micro spikes.\nYeah, well, you're a braver than I am.\nSo let's talk about GMO as a whole.\nSo I know you guys have a sweet of ETFs.\nBut what all do you do to help service clients?\nI know it's more than just ETFs and these types of products.\nSo as a firm, what are you doing to help on a massive different flu of things?\nYeah, the ETFs are actually a brand new initiative for us.\nAnd so that's part of the reason we're excited to be talking to you.\nWe're a global investment management firm across many asset classes.\nFounded in 1977.\nSo we have investment teams focus on asset allocation.\nIn addition to dedicated teams focused on equity rates, credit, and hedge funds.\nSo I'd say basically everything in liquid assets.\nWe do for our clients and it's the full structure.\nWe have some active ready to go strategies.\nThe clients will just select and say, hey, that's a good fit for my portfolio.\nWe also partner with our a lot of our clients.\nThe it institutions like foundations,\ndiamonds, pension funds, wealth management firms.\nAnd we will design something that's a little bit more customized to their specific needs.\nEither they're desired risk parameters, they're desired objectives, or maybe even just how\nthey want to receive this strategy from a liquidity perspective.\nI actually particularly love working on that.\nI think we in the investment industry all know that it's not one size fits all in\ninvestments.\nIt really depends on the investor and what their end objective is.\nAnd so making a strategy actually suit that investor's needs makes it work for everyone.\nSo you alluded to it earlier.\nYou know, ad GMO value kind of rain's king, right?\nSo we're going to talk today mostly about GMO V, which is your US value ETF.\nSo since we know that GMO is value based, what makes GMO V kind of unique compared to other\nvalue focused ETFs out there on the market?\nYeah, I think there are three things that are really differentiated in our approach to capturing\nvalue in GMO V. First and foremost, we take a top-down approach and we look for entire groups\nthat are dislocated or misvalued. And I think that is pretty unique to GMO and it comes from\nthat asset allocation capability that we have. Today, that's tears us to deep value stocks,\nthe cheapest 20% cohort. That cohort is completely dislocated. It is extremely cheap relative to\nits history. We think phenomenal opportunity. Value wins, deep value always wins by more.\nSo we're really focusing on that deep value cohort in GMO V. The second thing we do that's\ndifferentiated is as we're selecting securities, we don't rely on reported accounting data.\nAt GMO, we've actually restated the financials for every company in our investible\nuniverse to better reflect true underlying fundamental value. As an example, we consider research\nand development to be an actual investment rather than just a current expense. So we're going\nto capitalize that as an investment and turn it into an asset on the balance sheet, showing that\nthe company has additional intellectual property. The third thing we do that's unique in\ndifferent is we also look at forward-looking projections for each company. So we've created a forward-looking\nprojection for every company in our investible universe. And that projection is calibrated and tailored\nto that company's unique characteristics, including their quality and their growth prospects.\nSo we come up with an estimate for how enduring a company's profitability can be forward-looking\nusing our models. So those three things, the top-down approach, the fact that we don't\nrely simply on reported accounting data and the fact that we also create forward-looking\nprojections for each company, I think that really differentiates GMO V. Great, that's awesome. So\nyou mentioned this quickly about deep value opportunities. So how does GMO V balance\nvalue opportunities with other things such as quality and growth characteristics in the overall\nportfolio constructed? Yeah, I'd say there are a few things that we used to balance deep value\nwith these quality and growth characteristics, because I think part of what you're getting at is\nhey you don't want to buy something that's cheap for a very good reason. You want to buy something\nthat's truly attractive fundamentals and happens to be trading in a wonderful valuation relative\nto those fundamentals. So by not using those simple ratio-based accounting metrics, we're not\nlooking at simple price to book price to sales price to earnings, that's one thing that helps\nwho are actually building our own estimate of what the fundamental value is and looking for a company\nthis trading and attractive price relative to our estimate of its fundamental value. And that\nfundamental value estimate does incorporate a lot of characteristics of quality and growth,\nbecause we'll work projecting forward profitability for each country. Each company, those\nmetrics are key determinants of future profitability. A company with very good quality characteristics\nlike strong profitability, stable profitability through time, low reliance on external financing,\nlow leverage, those are the companies that are likely to have an enduring terminal profitability\ngreater than their industry group or greater than the overall universe. So that's one way.\nAnother thing we do is we do screen companies for red flags or potential problems. So what's\nan example? There's three categories we look at for potential red flags and there's just dozens\nof metrics we look at. Any companies going to have one, two, or three, but when you find a company\nwith 10, 12, 15 red flags, then you start to worry and maybe maybe flag that company is not\nsomeone you want to own. So the types of metrics we're looking at counting metrics like a company\nthat's built up a cool or a company that has a surprising paramount charge. We look at management metrics,\naggressive management behavior, too much M&A, too much share as she wins. We look at market metrics.\nSignals the market is giving us that there might be a feature for the mental impairment for\nthe company. If there's a lot of interest in shorting this particular company, if there's a very\nquick drop in the price, we call that a synthetic profit warning. The market is telling you\nsomething is happening here. Again, it's all about this growth of many, many of these metrics that\ngives you a sign that hate this could be a value draft. So those are a couple of things we do to\nmake sure we're not buying a company that's really cheap for a very good reason. So when kind of\nconstructing GMOV and the holdings underneath, how do you handle the common sector biases that\ncome with value, right? So such as overweight utilities and underwates to tax. So how are you trying\nto balance that inside the portfolio? Our view is we're willing to take sector bets and sector\noverweight underwates if they are supported by our view of valuations. So one example there would\nbe financials. We have a lot of financials exposure in GMOV and we think we can find a lot of\nbanks and financial companies that are genuinely cheap trading and attractive valuations relative\nto their underlying fundamentals. However, on the other hand, most value approaches value indexes\nand many other value strategies will be overweight something like utilities. That's something\nwe're currently in GMOV. We have no exposure to utilities. Even though it's typically an overweight\nand value portfolios, if we're not finding companies that meet our definition of cheap,\nwe're just not going to hold the sector at all. So with our guidelines for the sector perspective\naround a benchmark, we do run quantitative approach, we're running a risk managed approach.\nWe do have providers and guidelines. Well, one thing we've done that's pretty unique is\nwe have a symmetric bands around the benchmark. We're willing to overweight something that we\nthink is cheap and we'll put a cap on that, but we're willing to underweight a security\na sector or an industry group that we think is expensive down to zero. So we're not holding\nanything in the portfolio that we think is expensive just for risk control.\nSo I was going to ask a question on the role of sentiment and some other things and not getting\nstuck in a value trap. I think you did a great job already answering that. So I'm going to skip ahead\nand I want to we have been in a long period of relative underperformance of value versus growth.\nI mean, even in our funds that we run, we run everything equal weight and market cap is just\nis run right over us. So what is your perspective on this extended underperformance of value over\nreally the past decade? And do you see this as a massive opportunity? At least I do.\nSee it as a massive opportunity for those of us that are value investors or those of us that are\nmore equal weight-tiller investors. I absolutely do see it as a massive opportunity today.\nIn terms of my diagnosis for what's happened like how if we had such a long sustained period of\nvalue underperformance? How has it gone on this long? I have a theory and the theory is in particular\nfor this deep value cohort. These stocks have just gotten left behind partially because it has\nbeen such a long term period of value underperformance. In this long cycle of value underperformance,\nmany investors have stepped away. They've allocated away from value strategies. They've\nallocated away from the deepest value strategies and sewage to core or even growth. We can actually\nsee this in the numbers. We can see this in flow and we can also see this in the number of\ndeep value managers who've gone out of business in the past five years more than any other time in history.\nAnother theory I have is that for active managers who want to stay in business who want to survive,\nI think many of them have tilted away from deep value. They've moved into maybe what we would\ncall shallow value or even more core again just to survive just to keep going through this cycle.\nAnd this is combined to lead deep value behind and leave it truly extraordinarily cheap today.\nAnd I do think it's a wonderful opportunity. One that we always do at GMO when we're trying to decide,\nhey, something a bargain today or is it really just a value trap? Is we analyze what the sources\nof underperformance have been historically? And one thing that really made an impression on us for\nvalue and deep value is in terms of the fundamental growth, you know, profitability revenue growth,\nvalue always underbrews the market. That's a defining characteristic. That's that is the definition\nof value. But that underbrews has been exactly in line with history. Value has been no fundamentally\nworse over this package decade than it was historically. It was really it's gotten cheaper\nrelative to the market. And so that gives us a lot of confidence that this is an extraordinary\nopportunity today and you can make a lot of money by betting on value. And while I would put\nwide error bars around this estimate based on a simple calculation, value needs to be growth by\nabout 60% to go back to historically normal relative valuation. I think that's a tremendous\nopportunity. Well, even to take this a step further is you have value underperformance versus growth.\nBut also you have massive U.S. outperformance over international at historic levels. And I know\nyou guys have another ETF and we'll get back to GMO V in a second. But I know you have GMO I.\nHow do you how are you viewing that as an opportunity with both of these being kind of wide\ndislocations over the last, I don't know, for years or more, maybe more?\nSo it's a similar story outside the U.S. in the sense that deep values extraordinary\ncheap there as well. So we've got kind of top-desiled cheapness in deep value both in U.S. markets and\ninternational markets. One difference is outside the U.S. value's been working. And even though\nvalue's been working, this deepest value cohort is still incredibly cheap. And as you stated,\noverall equities outside the U.S. are just cheaper than U.S. equities. Plus you've got the fact that\nthe U.S. dollar is pretty expensive as well. So if you are willing to invest in stocks outside the\nU.S. you could have a potential additional tailwind for currencies. So if you ask me purely on an\nabsolute return basis, what do I think is the better opportunity today? GMO V, the U.S. value or\nGMO I, the international value, I'd steer you short GMO I international value because you've got that\noverall market cheapness. And that currency is a tailwind in addition to the value cheapness.\nI still think GMO V is a wonderful opportunity. I think a lot of U.S. investors are very\nS&P 500 indexed focused. And I think the willingness to do anything different than pass\nof S&P 500 indexed will benefit you today. So definitely consider a value approach.\nYeah, I mean, even with all the advisors that I talk to on a daily basis, it's like,\nthey don't even want to own international anymore in a diversified portfolio because it's\ndragging on benchmark return. They are consistently continually overweighting tech into this because\nthey want to keep up, right? And I just think as you've stated eloquently more eloquent than I\ncan that there are definitely opportunities and now I think would be the time to start diversifying\ninto value, start picking up some international tilt and getting this portfolio a little bit more\nbalanced out. So I think a lot of model portfolios out there have drifted from model and I've\ngotten pretty top heavy U.S. growth and specifically market capital weighted growth. So\nstaying on value and you'd mention passive. So in your view, why do passive approaches\nto value investing kind of fail to capture true economic value? Like, why GMOV over not to\nput any competitors out there was the first one, like a VTV, right? Just by value passively,\nwhat do you think an active approach to this is going to yield better opportunity going forward?\nThere are a few things I think passive value is missing. One passive value tends to rely\nalong a lot on reported book value and I think reported book value misses a lot. It could even\nbe meaningless. To give some examples to a lot of companies, they have many assets that are not\non their balance sheet in a reported book value sense. They're intellectual property,\ntheir brand value, things that they have invested in, and all that investment has just been viewed\nby standard accounting as an expense. So that's information is lost. The second thing I worry about\nwith passive value is they use primarily backward-looking metrics. And I think sometimes you have to\nthink about the future. What is the potential profitability going forward for this company? Why\ndo I want to hold the company today looking forward? You mentioned sector biases, that's something\nI get worried about. There are sectors that tend to be favored by value approaches. We're\nnot finding any incredibly cheap companies at all. Utilities was one example. We don't find\na lot in real estate or reeds either right now. So we don't want to necessarily take all of the\nsector waids and overwates of a traditional value approach. And then the final thing I mentioned\nis they do nothing to screen for value traps. That's not their role. They're just screening\non finding low multiple stocks. So those are a few things I'd be wary of with simply going\nwith passive value today. The one thing I would add is, where we see this opportunity in deep value,\npassive value gets a lot of what we call shallow value. And in the US, shallow value is actually\ntrading at the very expensive end of its historic range. So I would say that's not how to best\ncapitalize on the deep value opportunity in our metrics deep value looks about third percentile\nversus history, basically never been cheaper. And shallow value is trading 79 percentile. So\nsort of that the upper end of its historic range, not the best way to capture today's opportunity.\nSo speaking about capturing today's opportunities, given current marking conditions, where does GMO\nkind of see the greatest value dislocations and how are you positioning GMO V today in order to\ntry to capitalize on those? It's really all about that deep value cohort, really focusing on that\ncheapest 20 percent because in a reversion scenario, that's where you can make the most money. Deep value\nis like high beta value. And when I look through historic periods, whenever value wins,\ndeep value wins, I'm more. So that's why we're really focusing on getting that very cheapest cohort.\nThat's why we're willing to take asymmetric parameters around the benchmark so that we don't\nend up holding any of the more shallow value or really pretty expensive stocks in the value index,\njust to do risk control. If you're looking for more of a sector point of view there,\nyou know, we are having a lot of exposure to things like financials. There is, we think a lot of\npre-high quality things from a financials perspective in the value book today, but we're finding\nopportunities across most sectors today. So we find a lot of opportunities to invest across\nthings like communication services, consumer discretionary health care. We're finding a lot to do\nin those areas and those might not be traditionally thought of it's value segments.\nSo from a portfolio construction perspective inside of GMO V about how many names in this portfolio\nany given time is it? I mean, are you buying, you know, a bunch of stuff are you very concentrated?\nWe're diversified. We're taking a quantitative approach and you should expect to see, you know,\nround numbers about 150 names in the portfolio at a time. So it's not all the eggs and one basket\nwe're trying to capture that deep value cohort, but we're doing it with many many different\nsecurities. And when, you know, waiting those 150 securities, you know, how are you making\nwaiting decisions inside this portfolio? Is it, are you making a bet? Is it market cap? Is it equal\nweight? Like, how would you see this portfolio constructed? It is a risk managed approach relative\nto a benchmark. So while it's not a pure market cap approach, there's that element of market\ncap to it because we're managing relative to a market cap benchmark. And it is a trade-off between\nour projected alpha, which is based on how cheap the company is and the tracking error creates\nrelative to the benchmark. And we have those those wonderful asymmetric parameters where our\nphilosophy is underweight anything we think is expensive down to zero. There's no way to hold it at\nall. Well, we are going to put an upside cap on how much we'll hold of anyone's security,\nany industry, any sector. We don't want too much concentration in one idea in this portfolio that\nthat's not over getting at and hence we end up with about 150 names. Got it. So I know the portfolio's\nactive. So in terms of turnover, how often are you guys adding, removing, re-weighting, I'm sure\nit's a daily process. But is there a more quarterly or weekly or annual or monthly snapshot\nand look where you're doing a lot of work? You're catching the right theme because with value\nfor the value investor and I think we as value investors don't always think about this that much.\nBut that turnover that re-balancing, that is the largest source of relative return for a value investor.\nWhen you think about the sources of relative return for a value investor, compared to the market\nor compared to the growth, value stocks always fundamentally undergrowth. By definition,\nthese stocks are trading at a discount for a good reason. They always outmeal the market. They have\nhigher yields than the average stock or then growth stocks. But the big source of relative return,\nthe big source of positive return for a value investor is this re-balancing. It's the turnover.\nThat you will buy some stocks at a discount that don't disappoint investors,\nwhite as much as they're expecting. And then they rewrite and you the value investor seldom\nand take profits and buy something that's become cheap. And that turnover is pretty large.\nSo let's call it 50 to 70 percent a year. These are ETFs. So they are daily managed\nfor reacting to flows. But think about our full refresh on a model basis. Typically,\nhaving a monthly, fundamental data does not get updated that frequently. So you can think about a\nmonthly cycle. But really, it is a turnover approach because that's how you capture the benefits\nof value investor. Of course. So you're sitting down with an advisor or somebody constructing\nmodel portfolios. How would you recommend they use GMOV or even GMOI in this case as well\ninside an already diversified portfolio? I think there's three good uses for these ETFs today.\nIf first and foremost, you could use GMOV or GMOI as a substitute for existing passive or active\nvalue exposure. The key to our approach that I think is going to be different than what you hold\nright now is that we are going deeper into value. And so we expect to outperform what value\nwins. Well, we'll outperform passive and traditional acts of value. So when I look at GMOV and GMOI\ncompared to other passive value indexes, we're trading about a 15 to 30 percent discount to value.\nIt's really a much cheaper portfolio. Second, if you don't have value exposure, value is\nextraordinarily cheap today. I suggest you use these ETFs to take an opera tonistic that\non value. At GMOV, we actually think that at fair valuations at equilibrium, value should\ndeliver market returns. We don't think there's an enduring value premium. We think value will\noutperform what it's price to do. So and it's really price to do so today. So if you were ever\ngoing to consider value exposure in your portfolio, now it's the time. And the third way to use them\nis I think there's a lot of love for the S&P 500 and I'm pretty concerned about it as an index.\nIt's near peak valuation on almost any metric you look at. It's out of peak concentration.\nThe top 10 stocks in the index make up the greatest percent of market cap and volatility that\nwe've ever seen. So the passive investors not getting diversification, they're getting a lot of\ncompanies to the specific risk. I think you can use GMOV or GMOI just as a vehicle for diversifying\naway from S&P 500 exposure. Yeah, side card, S&P. Well, Catherine, I really appreciate your time\nand this was enlightening and I think you guys are, I just looked, I mean you've launched\npretty recently. So I think you've got pretty good timing. So but I can't let you go\nunless people learn about where they can learn more about GMO, where they can find your ETFs\nand get all the information they need. Oh, please visit us at GMO.com. You can learn about\nour ETFs. You can also find our quarterly letters and our asset class forecasts and other resources.\nWell again, thank you very much. Thank you.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}