{
  "id": "16500845",
  "transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology they are run on\nand you want more customization and flexibility, as well as a AI-driven model marketplace,\nUX wealth partners is your destination.\nOn top of that they have institutional trading, so if you are an ETF issuer or an SMA provider\nlooking for outsourced institutional trading, UX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and\nmake your practice more efficient.\nWelcome to Behind the ticker.\nToday we have on Mike Lucas, he is the founder and CEO of TrueShares and they have a extensive\nlineup of active ETFs.\nBut today we're talking about their newest issues, Q-Bull and Q-Bair which is Q-B-U-L and Q-B-E-R.\nThey are a quarterly resetting, hedged equity product, I'll let him explain to you how\nthey operate and how they work, I think they're very interesting products, I think they\ncould be used for active portfolio managers as they are maybe in a risk off mode to allow\nthem some upside exposure.\nSo without further ado, please welcome Mr. Mike Lucas.\nHey Mike, welcome to the show.\nYeah, thanks.\nSo why don't you start by telling everybody a bit about your background and how you\nended up at TrueMark Investments and then ultimately starting TrueShares?\nWell, we started TrueMark Investments for the purpose of starting TrueShares, right?\nSo that's one of the same to me.\nBut we founded TrueMark back in 2019 and after 30 years in the business and lots of time\nfighting the tide, I realized that you know what, maybe ETFs are really going to stick\naround.\nAnd more so than that, I think we saw the next leg up for not just actively managed ETFs,\nbut really getting into that sort of solutions-based platform for ETFs where, you know,\nthe evolution was what sort of passive index strategies and then thematic and now it's,\nI think it's morphed into, you know, let's take a more traditional active strategies,\nlet's take some more institutional hedging strategies, you know, let's take portfolio construction\nto a whole new level.\nAnd that's what we wanted to be.\nSo that was the onset of TrueShares.\nHey, we launched our first ETF products in 2020.\nWe snuck him out literally right before they put a moratorium on listings for COVID in the\nshutdown and all that good stuff.\nAnd then we haven't looked back.\nSo we're up, we're 21 names, 21 tickers out there right now across all three exchanges\nand couple more in the pipeline and we'll just, we'll keep moving on with ideas that we\nthink have married out there and continue to build what we think is a pretty good brand name\nfor TrueShares.\nWell, that's great.\nAnd before we get into kind of like the nitty gritty of TrueShares, the type of products\nthat you offer, and we're going to talk about two of your ETFs today specifically.\nWhat do you like to do for fun?\nAny hobbies?\nYou know, we're talking about donuts before we started, but there's not a pure hobby\nof yours.\nYeah, it used to be.\nNo.\nNo, the donut thing is gone by the wayside, but you know, like, I'm a traveler which fits\nwell with my job, right?\nSo I think I'm not unlike a lot of folks in the last few years.\nI fall in love with Japan, you know, with the exchange rate where it is, it's having gone\nthere yet, do it and do it now.\nThis is an amazing place to be.\nI've gone there a few times in the past couple of years, like to travel out of places\nin Europe as well.\nI mean, I'm over 50 now.\nSo I think that automatically qualifies me to dig into military history, you know, so\nthat's a bit of a hobby of mine.\nBut beyond that, it's sort of golfing skiing.\nYou don't like to stay in shape and keep active.\nI think that's sort of the key, right?\nKeep moving and try not to sit for too long.\nYeah, no, I would, you know, you and I share golfing, skiing and traveling.\nIt's ski season here in Pittsburgh and I haven't picked up a club and I'm starting to get\nthe itch, you know, it's like you're ready to give it up for a month, but, you know, it's\nnegative, like, two real feel here today.\nSo I'm ready to start.\nI'm ready to pick up a club again.\nBut you talked a little bit about the philosophy of the firm in terms of the type of\nproducts that you want and you've got, you know, 20 plus ETFs that you have issued.\nWhat are some of the different types of products you've already brought to market?\nWhat's that, and then you kind of look like?\nYeah, so in the early days, we had, you know, what are our interpretation of traditional\nfundamental active management is we launched a few of those.\nWe have an AI and deep learning product that's been out there since 2020.\nPretty concentrated, long only 20 names, 21 names in the portfolio.\nAnd then we started to expand from there and we put out obviously our structured outcome\nproducts are defined outcome or poverty ETFs as they're commonly known.\nWe launched our first of those back in 2020 as well.\nSo we've got a dozen of those out there.\nWe started to build out our income and yield suite.\nGot some great income products in the platform, both domestic and international.\nAnd then we most recently launched Q-Bolic U-Bert, which are a quarterly bull hedge and quarterly\nbear hedge. So we'll continue to travel those parallel tracks, one being what we consider\nportfolio solutions, meaning you've got a holistic view of a portfolio, whether you're a model\nprovider or an investor, and you need the tools to create that expected outcome and risk tolerance\nto that portfolio. So we'll continue to put those tools out there and alongside that we'll\nopportunists we launch what I consider a quote of quote stand-alone investments,\nwhich would be a particular strategy, particular asset class that might be in demand in the\nmarket place or solves a pain point. So maybe a little bit more of the solutions based than the\nstand-alone basis moving forward, but those are two doling priorities in terms of product.\nAnd some of the products, if you can correct me if I'm wrong when I was looking at the website,\nyou have sub-advisors on. So people coming to you actively, and I would assume given your products\nwe have control of your own trust. So are you in the white label or realm at this point trying to\ncompete with some of these white labelers out there, or do you have such a specific niche for\nthese solutions based products that you're kind of trying to be known more for that, then\nhey, we're going to launch anything. Yeah, that's a great question. And in terms of the initial\npart of that question, the answer is a firm note. We are not in the white label space.\nOur intent was never to be in the white label space. I think the sub-advisors product that we have\nreally can come from two different areas. One, it can be selling coming to us, and it's a strategy\nthat we think is timely that can get up to critical masks quickly, right? Because we know in this\nbusiness that daily volume or the ability to buy the ETF is as important as the ETF itself,\nwhat the strategy underlying. So we look for those types of characteristics in what we launch\nwith sub-advisors. We do a deep dive on the sub-advisor. If we partner up with one,\nwe will more than likely do a follow-on product with them if that's something that is in their\nwheelhouse. But it comes from two different angles on that. One, it can be, look, we need a strategy\nthat fills this niche. Who do we have in our role in that? So do we know in the network that we\ncan go out to and maybe find an asset class specific manager to fill. And the other would be\nthem coming to us to say, look, we've got something we want to put up there. But by and large, I think\nit would probably be about a 75-25 split moving forward where the 75 percent will be internally\nmanaged portfolio solutions. And then we'll do opportunistic sub-advisory.\nNo, great. So let's get into the two ETFs we want to talk about today, which is your newest\nlaunches, Q-Bull and Q-Bair, which Q-Bull is Q-B-U-L. Q-Bair is Q-B-E-R. So really at a high level,\nwhat are these two funds trying to accomplish?\nPrincipal protection with directional market exposure, equity exposure.\nAll right. So if you look at our structured outcome product lines, if you look at offer ETFs in general,\nright, particularly the equity-based ones, you have a thought process behind them is people still\nwant exposure to directional market moves. They still want exposure to the growth characteristics\nof large gap equities, for example. But they want to mitigate the downside and they're willing\nto give up some of that upside potential for downside mitigation. And so those are great, you know,\nwe have a series of neural lots out there. They all do what they're supposed to do.\nYou just as long as you understand the math behind them. And we thought to ourselves, look,\nthey're a great stand alone. A lot of people don't necessarily understand on the implement them.\nA lot of people implement them in a way that might be incorrect for their investment goals.\nAnd so we thought, look, let's target the holistic portfolio viewpoint again.\nAnd we can provide tools that can fully protect, or at least a treasury risk, right,\nis your downside protection in these strategies. But it can allow investors and model providers\nalike to get out there and incorporate these into their portfolio, blend them with whatever asset\nclass they're in. Just in case they're wrong or just in case they want to toggle the risk exposure\nbecause it allows you to, you know, create equity based risk. However, you have upside,\nexposure to large gap equities with cue ball or downside potential downside alpha, right, with cue\nbear. So their mirror strategies different directions, cue ball, free month, you know, or\nthree months duration before they reset the reset every three months. So cue ball, it would be\nlook, if you've got a market move that's north of five percent in a quarter, then cue ball kicks in.\nAnd your downside is that of holding a treasury. So you've got this opportunity to say,\nlike, I have this risk tolerance. It's not negotiable. If the market\nbooms in a quarter, which historically it does a heck of a lot more often than we think,\nI want to be able to participate in some of that, but I can't take on the risk. On the other\ndirection to bear, same concept, you know, if the market drops more than five percent and a three\nmonth period, you will start to generate a positive return from cue bear in that band between\nplus five and negative five for the two strategies, your flat, your treasury. So it's, it's really\na more versatile tool, I think, then what we typically see out there, it's meant to allow\nsomeone constructing a portfolio to blend it with offered ETFs, blend it with long-only\nequity exposure, blend it with cash. So you can create all sorts of scenarios with\nmost asset classes out there that can benefit from adding this ingredient to the portfolio\nto achieve what your desired outcome is. Yeah, no, it makes it ton of sense to me. So just so\nwe're, you know, really clear if I own cue bowl, I'm just going to get treasury return\nwith maybe some income and let's the market exceed, until the market exceeds five percent.\nIs that correct? So if you're, if you're cue bowl, yeah, market upside five percent, cue\nbear will be market downside five. And is it going to be a one for one after that thresholds,\nfor is, you know, it might be, yeah, yeah, never be exact. So it would eventually start to catch\nup the further the market moves in that direction. So markets up seven percent and a quarter,\nyou're going to get, you know, you'll get some convexity once it pushes through five. So you'll\ninitially start at sort of one or two percent and it'll start to increase and gain convexity,\nthe higher it goes above five. Same thing on cue bear in the sense that, you know, if the\nmarkets down 10, you're probably going to capture, let's say six percent positive return just,\nobviously throw it out estimates, and cue bowl the same type of thing, right? Yeah. I mean,\nI could see cue bear just thinking about portfolio construction. I mean, if you're really\nbearish on the market, but you don't have the risk tolerance or want to short the market,\nand you're right, you're going to get paid, you're wrong. You're just exposed to treasury risk.\nRight. That's exactly right. Yeah. Okay. It's the same old concept with the head, right? No\nfree lunch, right? So we can't, we can't give you the full benefit of the move, but we can give you an\nopportunity to, you know, even if, say, your tactical and your signals that tell you to go all\ncash on some cue bowl just in case. Yep. Right. You know, you've got treasury risk.\nAnd you've got the potential to catch it, you know, that upside if you're wrong or something occurs\nin the near term that changes the directional momentable market. And, and, and same thing with cue bear.\nYeah. No. Makes a ton of sense to me. So can you kind of explain the asset allocation inside\nkind of the balance in between, you know, the treasuries that you're holding, and then I'm assuming\nyou're got to be holding some options here. So how are these being constructed? Maybe start with\ncue bowl first, and then we can flip the cue bear, but how are these portfolios being\nallocated, and then rebalanced every three months? So much like we do with our structure,\nI'll come see it as we try to keep the simplest possible. You know, when you have caps and one\nforeign participation to a certain level, et cetera, you typically will have minimum sort of four to\nseven different contracts on the underlying mechanism with cue bowl and cue bear, very straightforward\nstuff. So the principle goes into a treasury. We take the anticipated yield of that treasury,\nand because it'll be a zero, right? So we take that anticipated yield, and then we allocate that to\nbuying a directional position. So cue bowl, for example, we will put the principal to treasuries,\nand we will take that income, and we will go ahead and buy out of the money calls to the exact\npost, right? So the hired yield from that underlying income instrument, the more call coverage\nyou get, cue bear, same thing. You put the principal into a yielding investment, this case treasuries,\nwhich is perfect, but the yields are where they are right now, and you take that anticipated\nincome, and you'll buy a put position out of the money, in this case five percent a little more.\nSo the, for John those, we'll get to your convexity, right? So about the more coverage,\nright? A convexity. Right. And that's what I was going to ask. So the, does your, you know,\nyour five percent number fluctuate based on current yields of treasuries? Like, well, that target,\nI know we use that blanketed, but are you always targeting that five percent gate, or is it going\nto be variant based off of where treasuries are? Yeah, it could vary, and not significantly,\nbut it could vary. So, you know, if you've got solid coverage on your yield, you can get it\ndown a say four percent. You're never going to have it down, you know, right? Two percent,\nand that's sort of thing, but it can vary between sort of a four percent to six percent band.\nOkay, no, it's interesting. And so what was the impetus behind choosing a quarterly role strategy?\nA lot of buffers are now point to point that are, you know, year over year, or some now,\nmonth, the month, like what, what was the idea behind picking every three months?\nVersatility, I think, first and foremost, right? So, depending on how you're using these, and I think\nthe, we could go on for a whole other, you know, podcast session on this, but I think the\nunderstanding of the sequence of returns, it was always misconstrued the marketplace,\nwhere we're still so addicted to annualized returns, and not fully understanding that the bulk\nof those returns come in short periods. So, with the annualized product, or even the six month\nproducts, you have an extended period of time where your expected return does it necessarily match\nup with your current price or current value of the investment because the options decay,\nbecause the length, like, of those options. So, using a shorter time frame allows the product to\nreact with a higher correlation to what the market's doing. And if you are, it just, as an example,\none way to do this is, you know, if you've got a buffer to 12 month, buffer to ETF strategy,\nwhere you're layering or latering 12 month buffer ETFs, and you blend it with Q-ball,\nmarket pops, Q-ball goes up. You can clip that coupon in dollocost average it into your,\nyour buffer strategy, right? You can trade out of that Q-ball and go into your bear if the market\nhas, as pops, reverse your route looked on it, clip that coupon dollocost average into the other\nasset class. So, that correlation to the market is important to us, because we believe that\nyou have to be versatile with some of these moves and take advantage of them if you're blending it with\nother asset classes. Now, there's always just, you know, there's a set of it, forget it. So,\nthe other aspect of that is it works for both sides, right? If you're not tactical at all,\nand you'd like to set it, forget it, it just re-rolls every quarter. And so, it's going to give you\nthat dynamic sort of adjustment to the market on a quarterly basis regardless of what you do.\nSo, you have that tactical option in the Senate, forget an option and that tighter correlation\nto market moves because of the shorter option expiration period.\nMakes a ton of sense to me. I guess I asked this question on one hand, but I didn't ask it on the\nother hand, which was, I asked you about yields and how that could affect your target, but I also\nmissed, you know, market volatility, right? And that's going to affect the price of the option.\nSo, Q-explain that relationships is like, is markets enter period of volatility, let's just say,\nyou know, we get some volatility to re-rear here in the next couple of months, and how with that\nfact, the, you know, this product as you do your roll again in second quarter.\nYeah, so it's in the end, it will obviously, I'm the fact, right, and I think that\ndepending on the direction of that volatility, right, I always like to say there's good\nvolatility and bad volatility. And so relative to the product that you're in, whether it be Q-ball\nQ-bear, if that's upside volatility, if it's the good stuff. Yeah, it's sure it's going to drive up\nprice of calls, and, you know, it will, will adjust to that, right, based on how much of the\nunderlying income we use to establish the call position. If it's that bad volatility,\ndownside volatility, it'll drive up puts. But again, you know, understanding that\nthese strategies will adapt to that environment because of their short term nature.\nAnd that allows us that three month period, if that's extended volatility,\nit allows us to re-adjust to that volatility because we have a more opportunistic reset to the\nportfolio than having to sit around for 12 months of wait for it. So, let's talk about,\nyou talked a little bit about how you would maybe utilize these products with a series of\nbuffer ladders and trying to create it really like a defined outcome type portfolio. But if I'm an\nadvisor, I've got your typical model portfolio, you know, 6040 that's holding low cost, passive ETFs,\nyou know, it, how would you advise on them kind of incorporating these? Would you, would you have\nthem have one or the other in the portfolio at all time? If so, like how much? I know that that's\ngoing to be a total risk-related question, maybe that's a loaded and bad question. But,\nyou know, how do you see kind of using them in, as a traditional advisor, you're going to be\nlistening to the show? And it comes down to conviction on market direction, right? So, if you're\nsurely establishing a risk tolerance, and you've got a 64 year or some other asset allocation,\nthat is meant to be an all-weather portfolio, you own both. You want a little bit in both,\nbecause what you're doing is you're, you're covering both tails. And if the market's up, it's going\nto magnify your right tail. The market's down. It would ideally, you know, if the market's\ndown as a dramatic move, you're going to create a positive return on the left tail. Right? So,\nadding it into your low risk sleeve, your treasury risk sleeve is going to give you some\nconvexity on both tails in a positive way. So, if that's your goal, if it's a,\nlisten, we like to build portfolios that are all weather. We have a expected return, expected\nrisk tolerance, and we can blend this in without corrupting our risk tolerance, and potentially\nadd some convexity to the positive return of the portfolio, then that's great. You know, if you\nhave more conviction on the direction of the market, then that will dictate, you know, say,\nyou're starting 50, 50 cube ball and cube bear, maybe 75, 25, you know, matching up with whatever\nyour directional conviction is. So, the beauty of having both from portfolio, he can toggle back\nand forth to match up with your risk tolerance or your expected market return. And that's,\nyou know, that's the, the reason behind both, right? Giving the ability to own both\ntoggle back and forth between the two or only one stand alone if you're portfolio requires that\nbased on your expected return of risk tolerance. Yeah, I mean, for for me,\npersonally, this is a perfect product for the types of strategies that we run, right? And,\nyou know, when we get in a risk off mode, we're sitting in treasuries, right? And we are going,\nand there's a lot of managers that manage a long, only active book like that, where you're,\nyou know, you're moving into treasuries, you're moving into money markets. To me,\nit makes a heck of a lot more sense to be rotating that exposure to cube ball. If you're wrong,\nwaiting for that momentum or those signals to change to start cutting that cube ball exposure\nand get along the other assets that you want to get along. I think some of the traditional buffers\ncould theoretically work for that, but some of the caps can sometimes interfere.\nBut this, I think, is a perfect product for any long, only active manager that\ntends to move into treasuries, money markets or short duration, when, you know, they have a negative\nview on the market. Yeah, I think you're spot on. And then when you talk about the buffery\nTS with the caps, for example, cube ball mixing it in with those buffery tps, it can uncaps the caps\nbuffer, right? Right. It's going to, it's going to have that effect to give you some\ncomplexity to the upside. So you can fill some gaps, right, with existing product using these two,\nand, um, but again, I think you're understanding of this pretty spot on. Yeah, well, Mike,\nI really appreciate you spending some time on the ending to a really unique and you're going to,\nyou've given me personally something to think about. But before I let you go, working people\nlearn more about true shares and your entire suite of products. As always, true dash shares.com is\nyour best source of information. Um, and you can reach us through that website if you want to contact\nanybody on our team. Uh, but it's chock full of information on all of our products, best place to start.\nYou and I know in the ETF business, you know, 60 or 70% of your investors never talk to you anyway. So\nright, we like to put as much information as we can at their fingertips and and, uh, once they get\ncomfortable with what they want to discuss, then they can reach out to us as necessary. But that's,\nthat's the place to start true dash shares.com. Well, again, Mike, thank you so much for spending\nsome time with me. I appreciate being here. Yeah, pleasure, Brad. Thank you.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}