{"id": "16543594", "transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology, they are run on and you want more customization and flexibility.\nAs well as a AI-driven model marketplace, UX wealth partners is your destination.\nOn top of that, they have institutional trading.\nSo if you are an ETF issuer or an SMA provider looking for outsourced institutional trading, UX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and make your practice more efficient.\nWelcome to Behind the ticker.\nToday we have on John Dovey from Astoria Advisors.\nHe's a frequent recurring guest on this show and today we're talking about their third listing GQQQQ\nor C calls that the G triple Q's or as I'm calling it the GQ's.\nWe'll work it out, you guys will figure out what you want to call it.\nBut anyways, it is the Astoria U.S. Quality Growth Kings ETF.\nThey're trying to find more of those quality names inside of growth, not just in the Nasdaq 100 in large cap growth.\nSo it can go into midcap.\nMakes an interesting case of finding some quality in value with their screening process.\nAnd might have a little bit of different names in flavor, ultimately trying to offer growth.\nAlso lower some risk because the multiple is going to be a little bit lower than what you're seeing on the Nasdaq.\nAnd ultimately the goal is to increase the sharp ratio as well.\nSo without further ado, please welcome Mr. John Dovey.\nHey John, welcome back to the show.\nGood to be here. Thank you, Brad.\nSo for those who haven't had a chance to listen to our prior episodes, we already won over ROE.\nWe won over PPI.\nCan you talk about your background and talk about what all Astoria does for clients?\nSure.\nSo we are an Asim Management Company.\nWe manage money for three verticals.\nOne is financial advisors.\nSecond is kind of corporations slash small institutions.\nAnd then the third vertical is ultra high network individuals.\nSo we have about 2 billion total assets on the management advisement.\nAnd our investment this one is macro and quantitative.\nAnd it's the intersection of those two verticals that really is kind of the sweetstress, sweet spot from our standpoint.\nThe firm has been operating since 2017.\nAnd we have about 10 employees in total.\nI've been watching your growth.\nSpecifically in those two ETFs that you launched first.\nSo congratulations on all your success.\nAnd you have recently launched a new ETF, which is why you're here.\nSo can you tell me, you know, what really inspired the creation of GQQQ?\nI'm going to call it GQs.\nAnd what gap in the market you're looking to fill there.\nAll right, cool.\nAnd I would say, you know, for the most part,\nreally we only launched products when there's a boy that we feel like we have in our portfolios.\nSo serving as this kind of outsourced chief investment officer firm,\nyou know, we would lean and rather go with a well established ETF and fund provider.\nBut, you know, the impetus really for, you know, our first ETF PPI was that we were unhappy with the inflation alternatives out there.\nAnd the impetus for RAU, we are equally weighted ETF is that, you know, we just want to please particularly weighted ETFs.\nAnd for G and we're calling it G triple Q, you know,\nwe just think that we're at point in the growth cycle where it's time for kind of more thoughtful,\nportfolio construction.\nYou know, growth investing obviously has done exceptionally well.\nBut a lot of the growth ETFs out there right now.\nAnd it's just your market cap weighted, you know,\nnot even a lot of thoughtful intelligence.\nAnd in the most extreme case, like, you know, the NASEC 100 index and all their ETFs.\nYou know, I mean, there's no quality filter at all.\nYou only have to be as like a non financial company at top 100.\nAnd we just think that, okay, we had to need an outside.\nWe wanted to work perpetually on the weight growth in our portfolios.\nWe worked perpetually on the weight growth.\nAnd we wanted to kind of close the gap.\nAnd, you know, when we're looking at the pure passive ETFs,\nyou know, a lot of them, you know, they're just so concentrated in a few stocks.\nAnd we just didn't want zero growth.\nWe want to kind of marry growth and quality investing.\nAnd that's what G triple Q does is kind of the intersection of growth and quality investing.\nSo I guess you, you kind of went over, you know, the core thesis,\nreally, you know, what is the overall objective here for long-term capital appreciation?\nLike, what are you trying, how are you trying to construct this portfolio in order to deliver kind of a differentiated,\nyou know, growth, you know, growth ETFs and what's just out there that's market cap weighted?\nSo the goal is to kind of, you know, first we started a growth universe,\nyou know, large cap and mid cap, you know, growth stocks.\nAnd then we really kind of apply our traditional quality bond screens of what we do in our activity,\neither other ETFs, TPI and ROE, and then we have SMAs that we run, like,\nquant factor SMAs that we've ever run since 2017.\nSo, you know, the goal really is to kind of give downside protection through this quality filter.\nYou know, qualities, one of these fact, that's, you know, very persistent pervasive robust.\nAnd it's the intersection of Marion, you know, both quality growth that we hope to be differentiated.\nYou know, we can go into some specific instances, like, you know, we had this one stock app loving\nthat when we launched it October 1st of 2023, the G-Trip of QETF.\nI mean, we launched with app in it.\nIt's up like 700% since October 1st.\nYou know, past performance on ticket future results.\nYou know, the Nazic index just added it in December.\nAnd, you know, basically it had a big run-up.\nSo, we hope that, you know, by investing in not just large cap, but also mid cap.\nWe can kind of get some momentum on the way up.\nSo, you know, by also applying this quality filter, you know, we can have a lower multiple.\nSo, the multiple on our phone is like 23.\nNazic is about 27.\nSo, you know, but I would say for people, you know, it's a long-term hold-in.\nIt's meant to kind of complement your growth ETFs.\nAnd we hope that we can give downside protection and have a higher shop ratio over varying, you know, cycles\nand over long periods of time.\nThat's kind of the goal.\nSo, you've mentioned a couple of times the quantitative analysis process.\nSo, how does that announce process shaped the selection of the different stocks in the ETF?\nYeah, so it's very rules-based.\nIt's systematic in nature.\nYou know, we start with a wide, you know, a universe of growth stocks.\nAnd then we apply some minimum market cap, liquidity.\nAnd then we look at, you know, various quant factors and codes and metrics.\nAnd, you know, really what we want to do is kind of get, you know, the ones that have, you know, the strongest ROA, ROIC.\nAnd, you know, had that such that it's higher quality nature within that growth universe compared to, like,\nthe standard pure growth data instruments that are available.\nSo, you mentioned also that you have some big cap exposure in here as well as some large cap exposure.\nSo, you know, why did you kind of choose to include some of this big cap exposure?\nWhat's the, do you have a preferred, you know, tilt between large cap and midcap?\nI know that the CTF is active in nature.\nSo, you know, you can, it's going to fluctuate.\nBut is there a, do you favor a certain allocation between large cap and midcap?\nAnd, you know, how do those really align with G chip or Qs?\nAnd it's, and it's investment objective.\nNo, that's a good question.\nI mean, if I, you know, take a step back, Brad, you know, there's so much\nApple formats in those large cap, you know, mag seven stocks.\nThey've had a tremendous run.\nYou know, some of the best businesses in the world.\nYou know, but we just think in the next cycle that's going to be a new\nmarket leaders.\nAnd we're not suggesting they won't come from tech.\nBut think tech should be, you know, the cornerstone of your portfolio.\nYeah, AI is going to definitely be a big team.\nAnd it's going to help, you know, not only just the tech stocks,\nbut it'll help energy companies and industrial companies.\nIt'll help financial companies and insurance companies.\nBut we, you know, we're of the paying that, you know, the mega cap tech stocks\nhave had a massive run.\nSo, you know, within the, the, once we pick the stocks, which are very quantitative in nature,\nI mean, even how we wait stocks, it's kind of like this modified market cap.\nExposure, um, which I predict that in the years come.\nYou're going to start seeing a lot of cap in next week products.\nAnd there's been already one file on out there.\nBut it is so massive these mag seven stocks.\nSo by going down the market range, you know,\nwe hope to find more stocks like app loving that are going to be the new market leaders,\nyou know, over time.\nSo I think it's really crucial that we cap some of the weight on the, on the, on the upside\nand then we go into, you know, um, not to sludge cap, but also make cap stocks.\nSo, you've mentioned tech a few times.\nSo does G triple Q's have other sector diversification in it,\nor is it mean, or is it pretty much just focused on on the tech sector,\nor are you, are there other sectors that you're playing in?\nAnd do you have any guardrails on that sector exposure, or you just leave it down to the process?\nOkay, so that we try and take the midpoint between spies and cues.\nAnd we want this thing to kind of, it's the goal.\nIt's not, you know, no guarantees and past, for instance, bigger future results.\nBut we are trying to, you know, kind of being between spies and cues,\nin terms of like sector weight, and then hence performance.\nAnd, you know, the impetus really for us to launch it is, like I said,\nis that because we're diversified investors,\nthat generally has meant that you've had to be on the weight tech,\nbecause, you know, tech has been expensive throughout this cycle.\nAnd, you know, we were just, we needed to kind of close our, our on the weight.\nAnd, um, so we wanted to, we just, we could not buy, let's say, the cues, right?\nBecause it's just tough for us to do that, because cues just,\nthere's no filter at all.\nAt least in the SEP in the seas, you have four quarters of net positive earnings,\nyou know, to be included in today's index.\nSo we needed something that kind of fit in between, like spies and cues,\nkind of, close our on the weight.\nSo our tech sector weight, you're going to be very similar to,\nI mean, it's going to be in between spies and cues.\nSo it's like 45% tech, 14% communication,\nand then communication services,\nand the continuous session is 13%.\nBut the difference would be that we may have stocks that are lower in market capital\ncompared to like spies and cues.\nBased on a sense to me.\nSo I was actually, I was, I had the, the pleasure of being on Schwab network\nthis morning, actually, after, well, I'm waiting to get on.\nThey did 30 minutes on how, you know, they're super excited.\nThis bull market is going to continue and then they had me on to come in\nand it's the volatility guy.\nSo, yeah.\nSo, you know, it was hard for me to follow that.\nBut anyways, the reason I say that is,\nyou would mention earlier as well,\nyou do, you have some risk management kind of baked into this ETF.\nSo what strategies, as this fund,\nusing to mitigate volatility and maybe protect investors,\nwhen things do get a little wonky.\nSo annual balance, which I think is good because, you know,\nif you like a stock, you should be able to hold it\nfor, like, a long period of time.\nBut the quankote is reviewed quarterly.\nSo the stock, you know, significantly,\nderanks, you know, we do have the ability to kind of replace it.\nAnd then, you know, there's been instances, you know,\nyou know, we're big set AI stocks have gone up a lot\nand then kind of fell down from grace.\nI think, you know, we have the ability to kind of tweak things\nif we see the quank factor rankings,\nyou know, you know, if you're going to fall in,\nwhereas, you know, image of staying on normal passive\nand that's for, like, a long period of time.\nThe example I always gave investors is, like,\nI think it was in the FXI.\nThere was a Chinese company that basically was, like,\ndoing fraudulent.\nAnd it was kept in the index forever.\nAnd they, this company stopped trading.\nAnd basically, you know, you kind of like,\nstraight if you were just, you know,\nlong this one Chinese ETF.\nYou know, where we are in the cycle.\nYou know, it's been a long bullmark here in the US,\nlong bullmarking in growth stocks.\nIt's just time for more thoughtful, you know,\nkind of smartbait at 2.0.\nAnd we don't sell it at a market as smartbaited,\nbut I think active management, you know,\nthere's a lot of flows into active ETFs.\nAnd when we talk to advisors about it, they're like,\nyeah, you know, the cues are really just\nculmination of seven stocks.\nAnd it's had a good run, but, you know,\nlook forward the next three to five years.\nYou know, probably we need something else\nbesides seven stocks that are going to like take\ngrowth investing to the next level.\nSo I would say, you know,\nannual balance ongoing factor,\nwant rank in, if something deranged,\nwe have the ability to kind of kick it out.\nBut we're not moving in in that stocks,\nand we're in the cash, you know,\nit's kind of protected.\nBut downside, you know,\nthese are companies that, you know,\npast all these quantum metrics\nfrom a good quality standpoint,\nthat we feel pretty comfortable kind of being,\nyou know, being long, so.\nSo, you know, we'll talk about,\nyou know, I want to kind of talk about this\nin terms of the difference between GQs\nand triple cues and, you know,\njust passive ETFs.\nSo, you know, you're obviously an active manager,\nsometimes active management gets, you know,\nput in good light,\nsometimes it gets put in bad light.\nHow does, you know, the active component of G triple cues\nenhance, like the potential performance over just,\nyou know, passively buying growth,\nyou know, buying an asset.\nGood question, you know,\nwhat I would say is that, you know,\nif you look at our core business,\nwhich is, you know, kind of dynamic asset allocation,\nyou know, pass performance on ticket of future results.\nBut in our state of goal,\nin our multi-ass portfolios is to get,\nlike, 150 basis points to 100 above bench.\nAnd, you know, we've had good returns and historically,\nand our SMAs.\nAnd even if you look at, like,\nPPI, the first ETF we launched,\nyou know, it's in the second percentile over the last three years\nat, like, 330 funds in our category.\nEven our other ETF, R-O-E,\nlast year was its first full count on the year,\nand it was in the 12 percentile out of, like, 1100 funds.\nSo, you know, our two ETFs right now,\nyou know, they're largely,\nthey're not dynamic, but they are active.\nAnd it's really just a powerful,\nquant code of, like,\nmaking sure that we look for stocks that fit the category.\nIn the case of PPI, it's inflation,\nit's the last real assets.\nR-O-E, it's equally way,\nG-trip-acute, it's about tech and growth.\nBut, you know, really pick in,\nand mine for the alpha and the beta,\nthat quality rank in,\nyou know, it is our true North.\nYou know, we've been doing it since 2017.\nYou know, so we just think that that is really kind of,\nhow we try and differentiate ourselves,\nrelative to, like, just buying, like,\na Russell-1 growth ETF,\nwhich is just going to be, like, seven stocks.\nSo, it's time to kind of, like,\nmodify some of these big cap tech weights,\nand, you know, kind of brief to gap\nfor the next three to five years.\nSo, you know, as you mentioned,\nyour other funds are also fairly new,\nand you guys have done a great job at,\nyou know, getting them out there,\ngetting some assets, and, you know,\nG-trip-acute is also a new fund.\nSo, just from your past experience,\nand then the type of strategy that G-trip-acute\nis running right now, like,\nwhat challenges and opportunities\ndo you anticipate here kind of in the early stages?\nYou know, in the first, you know,\ncall it year that this thing is alive,\nyou know, what challenges you expect to face\nand overcome, and what opportunities\nyou think are out there for you to go out there\nand raise assets like you've done in your first two?\nUm, so, you know,\nit's tough if you're going to kind of\ncompete with, like, three basis points,\nyou know, Schwab, Vanguard ETFs.\nUm, so, you know,\nwe don't even try and, like,\nif in advisors,\njust help out on only in three basis points,\nETFs, you know,\nthat's just an uphill bow,\nthat's just too difficult.\nUm, you know, what I would say\nis that, you know,\nwe have an existing franchise\nthat, you know,\nwe've run model portfolios\nand asset allocation,\nand it's a captive, you know,\nclient base, you know,\nfinancial advisors are very receptive\nto how we do portfolio management,\nso that generally pretty comfortable\nwith our investment approach.\nUm, you know,\nthe key is really getting about, you know,\n50 million,\nwhat to get to 50 million more people look at it.\nOnce you get past 100 million,\nyou have a much different audience,\nyou get 150,\nit's even bigger audience.\nSo you just got to be in it for the long run.\nUh, we produce a lot of content.\nUm, you know,\nwe put out a white paper,\nmy colleague,\nNick Serbone,\non G-TripleQ,\nand, you know,\nit's just,\nwe want to be thought leaders\nand it'll lead from content\nbecause, you know,\nthese aren't really thematic ETFs.\nIt's not like it's just going to kind of sell itself.\nUm,\nor trend on Twitter.\nLike, this is like,\nyou know,\nwe want to go deep in advisor\nand explain,\nokay, look, you know,\nwhere at this point,\nwhere, you know,\ntext docs have run up,\nyou know,\nover the last 15 years,\nuh,\nyou know,\nmaybe things are going to be different next\nthree or five years,\nand here's our approach,\nand here's the evidence.\nAnd when you combine\nquality,\ngrowth,\nand, you know,\nthat is a pretty powerful story.\nSo in our white paper,\nwe kind of show,\nyou know,\nat least just a standard,\nlike,\nMSCI quality index,\nand the nasic,\nyou know,\nindex,\nand if you kind of do like a 50-50 approach\nas an equality,\nyou know,\nyou would have done better than just any individual,\nnasic allocation or quality,\nallocation.\nSo,\nbeing too awful,\nyou know,\nas a tall leader\nis definitely\nan edge that we hope to have,\nand,\nyou just gotta get the word out there.\nSo,\nthe million dollar question,\nI always ask in,\nI know you guys do your own SMAs\nand in your,\noh,\noh,\noh,\nyou're a professional foreman,\nyou know,\nokay,\nyou know,\nyou're an unbiased advisor,\nthat's not using you for that.\nThey have an existing model portfolio that they run.\nThey don't want you to be a CIO,\nbut you're selling them on G tripal cues.\nHow would you advise that person to use,\nthis product in there already\ndiversified model portfolio?\nGood question.\nYou know,\nwe would say,\nyou know,\nit could be used as a compliment\nto your existing,\nyou know,\nspyQ,\nyou know,\nYou know, if taxes is something that you're able to kind of do, you know, take some profits.\nYou know, this, this fund is like price at 35 basis coins, so it's fairly low for like a\nsmall in the, ensure like us. So, you know, I would say, you know, let's, nobody pushes back\nwhen we say to them like look the mag 7. I mean, Goldman Sachs has a chart that shows like the\ntop 10 stocks in S&P and how it's changed over time. It's, it's literally at a underyear\nhighs, right? Last time was at the side was a great depression in 1928. You know, you show a\ntroll like that to a financial advisor and like, okay, maybe it's time to like take some profits,\nright? Take a third of it out. And the ones that don't take taxes or can't take taxes, I mean,\nagain, that's not really our audience. Our audiences, people that are like, they believe in using\nquality growth investing together, they believe that, okay, you know, cap the weights, so it's not\njust, you know, seven stocks that make up the entire basket and G-trip a cue. I mean, those are the\npeople that are like more open-minded to kind of evolve in the portfolio. Yeah, so, John, I really\nappreciate your time. I hope you keep launching funds because I'll just keep having you on. And,\nyou know, I get, I get calls from Frank, he's like, hey, we got a new fund, we need to get on.\nSo, whatever, Frank, shout out to Frank. But before I let you guys go, where can you find\nall the information about a story, where can you find all the information you have out there on\nG-trip abuse? Great, so thanks, Brad, and I'll relate that to Frank. Frank is in the meeting right now,\nso he was able to join this one, but I know that you and I did want with Frank.\nWhich, I think we, are we the first, uh, three-peat? Probably. Yeah, you're the, yeah, you're the first,\nthree-peat, and I got to get you like a T-shirt or something like regular on behind the ticker T-shirt.\nMaybe I'll give you one of the exchange. That would be fun. So, a story at advisors, ETFs.com,\nthat's the website for our ETFs, the story at advisors, ETFs.com, and then our, our SME website,\nlet's say, is just a story at advisors.com. So, two different websites, one is plugged into the other.\nIf you just want to store advisors.com, you'll, you'll see the relevant ETF info. All right,\ngreat, well, again, John, thanks so much. I'll sure I'll be running into you here soon. Thanks, Brad.\nReally appreciate it.\n"}
