{"id": "16570789", "transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology they are run on\nand you want more customization and flexibility as well as a AI driven model marketplace\nUX wealth partners is your destination. On top of that they have institutional trading.\nSo if you are an ETF issuer or an SMA provider looking for outsourced institutional trading\nUX wealth can also be your destination. So check out UXWP.com to find out all the ways UX wealth partners\ncan help grow and make your practice more efficient.\nWelcome to Behind the ticker. Today we have on Rob our know he is the founder of research affiliates.\nAnd we are very pleased to have him. He's got over 50 years of investment management experience,\nparticularly pioneering qualitative or quantitative excuse me, investment strategies and really coming up with index methodology\nfor a ton of different strategies. You are probably very familiar with but today we're talking in detail about the next\nor NIXT which is the research affiliates deletion ETF. But I let him do a better job explaining it than I will\nso without further ado, please welcome Mr. Rob our know.\nHey Rob, welcome to the show.\nIt's a privilege to be on it. Thank you.\nSo before we get started why don't you give everybody a bit about your background how you ended up founding research affiliates?\nSure. Well I've been in the money management business almost 50 years.\nI launched research affiliates back in 2002.\nI had long thought I ought to build an asset management firm for me not just for other companies.\nBut finally got around to doing it in 2002. I was running first quadrant at the time.\nI ran both of them in parallel for two years and then the business research affiliates began to demand my full attention so I moved on.\nAnd it's been a wonderful ride. The focus has been innovation.\nOur business model is not to run money but to create strategies and run them through others.\nSo Schwab and Vesko host a mother company around the world license our ideas and use them for their own strategies.\nSo we indirectly run 158 billion dollars.\nAnd it's fun creating ideas that resonate with the market to the tune of 158 billion.\nYeah, I can imagine.\nSo before we get into like all the specifics and all of the things that research affiliates does.\nI always like to ask any hobbies things like you like to do when you're not working or sitting behind the desk.\nEveryone needs a hobby. I collect fastest of their era motorcycles.\nI don't ride them anymore. I got to wake up a couple of years ago when I had an accident that I should never have had.\nIt's just sheer poor reflexes and poor instinct.\nBut I still collect them and I love vintage wine.\nI'm going to Angela's chef to Angela's wine dinner this evening.\nAnd I love travel.\nYeah.\nWell, I've always wanted a motorcycle but my wife is vehemently against it.\nAnd probably best given that I like to go fast on things that I don't own one.\nSad speed doesn't kill you. Other drivers do.\nYeah.\nMy rule of thumb is don't just pretend that other drivers can't see you.\nPretend that other drivers are out to get you.\nYeah.\nIt's good advice.\nSo let's talk broadly about research affiliates.\nLike you, you kind of brushed over.\nYou got a lot of different strategies.\nYou help a lot of different people with strategy development and ideas.\nSo can you kind of dive in to research affiliates?\nJust a little bit more.\nWhat do you guys, you know, what types of strategies are you producing?\nHow are they being used?\nI'm sure SMAs, mutual funds, ETFs alike.\nSo can you just walk me through the firm a little bit deeper?\nSure.\nAbsolutely.\nWe're best known for our work in global multi asset strategies.\nGlobal tech to class at allocation.\nWe run the PIMCO all asset product suite.\nAnd M4 developing quantitative equity strategies,\nnotably fundamental index on a million taxes over a hundred of our hundreds,\n56 billion.\nAnd the notion with fundamental index is quite simply why should we\nchoose stocks for our index based on how popular and expensive they are,\nwhich is what happens with cap waiting.\nAnd why should we wait stocks that way?\nWhy not wait them by how big they are in the consumer marketplace,\nhow big their business is.\nAnd if you do that, you have an anchor for contracting against the markets constantly changing opinions.\nPrice source, fundamentals don't.\nWe'll say thanks for the nice high price.\nWe'll trim it.\nPrice takes fundamentals don't.\nWe'll say thanks for the nice deep discount.\nWe'll top it up.\nAnd sure, this is a better company with better prospects.\nAnd this is a worse company with headwinds.\nBut it's already in the price.\nSo it doesn't help you.\nAnd out of that, we have approximately 75 billion in ETFs.\nIn Vesco, pro shares,\nSchwab, Schwab is the biggest relationship and pin cope.\nAnd that money is all tied to variance of fundamental index.\nGot it.\nSo when you talk about, I read a little bit about your background.\nSo when you're sourcing and looking for these types of opportunities,\ngiven the fact that you have a mathematics,\nand as well as a computer background,\nis a lot of this quantitative and nature that you're running.\nScreens, or do you have, have you developed internal proprietary things that help you make these types of decisions?\nWe built our own databases, our own data source.\nWe built analytic tools that help us parse through the data and gauge what works and what doesn't.\nOne of the things that we are obsessive about is to not data mine,\nbecause the quantum community is addicted to data mining.\nAnd if people think that if you are a quantitative investor,\nyou're stripping emotion out of the decision process, which you are,\nand you aren't chasing performance, which is bump.\nBecause if you build models that maximize historical back-test performance,\nall you're doing is maximizing historical back-test performance.\nAnd so we are very strict about showing to a Bayesian method,\nwhere you start with a Siri.\nYou use the data to test the Siri.\nAnd you don't use the data to tweak and improve the back-test.\nThat's easy, and it leads to products that are rubbish.\nWe use our common sense to think, if we wanted to make this strategy better,\nwhat might we do to make it better, and then we use the data to test that.\nSo we don't go wherever the data leads us.\nAnd the result is our strategies have had a tremendous record.\nIf you look at, oh, look at Schwab's FNDX,\nfundamental index relative to IShare's Russell 1000 value,\nIWD, the value added is relentless.\nThe fundamental index has a stark value tilt, but it has a rebalancing alpha,\nwhich a value cap-weighted value index doesn't have.\nYeah, I mean, two things off of that, right?\nIs when you're developing quantitative strategies, robustness is key,\nbut I'm starting to see just in my line of work,\nspecifically around a lot of these AI strategies,\nexactly what you've just talked about, is a back-test that j-curves,\nand you know in production that that's never going to be the case.\nAnd there's a lot of curve fitting and optimization going on.\nAnd we know over time that, you know, you might have a short window of alpha\nperformance, but that's likely not to be the case,\nspecifically for someone who's had a long track record,\nlike you guys ever.\nYeah, we've had the fundamental indexes now 20 years old.\nAnd it's performance relative to the market hinges on how value is doing.\nSo if value is doing well, we have a tailwind\nto values struggling, we have a headwind, but we beat value by enough\nthat our 20-year results are ahead of the broad market,\neven though value is 3,000 basis points behind the market.\nYeah, value has been tough.\nThat's fun.\nThat's fun.\nValue's been tough for anybody invested in values over the last\nG's 36 months, it seems.\nWell, and you can go back 15 years.\nIt's really since 2007 is when value peaked relative to growth\nand some of the 2020 is when it hit bottom.\nBut it's been bottom bouncing since then.\nRight now, it's not too far off of the 2020 lows\nin terms of the relative cheapness of value relative to growth.\nIf you look at price to book value, value was one third\nas expensive as growth in 2007.\nIt was one ninth as expensive as growth in 2020.\nNine to one ratio.\nThat means that the market was saying, these companies are going to grow\nninefold relative to these companies in the decades ahead.\nThat's a fall order.\nAnd right now we're eight and a half to one.\nSo value is incredibly cheap, which is something that I find very exciting.\nYeah.\nI actually just had Katherine LeGrawl.\nShe's from GMO.\nThey launched GMOV, which is their D-value ETF.\nShe's very excited about that prospect.\nAnd somebody like myself who runs a lot of equal wage strategies\nand include value.\nI would love to see a resurgence of value.\nYeah.\nYeah.\nAnd of course our new Nixon decks is very much a D-value index.\nAnd it's a beautiful example of using common sense\nto develop a theory and using data to test the theory.\nSo one of the things that we've noticed with fundamental index\nis it wins because it has a rebalancing discipline.\nAnd it wins because it doesn't add stocks just because they're\nfrothy and expensive, right?\nWhich is a really key factor.\nIf you look at cap-weighted indexes for every Tesla or Nvidia\nthat gets added to an index, there's a dozen or more companies\nthat are hot bubble stocks popular, beloved, and then go on to create.\nAnd so the net effect is you're adding frothy stocks.\nA few of them go on to great success.\nAnd so they pull you down.\nAnd with fundamental index, you're choosing stocks based on how big\ntheir business is.\nYou're waiting until the Nvidia is big enough to be a successful business.\nAnd you're not dropping a dillard's department store just because it's\nhaving a terrible couple of years.\nAnd the result is you have lower turnover.\nRight.\nAnd that turnover is more sensible.\nAnd more effective.\nWell, one side of that is adding frothy stocks is bad for you.\nAnother side of it is dropping temporarily on love stocks\nis firmful to your wealth.\nAnd so the whole next concept is built on a foundation of,\nwell, why do we drop stocks at exactly the wrong time\nwhen they're deeply out of favor and they're cheap?\nAnd so that's been wonderful fun to put that strategy together.\nWell, you've walked me right into what we really are here to talk\nabout today, which is the next ETF, which is the research affiliates\ndeletions ETF.\nNext, nice ticker by the way.\nI don't know if you came up with that or the guys over it,\nETF architected, but you guys specifically created the index,\nETF architect launched the ETF.\nSo really what inspired the creation of the next index and what\nmarket inefficiencies is it really seeking to exploit?\nIt's seeking to exploit a deep value.\nIt's seeking to exploit the fact that stocks get\nflabbered down harder when they get dropped from an index\nand pushed it even deeper value.\nIt exploits the fact that in order to get into an index,\na company has to have had some measure of meaningful success.\nSo it's cherry picking the deep value names for those who have\nshown that they can be successful.\nAnd I like to joke that companies that get kicked out of index\nas some of them go on to achieve great failure.\nBut you only need a few to snap back and show their mell.\nA wonderful example is Lumen.\nLumen technologies was kicked out of the S&P in March of\n24, 23, and kicked out of the Russell Index in June of\n2023.\nAnd this past year, it was up over 500%.\nWhy was it up over 500%.\nBecause Meta cut a deal with them to help Meta get\nup the learning curve on Lumen's category of AI.\nSo Lumen has a niche within AI where they're the leading expert\nand Meta cut a deal with them to help Meta get up that curve.\nAnd so stocks up 500% it's almost certain to be re-added\nto the Russell Index in June.\nAnd that happens a lot.\nI mentioned Dillard's earlier, wonderfully fun little company.\nIt's a small department store chain.\nIt's been a member of the Russell 1000.\nFour times in the last 30 years it's been kicked out four times.\nSo business is good.\nStock rises.\nIt gets onto the index.\nBusiness hits a downturn.\nStock creators.\nIt gets kicked out by high sell low.\nBuy high sell low.\nBuy four times.\nYeah.\nLast time it was kicked out was 2017.\nHow's it done since then?\nIt's up over 500% and if my arithmetic is correct,\nit's going to be added to the Russell 1000 assist time in June of this year.\nWell, that's why buy high and sell low again and again\nwhen the size of the business was moving up and down a little bit\nand the size of the market cap was plunging and crashing.\nWhy not just say, OK, it's a big enough business to matter.\nWe're adding it to our index.\nAnd oh, it's out of favor.\nIt's cheap.\nBusiness is still pretty big.\nIt's struggling, but it's pretty big.\nThat's not kick it out yet.\nAnd so billboards been in nonstop that whole time.\nSo it's interesting when you have a,\nso let's talk about the index construction process on both sides for addition and\ndeletion.\nSo how are stocks selected after they are removed from a major index?\nBut if you, if you just look at this, you know,\ndealers example that you just laid out for us,\nis it going to be removed from your index when it's added back?\nOr do you let that positive news run for a little bit?\nCan you just talk about the addition and deletion?\nThe way we construct the index is straightforward.\nFirstly, we have to be respectful of S&P and Russell's intellectual property.\nSo they would want to charge a not in consequential sum for us to use their specific deletions.\nSo what we've done is to create a top 500 by market cap and a top 1000 by market cap.\nAnd companies that fall more than 10% out of that range, we view those installations.\nNow it turns out that deletions from a mechanically constructed 500 and 1000\nworks just as well as deletions from the S&P and Russell.\nSo it's not that S&P and Russell are doing anything wrong.\nRight?\nIt's that the mere process of adding a stock just because it's market cap is sort,\ndeleting a stock just because it's market cap is tanked.\nIs that process in and of itself is the problem.\nAnd so what we do is when a stock falls out of the top 50 or out of the top 1100,\nit's on our deletions list.\nNow what we've noticed is that deletions outperform the market by an average of 7% per year,\nthe first couple of years tapering off to about 3% after 5 years,\ntotal of 28% 2800 basis points about performance over the 5 years after deletion.\nThat's marvelous.\nSo you buy the deletion, but we don't want value traps.\nSo the first thing we do with deletion is filter it on quality metrics.\nThere's many quality metrics, the academic community is obsessed with profitability as the sole\ncriteria.\nThat's kind of narrow.\nWhat about debt equity ratios?\nWhat about coverage ratios?\nWe use multiple measures.\nFilter out the 20% worst.\nThe ones that are likely to be valued traps.\nAnd then buy those stocks and hold them for 5 years.\nIf they're re-added to the index, then they're pulled out of ours.\nAnd so we've tested the idea.\nOnce again, we use data to test an idea not to create the idea.\nAnd going back to 1991, over from 91 to 2023,\nwe find that stocks deleted from SNP or Russell held for 5 years would have given you 74 times your money.\nWell, 74 times your money in 32 years is not bad.\nNo.\nAnd what if you just put your money in the SNP?\nYou would have had a little under 30 times your money.\nThat's wonderful.\nBut it's not as good as 74 times your money.\nAnd so we decided, this is fun.\nThis is a niche strategy that's built off a foundation of everything we've learned about\nproblems with index construction.\nAnd one of those problems, one of those Achilles heels, is kicking out stocks at the wrong time\njust when they're facing their worst news and most deeply undervalued.\nOn average, stocks kicked out at half the market multiple stocks that are added or added at twice the market multiple.\nWell, neither of those makes a lot of sense.\nAnd the niche side of it, the deletion side of it,\nis particularly fun and interesting to me now because small cap is out of favor and cheap.\nValue is out of favor and cheap.\nThis is a deep value strategy.\nThe largest holding in it is Lumen, which was a deep value strategy until meta signed up with them.\nSo you're making a good case here.\nI'm going to ask one more question about the index as a whole.\nThen I want to speak a little bit more broadly about some of the things you've seen in this index.\nSo the fund rebounds is annually.\nI'm sure you guys did the research.\nWhy do you believe that frequency is optimal compared to maybe a more active, you know, quarterly type rebounds?\nIt turns out it doesn't much matter when you rebounds or how frequently.\nNow, just as a nuance, this is a strategy which owns 150 small cap value stocks.\nAnd the liquidity on those is not brilliant.\nI can confidently predict that if this ETF attracts a billion dollars in assets,\nwe're going to start looking at moving accordingly.\nSo it just makes sense to be responsive to the issues we'd face our implementers.\nThe ETF architect would face in implementing the strategy as the strategy grows.\nBut at its current size, the ETF has attracted just under 40 million in its first few months.\nThat's pretty cool.\nEspecially without marketing teams focused on wholesalers going around telling people about it.\nWe don't have any wholesalers nor does ETF architect.\nBut for the strategy at its current size, the liquidity is not an issue.\nAnd we did test rebalancing quarterly.\nIt same returns.\nIt deteriorates if you rebalance less frequently than annually.\nBut it deteriorates actually only modestly.\nThe advantage of more frequent rebalancing is liquidity and capacity.\nYou would roughly double the capacity by moving to quarterly.\nAnd we estimate the capacity of the strategy at about 5 billion.\nAnd so if you wanted it to be 10 billion, we'd do it quarterly.\nIt will be nice if we ever have that problem.\nThat's what I was going to say.\nSo that'll be a good problem to have.\nGotta roll a few hundred fold before we're there.\nYeah.\nWell, you never know.\nAre there any particular sectors or industries where deleted stocks have shown like a stronger mean\ntendency and I also want to ask that question a different way.\nAre there certain sectors that have been or industries that have been subject to more deletions?\nAnd do you have any kind of industry or sector constraints on the strategy?\nSo you maybe don't get in one area a little bit too heavy.\nThe best way for us to constrain sectors is to hold the stock for five years because sectors come in and out of favor.\nWhat we've noticed is that the performance of deletions goes up when there are more deletions.\nSo when the indexes are relatively stable from year to year, the value at is nice.\nWhen you get to a burst of deletions,\nS&P or a top 500 index would have been busy chasing the dot com stocks in 99 and 2000 and kicking out basic industries and energy stocks.\nAnd then two years later would have been doing the opposite.\nDuring bursts of heightened turnover, the performance goes through the roof.\nAnd so that's one of the things that's interesting to watch for.\nThere was a burst of turnover in both Russell and S&P in 2009.\nGlobal financial prices.\nAnd there were industry concentrations, financial services, more were being kicked out and consumer discretionary.\nAnd a consumer of non-derables, I should say.\nAnd so we don't constrain the sectors at all, but in one year there may be much more of a particular sector getting kicked out.\nAnd then the next year something totally different.\nAnd so by holding for five years you get broad diversification.\nI actually started running this strategy in my personal account back in 2018 using actual S&P deletions.\nAnd holding them for a year.\nAnd I quickly discovered, okay, sometimes I have eight stocks in the portfolio.\nAnd sometimes I have 20.\nIt's not very diversified.\nIt's not scalable.\nBut the performance was lovely.\nI was having great fun with it.\nAnd I realized that's when we went back and tested.\nOkay, how long does they out performance last?\nFive years give or take.\nIt tapered off 7% as 6% 5% 4% 3% and who needs to stick around for two.\nAnd by holding it five years you quintuple the number of stocks in the index.\nBy using top 500 and top 1000 deletions.\nYou triple the number relative to just say using S&P deletions.\nSo you could create an ETF that strictly focused on S&P deletions.\nPay S&P the licensing fee for access to that, which would not be an inexpensive licensing fee.\nAnd have a narrow, undiversified, highly volatile portfolio.\nOr you can construct something that has 150 stocks in it.\nAnd equal weights once a year.\nLumin is now a 2% holding because equal weighting in June turns into a 2% position now.\nRight.\nI was just looking at that.\nYou, again, walked right into the next question.\nSo at rebalance, you're going to do everything equal weight.\nYou're not going to take an opinion.\nYou're going to let things run.\nSo at next rebalance, you're going to pull Lumin back down and line.\nYou're just get everything back on the same level playing field.\nWe would pull it back down unless it's re-added to the top 1000, which it will be.\nSo Lumin will turn out to be one of our short term one year holdings.\nGot it.\nSo when looking at an advisor, you do a lot of model portfolio work.\nSo looking at an advisor that's got, you know, a diversified,\nrep is PM model with the running fairly strategic.\nWhere are you advising?\nThey use this strategy as a side card of their existing market capweight exposure.\nOr a, how do you say, Dave Nadeg, when I talk to him about this, he said,\nOh, this is just a completion strategy.\nIt fills in what the indexes don't have anymore.\nAnd it does it in a clever way that,\num, uh, buys the companies that are no longer in the index that have proven\nthat they know how to run a big business.\nUm, and so one way to think about it is as a completion strategy.\nI'd never advocate somebody putting 50% of their money into this.\nIt's a niche strategy.\nBut if you want small cap value,\nthis is a really cool way to do it.\nAnd so if you're putting money into IWM, Russell 2000 value,\num, uh, buying an ETF that's tied to the next index is a really interesting alternative.\nUm, as an index provider,\nI'm not allowed to specifically recommend an ETF,\nbut I can recommend the index.\nYeah, or the compliance people will be listening.\nWell, Rob, this has been, uh, you've been a wealth of knowledge.\nAnd I really appreciate your time.\nI think the strategy's really, really cool.\nI'm going to keep my eyeballs on it.\nIt's going to go on my watch list.\nBut before I let you go,\nworking people learn about research affiliates,\nall the work that you do and get some more information on the next index.\nWell, firstly, I'd strongly suggest going to our website,\ndot com, or if you don't want to type that many letters,\nRALC dot com.\nThey both take you to the same place.\nUm, we have, uh,\nwe have an interactive tool that helps people look at long-term future returns for asset classes.\nIt's called asset allocation interactive.\nUm, it's, it gets about a half million,\nuh, new views every year.\nSo it's gone viral by the standards of our industry.\nRight.\nUh, the, uh, next index is written up in there.\nThe white paper that describes the next index is in there.\nUh, it's called next, the upside of getting dumped.\nUh, the point of the paper is, um,\nwe've all had the experience of getting dumped, or at least most of us have.\nProbably not you, but, uh,\nanyway, you, you can either, uh,\nwallow-inself pity for life,\nor you can play your socks up and, uh,\nuh, take some learnings from the experience and move on.\nAnd a company that gets next,\ncan either wallow-inself pity and flounder and go on to great failure,\nor can decide, okay,\nwe need to get our act together and some of them do.\nAnd if they're,\ncheap, if they're half the valuation multiple of the market,\nthen just doing an average job means the price doubles.\nRight.\nThat's cool.\nWell, also I was on your website as well,\nand there's, you, you publish a lot on there.\nSo if you're looking for, if you're looking for articles on it.\nYeah, if you're looking for insights and things,\nyou know,\nto stir the brain a little bit,\nI would definitely go and check the website.\nBut again, Rob,\nthank you so much for your time.\nThanks for being here with me today.\nThanks for the invitation.\nThis has been great fun.\n"}
