{"id": "16627106", "transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a Tampa user and you're sick and tired of the legacy technology, they are run on and you want more customization and flexibility.\nAs well as a AI-driven model marketplace, UX wealth partners is your destination.\nOn top of that, they have institutional trading.\nSo if you are an ETF issuer or an SMA provider looking for outsourced institutional trading,\nUX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and make your practice more efficient.\nWelcome to Behind the ticker.\nToday we have on Emma Harper.\nShe is from Sage Advisory and we are talking about their 2024 annual ETF stewardship report.\nThey release it every year.\nThey do a survey about what is best practice in the ETF space.\nIt's part of their own research that they do for their own clients when doing due diligence on funds.\nSo we talk about a variety of different things about different topics.\nSo without further ado, please welcome Miss Emma Harper.\nHey Emma, welcome to the show.\nHi, thanks for having me glad to be here today.\nSo before we get started, I want to give everybody a little bit about your background and how you eventually ended up over at Sage Advisory.\nSure, so I went back to school after having career in actually a different world.\nIt was more retail management.\nAnd I decided to go back to school because I loved the financial aspects of the business and everything.\nAnd so I went and bought my MBA and focused in finance and then wound funding a job with a few.\nAnd I have been focused on research and sage.\nSo all things research on things like ETFs I were chatting about today to responsible investment, sustainable strategies.\nSo it's been really interesting to see kind of the growth of all these different areas and be able to learn about all these different ETF providers.\nAnd there are their stewardship practices is going to be focused for us and what we're chatting about today.\nSo it's been it's been a journey and it's been great to learn.\nYeah, well, I reviewed obviously we're going to talk about that stewardship report and it was a great piece.\nAnd but before we do that, I always like before we get into the nitty gritty any hobbies.\nWhat do you like to do when you're not behind the desk?\nAnd you know, I like to play with my 17th and gold son is active and wild and keeps me going and running after him at all times.\nSo I like to do anything that he wants to do go outside play or go for long walks with our dog or ride.\nHe's learning to ride bikes now a little little mini bike so and things like that.\nYeah, that's 17 month area 17 to like 24 months is the they're starting to get active.\nThey want to climb on everything you don't hurt themselves.\nIt is probably the most anxiety inducing time of parenthood and you're right in the middle of it.\nI'm running after him constantly all he's trying to do is find ways to to injure himself.\nSo yeah well my son is in three and he's starting to do front flips couch so you know it doesn't get any better, but oh my goodness you know it is what it is.\nSo yeah and also like sage advisory and if you guys do a ton of research I was on your website you have a lot.\nI think pieces what else do you do to help clients is it a research based firm you guys manage money like what all the sage advisory do to help clients and people who work you guys work with.\nYeah, so we manage money for a number of different clients that institutional as well as smaller clients as well.\nSo we are on a number of potful arms and we're able to be accessed for clients that are not in the institutional space and then we also have institutional relationships I believe we're about 20 billion in assets under management now.\nSo you know we think it's it's important to keep abreast of all of the changes in the industry what's going on and so our research powerhouse I would say is then you know we keep going and we keep thinking about what are the latest trends what's going on what's going to influence you know investments overall.\nAnd it's important for us to do that to be the best stewards of our clients assets so and that's where our research efforts really come into play.\nYeah, so I mean for people who are long time listeners in the show we've talked you'll be I mean you'll be episode 75 so we do on doing this for a while we've talked to I don't know of those 75 70 70 of them were probably ETF providers.\nThe rest are you know white labelers or attorneys or accountant so it's going to be an interesting change of pace and I think talking about the stewardship report is important and I think there was a lot like I said a lot of really great information in it so.\nBefore we get into some of the details of the report and some of the findings why don't you just explain overall the type of information this report is going to give somebody when they when they go in and find it and review it.\nSure, so this report looks over basically what are the stewardship practices my research stewardship we're looking at.\nWhat are the voting practices the engagement practices these different ETF providers and or in these ETF providers practices and how are they voting on.\nAll kinds of decisions and and how are they engaging with companies are they chatting with companies about issues that they are concerned about in you know what the companies doing in the operations or strategy or things about nature so we're actually looking at.\nWhat is the focus of these different providers how are they doing it and then who's doing it so we look at their stewardship teams.\nAnd you know are they're dedicated people that are doing this day and day out I mean there's extensive amount of stewardship obligations when your ETF provider given how many companies you're investing in one time.\nAnd then we're looking at other issues like climate related issues since that's been top of mind for a lot of people in the last several years and you know do they look at things like climate risks how are they incorporating that are they incorporating it in the stewardship practices if so how we're looking at things like DNA that's been top of mind for people.\nYou know from a company operations perspective internally and how do you look at that are you know what are your focuses on that in your own operations and then governance so how are you governed right so we focus a lot on.\nYou know company governments corporate governments and investments that we're looking at but turning it around to the actual providers themselves how are they different what are their.\npolicies on things like corporate and political lobbying those kind of things are they transparent on that so we're just trying to kind of tear back the onion or peel back the onion and look at providers from all these different aspects to understand you know what is going on from the actual stewardship activities to how these ETF providers are actually governed and then you know it allows us to understand.\nmoney as being you know utilized to influence or not influence corporate behavior and well it's we comment upon us since we are users of ETFs.\nFor our clients assets to understand all these things to be the best for our clients so that is kind of where it all came from is we need to know what's going on underneath the hood.\nAnd because we as ETF holders are giving up our ownership rights to ETF providers so we want to be sure that we're comfortable with how those ownership rights are being handled and that we're comfortable investing our client dollars in the ETF.\nYeah, it makes a lot of sense to me. I'm sure this has to do with a lot of the you know bigger providers as well that have a lot of sway and influence. We're going to talk about that but going through your 2024 report.\nWhat are some of the most significant trends you observe this year compared to maybe previous years.\nYeah, so we've been doing this for six years and so we've definitely seen a lot of changes over that time and you know in the first couple of years.\nWe had fewer questions it was more of a nascent kind of you know questions set basically just asking basic do you have voting principles do you engage those kind of things and over time we're able to expand the questions that learn more.\nAnd providers were becoming more aware that investors were wanting to give this or wanting to get this kind of information understand this kind of information so they were getting better at giving more information on what they're doing.\nAnd so we saw this kind of upward trend and ability to understand.\nAnd then we saw in about 2022 where there was a really cool back in the types of language even used to describe processes became much more legal in nature and in tonality in terms of what they were willing to say they were doing are not doing.\nWhether there was influence exerted on company management or not.\nAnd so we really kind of attribute that to increased caution around things like regulatory or political backlash that kind of thing so.\nIt's something that we've seen over the last couple years I continue to see in terms of what providers are willing to say or they do or don't do in terms of stewardship practices.\nWe've also noticed a shift towards things like direct client driven proxy voting or pass through proxy voting.\nAnd that has really been more in the larger provider ETF provider zone in terms of who's actually doing that, but there are some smaller ones saying that they're thinking about the topic or kind of taking it in as far as maybe they're wanting to potentially thinking.\nI mean for their clients and I know the larger ones are also rolling it out or trying to roll it out to more and more ETF investors for us that trend we've been watching really carefully because it's kind of been.\nWe might talk about it later, but more of a double edged sword for us right as the potential to let investors actually vote with their principles in mind but also has a potential to lead in the reduction.\nI have the depth of stewardship services provided by these ETF providers so yeah those are some.\nWell I mean over just more recently right we've seen so many active ETFs being filed compared to what the industry previously was was mostly just passive so can you elaborate kind of on the findings regarding that growing divide between active and passive ETF managers and terms and how to their steward.\nStewart stewardship practices maybe differ.\nSure so we actually did this analysis this year because of some responses that we've gotten previous years.\nIn that we send it out to a wide net of ETF providers and then we'll get responses back in terms of oh we want to participate or we don't want to participate because X.\nAnd in this last year or two we've gotten some providers actually respond back to us and say you know we don't want to participate because we are passive managers so you know we don't really have any active ownership practices and so that was an interesting kind of like.\nA comment of why some or the fact that some providers that are more possibly managed style versus actively managed style.\nThere actually might be a difference in stewardship practices and what we found was actually a pretty good gap in stewardship practices between those that were more.\nWhat's active management versus passive management with the active managers generally outperforming the passive managers in terms of stewardship practices basically.\nThe largest factors affecting the disparity were the absence of engagement activities overall at passive managers and then also the lack of a dedicated stewardship team at some of the passive.\nSo you know the fact that they don't at all do any sort of engagement or had any stewardship team that's where that.\nPatzen's developed between the two.\nAnd we noticed that passive managers were more likely to rely on things like external proxy voting advisors your I assessor glass Lewis and potentially show less independence and the decisions.\nSo this is a broad stroke, so there are some passive managers obviously that that have a dedicated team and gauge they're you know focused on it.\nBut as a broad stroke we did see a difference in active versus passive managers.\nSo when I was kind of going to the report to as a saw kind of the highlighted concern about concentration of voting power among a few large providers we only hear they are your band guardian partner.\nYeah, you know what are what are the risk for investors there and how should they be evaluating kind of the stewardship quality of those big providers.\nSure, so I think the role of stewardship in the industry has become a differentiator.\nAnd for ETF providers, as you're saying, I mean there's huge amount of influence trillions of dollars under management and 2024 ETF saw global inflows of 1.8 trillion US dollars.\nI mean it is growing.\nAnd so the concentration of voting power among few large ETF providers raises concerns about the alignment of their voting and stewardship practices with the interests of individual investors because they do have such a large influence on things like.\nAnd voting matters that shape outcomes on proxy voting decisions, you know whether these decisions are binding or advisory.\nThere's still influence exerted.\nAnd so if you know ETF providers don't exercise their stewardship responsibilities diligently we think there's a risk in harming long term value and exacerbating broader market risks like corporate governance failures or.\nAnd it grants to other researchers like really risks and from our data.\nActually the larger managers are far more likely to support management than vote against management and through self reported stats we found that large managers on average reported supporting management about 91% of the time versus media managers or small managers the groups that we have reporting more 81 82% of the time.\nSo we think it's you know investors really need to evaluate whether their ETF providers are taking these responsibilities seriously.\nAnd our prioritizing or should prioritize those that demonstrate a commitment to transparent stewardship activities, transparent stewardship practices.\nAnd especially with those investors that are more sustainable focused.\nAnd you know support levels of a dropping for significant shareholder resolutions and even are remotely related to E&S issues.\nAnd so it's more important than for those who are wanting to.\nAnd way to really be diligent and understanding support levels at these types of resolutions for different.\nWell the other thing the report showed to is kind of a decline in transparency as you just mentioned.\nYou know from some of these providers what factors do you think are contributing to this and how can we as investors kind of push for more transparency.\nSo we've noticed it among some ETF providers.\nNow it's not all.\nBut it's definitely a worrying trend that at least some of them are having this decline in transparency.\nWe attribute it to this increased legal and political scrutiny.\nAnd it's really led to this more cautious approach in publicly available information about their stewardship practices.\nAnd so you know in 2024 as I said, we we I'm interested in a support for things in the environmental proposals fall below social proposals for the first time.\nAccording to Morningstar, it's likely due to scrutiny over asset managers net zero commitments, which I think is fascinating.\nSo I think it's really you know investors need to continue to push for greater transparency.\nAnd demand regular publication of stewardship public commitments and stewardship reports and also demand easily deciphered proxy voting records.\nAnd you know if you have done any sort of analysis of proxy voting, you'll know that going through every decision and trying to understand general trends can be really tough because they're looking at every decision for every vote for every fund.\nAnd so actually putting that together is going to challenge now some of the providers have gotten better in providing dashboards to understand voting behavior, but they're still worth to be done in terms of aggregating what general trends are and what their votes are generally on different topics.\nAnd so it's more important than ever to understand what your manager's doing and doing in terms of their voting and their engagement and evaluating if it's an alignment with their expectations of how their assets are being managed and should be managed.\nSo you've mentioned climate and sustainability issues a few times.\nSo related proposals have seen kind of like fluctuating support.\nI mean, ESG was really hot.\nI can remember back like 17, 18, 19, 20 and it seemed to.\n21, too, that was the biggest year.\nYeah, 21 and it seemed to kind of fizzle out a little bit.\n20 to what key insights did you know this particular survey uncovered regarding ETF providers stance on sustainability.\nShort, so for us, we want to understand basically overall how providers are operating right so we're looking at stewardship practices in general voting engagement on all topics not just ENS related but since ENS was such a big topic and such a big explosion and then it kind of fizzled.\nRight, we wanted we wanted want to make sure we understand what's happened in practices with that as well as overall so that's why we we focus on both and you know overall search practices as well as ENS practices to understand.\nAnd so you know survey shows that most ETF providers have guiding principles on climate issues and demonstrate how these principles or issues are integrated into their investment process.\nBut some managers really express caution when discussing discussing their voting support for climate change initiatives or climate climate disclosure.\nAnd so oftentimes the reference poorly designed or overly detailed shareholder proposals as a reason for lack of support.\nBut you know having a significant fall in support for environmental proposals this year even below social proposals was an interesting binding.\nIn from our data 90% of providers have climate principles but only 67% cited in inclination to vote in favor of things like climate disclosure.\nAnd which was really interesting too because that our smaller providers were more likely to have robust climate principles and site support for things like climate disclosure.\nAnd we found that many in that smaller peer group actually have dedicated funds and teams focusing on climate related issues so that's why that kind of happened.\nAnd also another trend we're seeing is a growing emphasis on things like biodiversity.\nAlthough it's still emerging area it's an area that I think providers have identified as client interest.\nThere might be client interest behind that and so that's another trend we're seeing in that climate area.\nSo like the million dollar question that advisors or investors are always asking is like how do you find how do ETF providers find that balance between.\nYou know broader social environmental or stewardship priorities versus delivering the best financial performance and so when you're looking at that or you're analyzing that or researching that you know how how would you recommend kind of these ETF providers balance those two things.\nOkay, so this is a this is an interesting question because like ETF providers and all fiduciaries must prioritize the long-term financial interest of their clients right.\nAnd it's been thoroughly assessing all material financial risks that may affect a given company.\nAnd these in areas represent potential sources for companies risks for companies within ETF portfolio so all things are analyzed right to to make sure that they are safeguarding the long-term financial interest of their clients that's number one.\nAnd so just kind of wanted to to put that up here.\nAnd but you know as far as products and there are products that have a very specific focus on a particular E&S issue where you can get more of that focus on maybe a particular E goal or at school.\nAnd that's something that we've seen as a creation of more niche products aimed at very specific issues like climate transition or clean tech or even kind of nuclear focused things.\nSMR focus things.\nAnd so they have products that are catering to those investors looking for ETFs that align with their particular priorities.\nBut overall as fiduciaries they have to prioritize the long-term financial interest of their clients.\nI would agree with that.\nEngagement with portfolio companies I think is probably one of the key elements of stewardship.\nWhat differences do you notice in engagement strategies among different ETF providers and even by size.\nSure.\nSo I would say you can try to do some on ETF providers very right some don't even engage right so we're talking about that passive group where they just.\nThey just don't engage at all that's not part of their strategy that's not something they do so that's one group.\nAnd and then you have another group that are really focused on engaging really have a focus on topic talking with company management.\nHaving metrics and targets for success for their conversations.\nThey have a concern they talk with company management they have metrics lined up of you know things that they want to.\nSo achieve and their discussions you know actual metrics that they want to hit as far as.\nWhat the goals are for the changes they're looking to see from company management etc.\nAnd then you have some that are taking more cautious approach and focusing on information seeking engagements with minimal suggestions on improving company practices.\nSo some remain consistent with their engagement practices and highlighting the long term value gain from sustained positive dialogues with metrics and targets and then others have really gone back and just focus on more information seeking.\nYou know also we've seen this idea of.\nClient driven engagement being put out there and basically saying they're holding separate sessions or joint sessions.\nBut basically saying you know this engagement priority is for this subset of clients focused on this particular issue doesn't represent the broader.\nEngagement priorities of the firm but we have a particular client set that wants to engage on this and so we are engaging on this.\nWe think that has potential for maybe some confusion in terms of what's the priority or not the priority.\nFor engaging companies and you know what they should be focusing or not focusing on or not and so we're we're watching that one.\nDefinitely very closely to see you know what the.\nWhat that will actually look like in practice and so some trends but I would say those are the main differences.\nSure so you've gone through you know all the data you've seen the trends over the last handful of years.\nYou know what are the major improvements you would like to see overall from ETF providers in terms of you know their stewardship disclosures and practices.\nYeah so there's still room for improvement in transparency particularly right now we're such a.\nA time of flux things like stewardship things like collaborative engagement.\nThat's been a lot of flex this last year.\nI've been voting stats on things like politically sensitive topics and things like that so I would say investors have become increasingly interested in knowing.\nWhether ETF providers are consistently voting an alignment with the principles and they publicly endorse.\nIf they are engaging meaningfully with companies or you know what that actually looks like and and seeking transparency on these different activities.\nSo we feel that improvements in transparency improvements and understanding voting records making them easy to understand and decipher.\nImprovements in these areas would help build trust and ensure that ETF providers are taking their stewardship responsibility seriously but also ensuring that investors can understand what's going on easily.\nIt isn't enough to have your form mpx you know providers should be making their stewardship behavior easier to understand so investors can make the most informed decisions on how and who they want to investors their dollars with I mean simply put it back.\nSo those types of improvements kind of similar to what you think will be key areas of focus for ETF stewardship in the coming years like.\nTo those to those two things align or do advisor or I'm sorry do providers maybe have a different focus than what where you hope improvement will come from.\nI think there is going to be continued push towards things like accountability and transparency.\nI think whether providers want to or not I think there will be continued push right and I think key areas of focus for ETF stewardship and their teams will be on things like corporate governments which has been a big part but continues to make it be a big part right so it's.\nIt's less politically contentious maybe than being asked but it you know governance is still going to be a focus and and also things that are newer to the scene like part official intelligence and how that could influence portfolio company operations things like cyber security.\nAll these kind of emerging topics that are becoming really much more important are going to be you know focus areas for ETF stewardship I think going forward.\nAnd also I think regulatory and political pressures will continue to shape stewardship practices and an ETF providers are going to be mindful of.\nCurrent regulatory and political landscape and they're going to you know have to navigate any changes on that front but I think overall transparency accountability are still going to be.\nBig and important for ETF providers.\nWell Emma I thank you so much for your time the report is you know very informative and before I let you go where can people find this report and also learn more information about sage advisory.\nYeah so it can look us up online sage advisory and the sage advisory.com and you know our research is available on the website you can find this report on the website under our research in China and we have.\nAs usually a research on a number of different topics so you know you can you can find things from where we think the market's going generally to.\nAnd so on things like the Fed to things that are like this more you know focused on broad topics of stewardship or broad topics on you know things under responsible investments so we have a lot of research out there and it's available online on our website.\nWell again Emma thank you so much for spending some time with me.\nThank you appreciate your time.\nThank you.\n"}
