{"id": "16673252", "transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology, they are run on and you want more customization and flexibility.\nAs well as AI-driven model marketplace, UX wealth partners is your destination.\nOn top of that, they have institutional trading.\nSo if you are an ETF issuer or an SMA provider looking for outsourced institutional trading, UX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and make your practice more efficient.\nWelcome to Behind the ticker.\nToday we have on Adam Patty.\nHe is from VistaShares and we are talking about AI-S which is their ETF, the VistaShares Artificial Intelligence Supercycle ETF.\nIt's very, very well crafted, very solid team. They are looking more at what they call the bill of materials and pure exposure approach to investing, where they're investing more.\nAnd all of the things it takes like infrastructure, data center, semiconductors rather than just traditional AI applications or some really overweight exposure to those mag seven names.\nWe're really looking underneath the hood. It is very well thought out and I think they're going to have some success here in the space.\nSo I will let Adam tell you everything about the product. So without further ado, please welcome Mr. Adam Patty.\nHey Adam, welcome to the show.\nThanks for having me.\nSo before we get started, wanting to take a little bit of time and tell everybody a little bit about your background and how you ended up founding VistaShares.\nSure, I've been in the ETF market dating back way back to around 2001 where I was running.\nAmong other things, a division over a time warner called Fortune Index is where we created a stock index based on the Fortune 500.\nWe used that index to create an ETF with state street, the triple F was a ticker.\nI was way back in the early days of the ETF market.\nBut they gave me the first taste of the market and the growth prospects and how interesting the ETF wrapper was for investors and how efficient it is to use it portfolio.\nSo fast forward, I ended up taking that knowledge and founding a company in 2006 called Index IQ.\nWe were one of the early ETF issuers. I think we were the 18th or so that launched.\nAnd we focused on liquid alternatives trying to package institutional quality alternative investment strategies in the ETF wrapper.\nI built that up sold that to New York Life in 2015.\nWas it New York Life rolling out their ETF platform globally for a few years and then I left.\nAnd it's been a few years out of the industry and was dying to get back in and had the good fortune to meet up with a guy named John McNeill and his DVX Ventures company.\nAnd John and I ended up partnering to create VISTA shares and create high quality products for advisors.\nBut using more thoughtful approach to the thematics base.\nYeah, no, it's great.\nAnd we're going to talk about AI today.\nA little bit.\nBut before we get into kind of geeking out on the ETF and AI.\nI always like to ask, what do you like to do for fun?\nAny hobbies?\nYou know what?\nIt's an interesting question.\nI have three kids.\nOne is going to college.\nOne's in college.\nOne's going to the high school.\nSo I'd like to say I have hobbies.\nBut I think all my hobbies have been you served to find my three kids to constant demands for whatever they happen to be doing at the moment.\nThat combined with a startup company is taking up all my time.\nBut I used to like to work out in lift weights and play tennis.\nSo hopefully I'll get back to that soon.\nYeah, right now.\nYou just sit on pay to a driver.\nExactly.\nSo let's talk about the ETF you guys launched, which is AIS.\nThe VISTA shares artificial intelligence, super cycle ETF.\nSo we're seeing a lot of thematic AI ETFs starting to be launched.\nSo how does this differentiate itself for maybe some of the other AI focused ETFs in the space?\nSure.\nWell, first just talking about the super cycle concept.\nJust to take a little bit of a step back.\nYou know, part of what DV X ventures in John kind of came up with this brainstorming session early on to try to figure out how to create a better exposure to some of these disruptive trends.\nAnd what's interesting is that if you look at what a super cycle is, it's really a long term disruptive trend, you know, founded in a technology revolution, right?\nSo the last one was of course the internet.\nIt was a single super cycle that of course changed the way we work that we live our lives communicate.\nBut interestingly now, there's really four super cycles that are occurring at the same time.\nIt's it's AI is robotics, it's electrification and biotech.\nAnd they certainly play off each other, but each one of those is really changing the world.\nSo we chose to focus on, you know, AI as our first kind of foray into the market.\nAnd the problem in the market is that, and this is really a problem across thematic ETFs generally.\nThey don't necessarily always provide investors the exposure they think they're getting.\nSo just because something's called artificial intelligence doesn't necessarily mean the companies you're buying in the portfolio have much to do with AI or at least aren't the key drivers of the space.\nSo, you know, if you look into the hood, many of these ETFs out there in the AI space, you know, you're really getting the mag seven, you know, for the vast majority of your exposure.\nWith a little bit of Netflix and 10 cent in Hollywood, Boba and salesforce.com thrown in there.\nYou know, it's not really, and look, I understand that these companies are making massive, you know, hundred billion dollar plus investments in AI.\nAnd certainly are players in that space and will certainly be very, hopefully significant, you know, consumer focus players once these consumer focus applications become important to people.\nBut in the meantime, the way to play AI is really by looking at the infrastructure is that without the infrastructure, there's there's no consumer facing applications without developing the compute to take these AI models from the training portion of development to the inference portion and beyond.\nThere's no innovation, there's no ability to create that value for consumers.\nYou know, we have really just focused on the infrastructure in particular, the data center and semiconductor infrastructure that's really driving innovation and we've come up with, you know, a methodology and a kind of investment strategy that we think really captures it very efficiently.\nSo I was going to ask you about, you know, you guys emphasize a lot this pure exposure to AI super cycles.\nIs that what you're referring to there kind of investing more in the infrastructure, can you kind of elaborate on what that means.\nSure, so to us, there are two important, so just to back up what we do very simply is is we look at the supply chain.\nSo, you know, taking AI, you know, what are the drivers of AI? Where is the investment going? What are the components that are required to build the AI infrastructure?\nAnd that's really a supply chain analysis exercise. So digging into the supply chain, understanding which that each segment of it really means to to the growth of the industry.\nThen looking at the bill of materials. So, you know, what how much does it cost to build an AI data center? How much does it cost to build in a high performance AI chip.\nAnd then what are the components that go into that? So in data center side, just using an example, you know, to build the data center, it's, you know, it's cooling systems, it's fiber optic cable, it's racking.\nYou know, it's all the pieces that need to go into building that data center similarly on the semiconductor side. It's not about for us, it's not about buying the chip companies that are selling the chips to the data centers or other vendors.\nIt's about finding the components, the GPUs, the VRAMs, the cooling systems, everything that goes into building the semiconductor chips themselves.\nAnd that's how we're getting to that pure exposure. Looking at the supply chain, overlaying the bill materials, then looking at the companies that contribute to each segment within that supply chain.\nThen doing a deep dive into the financials of those companies, because just because a company is a, quote, cooling company for data centers doesn't necessarily mean that they're providing their their their services or their their products to AI data centers.\nIf you need to understand what are the projects that they're working on, what is their pipeline looking on looking like, how much revenue are they're actually getting from AI projects.\nSo that's the next level of analysis, try to really dig in to see how much AI direct AI revenue is coming from these companies and then building that into a portfolio.\nYeah, so with such a focus on, you know, infrastructure, data centers, the semiconductor is rather than, as you kind of put it earlier, some of these like AI applications.\nYou know, how do you see this focus maybe evolving over the years is AI adoption mature. I mean, we're still, you know, we've moved fast, but we're still in the very early ining. So are you, is this ETF going to continue to kind of follow that bill of materials approach or can you kind of see your investment thesis evolving over time.\nWell, the bill of materials is the core of it. So we do have that it is an active product and I can explain how we use our active management overlay to create value. But yes, we have the ability within our rules based process to add additional supply chains. So certainly consumer applications will at some point be a significant piece of the business.\nAnd it will be even the largest, but not today, not without the infrastructure required to create those applications. So in the future, we will, you know, probably be bringing out, you know, adding to that supply chain focus and focusing more, you know, bringing that consumer application piece into the, into the portfolio.\nThe other piece is the energy piece. That's another piece that we have the flexibility to bring in as well. Once that gets to the point where it's more investable and a little more mature.\nSo you would mention, which I agree with you, a lot of these AI centered focused ETFs right now are heavily weighted and the video Microsoft, you guys are much more diversified in terms of underlying holdings.\nI believe it last look and don't quote me on this, there's, you know, some like 72 companies across various segments of the supply chain. So as you referred to kind of your active approach and rules based approach, what are some of the key criteria for really selecting these companies.\nAnd putting them in the portfolio. Sure. So just, you know, again, it going back to the supply chain focus. So you break down the supply chain, you determine what percentage.\nAt each level of the supply chain goes into building the end product. So in the data center side, you know, call 25% is cooling systems.\nYou know, 2% is racking and cabling systems. So you really need to do that analysis, break down the supply chain, apply that bill of materials to see how important is that segment of supply chain into building the end product.\nThen finding those companies that actually have the AI driven revenue within these segments. So, you know, it's, it's a time consuming process, it's heavy and analysis.\nThe way we've accomplished this is we've built this into a rules based process that we filed a patent on.\nSo the core of the portfolio is, is rules based. It's transparent. And we did that because we think it's important for investors to really understand what they're getting.\nSo that there's no surprises. You know, understand, you know, why a certain company is in the portfolio, what segment of the supply chain do they fit into and why are they in there. So that's important.\nAnd we rebalance that core of the portfolio twice a year according to the rules. Then of course, we have our active overlay. So the active management piece is I think a critical piece because particularly in a fast moving, very dynamic competitive space like AI things change very quickly.\nYou have to be nimble. You have to have people that really understand the space to identify the risks and opportunities that are present themselves on a daily basis. So if we have our investment committee is commit as is comprised of four people.\nWe do it a little differently. Then I think most fun companies kind of look at it.\nWe have what we call the practitioners and then we have the portfolio construction side. So on the practitioner side, we have John McNeill who, you know, the president former president of Tesla, former CLO of lift on the general motors board, you know, an expert in kind of autonomy and AI.\nWe have Sunnymodra who is the president of a company called Grok, you know, one of the leading AI companies in the world. He's been in the space for many, many years.\nTheir job is to identify those risks and those opportunities before hopefully other people see them. So, you know, they'll know a company in South Korea is has all of some develop a massive pipeline of AI projects across the world or, you know, another company may be falling behind on their technology development in a certain segment.\nSo we need to know that. So we need, once that is identified, then it goes to the portfolio construction site and prize of myself and professor Robert Whitelaw.\nProfessor Whitelaw was the dean of the undergraduate college and why you stir in school business. He was the chairman of the finance department and why you, you know, leading expert in portfolio construction.\nSo once we find these risks and opportunities, it kicks over to us and then it's our job to really identify how to affect that change in the portfolio, taking into account all the different risk factors that you want to look at to, you know, optimize the portfolio.\nSo you alluded to this and this is right in your wheelhouse is so are you, how are you waiting, are you waiting your holdings based on contributions to the AI sector in terms of, you know, such as semiconductors or applications or infrastructure, is that how you're kind of making a base waiting decision.\nThat's correct. So put aside the applications. That's not part of it right now. It's just a semiconductor is in the data centers. So yes. So we are first.\nWe're waiting them first by their contribution to the supply chain. So if it's a 25% waiting of if cooling systems are 25% of the data center.\nThose companies in the in the cooling system bucket would get a 25% waiting.\nOkay, and then what we're doing and then we're then we're looking a little deeper at the financials to determine how much revenue they getting from.\nFrom AI projects. So let's say in the cooling system, there's a hundred million dollars in AI.\nAI data center projects and there's four companies in each in that that are that have met our criteria.\nAnd one of those companies has 50 million of the hundred million.\nWe are market share weight them within the, within the segment. So the company that has 50 of the hundred million will get 50% of the 25%\nAnd the other countries will split the remaining based on based on how much revenue they're bringing to the table.\nYeah, that makes a ton of sense. And so that kind of core reweighting is that on that semi-annual.\nOr are you a little bit more active kind of maybe looking at quarterly results and reports to kind of tweak here and there as time goes on.\nSo we do an official rebound to the core portfolio at the end of December at the end of June.\nSo that's that's part of the rules.\nBut then we will certainly be looking at all of this on a weekly basis to see how things are shaping up.\nYou know, we won't be we're not going to make active trades for the sake of being active.\nWe're going to do it if we think there's a significant risk or opportunity that needs to be addressed.\nSo speaking about like geographic exposure.\nOr is this go anywhere you evaluating opportunities in emerging markets outside of the U.S. or is it pretty much just domestic?\nNo, we're looking globally. It's a global product.\nThere's companies all the world that are providing significant innovation into the space.\nAbout 60% of the portfolio is currently a U.S. base though, followed by Taiwan and China, France and so forth.\nSo, you know, there's there's market leaders in different parts of the world and they need to be captured in the portfolio to get a good representation.\nSo I was I just want to get your take on this is reading one of your white papers and it says in there you, you know,\nAI growth of up to 300 x by 2032, you know, what kind of key drivers do you think will fuel that growth and what if what really if any risks do you see that could totally derail it.\nYeah, and frankly, that number might be off at this point.\nI mean, that was based on analysis from, you know, probably six months ago and you probably seen all the news on all the cap X investments being announced.\nI mean, it's it's absolutely an arms race right now.\nI mean, just a couple days ago, you just came and announced 200 billion.\nI think 150 of it was was already announced that they added another 50 to that.\nYou know, Amazon all the mag seven companies are, you know, putting significant dollars and so I think the cap X numbers are even far.\nIn access of what we anticipated just six months ago and I think a lot of that is driven by just the national security interests around the AI space generally.\nSo what can derail it?\nI mean, look, there's always things that can derail, you know, any sector in in the markets, you know, geopolitical risks, you know, wars.\nI mean, anything, you know, derail all these investments being made.\nSo you need to, you know, of course, always look at that, but from a market perspective, you know, we don't see anything that's derailing this.\nI think we're very early.\nIt is a lot of heat in the sector.\nPeople have been talking about it, but it's really just getting going.\nJust that the stage where we need to build the infrastructure to serve the needs of the models, the language of large language models that are being developed.\nSo very early.\nYeah, and, you know, as you know, and mentioned, you know, there's a lot of volatility in this space.\nLike, I know it's not related to your fund, you know, specifically, but I saw what happened to quantum computing stocks just because of one, you know,\nthing that came out that said, they're, you know, another seven or ten years away, rather than five, right?\nAnd they all were down 40, 50, 60 percent in a handful of days.\nSo we've, we've definitely seen volatility in the space that you're playing in.\nAnd does AIS manage risk a little bit in your active stance, or is it still more of a fundamental reweighting?\nYou're not going to be trading just because there's headlines.\nSo I agree.\nI mean, look, there is definitely a look when deep seed came out, right?\nThat won't lose about deep seed a couple weeks ago.\nI mean, the whole sector just got clobbered.\nOf course, it's all clawed back because I, you know, people believe that was overblown.\nBut we don't actively manage for volatility.\nHowever, if you look at the performance characteristics of AIS versus the other products in the market,\nI think because of our focus on the infrastructure versus some of the kind of front end applications,\nour volatility profile is quite a bit lower on average than most of the products out there,\nor the most of the ETFs out there.\nSo in part of that is due to the breadth of the portfolio, right?\nNow actually we're even higher than we were, you know,\nthe 72 number was probably before the rebounds.\nI think we're at 85 right now.\nSo we have a broad portfolio of companies across, you know, quite a variety of sectors.\nAnd, you know, that contributes to a lower volatility profile.\nSo with that being, you know, that being said of kind of adding some additional names as this space continues to grow.\nI'm sure in your analysis, you're looking at existing companies in the portfolio to kind of evaluate their durability.\nAnd do they still have a competitive advantage in the space?\nIs that something you guys are doing on an ongoing basis as well?\nThat's part of the constant process.\nAnd that's really about finding those risks.\nSo, you know, we have to make sure that the companies that are currently the leaders that their technology edge is still intact.\nAnd that they, their pipeline is still being grown from a AI revenue perspective.\nAnd then, you know, what new companies are emerging that could take the crown in those specific portions of the supply chain that may be not on the radar of other people.\nSo those are, that's a critical piece of the puzzle right there.\nFind those opportunities.\nI imagine, I mean, evaluating the current portfolio is easy trying to keep track of all the new issues and all the new opportunities just given the growth and the excitement in the space might be the harder part of the equation.\nYeah, and that's why I have in the practitioners.\nWe think is a massive competitive advantage that I don't think anybody in the space has, you know, having people, sunny and john that are in the space have been in the space since the beginning and understand the landscape.\nAnd who all the players are and frankly, you know, in sunny cases is involved with building data centers around the world. So, you know, he's they know who the players are probably before most people do because they're working with them.\nYeah, makes a ton of sense to me.\nSo, million dollar question, you guys are sitting down, you know, you're selling the fund.\nYou might be sitting down with a financial advisory group or an advisor.\nWhere are you, you know, recommending kind of slotting an allocation to AIS.\nYeah, it's a growth equity product.\nFor sure, that's what the exposure provides. So, you know, we, we, I always position it as a, as a satellite to your core equity.\nYou know, it's depending on what your risk challenges are, of course, and what your clients are looking for.\nBut, you know, it's a three to five percent, you know, a slug out of your core equity exposure.\nIf you believe in the space and you believe in the long term growth process.\nYeah.\nWell, I don't know how, how as an investor and how widely utilized the stuff is becoming,\nthat you couldn't be excited about the space or want some exposure.\nBut, Adam, I really appreciate your time before I let you go.\nI got to ask you, where can people learn more about VISTA shares and find all the information on your ETF?\nYeah, I mean, our website is VISTA shares.com.\nSpell just how I, how it sounds.\nWe have a nice presence on LinkedIn and on X.\nWe are, we have a great newsletter on LinkedIn as well.\nWe're putting a lot of effort and time into content.\nWe think content is crucial.\nEducational content around the space.\nSo, investors can really understand, you know, what it is they're looking at beyond AIS,\nwhich is, of course, the ticker of the ETF.\nBut it's really about education and, you know, letting investors understand the space.\nAnd then, hopefully, they come to AIS when they want that exposure.\nWell, again, I have a feeling given your background and given the company that probably not the first time we're talking.\nI know you're not going to be able to talk about any future issues that releases or ETFs you guys may do.\nBut, I have a feeling there will be some other opportunities for us to talk.\nBut, again, Adam, thank you so much for your time.\nThank you very much. I appreciate it.\nThank you very much.\n"}
