{"id": "16759457", "transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology they are run on\nand you want more customization and flexibility, as well as a AI-driven model marketplace,\nUX wealth partners is your destination.\nOn top of that they have institutional trading, so if you are an ETF issuer or an SMA provider\nlooking for outsourced institutional trading, UX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and\nmake your practice more efficient.\nWelcome to Beyond the ticker.\nToday we have on Kirsten Chang, she is from Vettify and we are talking about the exchange\nETF conference, which is right around the corner.\nIt is the big one, 23rd, 24th, 25th and 26th of March.\nWe will be in Vegas this year, everybody in the ETF industry, the whole landscape, as\nwell as hundreds and hundreds of financial advisors, there is plenty to do.\nWe talk about the agenda, we also talk about some of the other fun events and things that\nwill be going on while we are all together, so without further ado, please welcome Kirsten\nChang.\nHi Kirsten, welcome to the show.\nHey Brad, happy Friday.\nThanks so much for having me on.\nThank you.\nThank you.\nBefore we get started why don't you tell everybody a bit about your background and how you ended\nup at your current role over at Vettify?\nYeah, sure.\nThanks.\nI started out at CNBC.\nI got a job as a producer right out of college, and I spent more than a decade there, first\non Squawk Box, which is the morning show, and I moved on to the work on the floor of the\nNew York Stock Exchange with Bob Pazoni, one and only covering the stock markets and helping\nstart up as weekly show ETF Edge.\nBob and I used to attend this exchange conference every year, which of course, you always\nbe in Miami, and we would kind of get together with the close in the ETF community, sit\ndown with CEOs, thought leaders, cover the latest, greatest trends in the business.\nSo I became pretty close with Tom Lighten, of course, who started up at Vettify, Dave\nNade, Todd Rosenbluth as well.\nSo they kind of approached me once they caught wind of my leaving CNBC when I wanted to move\nback to the West Coast, and asked if I was interested in developing more of my own voice.\nAnd you know, because exchange always fell in the first quarter of the year, we really\ntook those conversations as kind of setting the stage for the markets.\nSo whatever resonated at the conference was really what to rove, investor, and advisor\ninterest for the rest of the year.\nSo I was always very fascinated by that community.\nI think I've started my day off for the last 20 years with Squawk Box.\nThere you go.\nJoe Becky and Andrew.\nJoe Becky and Andrew, and I love when Joe and Andrew go after it's specifically, particularly\nduring political and, but it's, yeah, I, so very familiar with the show and yeah,\nCoach or cast of characters.\nYeah, it is.\nIt's great.\nI mean, you sit there with my coffee and turn on Squawk Box, it's like automatic\nfrom me.\nThanks for watching.\nYeah, so I have to ask, before we kind of get into the topic, which we're going to\ntalk about the exchange ETF conference, it's coming up here in a couple weeks.\nAny hobbies?\nWhat do you like to do when you're not working?\nOh, well, I love rock climbing.\nI like to do that when I can, although I am, I am pregnant now, so I can't really\nbe doing that these days, but I've normally love rock climbing.\nI like to go skiing.\nI know you were just in Colorado, that's one of my favorite spots to go to hit the slopes\nthere.\nI also really enjoy kind of hiking, which is a big reason I move back west.\nI really wanted that exposure to nature and the outdoors, you know, like karaoke in my\nfree time.\nYeah, and just kind of watching nerdy movies and things like that.\nHow about yourself?\nOh, I, um, well, you're having a baby, I have two young ones, so my days are, you know,\nbasically making sure my little one doesn't have to go to the emergency room for busting\nhis head on something, doing backflips off the couch and my daughters and in soccer and\ntennis and all the stuff.\nSo, um, it's straight though, it's great.\nWell, let's talk really briefly at first, because, um,\nidentify, you're not just putting on a conference, right?\nSo, what, is, identify kind of as a whole?\nWhat do they do?\nHow do they help service clients, you know, you guys have a big company?\nSo if you could, um, just kind of give everybody a little bit about what they do outside\nof just put on this wonderful conference once a year.\nYeah, great question.\nVerifies a lot of things.\nIt's an index provider.\nWe pair with index partners to launch actual ETF products.\nWe are data company.\nWe have all the latest data on trends.\nWe watch the flows carefully, performance.\nWe have a digital distribution company.\nSo we do regular webcast where we educate advisors, kind of bridge the gap between advisors\nand issuers, a lot of letting them know what's under the hood of these companies, because\nthey're, and the funds, because there's so many ETFs out there, you know, 4,000.\nSo we really have to kind of be careful and shifting through the noise and letting people\nknow what's out there, what they can recommend to their clients, what makes sense in the\ncurrent market environment.\nSo, a lot of educational work there, um, I write weekly articles based on the trends that I'm\nseeing.\nI moderate these webcasts on a regular basis.\nSo a lot of, a lot of just kind of being the one-stop shop for ETF data and information\nfor advisors and investors, um, ultimately.\nYeah, I know I've been on the website a handful of times.\nThere's a breadth of information and you're kind of, you know, the behemoth in the room\nwhen it comes to all things ETFs.\nAnd so, um, yeah, I use it as a resource often, but we're here to talk about the big one,\nthe exchange ETF conference.\nIt is the ETF conference of the year now in Vegas used to be on Miami, so big change this\nyear.\nSo really, how did the, you know, conference come about and like, what is the point of getting\nall of us together for a handful of days now in Vegas?\nYeah, so it's, you know, it's the world's largest ETF conference.\nIt has been going on for a number of years.\nI think more than a decade now, I've just joined by the file last year, but I know it's been\ngoing on for long before that, because I used to attend those on the other side of things.\nThat's kind of wild and wonderful to be on the, on the action, part of the action and\nthe inside of it all, but the kind of the idea is to offer advisors, you know, you mentioned\nVegas.\nThey say what happens in Vegas days in Vegas, while that might be true, where we're hoping\nour advisors take away plenty of tangible advice, poem to their clients.\nWe want them to, you know, have actionable insights and analysis, that includes updated tools,\nkind of to enhance their business practice and better themselves, and their businesses.\nAnd again, we want to set the stage for the rest of the year in terms of the market conversations\nand what's really driving the trends.\nSo yeah, it's essentially a way to give advisors a playbook to prepare them for what's\nahead, you know, never a dull mark moment in the market these days.\nYeah, well, that's true.\nSo this conference is pretty unique.\nI go to a lot of conferences.\nWhat do you think kind of sets this apart from other financial conferences?\nBecause there's like 30 of them every year.\nAnd this one seems, it has always been, you know, a musco to and very well attended.\nSo what do you think is kind of the main reason for that?\nYeah.\nYou know, I think, again, we kind of were supposed to be the one stop shop for everything\nETF.\nSo we're bringing all the biggest issuers and asset management provide, you know, they're\nthere, they're part of our partnership.\nThey're going to give us the greatest insights into what's going on with the latest products.\nWe also have keynote speakers that always draw a lot of attention.\nDavid Kelly, people love listening to for the latest macro market analysis.\nIan Bremer is going to be there to help cap things off and kind of make some sense of\nwhat in the world is going on with trade wars tariffs and geopolitics right now, which is\ncertainly top of mind.\nAnd I think it's just the idea that, you know, as as students of the trade advisors always\nhave to keep learning, they have to, they can't get comfortable.\nThey're not complacent with what they know.\nThey have to keep learning.\nSo they have to keep listening and learning and educating themselves so they can go home\nand talk about the evolution of of the markets and and educate their clients on what\nelse is out there and what's new.\nI think that conferences are a great place to do that in person.\nYeah, I agree.\nI mean, there's a ton of ETF issuers, there's a ton of service providers, there's all\nthe different facets that attend this conference, but really, as an advisor, there is so\nmuch, there's so much more than just ETF's ETF's.\nAnd I think as a financial advisor, given the fact that they get a massive discount for\ncoming, right?\nLike, it's a perfect conference for for financial advisors to attend and, but I think\nwhat are the big trends?\nWhat are the big themes this year that attendees can expect at this year's conference,\nboth kind of with any ETFs and kind of the broader investment landscape?\nYeah, so I mean, you know, the ETF industry is evolved and so is the agenda.\nA lot of the topics will be covering will range from hot button issues like private\ncredit ETFs and hedge fund lead multi-ass that ETFs and will also be talking about actively\nmanaged because, you know, active management has been huge.\nIt's been growing and it explodes of rate in terms of equity is and fixed income.\nSo it'll be delving into that, especially with the Federal Reserve kind of keeping the\nmarkets guessing at the moment.\nI think we're pricing in three rate cuts.\nIt was like one rate cut a couple of weeks ago.\nSo you never know which way the market's going to turn.\nWe have the jobs report that was weaker today and just in terms of other topics broadly,\nyou know, the Maddics will be talking about ESG kind of ESG, but don't call it ESG.\nYou know, there's still a lot of interest in that sustainable investing idea, believe\nit or not.\nOur advisor council was very big on making sure we had a panel diving into that.\nWe'll still be talking about crypto, the usual sort of trends that are standing out,\nalthough they may have been on the back burner lately, AI, power demand, lots of interesting\nnarratives going on driving the whole conversation.\nSo I mean, crypto was, excuse me, massive last year with it, the ETFs being launched.\nSo I remember that being a huge theme.\nI also remember some giant booths from some of this crypto providers in the exhibit hall.\nI don't know how they get those things there and what they cost, but they were impressive.\nYeah, they're showing out the big bucks for those booths.\nYeah, for sure.\nSo I know you mentioned a few other than your own panel, what kind of panels or topics\nor keynote speakers, or you particularly kind of excited about this year.\nYeah, well, I think one must see panel is led by my dear friend and mentor Bob Bazani.\nHe's going to be interviewing Rob Art not of research affiliates, and they'll be talking\nabout why you shouldn't reject value investing.\nAnd you know, what's not to love there?\nRob of course has been a pioneer of smart beta.\nHe just launched his new kind of bottom feeders ETF, the research deletion ETF last year.\nSo lots of characters there will have state street, global advisors and bridge water.\nThings that gives from both heavy weights and the asset management industry.\nThey'll be on stage with my colleague Todd Rosenblitz to delve into their brand new all weather\nETF that just launched yesterday.\nYou know, it's the first ETF that really offers that hedge fund strategy to the average retail investor.\nSo really interesting stuff.\nAnd you know, speaking of new launches, lots of buzz again around the new private credit ETFs.\nQuite a few eyebrows raised there.\nSo we'll hit on this when we talk fixed income with bond blocks and FM investments.\nThose are two big innovators in the bond ETF space.\nAnd you know, fixed income, again, top of mind for many after a record year for fixed income ETF\nflows.\nThen we also also got my colleague Roxanna Islam, just going to be talking about under the radar\nthematic tech trends with an active portfolio manager at TRO.\nSo it'll be interesting to see what he's watching given thematics of kind of fall into the\nwayside over the past year or so.\nSo we'll see if those pick up this year as more investors looked at Chase Alfa, which\nis also got an interesting international equity panel with three edge and research affiliates,\nwhich is a very timely topic in today's economic environment.\nAgain, AI, Surging Power Demand, the crypto panel led by Eric Balchunes, Bloomberg, always\ngreat on those and that ESG session again.\nIn terms of, I guess, other speakers, David Kelly, again, great, great speaker, chief global\nstrategist, something of a rock star now among our advisor audience.\nSo we're going to go in and deep with one of the largest active managers in the space,\nhim and John Mayer of JP Morgan.\nOh, and here's the fun.\nWhen we have one called Money Lines and Markets, where Mike Durso, from Shore Haven's\ngoing to talk to Mike Palm of circus sports, and they're kind of drawing the parallels\nbetween investing and sports betting, because there's a surprising amount of quantitative\nanalysis and strategy behind sports betting that can be applied to investing.\nSo I think that's a good example of how we're embodying the spirit of Vegas while we're\ndown there.\nMike Palm from circus always a real character.\nAnd yeah, well, we'll also have a few practice management advisor wellness sessions\nwith Brian Portnoi.\nHe always does well from shaping wealth.\nHe's a leading expert in the psychology of money.\nWe'll be hearing from award-winning speech coaches like Jonathan from Oregon, from Connective\nCommunication.\nWe'll also have a retirement expert and Lester, Chris D'Akuberry from wealth consulting\na list goes on, really for holistic, holistic business management and wellness practices.\nAnd Kyle is still on always does really well with our younger audiences.\nShe's a young fresh face, founded bread, huge following on social media.\nSo she's going to be talking about the convergence of social media and AI and the impact\nthat all of that's had on the markets.\nAnd just a lot of these sessions will be offering those CE credits.\nYou know, everyone has to get them.\nWe want to make it easy for them.\nAs you mentioned, very easy for advisors to sign up, many of our webcasts if you attend\nthem lately.\nYou'll be getting free registration passes to the conference, so definitely take advantage\nof that.\nWell, there's definitely a lot there.\nI'll definitely definitely be going to the sports betting and investing panel.\nThat sounds fun.\nYeah.\nI mentioned Rob Arno.\nHe was just on this show.\nI believe he was either the last episode of the episode before I could talk to him for three\nhours.\nRight.\nThat would be one I would definitely want to go see.\nSo I mean, totally action packed a couple of days and not not short on information.\nBut you are on a panel this year.\nYou didn't mention your panel.\nI know there's still some things out there as to, you know, what that is going to be\nabout.\nBut if it's okay for me to ask you a personal question, I just out on a panel before you\ndo.\nYou get a little nervous.\nLike, how do you prepare yours, do you just go and just wait?\nWell, I think, yeah, it's kind of how I prepare for webcast.\nI do a few vocal warm-ups, which nobody has to be privy to, but I will usually, you know,\ncheck a lot of hot water, I'll drink some honey tea, and then I'll do my vocal warm-ups\nwhich involve a little bit of singing, a little bit of, you know, just kind of tongue twisters,\nall the stuff used to do in drama school.\nAnd then I'll just kind of go over my notes and go over the key points that I want\nto make sure I come out in the discussion and be ready to kind of add lip from there\nwith follow-up questions, make sure I'm familiar with my panelists, make sure they're comfortable\nwith me, have a little bit of identity dynamic going with them, maybe learn a thing or\ntwo about them, about their hobbies, like you did with me, just to kind of see if I can, you\nknow, bring that in and kind of live it up the conversation a bit.\nIt's always a great time connecting with these people that I love, liaising with these\ncommunities.\nIt's one of my favorite parts.\nYeah, I mean, and you just let me perfectly into my next question, which is a major draw\nof this conference is always networking.\nBut the ETF community seems to be so much more open to meaningful connections and community\nthan really any other part of this industry, and I've been in most other parts in some\nway of shape or form.\nSo, you know, how do you, you guys think about, as you're setting up this conference,\nhow to facilitate those meaningful connections among attendees, speakers, and sponsors?\nYeah, a great question.\nWell, one of the new ways that we are doing that to bridge that gap, we actually have\nthese web-based tools now, we have an app, which we've always had, but this app in particular\nis going to be very special.\nIt should roll out next week.\nIt's called Exchange 2025.\nYou can download it now, but it won't be of much use yet.\nBut next week, you'll be able to use that and our website to book one-on-one appointments\nnow to make it really easy to engage with attendees at your own leisure.\nSo, all registrants will get an invitation and announcement about this.\nYou know, a lot of our advisor counsel indicated they really prefer the freedom to set meetings\nfor first thing in the morning or later in the afternoon, you know, at the times when\nwhatever's kind of fluid for them in their schedule.\nSo, we have a lot of those options.\nYou can meet with anyone you want in a cafe and what we call the oasis out on the lawn, lots\nof flexibility there.\nSo, it feels a little bit less like speed dating, so to speak, and a little bit more just\non your own pace, you know, kind of mingling and networking is key.\nBecause I think that's the real importance of that, of that community, ever, ever vessance\nand kind of feeding off the energy that you get when you're in person with all these\npeople.\nYou never know you're going to bump into.\nSo, definitely stress the importance of mingling networking, you know, just being\nout there as much as you can.\nOkay.\nSo, it can be quite daunting when you attend this event for the first time because\nit is such a big event.\nThere are so many sessions, there are so many things going on, there are so many different\neven places.\nI mean, just looking back at Miami, you know, you could be out, there's places that\ncan ban is out by the pole, there's things upstairs, there's a giant, you know, there's\na lot going on, which is great.\nBut if you were coming to this conference kind of as a first time attendee, how would\nyou give them some advice on how to navigate not only the event itself, but also to keep\nup to speed with all the content that's going to be happening?\nYeah, and that's a great question.\nI mean, first of all, we're out of to do venue, as you mentioned, we're to brand new\nbeautiful hotel, version hotels right off the strip.\nIt's much more reasonably priced.\nWe'll have a wonderful indoor outdoor experience ready.\nSo, we'll have a campus kind of all spread out on a single level.\nSo, it'll be easier to kind of find who you're looking for.\nWe want to freeer more interactive feeling, you know, to this conference versus previous\nconferences.\nAnd I think, you know, first off, just to familiarize yourself with the agenda, take take a look at\nthe topics or the speakers that kind of resonate with you and your business.\nPrioritize those, you can, again, use the appointment schedule in your app,\nblock-off times for the sessions that you want to attend.\nThink about really the on-site community who you want to meet, connect with,\nthat's kind of meeting your goals for the day.\nBe proactive with inviting them to meet you.\nAnd, you know, again, never underestimate the importance of networking.\nJust just walk around.\nYou never know if you're going to bump into a coffee shop that can cause the great, you know,\nclose a great deal, create a great connection.\nYou're could be your next client, your next prospect.\nIn terms of the weather, I will say it's important to layer up.\nVegas is hot, but it might get a little breezy first thing in the morning or even later in the evening.\nSo, you know, that's a dress code is kind of breathable, business casual,\nno shorts and flip flops, but it is Vegas.\nSo, you know, feel free to add a little flare, sparkle, you know, when in Rome, right?\nI guess, yeah.\nSo, in addition to kind of the panels and lectures that we talked about,\nyou guys always do some extracurricular type things, whether that's in the morning or,\nso anything on the agenda this year that really kind of enhances that community connection,\nthat you guys generally always kind of sprinkle in there.\nYeah, no, that's true.\nYou know, for one, thatifies always held the charity event,\nI'd exchange to benefit the Susan G. Coleman for the cure,\nrest-counter foundation.\nAnd in the past, they've hosted five K runs, but this year, we're doing put for pink.\nThat's many golf. So, we'll have six many putting greens,\nspread throughout the campus. The attendees can play and gauge donate to a philanthropic\ncause throughout the week, which I'm really excited for.\nAre you much of a golfer yourself, Brad?\nI am. If I'm allowed to leave for five hours, that is my hobby of choice.\nWell, there you go. So, hopefully, you see in, you know, putting those,\nputting your heart out there. Also, we have March Madness,\nand it's going to be in full swing. So, to mark the occasion, State Street will also be setting up\na basketball hoop area. So, it's going to be kind of like basketball connect four,\nwhich will be fun. So, you know, come on down, shoot your shot, and see how you do.\nWell, speaking of being March Madness, hopefully, people are out of the sports books and in more\nof the lectures, rather than on the strip, placing sports bets, you know?\nI know, that's true. Sunday might be a tough one to draw the crowd away from the\nscreens, but we'll do our best. It happens. So, the other thing to,\nyou kind of sometimes always sprinkling a little bit of a surprise last year was a drone show.\nNot saying you have to have one this year. Anything you got in, any of you guys are kind of\nkeeping to the wayside that could be a fun little thing? I'll be honest, if there is,\nI'm still in the dark about it. So, it will be a surprise even to me. So, the answer is\nprobably, but I can't confirm or deny. That's fine. Well, look, I look forward to seeing\neverybody at the event this year. I'll be there. I'll be reporting podcasts as I told you before\nwe got on. I think I did like 10 or 11 of them last year, and it's always fun to connect with\npeople that have helped me, service providers. It's good to connect with Todd and everybody that\nI've known and they've been on the show and who are running around that conference. The energy\nthey have to have for that week is intense, but look, I really, really appreciate you spending some\ntime with me. I think it's going to be a great time, but before I let you go, if you haven't signed\nup already or if you're looking for the agenda, where do people need to go to find out more information?\nYeah, so if you haven't yet, don't forget to sign up. We already have more than 1,600 registrants\n700 plus advisors in counting, so you can go to our website exchange etf.com. We've also been\nhosting a number of webcasts throughout the month. You can find those on etftrends.com. If you stop\nby any of those, you'll be able to register for free using a special code. And we just really\nwant you to have fun networking and enjoying the content with a little bit of levity along the\nway. So we hope to see you there. Well, Kirsten again, thank you so much for your time and I hope\ndid I run into you while we're there? Yeah, let's do it. I'll see you on the putting green.\n"}
