{"id": "16797128", "transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology, they are run on and you want more customization and flexibility.\nAs well as a AI-driven model marketplace, UX wealth partners is your destination.\nOn top of that, they have institutional trading.\nSo if you are an ETF issuer or an SMA provider looking for outsourced institutional trading, UX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and make your practice more efficient.\nWell, come to behind the ticker.\nToday we have on Dan Peterson, he is from New York Life.\nWe are talking about the New York Life footsie international equity currency neutral ETF.\nWe also joked about how much of a mouthful it is to get that all out.\nBut it is a market cap weighted currency hedge ETF 50% currency hedge.\nSo we talked about how the ETF works, how it operates.\nWe also get into the landscape of international equity exposure.\nHistorically how it's been and what we can look at going forward.\nBut without further ado, please welcome Mr. Dan Peterson.\nHey, Dan, welcome to the show.\nHey, Brad, thanks for having me on appreciate it.\nSure, so before we get started, why don't you give everybody a little bit about your background and how you ended up over at New York Life.\nDefinitely, that's great.\nSo I've been in the industry since 2003 going on 22 years now.\nAnd I've been in financial advisor roles and junior roles initially and made my way over to index IQ as my first ETF position.\nAnd from there 2012 through 2015, we were a small shop and then were acquired by New York Life in 2015.\nSo to the past 10 years, I've grown from being a hybrid distribution wholesaler into now product management for the past eight years or so.\nSo we're here to kind of talk a little bit about the products we.\nBut before we do that, before we get into, you know, nerd out on the ETF, any hobbies things you like to do and you're not working.\nI do. I'm a continuous learner. So I've really dive into anything mechanical.\nI do a lot around the house a lot of do yourself stuff.\nTwo kids, they're now 11 and eight, so that takes a ton of time.\nBut last year, I finally got back into my roots as a as a kid. I grew up around voting community and since then have not had a boat up until last year, we bought.\n20 year old boat actually rehabbed it and then get it into labor day, which is rough.\nAnd this the whole summer pretty much, but looking forward to using it this summer.\nNo, that's great. I've been, I was a, I was a, I was a do it yourself for for a long time and then made too many mistakes and so I'm a, I've now outsourcing.\nAll things inside the house.\nThat works. It's expensive, but it works.\nYeah, it's, yeah, and you don't hurt yourself and, you know, you don't come in and you're bleeding in your wife's like, now what'd you do?\nSo, so let's, let's talk about, we're going to talk about HFXI, which is the New York life.\nFootzy international equity currency neutrally TF. That's a full sentence.\nSo why don't you start by giving us an overview and what makes this, you know, really unique product in the international equity space.\nDefinitely. That name has evolved over time. We tried to find the most succinct way to say it and it is still a mouthful for sure.\nWhat we're trying to get at with the name is to understand that there is indeed a currency decision that's made when you're investing internationally.\nThe decision.\nReally, there wasn't a decision. If you were to go back if 20 years or so, you pretty much as accepted currency risk for what it was.\nAnd whether that helped or hurt, you understood that that was part of the attribution to the return.\nAnd then fully hedge products started to come out to.\nDeliver the option that you had the chance now to remove currency risk from the equation and just focus it on the equity exposure.\nAnd when those first came out, there was a lot going on in Japan to intentionally devalue the yen spur exports, the title that albidom expected.\nAnd it seems like a pretty logical trade to want to hedge Japanese yen and go along the equities because of what they were doing to their currency.\nUnfortunately, if you look at assets in that space, most people were late to that trade.\nA lot of the assets flowed into hedged Japanese equity products a little after the fact.\nAnd if you were to look at performance of those assets that came in, they underperformed on hedged assets.\nAnd it was it was a bit of a traumatic trade for many.\nAnd in our conversations for those that were around for that, we find that most people just do not want to do anything in terms of making a decision to have,\nto have not currency and they just go to default option.\nIf you look at indices, all indices are US dollar based.\nSo when you're benchmarking, you generally have the impact of currencies reflected in the benchmarks as well.\nWe're trying to deliver an option here that lets people understand that there is a neutral way to do this to have some currency exposure.\nBut not have as big of an impact as we've seen over the years with full currency exposure.\nSo what we're doing is hedging half of the risk which allows people to not have as much volatility that comes from currency.\nBut also participate in foreign currency strength when it does happen.\nAnd that allows investors to not have to decide, what do I do now?\nDo I technically move towards hedging?\nOr it's not hedging, am I chasing my tail?\nWhen I look back at performance, I see what has done well.\nBut if currencies mean revert, I might not want to do what has done well.\nAnd it gets into a very deep rabbit hole of decision making that is impacted by just a tremendous number of different possibilities,\nwhether it be interest rates, geopolitical risks and things in that nature.\nTrying to provide almost the most passive approach which is market cap waiting and having the currency exposure.\nGot it. So far listeners that might not be familiar with how to construct a currency hedge.\nAnd a practical level, how is the fund constructed in order to achieve this and what types of instruments are used?\nDefinitely.\nThe answer is going to be forward contracts which is kind of the industry standard.\nIt's an agreement where whatever the currency move is over the next 30 days.\nIt's implemented at the beginning of each month with 30 day forward contracts.\nSo the instrument allows you to settle on the difference in the currencies from the beginning and month to the end of the month.\nBut I might want to pull back just for a second and review what's happening here.\nAgain, most people understand that when you invest internationally, there's a currency impact to what why and how does that work.\nIf I take my money and I put it into a Japanese equity, I have to convert my US dollars that I'm investing into yen.\nIt's now on their market and I'm buying Toyota or whatever Japanese equity, you know, I want to buy Toyota or whatever equity.\nIt goes up 5%.\nCool.\nI get my 5% return.\nBut in the meantime, the yen also devalues versus the dollar 5%.\nSo when I translate that back to US dollars, I actually have a zero percent return.\nIt is, you know, one for one going to reduce or increase my return.\nSo it is significant.\nAnd if you look at this on an index level and you assume, okay, there's, you know, Japanese companies in here.\nThere's European companies in here.\nYou know, all the different developed nations and various currencies that are involved.\nAnd if I look at that as a holistic approach from an index level, it is not uncommon to have a thousand basis points or 10% of attribution or one year up or down.\nThat's kind of the widest part.\nYou know, currencies move throughout the year.\nSo we'll see on average is about 600 basis points of additive returns or detracting returns.\nYou can blow out to as much as a thousand basis points in either direction.\nSo great if it helps me.\nBut if I'm subtracting 10% from my return in equity, I don't know, you know, if I'm planning for that and my having a strong opinion about that.\nAnd if I don't, you know, I might want to reduce the exposure there because that's pretty significant.\nSo can you talk about kind of maybe different market environments and how this would perform in those environments.\nAnd in those conditions like what is ideal for this product.\nYou know, what type of situation would be ideal, what type of situation, you know, might be a little bit more difficult.\nSo yeah, if you could just share that and I think it'd be super helpful.\nAbsolutely.\nThe great part about this product is it's it's designed to be that all weather long term allocation.\nSo the there is a good condition if I were to look at this compared to a fully hedge product and there is a good condition if I were to this compared to an un-hedge product, which when you look at the category.\nAnd I look at the assets in in the foreign large blood category 99% of assets are in un-hedge products, especially if you're looking at market cap waiting.\nSo there aren't a lot of assets in fully hedge, so you kind of wonder if it's worth comparing it, but I will anyway.\nBut the bottom line is there there are periods where currencies will help you and currencies will hurt you.\nGenerally speaking, it's when you have even an expected inflation and stable growth that foreign currencies will strengthen relative to the dollar.\nThe dollar benefit, the US dollar benefits from risk, right, there's a flight to quality trade that happens where everybody starts to go into the dollar for stability if we're in a market downturn or in type of recession.\nBut there's also high growth scenarios like we've seen over the past several years where there's a US dollar strength phenomenon that happens as well, just because there's a lot of US centric growth happening globally.\nSo if you think about that there's this phenomenon called the dollar smile, right, so there's these two ends of the spectrum where the dollar strength ends and then there's that middle ground, which actually should happen more commonly where you have expected inflation and stable growth with foreign currencies can benefit.\nFortunately, especially for that left tail where we're in a recessionary environment or risk on environment, equities are moving down and there's a flight to quality with US dollar.\nSo if you have both equity and foreign currency exposure, you kind of getting double the downside.\nAnd we saw that in 2022 when the international indices performed as poorly as US indices, right, the SB 500 was down around 16% or maybe exact number.\nAnd if you were to look internationally at, you know, an MSCI, EFE index or EFOTSEE developed markets index, it was also down about 15, 16%.\nAnd if you look at the attribution of that, the equities were only down about 8%.\nSo it would have been an okay diversifier to have, you know, part of my equities only down 8%.\nBut because of the currency impact, it was down as much as US markets.\nSo especially in those risky environments where both equities and currencies are down, that's where any amount of hedging is going to be appreciated in the portfolio.\nYou know, if you're great at timing these things, don't fully hedge, you know, time, it's cool.\nAnd then get back into one hedge, you know, when it's working for you, but these cycles play out short, medium and long term.\nSo it's really difficult to play around with the portfolio and time it right and our approach is.\nHave some to benefit, but also lower the risk so that it's more in line with people might generally expect, you know, if currencies buy in large long term or contributing, you know, 30% of the return.\nI, I'd want to have a pretty stronger opinion with something that that powerful 15% of the return, you know, here's something where I can kind of say, okay, it'll help sometimes it'll hurt sometimes.\nAnd I'm kind of okay with that level, that's why the 50% number works pretty well.\nSo the the non hedge portion of this portfolio got like 800 equities in there, is it just strictly a mirror of the footsie index is that the exposure at market cap.\nYou're not doing any other ancillary stock selection or active nature in there, you're not, you know, you're not taking an opinion, you're just merely following the index.\nCorrect. Yep. It's replicating the index. So what what the index shows is what this will have in terms of, you know,\nactive selection is purely past. So you're not seeing that and you know, it's worth reiterating, especially, you know, with this kind of conversation that.\nYou know, the returns come from the equity returns plus or minus the currency returns.\nSo those that are unhedged are having that equity basket exposure and then the currency can contribute or the track on top of that if you're unhedged.\nAnd there are slight differences between footsie and MSCI and, you know, all the various different index providers.\nSome will consider, you know, footsie considers South Korea and Poland as developed whereas MSCI does not.\nSo you have a little bit of different country exposure.\nVanguard has a product that tracks also footsie, but it includes Canada.\nSo MSCI E3 does not include Canada, but footsie, the version of footsie that Vanguard uses with one of their products does include Canada.\nSo there's a little different ways to slice and dice developed markets exposure and then you can go out as the old world category where you're now including emerging markets as well.\nSo, you know, you can look at these very different ways, even though they're market cap weighted.\nBut generally speaking, if you look at correlation, very high, if with straight developed markets exposures, you're looking at 99 plus in terms of correlation over most time periods.\nWell, when we talk about, you know, the international sector as a whole and take some time there because I've looked at the charts.\nI'm sure you're aware, you know, international is just, I don't know if it's three standard deviations now away from, you know, kind of the mean with US equities, but, you know, I'm of the camp.\nAnd I think you've said it earlier that sometimes things mean revert or you guys getting a little bit more excited about international exposure over there or what are your thoughts.\nSo I wrote a primer paper about this a few years ago, I feel like you might have dug this up or something with the standard deviations.\nSo you're, I think you're referencing price earnings ratios, right? And, you know, basically the fact that international indices generally exhibit a discount and valuation to domestic equities.\nAnd this is what any, you know, international equity provider or strategy is going to talk about in terms of why international is attractive because you have lower valuations and more room to grow versus the US.\nIt gets tiring, though, because that's existed forever, right? So it's just like, I've heard the story a hundred times, you know, of course they're discounted.\nIt's always priceable hires, more demand for US companies, it seems, in the open market.\nBut to your point, there is a range. It's always discounted, but it's been, you know, in the past we've seen, you know, USPE, it's we look at the S&B 500,\nit might have been in the 20, the low 20s, and then international might have been, you know, 15, 16. So it's discounted, right?\nOr we're looking at maybe like, you know, 75% or so in terms of the price earnings comparison there.\nBut right now, if you were to look at, you know, develop market indices, whether it be footsie or NSCI, you know, you're looking more about 17, maybe high 16s and the US is 27.\nSo now it's really stretched to your point, several standard deviations away from the average.\nAnd I don't argue, maybe even in the bottom 10th percentile, that's about how far away we are within that range of discount. So the rubber band is definitely very stretched right now.\nAnd that, that paints a picture of opportunity, whether that be the US comes down or the international catches back up, we don't know where we're go.\nBut when I look at a portfolio and you say, you know, what's the opportunity for, for international, it's definitely a diversification potential.\nAnd there's evidence using price earnings to be able to point to say, you know, why we're making this decision maybe to start to increase international exposure portfolio again.\nAnd we are starting to actually see that pick up that that was a long conversation for many years in the working, but if you look at, you know,\nI don't want to start flow data in various categories, we do see foreign large blend picking up a little bit and assets compared to what has done historically. So there's definitely opportunity there.\nAnd we also see things like essential banks are, you know, already starting to cut rates, they were little ahead of the US in terms of the rate cutting cycle, which might point to, you know, opportunity as well overseas, you know, compared to the US, which is still a little restrictive.\nAnd we don't know how fast the US will be going forward in terms of cutting rates.\nYeah, well, I don't know if they're going to be cutting rates at all, we'll see this year, but you know, it's interesting to me because, yeah, if you're seeing flows again, that's great, but, you know, there was periods of time there where I was having conversations with advisors and they're like, why am I still including international exposure inside of my portfolio?\nIt's just been a drag. And they understand the diversification benefit of it, but from a portfolio construction standpoint, they were just getting fed up with it because, you know, as you know, and I know, and a lot of people who listen to the show know, as you've got basically seven to 10 companies that have popped up the S&P for the last, I don't know, 36 months.\nAnd if you're not invested in market cap weighted, US index is specifically, you know, the S&P 500 and the NASDAQ, you know, you can't keep up. And so I understand their argument, but to me, into your point, you don't know which is which, right?\nYou don't know whether or not the US is going to come back to Earth a little bit, or if you're going to get this catch up from international equities, I tend to favor the first part of that that, you know, the US probably could use a little bit of a cool off here.\nAnd allow that kind of difference, the differential catch back up a little bit, but I think just as an asset allocator, you've got to continue to look at international and even some emerging markets as a place to diversify some assets.\nBut I don't know, I don't know what your take is, but to me, it just seems as if asset allocation or, you know, traditional asset allocation has been really tough for advisors over the last handful of years.\nAnd you're starting to see some massive concentrations and portfolios, not only to specific socks, but, you know, I'm seeing, I'm seeing portfolios where people have 30% exposure to the max ETF, you know, they just want to buy the seven.\nAnd it's frustrating is somebody who helps assist in that process to see it because you know it's common.\nAnd those numbers, they're still stretched, I mean, you see them in articles every once in a while, actually pulled them recently, the percent in the top 10 names for the S&P 500, 36% right now.\nAnd if I were to look at international index concentration, it's closer to 12, one is almost at 13 right now.\nSo yeah, the concentration benefits internationally also is a big help. And I'd also, you know, mentioned that I'm putting together some research right now actually to look at historical periods right history can't be counted on to repeat, but we've seen some historical examples where, you know, we had a strong run in US equities.\nAnd the last time we had as strong a run as we have currently, right, which is excess in excess of 20% annual returns and six of the past eight years, just pretty wild, right, it's a lot of people have only been around for eight to 10 years only know this.\nBut if we look back historically, we have the tech bubble right where you where you had it was similar where you had a handful of, you know, 20 plus percent years in the S&P 500 and then the prior period to that would be the late 70s early 80s.\nAnd where we had a strong run in US domestic markets in both of those prior periods as not a large number of periods like two periods that we can look at both of those prior periods the international indices exhibited.\nAnnual returns in excess of 20% for the following several years.\nSo it was a place to go that maybe had a little bit of a, you know, like a tag on performance from from US strength.\nOne period of course, the tech crash didn't end well for US but the late 70s and early 80s actually just continued to have decent strength.\nThose in 20 plus percent, you know, year returns, you were better off diversifying internationally, but it's good to see that historically, you know, this all doesn't end poorly, right, there's some kind of light at the end of the tunnel.\nIt doesn't have to be that everything goes down and international goes down less.\nIt could actually be that international does have strength going forward and maybe maybe that's a both on effects from from what's happened in the US.\nI know that's great. So when we're just talking about this product specifically hf x i.\nWhen you're sitting down with an advisor or talking to someone about how to use it, you know, where are you, obviously it's going to be in that international sleep are you pairing it with.\nJust traditional market cap weighted only international or do you think that this is just a better alternative to that because you're getting some currency edge like how would you,\nhow would you try to really position this and using it in a kind of overall model diversified portfolio.\nYeah, it really depends on what people are looking for, right, some people love active for what it is and, and you know, this isn't something that would compete necessarily directly with active.\nIt could be a course satellite type of approach where you have, you know, core market cap weighting and there are reasons to pair this with active.\nAnd more so than anything else, it will be volatility reduction actually because the currency in and of itself provides a separate and distinct series of returns that exhibits its own volatility.\nSo every bit of currency that I take out in terms of exposure lowers my volatility of the overall of the overall strategy.\nAnd that's going to hold true at the index level, you can find individual countries where currencies could be negatively correlated to equities and that kind of exists in short periods.\nWhere reducing currency risk could actually increase your standard deviation, but it's actually very rare to find out in developed world, and especially at the index levels at the index level.\nThere is a slightly positive correlation, but it is a separate distinct time series return because there are times where currencies correlate and times of currencies don't correlate but by and large when I reduce currency exposure in the portfolio it takes away volatility.\nSo we look at this as a way to pair with active in order to lower your volatility and maybe come closer to a benchmark exposure, but maintain your active exposure as well.\nAs a as a satellite or you know to whatever extent you want to maintain active and and definitely as a passive substitute and portfolios for international just again have maintaining your market cap weighted equity not tinkering with your equity waiting.\nYou know there are smart beta strategies and other ways to approach international to try to reduce volatility.\nBut many times we find that sacrifice returns as well, so this is a way that you don't give up any equity exposure whatsoever, but you're able to reduce your volatility through currency reduction.\nGot it. Well, Dan, I really appreciate your time with me and congratulations on the success with this product. I mean, it's had a consistently five star morning star rating.\nYou know, good flows of performance over the last year, given how over the last five years, given how, you know, week international has been the products performed performed very, very well.\nSo before I let you go, where can people learn more about this product and new work life is a whole.\nSo NYL investments dot com is the is a home page and just same same website and why NYL investments dot com slash h of x i will get to the page for the fun.\nWell, again, Dan, thanks so much for being here.\nThanks, Brad appreciate being off.\n"}
