{"id": "16846928", "transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology, they are run on and you want more customization and flexibility.\nAs well as a AI-driven model marketplace, UX wealth partners is your destination.\nOn top of that, they have institutional trading.\nSo if you are an ETF issuer or an SMA provider looking for outsourced institutional trading, UX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and make your practice more efficient.\nWelcome to Behind the ticker.\nToday we have on Jeff Colin.\nHe is from Shafer and Colin.\nAnd we were talking about their newly issued ETF, the enhanced equity income ETF.\nThis is a covered call strategy yet it's quite different than some of the other covered call strategies you might be familiar with.\nIt buys individual dividend paying stocks and combines that dividend income with the option premium.\nAdditionally, the strategy has been run for a well over a decade and they are bringing it to us in an ETF wrapper.\nSo without further ado, please enjoy this conversation with Mr. Jeff Colin.\nHey Jeff, welcome to the show.\nHey Brad.\nIt's great to be here.\nThanks for having me on today.\nSo before we get started, I want to give everybody a bit about your background and your role over at Shaefer Colin.\nYeah.\nMy background is been in the business for 30 plus years.\nI started out on a mutual fund sales desk for paying Weber when they were still paying Weber.\nAnd we talked in New Jersey, which is not part of UBS.\nAnd it was a great career to start out with.\nIt was a great place to get trained.\nAnd I've been involved in sales and marketing.\nI'd asked it management firms and broker dealers for the rest of my career.\nFor Shaefer Colin for the last 13 years, I actually worked at Bank for American Merrill Lynch,\nwhere I sort of ran a product for them in the SMA world ETFs, mutual funds and insurance opportunities.\nAnd then with the BVA and Merrill Lynch kind of came together.\nI read some offshore funds for them before joining Shaefer Colin.\nSo always an investment.\nIt's been a great industry and really like being in being in it.\nYeah.\nSo as with you and I were joking, before we got on you, you're prepared for the any hobbies.\nThings you like to do outside of work question.\nSometimes people get a little taken off guard.\nSo what do you like to do when you're not behind the desk or working or running around?\nYeah.\nI actually spent a lot.\nI like exercising.\nSo I like the outdoors and exercising.\nSo my wife and I usually kind of work out together, whether it's Jim or go for walks or for\nhikes, snump showing what have you.\nWhen I have a little Jeff time, I like to fish.\nI say fish, golf and skiing would probably be the three.\nI love fishing.\nIt's just I could lead my phone in the car and just kind of go out there and just relax\nwith nature.\nIt's really, really nice.\nSo those are the kinds of the areas that I like to spend time when I have some free time.\nAll types of fishing or you fly fishermen like I need to graduate.\nI probably from just the classic lake pond.\nI had I grew up in Pennsylvania.\nI need Jersey, but we had a house in Pennsylvania.\nSo we fish off the dock for years.\nAnd I just, yeah, I've just thrown a canoe kayak in, going out in the middle of the lake and try to\nreel at something special that she doesn't happen.\nBut I enjoy going anyway.\nYeah, I grew up in rural Pennsylvania.\nWe, you know, getting the water and fish all the time.\nBut now living in Pittsburgh.\nI don't know if I want to catch any of the fish in the Mont River over here.\nWho knows what'll come out of there.\nBut I'd like to get back to it at some point.\nBut anyways, back to business.\nCan you just talk about Schaefer calling is a whole.\nWhat do you guys do to help clients?\nI know you have the TF, which we're going to talk about at length today.\nBut you guys do a lot.\nYou have a great history.\nSo could you just talk about the firm a little bit?\nYeah, Schaefer calls actually celebrating its 40th year of being in business.\nWe are, you know, we got the car ourselves of boutique asset manager.\nBut the reality is we're a midsize firm.\nWe managed 24 billion in assets.\nWe have 67 people who work at the firm.\nBut we have one style investing and it's, it's, it's, it's basically\nIt's low PE's kind of valuation perspective.\nAnd, you know, pretty much we're known in the industry as a value\nInvestor with a focus on dividends.\nAnd those are the main strategies that we kind of run for clients.\nBut we are, we've been in business for 40 years.\nWe run mostly, secondly, managed accounts.\nWe have a mutual fund sleeve of portfolios that mirror the\nSecondly, managed accounts.\nWe have some offshore use it.\nAnd, you know, we just started to get involved with the, with the ETF by launching\nOur, an active ETF of a colon strategy that we've run for 13 years in SMA.\nSo that's kind of the history that we have firms based in New York.\nBut yeah, people and local sales and marketing people scattered around the US\nTo meet with advisors.\nWell, we're here.\nWe're here definitely to talk about the ETF.\nAnd so you would recently launched, as you said, off of an existing SMA,\nThe colon enhanced equity income ETF, ticker, DIVP.\nCan you just dive right into it, explain kind of what the primary investment\nStrategy is here?\nYeah.\nOn the strategy, it focuses on basically owning between 30 and 40 large cap value\ndividend paying securities.\nAnd then what we simply do is we write covered calls,\nSelective covered calls on between 25 and 40% of those underlying stocks.\nSo the portfolio today has 32 stockholders in it.\nThey're large to mega cap, diversified companies that almost everyone will know.\nAnd then we simply look for volatility in those 32 names in the options market\nTo see what names we can write on to get good options premium for those underlying equities.\nThe options that we're writing are all short term from two weeks to one month.\nThey're always out of the money between two and say four percent.\nAnd that will change depending on the stock and we're going to write on the volatility.\nAnd we just rinse and repeat that each and every month.\nSo since the options are typically two months, two weeks to one month,\nyou know, we're just rewriting options on a continual basis each and every month.\nThe nice part is by writing on the individual securities.\nThere's always something going on like today.\nYou know, there's news and headlines in the Middle East and the energy stocks are up for example today.\nSo they'll probably write on or they may write on some of the energy names if they feel like they can get option premium.\nBut the strategy is run for income.\nSo if the combination of dividend income and then options premium when you add the two together,\nyou get this income level that we're we're seeking.\nWe've run the strategy for 14 years in a separately managed account.\nAnd because we're writing options on the underlying names,\nthe minimum on the separately managed accounts a little higher than most advisors are used to.\nIt's a $250,000 minimum per account.\nSo a lot of advisors have come to us.\nWe have $1.8 billion in the strategy right now.\nSo $1.8 billion in this 14 year separately managed accounts strategy and advisors came and said,\nLook, I want to use the strategy in IRA accounts.\nI want to use it in smaller accounts.\nI want to use it as an allocation in my fixed income portfolio for additional income.\nCan you make an ETF out of it?\nBecause it's easier to implement and I can get it at a lower minimum.\nSo we did.\nWe launched it.\nWe just came upon a year's anniversary this past March right now.\nAnd all things are kind of clicking.\nNo, it's it's great.\nSo you briefly mentioned some of the other kind of covered called strategies.\nWe've seen a lot of kind of innovation in the ETF industry,\nwhether it be covered call strategies, whether it be buffers, whether it be zero downsides.\nAnd this is a little bit of a different flavor than traditional covered call strategies in my right.\nYou are.\nYou are most of the covered call strategies that are on the market and have raised a lot of money.\nThey all buy a certain grouping of stocks.\nWhatever that may be or they're cloning in index.\nAnd then they're writing on it underlying index.\nSo they're either writing options on the S&P 500 or the writing options on the QQQ.\nOr puts on it whatever they might be doing.\nBut usually it's the options around the index and not the individual names.\nSo you mentioned you're targeting 30 to 40 large cap names people would know.\nSo could you kind of describe what that screening process looks like?\nLike is there a certain thing you're absolutely looking for when you're starting to add an answer to this portfolio?\nYeah, with the portfolio management team looks for.\nIs there going to screen by lower valuation?\nSo we typically screen for lower PE stocks then are in the Russell 1000 value index at the moment.\nWe're going to look for a dividend yield probably greater than 3%.\nIt's usually about 3% or higher we want a dividend yield.\nBut we also want dividend growth, right?\nSo we don't want to buy just low yielders and high dividend.\nI'm sorry low PE ratio stocks and high dividend yielders.\nYou're going to wind up in just like utilities or some energy.\nWhat we look for is a combination of the three.\nWe want lower PE stocks compared to their historical norm.\nSo for example, we're not going to compare utility to a technology stock for PE ratios.\nIt's going to be XYZ stocks.\nThe historical PE ratio is 25 and right now it's trading at 18 with this market correction.\nAnd the dividend yield is now 3.4% or something like that.\nThat becomes attractive to us.\nWe want to see earnings growth from the company.\nWe want to see expansion.\nWe want to see reasons why the earnings are going to rise.\nAnd then we want to see is dividend growth and that particular stock coming from the earnings growth in a company.\nWe don't want them to do fancy financial engineering and borrow debt in order to fuel a fund a dividend payment.\nWe want that combination of three low PE dividend yield and dividend growth.\nSo once though and then you want to diversify portfolio.\nBecause if you're writing options on only two sectors, right?\nIf your valuation brings you to owning say staples, utilities and energy,\nthen that means I have to write or the team has to write options only in those three options.\nWell, there's no in those three sectors.\nSo if there's no volatility, you can't get good options premium.\nSo the portfolio managers build a diversified portfolio.\nThere's holding is holding is an each sector of the S&P 500.\nAnd then that gives them more availability to write options on.\nSo it's those combinations of the three.\nAnd the underlying stocks, Brad, are picked first.\nSo they're picked from a fundamental perspective that we think those stocks are going to go up in stock price period.\nAfter that, those stocks are handed to the options portfolio manager who looks at them and is looking for that volatility.\nSo he's going to look at that and say,\nWell, are we willing to lose XYZ stock?\nLet me choose an example of XY mobile.\nAre we willing to lose XY mobile?\nAnd if we don't think the stocks are going to appreciate,\nwe'll write an option on it if we can get a good options premium.\nIf the stock's going to effects on mode was going to pay a dividend,\nwe're not going to write on it because we want to collect that dividend,\nthe strategies run for income.\nSo we want to collect that dividend.\nA lot of times the portfolio managers,\nbecause I mentioned we buy the stocks because we think they're going to appreciate first.\nA lot of times they will write half positions.\nRight.\nSo we'll write on half the stock.\nSo effects on mobile.\nBut volatility in the Middle East happens or there's a good earnings on XY mobile.\nWe still have half the positions.\nAnd if we get called away, we're only losing half the position on being called away.\nSo they're very thoughtful on how they pick the underlying stocks.\nAnd then how they do the options overlay.\nSo a couple of questions out of that.\nFirst would be how often or you kind of running this fundamental screen\nadding removing names.\nI know the portfolios active, but is it on a regular cadence?\nYeah.\nThe teams are always looking for new names.\nThe reality is the underlying names in the 30 to 40 stocks we own.\nTurnovers about 15%.\nRight.\nIt doesn't change that much.\nAnd that is simply because you need that dividend yield.\nSo we, you know, it's not like a company decides to start a dividend today\nand they yield 4%.\nThey start a dividend at 1%.\nThey sort of graduate their way up.\nSo what we find is there's a lot of stocks we have in the pipeline\nas they're moving up in dividend yields.\nBut sometimes they have lofty valuations.\nSo their valuations are a little higher than we want to pay.\nSo we are patient.\nSo that, that underlying turnover at those names is probably about 15%.\nNow, in the strategy because you're writing options on those names,\nwe are called a way.\nI mean, we're called a way probably a third of the time.\nMany times, and most of the time,\nmost of the time, we usually buy the same stockback.\nSo if we wrote on Xon, we got a good option premium.\nWe got half the position called a way.\nWe'll likely write on it back, or we'll wait for Xon,\nmaybe if we thought it might trend down a little bit,\nor if we had really robust earnings,\nand it shot through, and maybe trades back,\nwe'll add back to it.\nOtherwise, we might move on and then buy Chevron,\nor buy another energy kind of position.\nSo that turnover, that leads to higher turnover\nin the overall portfolio, the enhanced equity income\nbecause of the options.\nBut the underlying names to your main point is probably about 15%.\nGot it.\nAnd then you mentioned kind of ensuring diversity\nwithin kind of sector landscape,\nso you have better diversified portfolio\nother than just utilities and some of the normal things\nwe would see in traditional value.\nSo are there any guardrails on kind of maximum sector exposure\nthat maybe you're capping utilities at 20%.\nLike is that a hard and fast role?\nI'm just making that number up, but we do.\nWe have sort of guidelines that exist exactly that.\nI think it's 20%.\nAnyone sector at cost, so it just,\nthe only sectors that usually would be around that range\nfor us as value investors tend to be financials, health care,\nindustrials.\nI don't think we have any sector right now,\nabove 20, most of the weightings are somewhere on 17,\nI think industrials is probably our highest at this point in time.\nBut no, I think those are the largest kind of weighting sectors\non position size.\nI've seen the portfolio,\nI don't see us going above 5%.\nAnyone position, when I look at the stock,\nwe have in here most of the weightings around 3.4,\n3.5%.\nAnd what happens in these situations is\nthe stocks are to run up,\nyou know, think about the scenario here.\nYou know, again, I'll use XI mobile as the example.\nI don't have the stock price in front of me,\nbut say the stock kind of runs up,\nand we'll use you what happens is stocks are to run up\nthe PE ratio then moves with it until they have earnings\nannouncement.\nThe yield goes down because the stocks are appreciating\nand they have increased their dividend yield,\nthen usually earnings come out.\nThey announce some kind of dividend increase,\nright?\nWe want dividend growth,\nthat then pushes up the dividend yield,\npushes down the PE ratio.\nSo you sort of have to be patient\non these positions and let them play up.\nThese are large mega cap,\nyou know, again, as I mentioned,\nhousehold names that we think can appreciate\nand we believe will appreciate and in price over time.\nBecause otherwise, you're just chasing yield.\nIf you're just chasing yield,\nyou can do that.\nAnd there's a lot of ETFs to do that.\nIt's just not what we do.\nYeah.\nSo you're getting two sources of income here.\nYou're getting the covered calls and you're getting,\nyou know, the dividend income here.\nSo how does that combination of dividends\nas well as covered calls kind of enhance\nthe income potential for investors?\nOkay.\nSo again, the way we do it is we,\nwe get about,\nI'm going to talk about the separately magic count\nas a baseline here.\nAnd we get about 4 to 4.3% on average,\non average, over the course of the last 14 years,\nin dividend yield.\nSo the underlying stocks we have historically,\nwhen we look at the separately magic count,\nit's called between 4 to 4.3%\nand you're getting from dividend yield.\nThe options premium is then added on top of that.\nAnd now,\nlook at any market volatility\nto get good options premium.\nOtherwise, you're just kind of writing options\nand getting called away.\nSo like, what's happening here today for us\nis great.\nThis market volatility in the headline news\nwith everything coming out of the administration\ncreates good opportunities for us.\nBut that historical yield has range between,\nsay, 3% to 3.5%\nso when I look at the separately magic count\nand aggregate on each particular year,\nwe have range of the last 14 years\nbetween 7.2 and 8.3 total yield.\nOf that 8.7 to 8.3 yield,\nabout 55% has come from dividends,\nwhich are taxed as qualified dividends,\nright? The lower tax rate, their QDI,\nand the other half is coming from options premium income,\nwhich is taxed as short-term capital gain\nor ordinary income,\nwhich is different than you'll find\nin some of the other ETFs that exist\nand just write in the index.\nNow again, we can generate,\nand so the yield range in the separately magic count,\nthat 7.2 to 8.3,\nwe can,\nthat can weaken the team to generate 10 on the yield,\nif they wanted to.\nYou're just going to write on everything,\nand you're going to want to be called away at times.\nSo you generate income,\nbut you give up total return.\nSo we're trying to give you that combination of both.\nGet good income for you,\nparticipate in the upside-words there,\nand then you also have that downside benefit,\nwhich is actually showing super well for our portfolio this year.\nWe have the valuation discipline first,\nthat helps on the downside kind of captured.\nThen on top of that,\nwe have different yield,\nand then on top of that,\nyou have option preview income.\nSo there's a lot of downside help.\nWe don't do buffers,\nwe don't do puts in these strategies,\nwe've looked at it,\nthey're expensive,\nthey kind of,\nthey work for people,\nthey kind of corral you in certain ranges,\nand we don't really want to do that.\nWe just want to say that this strategy actually\nis where advisors have done this for decades.\nThis is a corner office,\nfinancial advisor,\nstrategy that they do,\nand they still may be dope,\nwhere they just bone large mega cap stocks,\nand they write options for their clients.\nIt just became owners to do,\nso we made it to a package product for people.\nSo you brought up a,\nyou bring up an interesting point there,\nin terms of,\nkind of what is a key performance indicator for you,\nbecause you guys are looking at valuations,\nyou one stocks to appreciate,\nobviously,\nand you want the yield,\nso it's got to be some sort of dynamic mix\nbetween consistent yielding income,\nbut also,\nyou know,\nyou're not looking at,\nyou know,\nnow the appreciation as an indicator here.\nSo how do you guys view performance\nwhen you're running a strategy like this?\nWell,\nwe want to do is deliver what we basically,\nit struck clients that we wanted to,\nto deliver for the strategy,\nwhich is on this strategy,\nit's focused on income generation.\nSo it's first and foremost,\nit's trying to generate that 7%\nin our separately mentioned count,\nand higher yield,\nwhich we've been able to do for the last 14 years.\nSo that's sort of key.\nThat's what we tell people,\nthat's how they use it in portfolios.\nWe see a lot of financial advisors will use it in IRA counts.\nThey use it as a way to generate income.\nBut then,\nhave the ability to be in equities that can appreciate\nfor you and dividend growth, right?\nA great way to flight inflation is through dividend growth.\nIf you own just the bond,\nyou're stuck with your principal coming back to you.\nAnd you generate the income,\nbut you don't really get the chance for any kind of appreciation\non that overtime.\nSo that is sort of how advisors kind of focus on it.\nBut in an upmarket,\nwe will have appreciation beyond the income, right?\nSo if we just generated folks on generating income,\nthey average return in the portfolio,\nit might be say 7%.\nThe percent will be the logical number here.\nBut we have some years where the portfolio's been up 21%.\nIf the market's up 31%.\nIt depends what's moving the market.\nSo far this year,\nthis is obviously recording in 2025.\nYou have a lot of the NASDAQ market sort of getting hit,\nbut you have dividend payers actually positive this year.\nAnd we've been participating in that.\nSo profile is income generation and\nthe ability for total return from the underlying stocks.\nBecause you have to figure out the math here.\nIf we own 32 stocks,\nand we write on average on 33% of the portfolio.\nSo now technically we're writing on say around nine names.\nAnd I told you we wrote, we write half positions, etc.\nBut just say we did full rights.\nYou're being written on nine names,\nand you're only called away 25 to 40% of the time.\nSo I'm really only losing four or five stocks\nif they get called away,\nif they break through strike price.\nSo you still have all those other stocks that have the chance for appreciation.\nYeah.\nSo we talk about a market environment,\nwhich could be pretty good for you,\nwhich is, you know, you have a little bit of volatility.\nMake a cap value names are doing well.\nYou're collecting dividend yield.\nWhat sort of market is not ideal?\nI'm guessing almost little to no volatility in sideways.\nIs that what that be?\nNo, no bueno.\nThat's pretty accurate.\nI would say,\nactually a fast rolling market that we've gone through\nis also poses its challenges.\nBecause in a fast rolling market,\nsometimes people just want to own the stock\nversus buying the option.\nSo you actually need volatility.\nSo a straight up market,\nwhile good for total return,\nwhich we'll participate in,\nmakes the option writing a little bit more difficult.\nAnd a sharp down market, same thing.\nBut you don't remember,\ninvestors are always sort of betting\none way or the other constantly.\nAnd that's why writing one month options\ngives us that flexibility.\nYou might have pull back and, again,\njust to say,\nExxonMobile,\nyou'll have half the people thing that's going to go down.\nYou have half the people thing that's going to go up.\nSo you have someone who's usually a buyer for\nour positions on what we do.\nA sweet spot to your point is sort of now.\nYou have sort of this headline\nrisk.\nThere's volatility.\nThere's a bit of a push toward\nconservative value investing\nfrom the go-go growth that's been on the Nasdaq\nand the S&P.\nAnd that creates a good blend.\nAnd the way I like it,\nis our firm is a value-oriented investment.\nSo we manage non-cover-call option\nstrategies as well.\nAnd we're often used as a blend with\na growth manager for our financial advisors\nthat have used us for decades.\nAnd that's how we're reviewing the same thing.\nWhile many of the popular ETFs\nthat you cover call writing today,\nthey tend to be S&P 500-oriented\nor Nasdaq-oriented.\nWe're the value-side equation.\nWe actually blend super well with them.\nSo people are using those.\nGreat. They work super well.\nI would have them think about us\nand look at what's kind of happened with the pullback\nand the Nasdaq specifically.\nSo well, maybe I should take a portion\nof what I own in some of these.\nIt allocated the DIVP as a value-play.\nNo different than I do,\nmy normal core value-style investing growth and value.\nSo we're not only manager,\nI know about it on the value-side equation\nthat's doing cover call writing.\nAnd we're not doing it on an index.\nWe're actually doing all of those individual names that I mentioned.\nYeah.\nSo who would be ideal for this?\nIf there's an investor out there\nthat is just perfect for this?\nWho would that person be?\nIt's a great question.\nI know we're in a podcast here.\nI'm smiling, but as short answer\nis anyone in these income?\nI mean, at the short, the short answer is,\nlook, if you're looking for income generation,\nwhat I find a lot of financial advisors will do\nis they do a great job of blending all things together.\nThey use loan participation notes.\nThey're using CDs.\nThey're doing individual bonds.\nThey're doing monies.\nAnd now they're getting access to some of these other\ncolumn income-producing ETFs\nthat can generate good yield for them.\nBut I think they're starting to see\nthat there's actually underlying holdings\nthat could be volatile out in there.\nSo for us, I think this works great for anyone\nthat needs income.\nAnd they are okay with some equity volatility\nfrom household, large cab value, dividend names.\nBecause look at the breadth.\nThe market goes down.\nThese stocks are going to go down with it.\nSo it's not like a fixed income.\nIt's more risky than fixed income.\nBut you know, you're sort of liking it to jump on\na little bit.\nIt's probably risky in jump bonds\nbecause you actually own the equities.\nBut you know, when people are doing allocation\nin jump bonds, they want more yield\nto take in an equity-like characteristics.\nAnd this is sort of in that sort of vein.\nI see a lot of financial advisors using it\nfor the three-prong approach too, right?\nBecause right now I told you\nour underlying dividend yield\nand the portfolio might be 4.2%.\nBut we don't change those stocks underlying\nthat often.\nAnd those companies, historically,\nhave increased their dividends\nin our portfolio on average somewhere around 68%.\nSo that 4.2% yield for you\nif you stick with us\nstarts to increase over time\nas each of those companies increase the amount of dividends\nthey're paying.\nAnd then we're just kind of writing\nand covered calls on it.\nSo it's this decent way for people\nto have a nice conservative equity\nand come strategy with a focus on income\nand conservative equity.\nAnd that's sort of where a\ncan blend in portfolios for advisors.\nSure.\nSo maybe maybe a little bit of inside\nbaseball here.\nBut you guys, you know,\nI've run very successful\nlong-term track record SMAs.\nYou do uses.\nYou do the mutual funds.\nYou've been in the, what we call\nthe ETF Thunderdome now\nfor about a year.\nHow's it different?\nHow's it going?\nHow are you thinking about getting\nthis thing into advisor's hands?\nMe.\nI could say like,\nI've made a lot of product\nover my life.\nI kind of went through the\nhistory of places I've worked.\nI've made mutual funds.\nYou sit SMAs.\nYou amazed.\nThe ETF wrapper is just\nvery good.\nThere's no ways to\ndo.\nI can't.\nI almost can't take the other\nside of the argument.\nI mean, it's been written\nabout over and over how\nan ETF is sort of better than\na mutual fund.\nI'm almost starting to think\nit's just as good as\na separate manager count.\nI mean, it is really\nwell run.\nWe don't have cash drag.\nYou have creation stocks\nthat are handed to us.\nWe can do custom baskets\nto remove capital gains.\nWe can run it at low cash.\nIt is very, very effective.\nVery effective.\nSo that is one of the main\nreasons we made this particular\nstrategy.\nWe managed about 13 different\nseparate manager counts.\nWe picked this one\nspecifically because it's easy\nto implement in and a\ndivisor is you may\ncounter or a broker\nto count where you just\nwant to own a sleeve of\nsomething.\nVery, very easy to implement\nacross the board.\nVersus the paperwork and everything\nthat goes involved with\na separate manager count.\nSo I I have spent a lot\ntime figuring out what other\nyou should launch into ETFs.\nAnd I have a laundry list.\nSort of the issue is\nit becomes a little\nchicken the egg.\nMost of the major firms.\nWe have $1.8 billion\nas I mentioned in the\nseparate manager count strategy.\nThe ETF version has to\nreach a certain threshold\nand assets in order to be\nactivated at a lot of the\nmajor warehouse firms.\nThey have these internal\nmandates.\nSo I know that when we hit\nthese strategies, we've been\ntalking to them.\nThey're very active.\nThey're very interested in\ncreating it for us.\nSo for any financial\nadvisors that, you know,\nhave familiar\nout of it with our\nseparate major count.\nETF hopefully\nwould be coming to your platform.\nBut in the meantime,\nyou sort of have to go\ndown that path.\nSo I want to make more ETFs\nhere.\nI'm sort of waiting to see\nhow this SEC ruling\ncomes out on share\nclasses on a mutual fund.\nIt makes a lot of\nsense for an active manager\nto sort of wait to see\nif just adding a share\nclass of an ETF share\nclass to an existing mutual fund.\nWould make it more\noperationally\nefficient and easier to work\nto work with the\nwarehouse platforms and the\nregional BDs and the\nRIAs that we work with\nwith the funds are already\navailable.\nSo we're definitely\nmaking more ETF\nshare classes.\nWe're just going to wait\na little bit to see\nhow best to do it\nin the timing.\nBecause if you make\nan individual share\nETF from scratch,\nyou start from zero\nwhere it make\nmore sense for us.\nBut that's our plan.\nIt's to sort of add\nat ETF share classes.\nAnd you can see\nclearly as\nday.\nThis is sort of\nthe future.\nWe've come from a couple\nof different conferences.\nYou asked me how it's been.\nI got to ask to say I love it.\nThere's a huge group of people\nwho only do ETFs, right?\nSo we might, they might love\nwhat we do.\nBut if they don't, we don't\nmake it available in the\nvehicle. They like to\nimplement it in.\nThey're sort of missing out.\nAnd I've met not only\nyourself here from a\nconference, but I've met\ntons of people that are\njust doing ETF only.\nAnd it's really an\ninteresting platform.\nAnd I've also\nreally come to\nlove how open the ETF\ncommunity is to\nanother.\nAnd I've met for\nfirms who do what we do.\nExactly what we do.\nAnd we will share information.\nAnd that doesn't happen a lot\nin some of the other areas\nthat I work with.\nAnd it's been refreshing.\nAnd it's sort of\nthrow back to the 1990s when\nI first started to work.\nVery collegiate.\nVery cooperative.\nAnd it's been really fun.\nYeah, and you know, it's\ninteresting.\nI've had this conversation actually\non the show multiple times.\nIt's it's a unique community\nbecause if you've been in\nthe other parts of the business\nlike we have been.\nYou know, it's it's a\nlittle bit more cutthroat.\nThis seems more.\nHey, how can I help you?\nHow can you help me?\nHow can we?\nYou know, network do things\ntogether, collaborate?\nAnd yeah, it's been refreshing.\nBut Jeff, I really\nappreciate your time.\nI think I think this is going\nto be a well received product.\nI know you've got a year under\nyour belt.\nAnd before I let you go,\nthough, where can people\nlearn more about the firm?\nWhere can they find information\non the ETF?\nYeah, anyone who's interested\nthey can go to\nwww.colonfunds.com.\nThat's www.colonfunds.com.\nThere's areas there that\nyou'll have a local\nwholesaler's name will pop up.\nYou can click on that.\nMy personal email.\nI mean, where working\nmail is Jeff Colon at\nShea for a hyphen.colon.com.\nSo people can reach out\nto me directly.\nBe happy to talk to\nabout it.\nThat might be of a stake.\nDoing that Bradwell.\nHopefully no bot.\nAnd I'll send it to the show.\nWe're excited about the ETF and\nI'm glad to talk to anyone about it.\nSo you can get my contact\ninformation through there.\nButcolonfunds.com or info\natcolonfunds.com.\nTake care again as\nDIVP.\nThe reason we call the DIVP is\nDIV for dividends and\nP for premium.\nSo we thought it'd be easy\nto mention what's we kind of\nget that people said.\nIt's DIVP.\nThat's how we refer to it.\nAnd happy to talk to\nanyone who's interested.\nSo appreciate being on\nyour podcast here Brad\nand appreciate questions you\nhave for me today.\nAll right, Jeff.\nThanks so much.\nThank you.\n"}
