{"id": "16875452", "transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology, they are run on and you want more customization and flexibility.\nAs well as a AI-driven model marketplace, UX wealth partners is your destination.\nOn top of that, they have institutional trading.\nSo if you are an ETF issuer or an SMA provider looking for outsourced institutional trading, UX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and make your practice more efficient.\nWelcome to Behind the ticker.\nToday we have on Matt Kaufman, he is the head of ETFs at Calamose Investments.\nAnd we are talking about their latest innovation, which is a suite of protected Bitcoin ETFs.\nGot 100% downside, which is CBOJ, 10% at risk, which is CBTJ and 20% at risk CBTX.\nMatt and I talked for about 20 minutes on how these portfolios are constructed, how they work and who are they best utilize for.\nI think they're timing with these products is excellent.\nSo without further ado, please welcome Mr. Matt Kaufman.\nAnd we are live from the Exchange ETF conference.\nI'm here with Matt Kaufman from Calamose.\nMatt, welcome back to the show.\nThanks, Brad.\nThanks for having me in Las Vegas.\nNot Miami this year.\nYeah.\nI mean, it's still nice here, but for me as an East Coaster, I think I'd rather take the short flight than the long flight.\nBut it's great.\nYou'll take the humidity and the short flight versus the dry temperate climate.\nPlus, all the money I'll probably lose at the blackjack.\nOkay, well fair enough.\nSo why don't you briefly just refresh everybody on who you are, what you do and a little bit about Calamose is a whole.\nSure. So Matt Kaufman, I'm the head of ETFs at Calamose investments.\nFor those not familiar with Calamose, Calamose is about a 50 year old risk manager, largely built on a foundation of convertible bonds.\nSo if you're not familiar for those listening with a convertible bond, it combines a call option, you know, upside option of a company.\nAnd it ties it to its fixed income counterpart or its corporate bond.\nSo what you end up with is the upside of a stock and good markets and then you've got a bond floor.\nIf that, you know, stock stops performing, you've got a built in bond floor.\nSo Calamose was built in the 70s, 1977, just a few years after the Chicago board options exchange was founded.\nAnd it was, again, largely on convertible bonds where the largest converts manager in the United States.\nAnd one of the largest alt managers largely on the back of the market neutral income fund, which is one of the largest alt mutual funds in the country.\nSo I said the mutual fund weren't worth on an ETF podcast here.\nBut as we moved into ETFs, Calamose is now in the ETF space.\nWe've been at it for about two years now.\nAnd we have a lot of risk management products, as you might expect.\nWe built the world's first one year, 100% principle protected ETFs on the S&P 500, the Russell 2000, the NASDAQ 100.\nSo I think you and I spoke about that about a year ago.\nYou know, it had a lot of great reception on those.\nWe've launched a few other ETFs into the market since then.\nWe've a convert ETF that's performing very well.\nBut we've launched a what I would call synthetic convertible strategy where we buy call options on stocks in the NASDAQ 100.\nAnd then we pick our own bonds.\nWe've got an actively managed bond portfolio.\nThat is one of if not my favorite ETF in our lineup.\nWe've outperform the Qs since inception last year with less risk.\nSo it's performing very well delivering exactly as we expected.\nAnd then the newer newest offering that we just brought to market was protected Bitcoin.\nSo you can now get the exposure to Bitcoin with built-in protection.\nThe way that we talk about that is you can now get that with a safety net.\nYou have 0% downside risk.\nYou can choose to put 10% at risk or 20% at risk.\nAnd then your upside opportunity just varies and goes up based off of how much you're willing to put at risk.\nYou know, as we're in Vegas, you're talking about it.\nYou can see, you know, risk reward trade offs.\nYou know, with how much you put at risk and how much upside you can obtain.\nNot that that's gambling by any means, but that's an investment.\nYeah.\nI mean, and that's what we're here to talk about today is these new structured Bitcoin products.\nI joke with you when you got here.\nI said, I had a feeling these were coming.\nSo it kind of a high level.\nCan you explain what these structured all protection ETFs are and how they work?\nYeah, last time we spoke, we were talking about doing these on very broad liquid underlines.\nLike the S&P NASDAQ 100 Russell 2000.\nSo believe it or not, Bitcoin is now one of those assets.\nBitcoin is the seventh largest asset in the world.\nIt's almost $2 trillion.\nIf you view it by commodity standards, it just passed silver.\nSilver is about 1.7, 1.8.\nBitcoin's about 2 trillion.\nIf you put gold, gold is number one.\nAnd gold is about $18 trillion asset.\nBut all that to say is we now check the boxes for the ability to.\nWhat I would say safely deliver a hedged version of Bitcoin.\nIt's a $100 billion ETF market.\nThere's liquid options on those ETPs now.\nYou know, a short story on those is the ETP options.\nLike I bit FBTC.\nThose all have position limits.\nAnd so you really can't build an ETF using those options today.\nBut what we ended up doing is we worked with CBO Chicago Board Options Exchange.\nAnd they built an index that was primarily to be used by these ETFs,\nby the Bitcoin ETFs that we built.\nAnd that index tracks the underlying of the 11 spot Bitcoin ETPs in the market.\nSo what you end up with is about 100% correlation to the price of Bitcoin.\nAnd we can deliver options on that index.\nAnd so now we've built a framework so that you can now access Bitcoin\nin a risk-managed way.\nAnd there's a whole host of implications\nand why you would do that.\nYeah. And so, you know, it's obvious,\nBitcoin is known for its volatility.\nSo these structured protection ETFs really are for that client\nwho probably wants exposure to the asset class,\nbut is scared of that crypto winner that seems to come every so often.\nYeah, the crypto winters seem to come every fourth year.\nAnd I think we're in the third year of four.\nAnd so if you're a student of history or you think that it repeats itself,\nthen, you know, that could be a reason to enter into a protected version of Bitcoin.\nI think we're down 20% since we launched CBOJ,\nwhich was our 100% protected series.\nAnd the ETF work exactly as we expected.\nIt protected investors from nearly all of that loss.\nIt will be all of that loss protection.\nIf you hold to the end of the one year out-comperiod,\nI think CBOJ's down about 1% right now,\nwhile Bitcoin's down about 20%.\nBut as far as the application points go,\nyou know, you think of 0% down side,\n10% down side or 20% down side.\nAnd then the upside caps that we're seeing right now for a 20% floor.\nSo 20% at risk may give you a 50 to 55% upside cap rate.\nSo really significant upside relative to Bitcoin with a 20% floor.\nThe 10 floor, maybe about a 30 cap.\nAnd then the zero floor, it's about a 12% upside right now.\nAnd so yeah, you mentioned a three.\nSo we have CBOJ, CBOJ in CBOJ.\nSo CBOJ is the 100% down side protection.\nYou kind of, can we go a little bit deeper?\nSo when we're looking at the underlying holdings,\nhow is this thing constructed in order to deliver this protection?\nI know it uses options, but can you just kind of go into that a little bit?\nYeah, so we can just recreate that 100% protection product.\nYou have pretend like I give you 100 dollars or we spend 100% of the portfolio value.\nThere's no leverage or anything in the products,\nbut we'll spend about 96% goes into US treasuries.\nAnd those are zero coupon bonds.\nSo they're not paying you any interest or any income.\nBut the interest rate, so let's say interest rates about 4% today.\nThe price that you pay is discounted by the amount that you'll receive over the life of those bonds.\nSo that's why it's 96% and not 100%.\nSo we spend about 96 dollars on those zero coupon bonds.\nAnd that gives us about four dollars or four percent to play with.\nAnd I'm going to buy a call spread on Bitcoin.\nThat's worth four dollars.\nSo the way that we would do that is we buying at the money call on that Bitcoin index.\nAgain, as we were talking about, that's an expensive call option.\nBitcoin's volatile, that's going to cost you about 25%.\nYou know, you've already spent 96% of your money.\nSo you're going to blow your budget.\nSo the way you bring that back in line is to sell out and out of the money call on that Bitcoin index to collect 21%.\nAnd the difference is 4% that 4% that you're collecting from your treasury bonds.\nSo that whole package works together to deliver a 100% protected experience over a one year out compared.\nAnd then for the 90% protection of the 10th floor.\nInstead of 96% and bonds, we'll hold about 86% and then 76% for the 80.\nIt makes a ton of sense to me.\nSo let's talk about how markets can impact, you know, these ETFs.\nThe structure doesn't change.\nIt's buying hold.\nYou're flipping it at the end of the year.\nBut for example, if Bitcoin experiences, you know, a really sharp decline.\nLet's start there.\nIs there any, do you have any sort of arbitrage in the product?\nIf you may be by later into the one year.\nAnd I know we talked about this with the index or the equity version.\nBut I think we should refresh everybody's memory.\nIt is point to point.\nSo it can react somewhat differently in the middle of the outcome period.\nSo can you let's start with sharp decline.\nBitcoins down 20%.\nYou know, what can investors expect holding these products?\nYeah, I think understanding that starts with an understanding of what a floor actually is.\nSo there's floors and you might be familiar with a buffer.\nSo a buffer is going to protect you from the first set of losses.\nSo if you have a 10% buffer, you're going to be protected from 0 to 10.\nAnd then you're exposed from minus 10 to minus 100.\nSo you have 90% at risk.\nA floor is the inverse.\nA floor is going to expose you to the first 10% of loss.\nAnd then you're protected from minus 10 to minus 100.\nSo that's why I say this allows you to choose how much to put at risk.\nNo going ahead of time going into Bitcoin, how much I'm going to put at risk.\nThe reason that you want to do a floor and not a buffer is largely because of the history of returns of Bitcoin.\nIt's extremely volatile.\nIf you look at the returns of the S&P, it looks like a traditional bell.\nYou've got most of your returns around that 0 to 20% mark.\nSome 40% or more, a little bit of fat left tail.\nYou go to Bitcoin.\nIt's exactly the opposite.\nIt looks like a smile and not a bell.\nIt's all 40% or more up 40% or more down.\nSo you want to know that you've got significant protection.\nSo now that we kind of set that framework, we can answer the question.\nSo if Bitcoin falls significantly, you know that you have a floor in place.\nAnd what I, these are point to point products.\nIf you buy it at the beginning, you know what your outcome is.\nBut you can buy in anytime the market's open.\nYou can go to our website, calmos.com.\nYou can see where each of these are trading.\nYou can see what the upside is, what the protection level is,\nand how many days are left in that outcome period.\nBut what I like about the floors, particularly is as Bitcoin's going down,\nyour outcome for new investors actually improves.\nSo the 20 floor CBTJ, we had a 52% cap rate, 20% floor on day one.\nToday, that's actually much better.\nToday, if you bought CBTJ, I haven't looked since I got off the plane,\nbut I think you get a cap of about 60 to 62%\nand you've got about a 15% floor.\nSo it's actually a better deal for you to buy today than it might have been on day one.\nYeah, it's funny.\nMy brother has started a little project of looking at your ETFs like every day\nand whether or not there's an arbitrage opportunity because there can be a lot of opportunity\nmidpoint to point in some of these, and it's obviously worth taking note of.\nSo the structured products are fairly new to the market,\nat least in the ETF market.\nFor those of those people, the advisors, listening to the show,\nyou know, what are the risk here in terms of maybe liquidity or potential\nmisprasing?\nI mean, can you just kind of talk about that because these are fairly new in the ETF space?\nYeah, this was an exercise that we made sure we had down before we brought the products out.\nSo again, like I said, you don't want to build defined outcomes or structured outcomes on ill-equad assets.\nAnd so you're not going to see an Ethereum or a Solana protection product from Kalimos any time soon\nbecause those assets simply aren't mature enough to be able to do that.\nWhen you build and innovate in the financial services space, you've got to do it with security.\nYou know, if you're building a piece of technology, a lot of times you can build,\nyou know, the first version, you get it out to the market.\nIt might break a couple, you know, pieces of the software might not work right.\nAnd then you iterate and you update, you know, I think around the 350th iPhone update since they came out with those.\nAnd it keeps eating up my battery every time I update it.\nYeah, exactly.\nLike when you're dealing with financial services products, you simply can't do that.\nAnd a lot of times because you're dealing with people's life savings.\nAnd so we build things.\nI'd say with with the shade drawn, you know, we build things at Kalimos and spend a very long time making sure that they work before they bring them to market.\nSo you look at an asset like Bitcoin, a $2 trillion asset with a liquid market, liquid ETF market.\nAnd now there's options on the index that we can trade.\nAnd so we've built a big desk of market makers went through the exercise of pricing all of those options for several months before\neveryone was comfortable with the idea of building this and bringing it and had it just running in the background as a test for several months.\nUntil we were finally in a place where like, okay, this is ready for the market.\nAnd we've been out for a month.\nIt's worked exactly as as we designed it, even in a down market.\nLike we had we had we had the test.\nIt worked.\nIt's working great liquidity is there.\nAnd so I think people can can come in confidently.\nWell, I mean, that was I mean, that's almost like a benefit for you that you get to showcase it, you know, right out of the gate.\nYou don't have to wait for something to happen to really showcase the value here.\nYou know, there's a lot of other benefits to these types of products.\nMainly you're going to get better tax efficiency at the end of this point to point.\nYou're not going to have to because it's wrapped in an ETF.\nYou're not going to have to go out to like as an individual individual investor putting these together.\nSo just from a fee standpoint, you know, how what is the fee structure look like on these?\nI know it's going to be more expensive, but it should be more expensive.\nCan you just talk about what somebody could expect on a fee schedule for these three?\nYeah, we charge 69 basis points.\nThat's the unitary fee for the ETFs.\nThat's about as simple of an answer as I've got.\nSo kind of the last few things here.\nDo you see do you start to see or foresee more structured products in different areas of the financial market?\nLike is this going to go all the way down to sector specific exposure?\nYou know, I think of the sector spider ETFs.\nAnd I mean, are you even going to go deeper into finding more places to make this work?\nYeah, there's thousands of ETFs in the market.\nI remember 15 years ago when people would say is the market saturated and there were hundreds of ETFs in the market.\nAnd we just keep finding new areas of opportunity.\nAnd I always say it's a great time to be an investor, especially with ETFs in the market because you can now get.\nWe call spot exposure. You get the S&P 500.\nAnd there's so many different derivative to use upon their derivative options that you can use to get exposure to the S&P 500 now.\nYou can get income.\nYou can get buffers.\nYou can get a 5% 9% 10% 15, 20, 30.\nLike there's every different opportunity for you to access the S&P in a way that works for you.\nAnd so you can see how the the universe of options and ETFs expands.\nThe structured note marketplace has been around for three or four decades.\nAnd that really started to be disrupted in the ETF space around 2017.\nI was building some intellectual property that was doing buffers on the S&P 500.\nThat was the best selling trade at the time or the best selling note at that time because interest rates were so low.\nYou couldn't afford to do 100% protection.\nBut you could do something less.\nSo I'm going to buff her on the market.\nWell, interest rates are in a much different place now.\nYou can afford 100% protection.\nAnd so now the capital protected note space is being disrupted and being captured.\nSo there's the ETF wrapper is has been a wrapper for innovation for the last 35 years.\nAnd I don't I don't see that changing.\nYeah, no, neither do I only only see you get a big getting bigger.\nDo you foresee anything else coming?\nYou know, you probably are following the space specifically kind of the crypto space a little bit closer now.\nAny developments that might be coming to enhance product offering?\nI mean, do you have any kind of foresight into what might else be coming?\nSo that we can continue to innovate specifically in the crypto ETF space.\nYeah, as far as crypto ETFs go, we we watch the options markets very closely.\nAnd so I think the lifting of position limits on I bit and other spot Bitcoin ETPs may you know,\ncause more people to enter the market into those types of of solutions.\nWe don't have to build things that way, but I do think there's going to be a lot more innovation and product development.\nWhen it comes to giving people exposure, what makes me a little nervous is when you start to see less liquid underlines.\nAnd so I think it's important for investors to do their due diligence and know exactly what they're owning.\nAnd now not only are you owning a volatile asset, but you're owning it in a way that you may not understand or in a way that might not give you liquid exposure to that asset.\nSo that's something I think Calamos can add an edge in and where we can really sit squarely and is providing risk management exposure.\nIn a way that people can trust, you know, we've been around for 50 years.\nWe're not going anywhere and we're not going to build a methodology and blow the place up over a Bitcoin trade, you know.\nSo in your mind, who do you think is kind of the ideal investor for this type of product? I mean, I could proceed.\nI could see it being a couple of different people as the somebody wants to dip their toe in the crypto space, but doesn't want to get, you know, blown to pieces if things get ugly.\nI could see some people who maybe are running active Bitcoin strategies using this is maybe their risk off tilt, so they're still going to get upside exposure, but maybe their risk off and they get long one of your downside protection.\nSo in your mind, who do you think is is really looking and going to be buying this product?\nWe could do a whole podcast on that alone. It's a great, great question.\nHow we're seeing advisors use this and even retail investors and some institutions, which is probably I said, we could go a long time.\nWe see a lot of advisors building models. They're building crypto models right now.\nThe early adopters are and they're using our ETFs as a core for that. They've got some Bitcoin exposure. They've got, you know, Ethereum.\nBut they're using the 20 floor as their core. You know, they don't want to blow up the client. They don't want to know what their downside risk is.\nAnd, you know, to them 60% upside for a sleeve is quite enough upside. You know, that's that's good for them.\nIt's, it's a bit of a mind vendor too, but if you can get there, you know, when you think of a risk free rate product or capturing risk free upside Bitcoin is actually your best power source.\nBecause Bitcoin, you know, has a 12% cap rate and the odds of it achieving a 12% cap are high, you know, Bitcoin goes up significantly.\nIt can go up 12% in a day. They can go down 12% in a day too. But if you're, if you're capturing that 12% cap three out of four years, you're in a remarkably better spot than if you had captured your 4% CD rate and after tax.\nSo the summary here is we've seen, you know, some of the larger asset managers do studies.\nAnd they'll find that you should sell some of your max 7 exposure.\nOr move on to 2% into Bitcoin. You know, I think that's the most like for like comparison they could come up with was, you know, high flying tech stocks.\nBut I don't know that we should do it that way. I don't know many advisors that just have those 7 stocks laying around that they're going to then turn in and get their Bitcoin exposure.\nBut here, you know, we've actually right sized the volatility of Bitcoin.\nAnd so now you can make it a much more traditional portfolio experience. If you're a traditional financial advisor.\nMaybe you're using CBTJ for your equities. You're using CBOJ for your bonds or for your safer money.\nAnd that opportunity didn't exist before. And so I think that's where we're going to see a lot of demand. And now we've given advisors a familiar framework for accessing Bitcoin.\nWell, Matt, Bitcoin only goes down 12% in a day when I buy it.\nExactly. Me too. But hey, I appreciate you jumping off the airplane coming right over here and hang out with me for about 25 minutes.\nBefore I let you go, where can people go learn more about Kalimos in this new Bitcoin ETF suite?\nYeah, go to Kalimos.com. You can go to our ETFs and see all of the ETFs we have there to your brothers point. He's probably using our structured outcome tool.\nThat shows you every product we have and where they sit relative to their outcom periods. So we see a lot of people using that tool also.\nWell, Matt, thanks so much for being with me. Take care.\n"}
