{"id": "16924098", "transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology they are run on\nand you want more customization and flexibility, as well as a AI-driven model marketplace,\nUX wealth partners is your destination.\nOn top of that they have institutional trading, so if you are an ETF issuer or an SMA provider\nlooking for outsourced institutional trading, UX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and\nmake your practice more efficient.\nWelcome to Behind the ticker.\nToday we have on Paisley Nardini, she is Vice President and client portfolios strategist\nat Simplify asset management.\nWe are diving right into their Simplify managed futures ETF, ticker, CTA, the pick to good\none there.\nBut really interesting strategy, it plays four different signals to come up with the underlying\nactive asset allocation, it's done very well, specifically in times of volatility, but\nI will let Paisley tell the story.\nWithout further ado, please welcome Paisley Nardini.\nWe are live again from the exchange ETF conference in Vegas, I am here with Paisley Nardini.\nCan I get that right Nardini?\nNardini?\nYeah.\nI keep wanting to say Nardini because Pat Nardini was the coach for the pit panther's football team\nand I almost.\nWe have a lot in common.\nBut Paisley, welcome to the show.\nThank you.\nThanks for having me.\nBefore we get started, why don't you give everybody a bit about your background and how\nyou ended up in your role at Simplify?\nYeah, absolutely.\nI grew up in Northern Minnesota, I went to school in Northern Minnesota, grew up in like\nvery rural, farm town.\nSo my aspirations of like being on Wall Street were never really there.\nI would say, I didn't grow up being like, I wanted to treat bonds and stocks, but I\nwas introduced to an amazing program in my undergrad studies and ended up majoring in financial\nmarkets and that really kicked off my career.\nAnd so I started as a short-term bond trader up in San Francisco, which was a big shock\nlike moving from Northern Minnesota to San Francisco.\nYou see a lot that you've never seen before, but was super fun and really became attracted\nto the backdrop of I think goes on in the fixing comworld, which is this macro driven\napproach to thinking about markets, economic data.\nAnd so I spent about four years behind a Bloomberg screen, trading bonds waking up at\n330 in the morning, which is a, you know, being in my early 20s that wasn't exactly the\npath I was hoping for was really difficult to be social when everybody's going to\nstart eight o'clock and you were going to bed at eight.\nSo I decided to step out of just the fixed income trading world and into more of a client\nfacing sales capacity.\nI was at Pimco for a couple years working with institutional clients.\nThat's most of my career thus far has been in front of pensions, endowments, fundations,\nSouthern, sovereign wealth funds.\nAnd then just decided that this nice blend between client facing and portfolio management\nwas where I'm best suited.\nSo being able to understand the strategies from how they work, from a positioning perspective,\nthe impact of a market, and then having to articulate that work with clients, I think\nat the end of the day, is what's most fulfilling for me.\nSo I've spent the last eight or nine years in this kind of multi asset portfolio management\nslash strategist capacity, learning a lot.\nAnd I would say to the end of the day, most investors, whether it's large institutions\nor small advisors are all looking for kind of the same thing.\nSo there's a lot of themes and commonalities.\nI would say irrespective of the client base.\nSo before we get into the weeds, what about we're outside of work?\nAny hobbies?\nThings you'd like to do?\nSo this is my least favorite question.\nThis should be the easiest question when you get in a review.\nWho are you?\nWhat do you do for fun?\nMost of my friends and family would laugh and say most of my free time has spent volunteering\nfor the CFA society.\nI will say part of what drew me to volunteering.\nI've been on the board for about eight years of the president right now.\nCFA Orange County is student management investment fund.\nSo I had mentioned my undergrad studies was introduced to a student management fund as well.\nSo I spent a lot of time volunteering, mentoring, finding career paths for these students,\nskydens and just setting them up for success outside of finance and that world.\nI just actually signed up to take some pickle ball lessons.\nI realize I'm like 30 years too young and maybe like four years too late to this trend.\nBut some more social elements, perhaps the sports.\nBut I live by the beach in Orange County, California.\nI can't complain.\nI spend a lot of time outside writing e-bikes going to the beach, hiking.\nThat's sort of thing.\nYeah.\nI just picked up pickle ball and you're right.\nI would think both of us are probably 30 years before it.\nBut I did play.\nShe was probably in her 60s and she was.\nIt's an incredible workout.\nThe first time I played, I'm like, oh, a bunch of old people play.\nOkay.\nI got it handed to me.\nI'll just say that.\nThe sad thing is is like pickle ball just started taking off.\nAnd now you've got Padel.\nHave you seen Padel?\nI've heard of it.\nI'm like the industry of pickle ball racket sports is evolving too quickly.\nI can't keep up.\nSo let's go to simplify kind of as a whole.\nWhat all do you guys do for clients?\nI know you have the ETFs we're going to talk about.\nOne of them today.\nBut what else do you guys do to really help in assist clients?\nYeah.\nSo simplify asset management launched back in 2020.\nAnd the back of a SEC rule change 18F4 that just provided more guidance around the use of derivatives.\nAnd so this really opened the door for a lot of new active ETFs to launch.\nAnd simplify was one of them.\nSo we're really labeled as an alternative ETF provider.\nAnd I think what I've been trying to do more of in the last couple months is really shine a light on the fact that we're not just that diversifier bucket in your portfolio.\nWe have a lot of core active ETFs in our lineup, whether it be active fixed income, whether it be systematic approaches with an equity.\nAnd then of course more of those pure alternative diversifiers as well.\nBut I think it's helpful just to maybe understand some of the composition of who works at simplify.\nWe have a lot of expimico people myself included.\nAnd so really thinking about that theme of structural alpha, the use of derivatives to achieve more kind of like systematic repeatable return streams beyond just taking large bets and duration or credit risk.\nSo we have some wonderful portfolio managers who work now at simplify who you know spent much of their career next to Bill Gross.\nSo some of that flavor within our active fixed income lineup.\nA lot of derivative option overlay strategies with an equities.\nSo you know the buffer ETFs are obviously.\nI've seen a lot of success.\nSo we don't have an explicit line of buffer ETFs but similar kind of outcome defined outcome.\nThinking about protection on the downside and perhaps capping some of the upside participation for more certainty.\nAnd then also just thinking about that kind of true bread and butter alternatives, whether it's equity long short, whether it's currency.\nWe'll talk today about managed futures and trend following in more hedge fund driven approaches.\nSo as of today, we're about 7.1 billion in AUM.\nAgain, we just launched about four and a half years ago.\nSo it's pretty impressive growth.\nI think morning star named us maybe the second fastest growing ETF provider last year.\nAnd so continuing to bring innovative solutions to the marketplace really across all asset classes.\nWell, I mean, you guys have done an amazing job at marketing and getting your name out there.\nI'm sure that's where a lot of that growth came from.\nI can't get on LinkedIn without seeing a simplify ad or banner.\nSorry about that.\nThat's fine. You guys are getting the word out there.\nBut I think now is the appropriate time.\nReally with some of the volatility that is going on in the markets to talk about a more pure diversifier.\nWe're going to talk about your managed futures strategy today, which historically have performed pretty well in periods of uncertainty.\nSo the ticker there is CTA.\nSo at a very high level, what is the simplified managed futures strategy ETF again, ticker CTA?\nWhat role do you think it plays in a diversified portfolio?\nYeah.\nSo I would start by saying what is CTA?\nSo CTA, which is also kind of a clever ticker because we're talking about managed futures.\nTypically, we're talking about CTAs as an industry.\nAnd so we're really looking at how do we use underlying derivative contracts i.e. futures to take advantage of dislocations in the marketplace with the kind of underpinning of how managed futures are allocated to is really on a trend based model.\nSo for those of our listeners that maybe aren't familiar with trend strategies and more the hedge fund space,\nI always liken it to in the equity space around factors, the momentum factor.\nAnd so the belief that, you know, objects in motion tend to stay in motion, that's really what we're looking to harvest is these price fluctuations and capitalizing on these trends, whether it be long or short.\nAnd I think to maybe your point on the importance of long short opportunity set in this market with heightened volatility, more disruption.\nThe ability to take short positions is also very advantageous. So CTA in particular is looking at futures contracts in both the commodity space as well as interest rate futures.\nAnd I highlight that because a lot in managed futures broadly, you can really have access to all parts of the market equity for an exchange crypto now as well.\nWe were very intentional at the launch of our strategies to provide our clients with the most capital efficient diversifier in the report fully looks at the end of the day.\nIf you're pulling away from that 60 40 whether it be stocks or bonds or both.\nYou really want to ensure that you're going to have a diversified source of risk and return. And so by excluding equity and FX, we knew we could provide our clients with a diversifier.\nAnd then again, that ability to go long and short. So our contracts are all traded in North American hours so that we're providing heightened liquidity or market makers easier for transaction purposes.\nAnd so CTA launched in March of 2022. We just passed our three year anniversary.\nAnd I would say we've far exceeded expectations, which I'll get into in a bit here in performance as well.\nYeah, I mean, performance has been great. Has that risk has been great. You know, the AUM is there. So if I understand it correctly, the strategy incorporates four different models. You got a price trend, a mean reversion, a carry and a risk often.\nSo how to each of these models contribute to the funds performance and, you know, I know the answer to this question, but I'll have you explain in what market environments is this really going to be most effective.\nSo I would start by saying that our managed futures products, CTA, is differentiated and not only that it only includes commodity and interest rates.\nAgain, many of our peers have equity and FX, but it's also differentiated in the kind of the four indicator model or signal that you just outlined.\nSo if you think about managed futures kind of a core principle of how their managed is the trend model.\nWe absolutely have a trend model within our strategy. It is the core from a positioning perspective. We also complement that trend signal with the three other components that you spoke to.\nSo I would say second after trend is the fundamental reversion.\nThe way I would like in this is really to think about it's a counterbalance to trend. So as we know trends, objects and motions, send a stay in motion.\nAs that continues and the trend perhaps gets long and the tooth a bit. This second signal or model, the fundamental reversion is really going to look to amplify or dampen that trend based on macro signals.\nSo this starts to start a little bit bleed into that kind of macro hedge fund type strategy instead of just a pure trend strategy.\nAnd the fundamental reversion signal actually is anti correlated to trend. So why that's beneficial is as trend shift.\nYou have this counter balance again to amplify or dampen the positioning signal and just to clarify as well our trend model has a multi horizon outlook.\nSo we have a short term medium term in long term trend, which is something if our listeners are immersed in the trend world, you'll hear quite a bit of that.\nAnd talking about what trend time frame works for against these strategies that didn't get given point in time.\nThe additional indicator that we rely on is called the Intermarket Factor and a very easy way to understand what this is looking at is thinking about the relationship between asset classes and what that means kind of for their future potential.\nSo if we look at the just the last couple weeks in market volatility, there's been a meaningful drawdown in an equity prices historically what does that mean from a bond market perspective.\nIt usually means that bonds see a little bit of that flight to safety trade or a little bit of a kind of risk.\nRisk sentiment shift and so as equities so off our indicators are going to be supportive of taking long positions and bonds and vice versa.\nThe model has actually been quite short interest rate futures over the last two to three years because equities have continued to rip.\nSo that third signal or indicators really that counter balance of what's from a macro perspective how our asset class is behaving and then do we amplify our dampen our signals based on that relationship.\nAnd then the fourth signal sorry that you mentioned is really important as it relates to our interest rate positioning and that is the carry signal.\nAnd the reason that this is very important is that we are funding these futures positions and underlying front end rates treasury bill collateral.\nAnd so if the curve is inverted as it has been over the last several years, it's not advantageous to fund these positions from short term treasury bills because you're really losing out on that carry trade the curves that inverted.\nAnd so as a result that fourth component is very important as a really to interest rates and it's giving us a more holistic viewpoint on where we want to position within the interest rate curve.\nSo again, these four signals are very much hedge fund like and the reason being and I haven't mentioned this yet.\nTo simplify where we don't have in house capabilities that we feel are robust.\nOur industry leading will partner with outside managers and so simplify at the inception of the strategy partnered with altis partners a hedge fund based out of the UK.\nAnd they run a very similar model in house for their hedge fund clients they also have separate account clients as well that are relying on these four models.\nSo if it sounds institutional hedge fund like it's because it absolutely isn't it did come from the hedge fund world.\nSo I now have like 40 questions from what you just said so I'm going to try to simplify it for for time so you've got momentum model.\nYep long short or I'm sorry short duration medium term long duration I'm assuming position sizing.\nIf all three are risk on you're going to start to amp up those positions you get some conflicting that's going to help you manage position sizing.\nAnd then what you would also said is the your mean reversion model.\nYou know as you're right on a signal that mean reversion is probably going to have you start to dampen position size in time so it's all kind of working together.\nYes, the sizing of of the daily positions we're rebalancing on a daily basis so every single day we're looking at those four signals and as you said.\nThey're counter balancing each other amplifying dampening those signals to ensure that again we're not going all in on gold as gold's about to turn for for instance.\nSo do you have.\nMean reversion type signal on each of the three different.\nI guess momentum time frames or is it one master kind of you're looking at longer term cycle this thing is probably.\nA little bit outside of bounds therefore we we want to dampen our position size a little bit.\nYeah, so we do have like the three time horizons I mentioned for the trend model short medium and long term.\nWe are looking at the the counter balance of to your point kind of this mean reversion factor.\nAnd it's more in like kind of a holistic view points we're kind of taking it above like the three individual time horizons and then looking at them at more like the top level.\nTo counter act so I want to ask you about kind of the fourth pillar there which is the risk off model you know it's kind of designed to provide protection during.\nYou know equity drawdown and volatility how does this really work.\nTo reduce portfolio risk when markets become more volatile and you know you're shifting and I'm assuming safer assets like bonds or how does that risk off trade work yeah exactly so.\nTwo most recent examples were in mid December when we saw a bit of kind of like the fed pivot a little bit more hawkish stance.\nWe saw it so often equities I think I saw like mid December that caused us to go pretty.\nPretty far into our longer bond positions and again like since inception we've primarily held short interest rate futures positions we've been short interest rates because the negative carry component I mentioned.\nSo it's it's unusual to see these all of a sudden these long.\nNotional positions and our interest rate futures and it has been in the most recent equity drawdown so mid December was one.\nWe're again that we call that our inner market factor and then we saw that again in February so coming in like through January we had quite a bit of like long commodity positions just given some of the more risk off tone we saw broadly.\nhadn't trickled quite into equities yet and then in February really scaled out of almost all of our commodity position.\nWhich we saw a commodity sell off alongside equities and kind of that mid February late February time horizon so the positioning in the fund.\nadjusted pretty pretty pretty pretty dynamically so the course of two weeks kind of pulled out of most of our long commodity positions started to go short commodities.\nAnd at that exact same time because of this inner market factor with the equity sell off all of a sudden we were long the two year we were long in the five year in both Canadian and US rates as well.\nAnd since we've started to see a little bit of this pullback or maybe a floor in equity prices we've started to see some of that kind of counter balance as well so that inner market factor is really important because if you think about what you're doing in a trend.\nTrend following strategy is you have to be able to pivot quickly and that goes back to one of our other.\nDifferent heaters is we're we're capturing the signal and then treating on that so meaning all this partners is sending us the signal at close of business London time each day and we're trading on it simplify by close of business New York time.\nSo that latency in between signal to trade is really important to capture some of these really quick movements or shifts in the market.\nWell, I mean every great CTA has to be able to change their mind like immediately.\nSo I totally understand there's also some research out there that says for strategies that are trading so quickly there are downsides of that as well right you can have these whip saws or these false signals or just increased trading costs.\nThe day you're really trying to capture that alpha and the longer it takes you to put that into the portfolio the more decay you have of that alpha so we stand beside which most hedge funds do as well even intranet trading.\nSo the fact that we've brought this down to a couple hours from signal to trade is about as hedge funds it gets in the liquid ETF wrapper.\nSo given like the broad use of futures contracts here.\nIs there any leverage in the CTF I know you have to use leverage but are you kind of probably running and that notion will.\nI know it moves around but is there any you ever getting lever long or short.\nYeah so just by nature of course the use of futures contracts there's implied leverage within these you only have to put x amount down in margin.\nIn order to get it outsized exposure through noional in these futures contracts so there is embedded leverage and just investing in futures contracts of course.\nWe have one risk constraint in our CTA ETF which is a 25% margin to equity ratio and so the underlying noional exposure that we're achieving in the strategy is far greater than the margin that we have to post as collateral.\nAnd so again that 25% margin to equity ratio is imposed on us this is a loss just coming up with us so it is an outside third party so I think that helps with a bit of the checks and balances.\nAnd I would say for anyone listening that might be concerned on that embedded leverage historically CTA has been around 12 to maybe 13 or 14% margin to equity so again our cap is 25% we are far below that.\nAnd all of the other so called like risk constraints that could be applied we don't have constraints beyond that 25% margin to equity ratio so what that means is we don't have sector caps we don't have position caps in that is very intentional as well because like any time you're taking active risk it's usually a very few subset of whether you're picking individual stocks or selecting futures contracts that are driving that alpha.\nAnd so by having less constraints on where we can go and how much we can go we're able to capture some of those outside positions in a great example of that.\nBut would be in 2024 anyone that was following the cocoa market closely which I doubt many people where I love chocolate so I was on it but just given some of the weather patterns we're seeing in areas where they're growing some of these soft agricultural commodities.\nIt had a really meaningful impact on prices and so cocoa was up to to 300% last year and we rode the wave on that that was one of our greatest contributors to positive performance and outside returns last year another one was just being short interest rate futures and that goes back to that carry signal many the other trend following systematic trend.\nAnd as future strategies were long interest rate futures with the expectations rates we're going to fall and there was going to be a nice tailwind.\nSo our carry signal is really important but going back to your question less constraints on sector contracts notional allows us to be more dynamic.\nYou know the fund is focusing on absolute return and so how does CTA kind of manage those periods of relative on performance under performance like every CTA as those areas of relative under performance especially environments where commodities are interest rates like may not be in a in a favorable trend.\nSo how do you guys try to communicate that over at simplified clients they're going to weather the storm sometimes during those periods of kind of relative under performance.\nYeah so let's say for starters and this trend sends our strategy just in general trend following anytime there's major websites in the market trend following is usually going to be caught off sides that's the common pitfall is like you ride the wave objects in motion tend to stay in motion until they do not.\nSo when we have these kind of quick shifts in market sentiment we see meaningful sell offs it usually can take a couple days for trend following to pick back up.\nIf you look at a chart of our strategy and kind of that mid February sell off we just experienced we were the wave down for a couple days with the broader market and then we're able to kind of reposition as I briefly mentioned.\nAnd then we kind of saw that kind of divergence between our strategy and an equity markets broadly so making sure clients understand.\nWhat environments does trend following do well in and of course not to state the obvious when we have trends and asset prices whether it's in commodities whether it's an interest rates or for those that do trade equities.\nKind of like the status quo and kind of like that I don't want to say lower volatility environment, but that's really beneficial when we see these prolonged trends where you can capture those trends.\nWhipsaws that they said is kind of where you get caught off side so having that kind of reduced latency of signal to trade is also really important to make sure you can reposition and then I would say even broader a lot of.\nA lot of why managed futures did not be performed very well in the post GFC era was just where we were from an interest rate perspective so if.\nUnderline collateral for managed futures is often treasury bills if treasury bills are yielding zero that's your starting point so these are these are absolute return strategies so table collateral returns and yield is your starting point so if that zero you really need to like.\nToot for the star if you want to provide a attractive absolute return and that's why managed futures didn't get much love and that 2010 to 2019 period so that's a really great starting point today and has been really since mid 2022 when managed futures kind of re emerged as this important source of absolute return and portfolios is you had a really high starting yields and then any additional incremental return is just alpha our icing on the cake.\nSo we know CTAs are a great in terms of diversification and overall kind of like model portfolio so you know how does this low correlation equity specifically benefit investors during periods of market downturns.\nYeah, so as we know kind of like going back to the basics of asset allocation anytime you can combine assets together in a portfolio when they have a correlation that's less than one there's going to be a benefit to the overall volatility so by having a low and in our instance we've even posted negative correlation so it's anti correlated to stocks and bonds.\nThere's a tremendous value or benefit to those of us that are combining this which 99.9% of us are with stocks with bonds and so when we have these periods of market drawdown whether it's in stocks or bonds.\nThe benefit of a correlation perspective to smooth volatility to smooth the drawdowns.\nIs tremendous as it relates to portfolio construction. I can just pointing out again in February the most recent sell off we saw.\nThe ability then to kind of pivot and take advantage of all the sudden asset prices are trending lower and the ability again to take short positions capitalized on that provided attractive absolute returns as the broader market selling off.\nIs really really attractive and so there's been a lot of discussion in the last couple weeks as there is any time we see these market sell offs is like is the 60 40 dead.\nHow do we build a portfolio if we can't do a 60 40 any more and I always say like the 60 if you say the 60 40's dead you're saying diversifications dead and it's quite the opposite like from a.\nFrom our perspective like diversification is alive and well and so it's like we've we try to educate and help our clients understand that the 60 40 was the best set of like it's your best tool kit at the time when that was first constructed we have so many other unique innovative strategies in the market place today that provide low correlation to help smooth returns reduced drawdown risk.\nSo it's more of like that 50 30 20 that just builds a more stable kind of portfolio and CTA strategies manage futures really provide that most you know the best bang for your buck if you're getting low to no correlation and attractive absolute returns like there's not much more you can ask for a portfolio.\nYeah, let's talk about you know kind of this attractive return because CTA has had you know really attractive returns especially during risk off environments.\nSo what specific features of the fund in your opinion make it really effective that like crisis alpha and how do you measure its success and kind of these types of.\nYou know environments.\nYeah, I'll start by highlighting that.\nManaged futures are a very nice and asset class and the broad scheme of portfolio construction so part of my job is not just convincing our clients that CTA is the right managed future strategy for them.\nIt's helping them understand why they would even want managed futures and a portfolio to begin with.\nSo to your point on.\nHave they behaved as expected have they delivered as promised and if we go back to roughly 2000 so about 25 years ago that's when the managed futures index from sock gen was first developed.\nAnd you look at the periods of crisis we've experienced whether it's the the tech bubble whether it's the GFC whether it's COVID-19 whether it's 2022.\nManaged futures have delivered meaning they have outperform stocks they have outperform bonds in each of these environments by providing better downside capture.\nWithin a portfolio so they've smoothed your overall portfolio return so I'd like to just start with that and then the other thing I think is really important is if you look back over the last 25 years.\nThat's how much futures have outperform core bonds and again managed futures are not here to provide necessarily income.\nFor clients that need that so I'm not saying we should get rid of bonds and replace it all with managed futures.\nBut over long it's not just in those periods of crisis that they deliver like over time because they can protect in those short periods of drawdown they're very advantageous in a broader portfolio setting.\nMore specifically looking at our strategy I think again the the less constraints that we've had and the ability to kind of go all in on some of these markets as they're trending and take advantage of that.\nWe've been able to produce really attractive alpha.\nRelative to our peers or the index which we have are three in one year ratings were in the top percentile.\nWe've actually outperformed or in line with the S&P 500 going back to the inception I just looked at this morning.\nWe're essentially on top of each other when it comes to S&P 500 versus our CTA ETF.\nAnd so to provide equity like returns in a market environment where it's been very attractive for the S&P 500 over the last three years and to do so while being anti correlated.\nGoing back to my earlier comment like it kind of speaks for itself.\nWell, that's probably why the fund has a billion dollars and you got done a really great job.\nSo I can't thank you enough for being here with me one thing before I let you go.\nWorking people learn more about simplifying and finding all the information about your funds.\nYeah, go to our website simplify.us.\nWe have a whole lineup of our 35 plus ETFs about 7.1 billion in a year.\nToday we're continuing to grow the lineup but we're also very accessible.\nWe're all over social media.\nWe're at conferences.\nWe love when people reach out to us directly.\nIt's a lot of random increase in our website.\nWe respond to all of them.\nSo like don't ever hesitate to find any of us and we're happy to help and happy to be here and thanks for the opportunity.\nYeah, thanks for being with me.\n"}
