{"transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology they are run on\nand you want more customization and flexibility, as well as a AI-driven model marketplace,\nUX wealth partners is your destination.\nOn top of that they have institutional trading, so if you are an ETF issuer or an SMA provider\nlooking for outsourced institutional trading, UX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and\nmake your practice more efficient.\nWelcome to Behind the ticker.\nToday we have on Rob Harvey, he is from DFA and we really focus the conversation heavily\non DFA's investment philosophy, particularly the systematic nature and how they view markets\nand investing, but we did talk specifically about their dimensional, international core equity\nETF to your DFA I talk about how that strategy has some premium tilts towards small size\nvalue and profitability, we talk about how differentiates itself from other international\nequity ETFs.\nSo without further ado, please welcome Mr. Rob Harvey.\nHey Rob, welcome to the show.\nThanks for having me.\nGreat to be here.\nSo before you started, why don't you share a little bit about your background and how\nyou ended up in your role over at dimensional?\nYeah, sounds good.\nSo when I first came out of undergrad, I wasn't working directly in asset management.\nI was working at Cisco Systems as a member of their Treasury Department, cited for an exchange\ntrading brand or show repurchase program so as in deep in the capital markets and one of\nthe things that we did as part of that team was we oversaw a group of external asset managers\nthat managed some of the cash that we had on our balance sheets.\nWe had a roster of managers that we used and we were just in the process of firing one\nof our managers because they got to call on the Fed very wrong year after year.\nSo we got rid of them and we opened up a search for a new asset manager and one of the\npeople that we talked to was dimensional.\nSo the asset managers that came in the door, obviously the first question that we're\nasking every single one of them is, what do you think that that's going to do?\nAnd where do you think rates are going to go?\nHow are you positioning your portfolio accordingly?\nAnd everybody had an answer and everybody had a story except the national because their\nanswer was we don't think what predicting what the Fed is going to do is a worthwhile\nexercise.\nSo we don't do it and we don't think you should do it either.\nOkay.\nNow you got my attention because I haven't heard that response before.\nSo I was curious about it.\nI wanted to learn more about their approach.\nI flew down to Santa Monica to attend one of their conferences there where I got to\nsee Eugene Fama and Ken French presenting some of their research and talking about the relationship\nwith the dimensional and I was just blown away.\nWhen you're in the front row seat and Ken French is talking about the three factor model,\nit's like being in the front row seat of the journey concert, it is an incredible experience.\nAnd I was sold.\nSo when I went back to the day, I had advocated that we used dimensional as that asset\nmanager that was missing.\nI don't know that it was a good fit for the way that everybody views the world.\nBut for me, at least I had sort of a moment of introspection where I'm like, listen,\nif I like these guys so much, and I want to put my money with them, why don't I go work\nfor them?\nSo I did.\nSo I had wrapped up my MBA and I moved down to Austin, Texas and I didn't know what the\naverage one ever since that's a great story and we're definitely going to dive into some\nof the things that how DFA thinks as we kind of go along with our conversation today,\nbut before we dive into like all the new degree, I like to ask everybody any hobbies\nthings you like to do and we're not working.\nYeah, so I've got two kids who are six and four.\nSo they're at the age where they really like spending time with me still.\nSo I'd like to be into their hobbies as much as I can.\nRight now, that means I'm into Pokemon and hockey, which I got to be honest is no,\nthose are not the worst hobbies in the world.\nI am very okay with that.\nSo we're having a great time.\nYeah, I've got eight and three and hockey is on our list where the three year olds\nhad learned to skate and it's fun.\nI mean, but the eight year old is into travel soccer, I was in 31 degree weather\nand Columbus, Ohio, and I'm like, what am I doing here?\nLike, well, three hours away from home watching eight year olds play soccer.\nYou know, that that is one of the reasons why I'm supportive of my son doing hockey\nbecause I live in Austin and here's not going to be 31.\nIt's going to be one out four.\nSo I'm like, let's go to the rank.\nYeah, that's the character that I'm a future for us here.\nYeah, love it.\nSo let's get back into DFA.\nLike, can you give an overview of kind of DFA's mission and like everything you\nguys do really to help clients?\nYou do a lot.\nWe do a lot and our approach, I think, is different from that of other asset managers\nbecause I think really, if you wanted to summarize it succinctly, you'd say dimensional\ngoal is to help and clients reach their financial objectives by providing great investment\nsolutions.\nThat's a little different from selling products.\nIn fact, it's a lot different from selling product.\nAnd there's a few things that you see that are just very obvious right on the surface when\nyou look at us versus other asset managers.\nYou're not going to see dimensional take out an advertisement in the financial times.\nYou're not going to see us sort of promote our business and, you know, advertise here or\nthere because we're relying on word of mouth advertising really, which is you have a good\nexperience with the dimensional.\nYou like them.\nYou tell your family, they learn something new, maybe about how their investments\ncan be run.\nMaybe an approach that they didn't realize was out there before, then they're interested\nin they talked to their financial advisor.\nAnd the financial advisor piece is critical because we're very supportive of the advisor\ncommunity.\nWe don't have in-house advisors ourselves.\nWe partner with advisors.\nAnd that's because we think the best way for investors to reach their financial objectives\nis by leveraging their financial advisor and listening to their advice.\nSo it's a very strong relationship that we have with advisors that's, you know, paid off\nquite well, both in the sense that we've all been able to benefit right investors have\nhad a good experience.\nThe advisors have grown their business, the initials grown their business.\nBut it's because we're all playing on the same team.\nWe all want the same thing.\nAnd it's not about pushing whatever is hot today, it's about thinking, what's going to\nmake sense?\nWhat's going to drive long-term returns over the next 10, 20, 30 years?\nAnd there's a lot of ways you can support advisors, right?\nIt's not just about product.\nIt's about, you turn on the TV.\nThere's a lot of news out there.\nThere's a lot of noise out there too.\nHow do you cut through that?\nHow do you, you know, say, rather than to your clients that you only see for eight times a\nyear and have them stay focused on that plan when they're constantly being bombarded\nwith all this other stuff that that's part of a responsibility that we're picking up\nto when we're saying, we want to help you with that.\nSo it's content.\nIt's messaging.\nIt's thinking about succession planning for the business.\nIt just, there's a lot that goes into that and we're really plugged into the advisor ecosystem\nin that sense.\nIt's not just great investment solutions, but we do that too.\nYeah, and you guys have been around for a long time.\nI think you were founded in 1981.\nAnd so like, can you talk a little bit about the, you know, the evolution of the firm\nand then how you eventually got a little bit more accessible by getting into the ETF space?\nYeah.\nSo the firm had its foundation in 1981.\nWe had one strategy, which was the US microcap fund.\nAnd the reason that we launched the microcap fund is because you couldn't get microcaps elsewhere.\nAnd once you were just buying an individual, there was no fund available.\nThere wasn't even really a benchmark available for US microcap.\nSo we've kind of always been in the space of giving investors what they want.\nAnd otherwise had difficulty getting a hold of elsewhere.\nSo our heritage really has always been empowering investor choice and offering unique investment\nsolutions.\nSo as you said, I mean, we've grown quite a bit since then we have, you know, whatever 100 products\nnow that we offer, one of the ones that's important, very relevant for the advisor community\nas ETFs.\nAs you said, we didn't have ETFs in 2018.\nIt's a relatively new space for us to be in when you think about the longer history of\ndementia.\nBut we're the number one active ETF issue in the market.\nSo we came at a point where we knew that we could be successful based on that partnership\nwith advisors and we have been and we've seen that market share grow over time, actually\nas well.\nSo it's not just a, you know, an early advantage that's looked away.\nWe're actually, you know, picking up steam in the active ETF space as well.\nAnd you mentioned before that some of the approach of dementia has changed.\nThat's absolutely true.\nIf you wanted to buy a dimensional mutual fund, you had to go through a process and still\ndo, actually, of understanding how we view the world because we think that's really important.\nIf you're going to be invested in something like microcaps, you need to understand that\nmicrocaps aren't going to outperform large caps every day or even every year.\nThat's part of the experience.\nAnd so if we care about helping investors achieve their long-term objectives and it's clear\nthat we do right, that was one of the first things that I said, you have to also make\nsure that long-term expectations are set properly.\nSo there's sort of an educational period where we share the research.\nWe share what we're doing in the portfolios.\nWe talk about some of the messaging that can be effective for advisors.\nSo that's all part of buying the mutual fund.\nAnd we still have that, even with ETFs, we want to work with advisors.\nWe want them to partner with us and go to our conferences and speak to us and sort of share\nthoughts on what would be effective.\nBut you obviously don't have to do that with ETFs.\nYou can just go on buy it.\nSo we haven't walked away from that investor education piece, but with ETFs, they're just more\nopen.\nBut I think we're also being more aggressive with meeting people where they're at and making\nsure that the education is accessible to them.\nYou bring up a decent point with all the noise and the things that are going on in the\nmarket and making sure investor education is there.\nAnd like talking about the explosion of the ETF space where we've seen this gross over\nthe last handful of, I would say last handful of years, even over the last year, the ETFs\nlike to find risks and buffers and believe the DFA, you kind of think about it a little\nbit differently that constructing portfolios to kind of weather all sorts of market cycles\nand not caring about the noise.\nSo can you talk about the investment approach a little bit and how you guys think about\nthat?\nYeah, definitely.\nOne of the things that always kind of strikes me as odd is you'll have a conversation\nwith an investor or an advisor who doesn't know much about the\nconventional and I'll say, what's your best ideas fund?\nTell me what your best idea is.\nAnd that is really sort of a weird thought for me because if you have good ideas, they\nshould be in all your portfolios.\nSo from our perspective is, if you've found an area of the market that delivers higher\nexpected returns over time, why wouldn't you be a person in every one of your strategies?\nAnd we do.\nSo we're very systematic in that way.\nSo when you think about DVA from the market, which we do, we're an active manager, when\nyou think about moving away from what the market portfolio looks like, you better have\na good reason for doing that because if you don't have a good reason, you should just\nhold everything at market cap weight basically.\nWhat we do have good reasons and the reason really is is sort of that academic heritage\nthat we're well known for, which is the greatest minds and modern financial theory, like\nEugene Fauma, Ken French, Robert Novi Marx, Myron Schultz, have chosen to work with\nus to help us improve our understanding of where returns come from.\nAnd then actually build portfolios around capturing that.\nSo we have an enormous research team here with dozens of PhDs in it who take that research\nfrom academics and apply it in these portfolios again systematically, meaning the bets that\nwe're making on some of our securities, for example, doing better than large securities,\nare there in all of our equity portfolios and are there every day.\nSo if you believe in what we're putting out there, if you believe in the research, we're\nnot switching from it.\nWe're sick into our guns over time.\nSo there's a consistency aspect too.\nThat doesn't mean, again, that they're going to outperform every day, but I think that\nconsistency and approach gives investors more confidence because they know what they're\ngoing to see when they take up the account statement.\nIf value got crushed last year versus growth, you should expect us to see a value strategy\nunderperform.\nThat is part of your, that's part of the experience that you should anticipate, right?\nIf you weird, if you pick up your account statement, you're value fund out, performed the\nmarket when value didn't do well.\nSo part of that, I think, is also just about setting expectation like I said.\nYeah.\nSo, you know, everything you guys do relies really heavily on academic research.\nSo how do you add DFA, you know, ensure that the factors you're targeting such a size,\nvalue and profitability, remain kind of robust and all different departments?\nMm-hmm.\nPart of the evolution of the firm has been on the research aspect.\nSo I think about how the national's grown.\nThere's been two key areas, I think, that I've been driving the growth.\nWhat is, how do you make your portfolio is better?\nWell, what you're asking about, which is the research and the other is, how do you offer\ninvestment solutions that better fit the needs of your clients?\nSo I'll talk about the research piece first, which is, how do you improve your portfolios\nover time?\nBecause what we knew about the market in 1981 is not the same as what we know about the\nmarket now.\nSo you should have an evolution there.\nYou should have research that's coming out where people say, actually, you know, look\nat this area of the market.\nIsn't that interesting?\nThere's some differences in returns here.\nWe could do something with that.\nAnd there's always new research coming to light.\nThere are hundreds of factors of premiums, whatever you want to call it, that are out there\nin the market.\nYou need a team to vet all of those to say, all these worthwhile, like, should we be\npursuanties?\nAnd I think that deep bench of, you know, PhDs and researchers is incredibly important.\nMy boss Marlene Lee is a PhD who worked with Eugene Fama at University of Chicago.\nShe's very well equipped to have some of these conversations that has many times over\nthe years and through the value reading this research.\nSo there's a high bar for something coming into the portfolio.\nWe're not chasing the flavor of the week.\nWe need a lot of data and a lot of confidence that's going to work.\nBut we evolve.\nAnd there's a lot of evidence of that, too.\nYou think about profitability, for example, coming in to our portfolios in 2012.\nWe were doing small value for years and years and years before that.\nProfitability comes along.\nAnd we vet it carefully for a long time and say, this is worth it.\nWe should be implementing this.\nThere's little tweaks, there's big tweaks, but you should always be moving forward.\nSo what we look like today is going to be similar.\nI expected what we look like 10 years from now, but I also expected to be\ndevelopments and improvements.\nSo that's a research piece.\nThe product piece is also important.\nIf we found ways to improve the microcap portfolio a little bit here a little bit\nthere over time, that's great.\nBut we're not necessarily serving investors or investors or clients as well as we could.\nIf we know that we can also do things in other areas of the market that are also value\nad.\nSo you've seen not just in the product, wrapper, like ETF, like you mentioned, but also where\nare you going to be positioning yourself?\nLike, and what do you position yourself again?\nHistorically, dimensional has been very much a component of the market.\nThose are flagship funds, like a value strategy or a small catcher.\nWe do have market-wide strategies, but we're known for component strategies.\nSome of our most popular ETFs are low tracking error, high degree of overlap, market-wide\nportfolios with good implementation and very light tilt towards the premiums.\nPeople like that.\nAnd that's new for us.\nAnd we're not saying there's a right or wrong answer.\nIt's all about risk preferences and how much tracking error of all utility you're interested\nin taking.\nBut you can build portfolios that's still incorporate those good ideas and just different\nflavors.\nYou're just turning the knobs a little bit differently.\nAnd that has continued to evolve.\nAnd I fully expect that I see that going forward as well.\nWe are not done.\nYou will see more ETFs.\nYou will see more mutual funds launch in the future.\nSo you mentioned the firm is active.\nHow do you guys think about that daily portfolio management process, really enhancing return\nand enhancing the approach compared to just buy and hold, let's just index.\nYeah.\nLet's talk about what's happened this month already.\nOkay.\nSo halfway through April, how much has the market moved just in the last month?\nYou could measure it even over the course of a day.\nHow do you use financial?\nYeah.\nExactly.\nThat's right.\nThat's a good little nervous when we talk about things, you know, I haven't checked my\nphone in 20 minutes.\nI don't know when it's going to look like right now, but you know, that's part of the environment\nthat we're in.\nBut if that's important to you and you want your asset manager paying attention, then\nyou might want to think about what indexing looks like because most indices only change\ntheir holdings once twice maybe four times a year.\nAnd we just talked about the fact that since last week, we've had an incredible amount\nof changes out there in the market that you should be paying attention to.\nSo there's just a fundamental principle of how often would you expect your asset manager\nto be doing their job, which is looking at the portfolio and making sure that it's\npaying on track.\nI would argue it has to be every day, it has to be.\nSo right off the bat indexing, I think I got some problems with that.\nBut then on top of that, also indices don't incorporate the research that's out there\neffectively on where investment returns are coming from.\nAnd that is also problematic.\nThere's money that's being left on the table by sloppyness and implementation.\nThere's money that's being left on the table by doing the same thing that everybody\nelse is doing at the same time.\nAnd by only doing it once or twice or four times a year.\nBut then there's another aspect, which is why wouldn't you want to incorporate what these\nacademics would spend their entire lives devoting to understanding where returns are\ncoming from.\nWhy wouldn't you want that incorporated?\nYou should.\nAnd we have a phenomenal track record of outperforming index funds on a net of these\nbasis or indices, I should say, a net of these basis, which also means we all perform the\nindex funds that are tracking them.\nSo we've got the proof statement too.\nYou can do better than indexing.\nIt's a draw that we've been paying for some time now because it's hard to get people\nto look beyond an expense ratio, but it's important.\nThere's a lot more that's there.\nBy the way, when we talk about a dimensional fund, you're not paying much more.\nIt's fairly close to an index fund.\nBut look, if you want to have your portfolio be looked at every day, you've got to pay some\nto do that.\nAnd so that's going to cost you a little bit more, but it is absolutely worth it.\nYeah, no.\nI was just going back to last one, so it was some airplane, you know, had Wi-Fi, market\ndown in Uber with a business partner, and look at my phone and markets, like, I don't\nknow, I think it ripped like 8% and about an hour and I'm like, what are you doing on?\nI'm like, what kind of world are we living in?\nBut yeah.\nAnd then remember the Monday before that, it was that accepting.\nI reversed.\nRight.\nYou know, that is an area where it's helpful to have flexibility in your process.\nAnd it's also helpful to just have people paying attention.\nYeah.\nI totally agree.\nSo on the show, we love to pick up, you know, an ETF and dive a little bit deeper\nin it.\nToday, I want to talk through kind of the investment objective of DFAI, just one of your\nfunds.\nSo really, can you give me, you know, a high level overview of DFAI and how it really is set\nup and how it works for investors?\nYeah.\nDFAI is one of those newer products that I've talked about before, where historically\nin all markets, you've had more of an emphasis on the premiums than DFAI offers you.\nSo you would have a more substantial weight and small caps and value and profitability.\nSo you have market-wide exposure and your Toyota's are still in the portfolio.\nWell, they're going to be pretty far underweight because of the fact that you're going\nto be, you know, emphasizing small or deeper dive, higher profitably companies.\nDFAI is doing a similar thing in a sense that it is market-wide and you do have some\ntilt sort of the premiums.\nBut one thing that we've heard from investors is, hey, I like what you guys do on the\nimplementation side a lot.\nI like the flexibility and trading.\nI like, you know, the fact that you're considered about what's going into the portfolio.\nI don't know if I want heavy tilts.\nA little bit is fine, but I'm kind of trying to find a replacement for an index fund.\nSo I want low tracking here.\nI don't want to look too different from the market.\nGreat.\nDFAI's for you.\nDFAI is, again, as I said, sort of broad market capitalization coverage.\nIt has thousands and thousands of names.\nIn fact, it has thousands more names than you'll find in the MSCI World XUS, which is a very\npopular index to track for various funds that are out there in the developed international\nspace.\nAnd the reason that we have all these names that you don't have an index is because index\nfunds and indices don't include a lot of microcap securities in them.\nAnd that's because it's very difficult for index funds to actually go out there and buy it.\nAnd if everybody's trying to buy the same microcaps at the same point in time, it's going\nto get expensive.\nSo index funds don't want that because it's going to mess with their tracking here, right?\nIt's going to drive up their costs.\nSo indices just don't include them.\nWell, the juiciest returns in the market come from microcaps.\nSo you should expand your investment universe to include them.\nAnd we do because we don't have to trade four times a year.\nWe trade every single day.\nAnd in a way that we feel can be very cost effective to pick up some of those microcaps\nsecurities.\nSo do you think I just from a construction standpoint is different from the market?\nYou've got better coverage.\nAnd one of the things I always hear investors talk about and sort of lament is, oh, there's\nno good small cap companies anymore.\nEverybody's saying private for longer.\nNo, it's IPL and like if you buy the same stocks that everybody else is buying through\nan index fund, that is probably true.\nBut it doesn't mean that there's not great companies out there that look like private\nheck would heat a lot of the time based on, you know, they're starting up their business.\nThey're brand new, the profitability is not there, but man, there's a lot of potential\nfor those those are in the microcaps space.\nThat's important.\nSo from construction standpoint, there's that, but then just to implementation, as I\ntalked about, just making sure that when you go to market, you're smart about the way\nthat you do it.\nAnd maybe you don't want to hold everything out there in the market, too.\nThere's a lot of junkie, small cap companies and there's companies that have, you know,\nin the past, openly declared bankruptcy and stayed in indices because nobody took\nthe care to remove them.\nSo there's just some basic fundamental principles that can be adhered to and should\nbe that give you the edge.\nAnd when you look at the FBI's performance, it looks phenomenal over the last three\nyears.\nIt's out performed, it's benchmark on an edifice basis by a substantial margin.\nAnd we would kind of expect that from this portfolio, you know, you're talking about, you\nknow, somewhere between, I don't know, 50 basis points to 100 basis points a year.\nNow, performance net is a great figure to put up for this fund.\nAnd again, the tracking error and the expenses are not very high.\nSo very successful fund so far, and it's a great example of what we can do in other areas\nin the market as well.\nYes, you talked about kind of how the portfolios constructed, putting in some\ntilt.\nBut I believe, DFI, I also incorporate some shorter term considerations like momentum\nor on reversals.\nSo like how do these tackle adjustments enhance the funds performance, you know, without\nmaybe deviating from that portfolio construction process, they work so hard to, you know,\nbuild.\nTotally.\nWhen you think about momentum and that's a great example of something that is from\nthe research that is something that should be incorporated into the portfolio, what momentum\nis doing is essentially looking at the path dependency of securities and how they wound\nup where they are.\nIf you think back to, when we, you know, code first happened, we got a lot of questions\nand concerns from investors about certain industries like airlines or cruise ships.\nAnd people were saying, well, hold on, these look like value stocks because they got hammered,\nbut please don't buy them because we don't know for a kind of cruise ship again, right?\nThat might just be a dead industry from that one.\nAnd we said, don't worry, we're not, and the reason is because of momentum, right?\nMomentum tells you that stocks that are getting crushed and massively underperforming\ntheir peers, you probably want to stay away from those because the tendency is that they're\ngoing to underperform over time.\nSo that's a nice way for us to avoid value traps, for example.\nSo it's kind of a different, this is sort of the same side of the different side of the\nsame coin.\nAnd then you look at other stocks out there right now, what's doing really well in Europe,\nwhat's we're doing really well on DFI, defense stocks, they're doing really well.\nThose are momentum up.\nSo if you have a portfolio that's focusing on smaller, deeper value of higher profit\nrelated securities, which is what we know drives returns in the equity space, but you're\nholding a defense stock that's in the top 5% in terms of the performance for the rest\nof the international market.\nYou might want to hold on to that one a little bit longer, right?\nSo there's just sort of, it's not as rigid as looking at only the premiums.\nMomentum is a nice way of incorporating real world information into how to this stock get\nto where it is now.\nAnd what does that mean for what it returns look like over the next 2, 3, 4, 5, 6 months?\nYeah, so for, you know, the financial advisor or the ETF portfolio manager that's listening\nto this, like, how should they think about incorporating DFI into the portfolio is it best\nas a core holding?\nYou see it is a side card, situational indexing, like what are your thoughts?\nThe ETFI is built to be a core holding.\nIt's meant to replace the index fund that you have.\nAnd the nice thing is about it is because it has the broad coverage, but because it also achieves\nthat out performance that you're looking for, it gives you something that an index fund\njust can't do.\nWe have to remember that index funds, you are guaranteeing yourself under performance or at\nthe best case scenario.\nI'm very few index funds in the international space achieve it, but in the best case scenario,\nyou're performing a line with the benchmark, which means if you're trying to outperform,\nyou're really sort of taking a, you're fighting with one hand behind your back, right?\nYou're taking away some of your options.\nSo if you can find something that's scratching the edge that an index fund does, which\nby and large is going to be diversification and low cost, right, broad market coverage, you\ncan do that with the FII in a vehicle that has achieved the out performance, which just\nhelps boost the overall performance of the fund that it's a component of.\nSo I think if you have really meant to be a replacement of the core part in the international\nfunds.\nYeah, no, I would agree.\nBroad, I really appreciate you taking some time with me today.\nThis was great chatting with you before I let you go.\nWhere can people learn more about DFA and find information about all the different things\nyou guys do?\nA great place to start is on dimensional.com.\nSo there's a tremendous amount of resources there and there's also ways to get in contact\nwith the eventual representative.\nWe have a treasure trove of content and videos and just, you know, the ability to connect\nwith people to learn more about what we do and how we can be helpful for your business.\nSo check it out, make sure that you reach out to us.\nWe'd love to hear from you.\nWe're looking forward to it.\nAnd thank you for having me on.\nYeah, thanks for all of us.\nSee you soon.\n"}