{"transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology, they are run on and you want more customization and flexibility.\nAs well as a AI-driven model marketplace, UX wealth partners is your destination.\nOn top of that, they have institutional trading.\nSo if you are an ETF issuer or an SMA provider looking for outsourced institutional trading,\nUX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and make your practice more efficient.\nWelcome to Behind the ticker.\nToday we have on Wayne Penelow. He is the founder of NextGen EMP.\nThey recently launched the NextGen Efficient Market portfolio plus ETF ticker EMPB.\nIt's a long short equity ETF designed to really actively manage systematic market risk using a proprietary.\nIt really is statistically driven methodology as Wayne describes as a foggy ball.\nI thought this conversation was really interesting.\nThey've done a great job here recently with all the volatility,\nbut I'll let Wayne explain to you the strategy and how it all works.\nSo without further ado, please welcome Mr. Wayne Penelow.\nHey Wayne, welcome to the show.\nI'm thrilled to be here, Brad. Thank you so much for asking me.\nSo before we get started, why don't you give everybody a bit about your background and how you eventually decided to come the founder of NextGen EMP?\nWell, I think the most relevant part of my background is the 40 years I spent as a commodity trader.\nThere's 10 years on the floor of the American college change.\nRing chairman of options and then I moved upstairs to advise global trading companies like VTOL on how to manage the risk in their portfolios.\nAnd then around the year 2000 I started a consultancy to design and maintain hedge programs for companies because it was obvious to me that people weren't focusing on the right elements to manage risk properly.\nAnd I eventually patented that methodology that's called the performance risk management system.\nAnd our clients using the performance risk management system were paid over $13 billion for hedging successfully.\nThat cut the attention of Forbes books and they approached me and I published that methodology in a book called risk is in asset that's available on Amazon.\nI don't own the rights to it anymore because shortly thereafter I sold the company to one of my competitors and they wanted everything.\nAnd I was actually very glad to have them because I've been doing this for a long time and took the.\nThe winnings from selling my business and looked around at the equity space and said okay, you know who am I going to get help me manage this while I go into retirement?\nI couldn't find anybody I trusted and the main reason was that in equities they don't manage risk they diversify it away and the problem with diversifying it away is it means some portion of your capital is getting.\nThe equity style returns let's say 10 to 12 percent a year and you're taking risk to do that.\nAnd the other party portfolio was getting bond type returns which back four years ago was nothing today it's 4 percent but it's still nothing.\nAnd I said there must be a better way so I spent the last four years working on a methodology that would.\nAllow me to create a portfolio that one managed risk without sacrificing returns and then two made it available to the average investor you didn't need to be a qualified investor.\nAnd in fact the ETF that we launched is currently trading for about 25 and half dollars a share so if you got 25 bucks you can participate.\nIt's the beautiful thing about beautiful thing about the ETF but and we're definitely going to get into your ETF and probably more so in your methodology today but before we.\nYou know get into the nitty gritty always like to do always like to ask what you do when you're not behind the desk any hobbies.\nWell I was born and raised in New York and moved to Texas to get away from state and local income taxes.\nSo here I am living on a ranch between Austin and Houston which if you haven't ever been here it's actually quite beautiful the people are friendly.\nI agreed long horns on my property which is they're wonderful animals they're beautiful to look at and but you know they're a large bull can wait 2,000 pounds so you got a managed risk and just having heard like that.\nWhen I'm not doing that I play golf with my wife and pretty focused on ranch to table cuisine we grow a lot of our vegetables and fruits and we harvest fish and and deer and beef obviously from our ranch and and.\nServer to ourselves and our friends love it sounds like a great a great life and something I aspire to do one day is.\nYou know have a ranch growing on food and hang out and play golf.\nIt's not a bad living and you'll be very jealous to know that the golf course we play on on a busy day has maybe 40 players.\nOkay.\nSo there are no tea times start wherever you want and wherever you want it's pretty great like golf.\nYeah and by the way it's also just been ranked.\nThe best new golf course in Texas and in the top five of all golf courses in Texas.\nThat's right.\nI'm going to have to come down and visit that would be great I'd love it.\nSo let's jump right into the ETF and some of your philosophy because that to me I think is going to be most interesting.\nTo a lot of our listeners you brought up a good point most you know most equity investors are trying to diversify away from risk rather than to manage risk.\nSo I think the kind of the best way is just start with the philosophy of the ETF you guys have launched.\nTicker EMPB which is next gen's efficient market portfolio plus ETF it is a long short equity strategy so.\nCan you just dive into kind of a high level overview of what this fund is is trying to do.\nUnlike almost any other investment.\nOr actively managing the risk.\nSpecifically the systemic risk.\nSo all diversified portfolios are managing company or idios in credit risk by having lots of companies in your portfolio.\nAnd the role managing sector risk by having multiple sectors in your portfolio.\nAnd that's appropriate and it was born out of the work done by guys like Phama and Markowitz and sharp back in the 1950s.\nAnd then the only way they could manage the overall risk of the portfolio is to blend asset classes low low risk asset classes low risk low yield asset classes with high risk high yield asset classes.\nBut technology has changed in the 70 years since they did that work and I took it upon myself to take a deep dark look into it.\nAnd what I found is that the market predictability on an individual level as and I would agree with Phama.\nI mean, nobody, nobody knows what's going to happen tomorrow.\nNobody knows really what's going to go up or down.\nSo what we took the approaches that we wanted to use pieces of the equity space as a hedge since all of the various different industry sectors are reasonably well correlated.\nThat is typically 70% or higher.\nAnd we said, can we find a way to use the industry sectors themselves as a way to hedge the systemic risk that is when it's a risk off trade and everybody is selling everything.\nHow how can we risk that?\nAnd so the idea is actually born out of an observation made by fellow's name is Charles Ellis.\nHe chaired the Yale Endowment Fund for a number of years. He wrote a book called winning the loses game and on page 25 of his book.\nHe points out that if you bought and held the S&P 500.\nYour dollar over 10 year period wrote about 5,059 cents.\nBut if you missed the best 90 days, I mean think about that.\nThere's roughly 2500 days and 10 years.\nBut if you missed the best 90 days, your dollar would shrink by 22 cents to 78 cents.\nAnd so he made that as a very strong argument, which the whole world is still embracing that by and hold is the only way to go because you can never predict which of those going to be the 90 days.\nBut then he went on to say, to me the most astounding thing.\nIf you missed the worst 90 days, your dollar would grow to 43 dollars.\nThink about that. Think about how punitive those worst 90 days are.\nAnd so I looked at this and I said, you know, he's identified the low hanging fruit.\nWe're not going to try to be smarter than the market, which is going to try to be less stupid than the market.\nAnd there's no way we're going to figure out which days are the bad days.\nBut if you think of the S&P 500 as a horse race and think about which industry sectors are going to be in the back half of the pack.\nThe nags of the market, if you will, you know, maybe we can do something with that.\nAnd so I did what I call a crystal ball analysis.\nI said to myself, let's just take boiling gas, for example, XOP.\nIf I knew next month that XOP was going to outperform the S&P 500 or the other way around.\nAnd I got to, with the crystal ball, if I knew that, so I always on the one that performed better, whether or not it made a lost money.\nBut I always performed the better of the two assets.\nWell, if you bought and held the XOP, the period under the study was 13 to 2023.\nYou would have had a compounded loss of 2.5%.\nBut if you had the crystal ball, you would have made 63%.\nThink about that, 63%.\nSo I invented what I call a foggy ball.\nIt's not perfect.\nIt's statistically driven.\nIt uses momentum indicators and it uses what I call edge of the envelope indicators.\nSo you just think of Elliott Wave analysis.\nAnd I use many of them because I want to cover many timeframes.\nWell, and I use my crystal ball, and I do what the algorithm says.\nI raise returns from a negative 2.5% to about 24%.\nSo I capture roughly a third of the opportunity.\nIt's not perfect, but it works.\nAnd when we couple that with a portfolio of 16 ETS with a foggy ball works reasonably well,\nand we balance that portfolio so that we get a risk reward structure that we're comfortable with.\nWe're basically targeting a sharp ratio in excess of two in returns that beat the SSP 500.\nWe won't try to maximize returns.\nWe're just trying to find that great balance that, you know.\nI don't ever want to experience a 10% throwdown.\nAnd from a model perspective, we've achieved that.\nAs we go through life, and we see what happens in the real world, we'll find out.\nMy models are models.\nThey're not the real world.\nBut we launched in December and so far so good.\nYeah.\nSo far so good is right.\nI mean, we've recording this in the middle of April, and as we all know,\nwe've had a ton of market volatility.\nYou guys have done exceptionally well in that volatility.\nThe drawdown is basically non-existent in the portfolio.\nSo first of all, congratulations with that.\nYou said a couple of things there that I've some follow-up questions on,\nwhich is I use this analogy the best 90 days in the worst 90 days all the time.\nAnd it's astounding to me how if you just eliminate drawdown,\nyou can end up with a better result.\nAnd your statistical studies since you've done this as well,\nI think it's probably good for the listeners to know,\ndo you generally find those 90?\nBest 90 worse 90 highly correlated in the same areas,\njust trying to miss the bombs.\nOr do you find that they're very hard to predict and can be, you know,\ncome out of nowhere.\nCome out of nowhere.\nAbsolutely fat tail events that just never ever know when it's going to happen.\nAnd I think that that observation pays homage to the Nobel Prize winning\ngrades that founded what most people use to manage their portfolios today.\nI mean these guys, you know, the interesting thing about that is that\nin the 1950s when they were doing this work,\nnobody had had the data before then.\nThen the Chris came along and spent a couple of years pulling all of the data from all\nthe companies since 1926, making this data available.\nAnd then all sudden computers were available to analyze the huge following of data.\nAnd so, you know, Mark would shop and follow-up.\nThey were the first guys they ever looked there.\nThe farmer himself said, you know, it didn't matter what we did.\nAnything we did was new because nobody had ever had the opportunity to do it before.\nThat's great.\nI also want to talk about the indicators or the decision-making tree a little bit.\nSo you're using a array of different indicators to kind of come up with.\nIs it waiting decisions?\nIs it positioning?\nI know this is long short and I'll get into that.\nBut is it?\nAre you coming up with a derived score?\nWhich then indicates how big you want your bet to be?\nOr where you want your bet to be?\nCan you just talk a little bit deeper about the system?\nAnd I know that itself.\nYou don't have to give away the black box at all way.\nBut, you know, just a little bit more information.\nYeah.\nI got it.\nI developed a proprietary method of analyzing individual ETFs, not individual stocks.\nIndividual stocks have too much noise in them.\nI don't think you're ever going to get there with individual stocks.\nBut things like industry sectors or themed ETFs that's focusing on a sub-sector of an industry.\nThose all are potential candidates.\nSo the first thing we do is we run it through our algorithms.\nAnd we look for patterns.\nAnd if we can find patterns that we have confidence in, then we kind of begin by saying,\nWell, based on what we're seeing here, we're going to start with this portfolio of these.\nRight now we're using 16 different ETFs in our portfolio.\nAnd now what we're looking for is, you know, some of them duplicating the work like are they remarkably the same.\nWe're having two is the same as having twice the allocation to the one.\nAnd so we want to have to identify portfolio of ETFs that are suitable candidates.\nThen we take that portfolio.\nAnd we take that group of ETFs that are suitable.\nAnd we start to create through an iterative process.\nPortfolios that we believe are going to work.\nAnd then we find tune that.\nSo finally we get, you know, we started with the one we have now efficient market portfolio plus EMPB.\nBecause it appeals, in my mind, it appeals to new investors.\nThose are just starting out.\nAnd you know, really don't want to take a big hit, even though they have another 40 years of earning power ahead of them.\nAnd those at or near retirement who absolutely do not want to suffer a setback because they have no earning power going forward.\nSo we have portfolios that on the during board that are themed and them.\nAnd they perform as well.\nAnd we have long only that perform as well.\nBut they all have slightly higher risk components.\nAnd I think they'll be attracted to investors at some point in the future.\nBecause no matter how you tell people that don't try to time the market.\nEverybody tries that time the market.\nAnd I can envision a world where there will be a bunch of people to say,\nOK, I think the market's going back up now.\nSo I'm going to go in the long only portfolio.\nOh, no, I'm a little bit nervous.\nI'm going to go back to the launch portfolio.\nAnd God bless them.\nI know they're both going to work well.\nIt's just a matter how much risk you want.\nYeah, I, I, I sit on that side of the fence where I talk to advisors all the time that,\ntend to want to buy long short or CTAs or hedge fund like replication after volatility.\nAnd then when I get long only or in the most recent case,\njust one by the max seven, as we get layer down.\nIt's typical.\nIf you would vote the max seven before the peak in 20,\nit would have taken you three years to get back to break even three years.\nOh, how painful is that be?\nNot so interesting.\nThe fact that you lost 50% of your money.\nYeah, it was painful.\nIt's, but hey, that is human nature and what guys like you and others try to have,\nyou know, computers and systems and strategies to try to eliminate because I am done or my days.\nAnd I'm sure done are your days of trying to figure out what the market's going to do and time it and try to be in the right place without the help of our,\nthe work that we've put in and able to allow our, you know, our system to be able to help make those decisions for us.\nSo I want to talk a little bit about the short component because we haven't had many long short funds on the show.\nAnd I think it's, it's a, you know, an important part to investing that Auburn gets overlooked is maybe too risky for investors, but in reality, you know,\nit's a way to kind of dampen overall volatility compared to just diversification alone.\nSo how does MPB use short positions to actively manage systematic risk rather than try to diversify its way out of it?\nRight.\nSo the, the reason for including shorts is founded in partially economics, but mostly in performance.\nSo with the portfolio that we're currently using.\nOn on a on a pro form of basis, we do not have a six month period that lost money.\nAnd, and the biggest drawdown that we've had is less than 10% from peak development in intramunt.\nSo it's really, it's, it's an incredibly stable platform.\nAnd, and it's stable in another way too.\nSo, for example, if you, if you look at the, the first 88 days of our fund has been trading, the, the S&P,\nthe S&P, it's had a rough patch as we all know, and it's, it's had about as many losing days as it had winning days.\nAnd, and those, and those winning days, those losing days are actually because we're down obviously larger than the winning day.\nSo if we look at the winning days, there's the S&P made approximately a cumulative gain of 40% if you summed up the gains on all the winning days.\nAnd, if you look at us because we're long short, we, we only generated 24% so on the, on the long days, the S&P beat us by 14%.\nThere's, are going, yeah, 16 basis points, 16%, but, but we're still capturing about two thirds of that gain.\nBut the winner here, and this is why you want to have shorts in your portfolio, when you look at the losing days for the S&P, it lost a cumulative 54%.\nWe only lost 22%, so we, we did not suffer 32% of loss that people had only S&P 500 suffered.\nAnd so it's not that we're making more money, it's that we're losing less money.\nAnd by losing less money, we have a much more stable product, so it's, it's not, you know, you're sleeping at night, you're not worried about losing 50% of your money.\nIt's, and we just discovered that by focusing on industry sectors and, you know, building an algorithm that works, that the algorithm is actually pretty good at figuring out which are the nags of the market.\nAnd, and, and I will tell you, in the years, we're beta testing this thing.\nThere were many times the old, you know, fundamental analyst in the back of my head stepped in or, or some news item swayed me and we would deviate away from the guidance of the algorithm.\nAnd in every case, we paid the price and after about 10 in a row losses of making them say, we don't do that anymore.\nIf the, as, as well, we're supposed to do that's what we do.\nSo it's, um, it's another reason for these shorts too.\nI mean, obviously, if you're a long 100% AUM and then you're sure 50% AUM of highly correlated things, you know the product is going to be more stable.\nI said, that does, in a long, in a net long fund like ours, I mean, now all of a sudden people that have IRA accounts can own this because the fund is net long.\nThey could otherwise have the shorts in their account.\nThose shorts as an ETF generate funds that sit in our account.\nSo if you, if you look at our website, you'll see that we're long 100% AUM, we're sure 50% AUM, and then it looks like we're 50% cash.\nWell, that's the money from the shorts.\nWe're currently earning over 4% interest on that, which goes directly to investors.\nAnd so now is on, we're getting paid for holding those shorts.\nSo, and, and the 50% ratio while the sweet spot is really between 40 and 60%.\nUm, the 50% ratio is important because the collateral of the long position collateralizes the short position.\nSo unless there's a negative mark to mark it on the shorts, there is no margin expense.\nIt's just a tremendous opportunity to take advantage of the rules of the game.\nAnd, and I should point out that if we have a 50% hedge, it's perfectly hedge.\nThen if the market falls by 50% from 100 to 50 dollars, it has to rally 100% to get back to 100.\nAnd then we have a perfect hedge.\nSo it falls from 100 dollars, half as much to 75 dollars.\nAnd then it rallies half of 100%.\nIt's going to rally to 112 dollars in 50 cents.\nSo all of a sudden we're beating, you have to one cycle we're beating this by by 12.5%.\nThe only, the only way that formula gets to break even is if the underlying rallies by 200%.\nAnd we know that almost never happens.\nAnd so with a long short program, if we can go through multiple cycles,\nwhere we, at least have a very high level confidence that on average,\nwe're going to have a 50% hedge.\nAll we have to do is go through three or four cycles and we're going to be way ahead of the spy.\nThat's just the way it is.\nAnd, and these cycles aren't just cycles over months.\nThey're, you know, they're within the week, they're day to day cycles.\nAnd it's actually quite remarkable how efficient and it's simply the math.\nSo when you set a couple of things there that spurred a couple additional questions.\nOne of the funny things you said is, you know, I've over read the algorithm 10 times.\nAnd I was wrong 10 times.\nI used to joke, you know, it's better to make that mistake than to override it 10 times.\nTo be right 10 times than you think you got it.\nYou don't need the computer anymore.\nYeah.\nAs I hear you talk, you know, this is to me extremely hedge fund like, you know, accredited investor like,\nand not generally acceptable or not generally accessible.\nI'm sorry.\nTo retail investors every day investors or somebody who's not accredited.\nSo what made you and the team decide to launch this as an ETF rather than just peel it into a limited partnership and to in 20.\nSo I ran a hedge fund in commodities back in the early 2000s.\nIt traded natural gas liquid.\nSo I have experience in running a hedge fund where you go out and get qualified investors.\nYou know, it never got huge, but at one point we had over $150 million invested.\nWhat I really wanted to do was create a product that the.\nThe dental assistant in my town that's trying to save for retirement or maybe before a kid's college.\nAnd she she knows that leaving it in the local bank.\nOne percent isn't going to get her there.\nAnd she brings up that you know, she doesn't really know what she can do to get better than this.\nAnd.\nAnd if you look at some of these regional broker chouses, they.\nThey don't really serve these people very well in my opinion.\nI won't mention any specific names, but I just thought that.\nWe have open source platforms like, you know, Charles Schwab and.\nPedality and interactive brokers and a lot of the new up and coming ones, I'm not familiar with all them.\nThat, you know, anybody with a hundred bucks to get a stock account.\nWell, now we, if you got a hundred bucks, now we can get a stock account.\nBut, but you can have a season professional that has run.\nWho's designed developed in his maintaining a very sophisticated trading strategy at your fingertips.\nAnd, and all you need is twenty five bucks.\nAnd, and I just.\nIt's it's going to be hard to to sell that to a lot of people.\nI can tell you I was very disappointed when we go out and we talked to, you know,\nRAAs that are managing.\nYou know, a 500 million or billions of dollars that they won't touch this.\nWhy?\nBecause.\nAs soon as there people see that they can do well with this, then why am I paying you if you?\nI just buy that forget about it.\nAnd it's it's a little bit disappointed at the the barriers to entry that we've encountered, but, you know, we're we're going to persevere.\nAnd, and I think the performance ultimately was speak for itself.\nAnd as I mentioned to you earlier, we just had a great review in seeking alpha on our product.\nAnd, very pleased that somebody stepped up to the plate and said, this is a different product.\nYou need to take a look at it.\nYeah, I know if for those of you who.\nYeah, I would I would just read that article before our show.\nIt's a great.\nIt's a great piece.\nSo I would go to seeking alpha to check check out that right up.\nIt does a great job of kind of explaining what the product does and how stellar it's been.\nAnd you're right, barriers to entry are very difficult.\nIt's it's time and patience and, you know, the performance of the product is kind of going to do which job for you guys over time.\nYou know, as you go through different cycles, I think the one thing that a lot of advisors are going to kick back on is that advertised expense ratio right the advertised expense ratio shows a 2.21% expense ratio, but you and I have had some conversations.\nThat's a little bit misleading and so can you kind of clarify how some of these offsets can work and what that expense ratio really kind of looks like.\nSure, the guidance from.\nWhen we register this is that you have to report the fees your charge, which we charge to a 1% management fee.\nYou have to charge the associated fund fees because we use ETFs, they have fees in them.\nAnd so we have to estimate what those fees are going to cost over the course of the year.\nAnd and and that's about 35 basis points of the top my head.\nAnd then you have to because we have short positions we require to pay the dividends on those short positions.\nAnd and so it was determined that on average we're going to pay about 85 bips a year on on on those short positions.\nSo you got you know that gets you to 220 not to 21 that's reported.\nBut what they didn't or haven't yet and we're we're contesting this now, but what they're not letting us report is the net to investors.\nOf course, the total AUM the interest earned on the short positions is going to quite about 1.7% a year.\nThat's a that that all of our automatic mix almost all of it go away.\nAnd yet and we're still making dividends on the long position.\nSo they're making us report the money we lose or pay on the short positions.\nBut we're long twice as many and they pay about the same dividends.\nAnd so the dividend is not an expense. It's a credit.\nWe think that if if you go to morning start they're reporting adjusted fund fees at about 1.35%\nWhich is a number I can live with, but I think we're actually going to in this refiling.\nGet that that reportable number under 1% which is in my mind higher than the customers are actually going to pay.\nOnce we get the benefit of these other pieces, but it's you know you can't.\nYou just got to work within the system and you know fortunately.\nIn some ways I think it's one of the reasons why others don't have more long short funds because they don't want to have to put out that expense ratio.\nSo I see it as an opportunity to grow my business for people wake up that whatever it looks like it's a smartest thing you can do because it's the best thing you can do for your investors.\nYeah, and also I mean you got to pay an expense ratio for active management and smart strategy as well.\nSo I mean not everything can be 10 basis points and basically free.\nLet's see the other thing I wanted to talk about which was that I didn't cover when we were talking about kind of how the portfolio works.\nIs this are you trading this on a daily basis? Is there a weekly quarterly monthly?\nLike how often do you rebalance in the portfolio you in there every day?\nMonthly.\nAnd it might change subtly during the month because of creations and redemptions.\nBut if you go to our website next gen emp.com and scroll down to the bottom of the front page you will see our actual holdings every day.\nSo kind of one of the last questions here which would be you know you're out there talking to.\nSomebody that's doing ETF model portfolio construction or you're talking to advisors.\nThey have a they have a portfolio already put together.\nWhere are you advising or where would you recommend an allocation TMPB in an already diversified model portfolio?\nIn an already diversified portfolio.\nMaybe to make it more simple. Do you see this as an all exposure? Do you see this as a compliment to already you know an existing large cap equity exposure like.\nThat they like to talk in buckets. What bucket do you put yourself in or I know you don't I know it's a kind of a go anywhere a little bit and it's a trickier question for you but.\nSo we.\nWe designed this to be your equity exposure solution period.\nIf you think you need to add gold or Bitcoin to that or or and and ours is domestic and or foreign exposure.\nGod bless you you go do that when when when I focus on that.\nBut we're so I mean typically we hold anywhere from three to 500 different companies in our long portfolio.\nSo we are diversified and we are managing it.\nAnd and so I had a.\nOf friends from town approach me was very disappointed with the way the account was being handled recently and make a long story short she didn't like having on a $200,000 account did not like having a $3,000 drawdown.\nAnd I said all right I'm I'm going to I'm this is what we're going to do.\nAnd since I think my MPB is unlikely to have a 10% road and we're going to put $30,000 in EMPB and then we're going to put the other 170 in T bills.\nYeah she's 75 years old and and and if I get this completely wrong and you lose your 10% on EMPB you're going to wind up making something like one and a half percent on your money you're not going to you're still going to make money but.\nBut if I get it right you're you're going to wind up making close to 7% on your money and I said but you should never you should you know with the interest you're earning.\nOn the on the treasuries you know I don't think you're ever going to see a $3,000 drawdown and and by the way I'm managing your money so if we need to stop it we can stop it so that's you know what I want people to take from this.\nWhatever you're investing in you have to think about how much money can I lose most people started with how much money can I make don't start there.\nTalk about how much money can I lose and make sure that you never lose more than you're comfortable losing.\nIf you do that you're you're off to a good start now.\nIf you like me when I was starting out I was busy in in my commodity business and all every time I stepped into stocks at all this work and I don't want to lose more than that.\nAnd I didn't lose more than that but I lost that over and over and over again.\nI finally got tired hitting my thumb with the hammer and said I have to come up with a better way.\nAnd so this is the better mouse trap that I believe I built and I hope you all are willing to take a look at it and consider including it in your portfolio.\nAnd with this woman that I was just talking about I said you know in three to six months will visit again once you get comfortable with it and make some money in it.\nMaybe maybe you want to go up from 15% in equities to 25 or 30%.\nBut the bottom line is however much money she has in equities she knows what a risk profile looks like.\nAnd that's where I think I think that's the next generation of investing in equities.\nI mean once people figure out what I'm doing in it works they're going to be a lot of look at likes come along someone will be charlatans but other people are going to do just as good as I've done.\nAnd and there'll be a great opportunity for people to invest with more confidence and less risk.\nWell, when I really appreciate you know your time with me I appreciate your insights and your knowledge before I let you go where can people go to learn more about the firm and your ETF.\nSo our website is www.nextgeneMP that's any xtgnemp.com.\nEfficient market portfolio EMP it's in homage to the giants that created the industry that we all enjoy.\nAnd and and basically I'm standing on their shoulders to see further into the future.\nAnd it's it's if you go there you'll you'll see our bios you'll you'll see the current portfolio.\nIt has a link to our registered investment advisory firm and my telephone numbers there.\nSo if you call me leave a message because you call me I'm not going to answer the phone because you're not in my phone.\nBut if you call me and tell me why you called I'll call you back.\nThat's the same way again.\nThanks so much for spending some time with me.\nI look forward to you know hopefully run into you and spend some time face face in the future.\nWell I want to make a point at doing that and you should come here and play golf sometime you would love this course.\nYeah I'd love it.\nAll right Wayne.\nThanks so much.\nThank you.\n"}