{"transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology, they are run on and you want more customization and flexibility.\nAs well as a AI-driven model marketplace, UX wealth partners is your destination.\nOn top of that, they have institutional trading.\nSo if you are an ETF issuer or an SMA provider looking for outsourced institutional trading, UX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and make your practice more efficient.\nWelcome to Behind the ticker.\nToday we have on Brad Newman.\nHe is the director of Market Strategy in a portfolio manager at Algar.\nAnd we are talking about their ETF, which is the Russell 1000 Innovative Companies ETF.\nWe have ticker INVN.\nThis product seeks to invest directly in innovation by identifying companies with very strong R&D investment that is underappreciated by the market.\nThey call it the hip stocks highly innovative but prudently priced.\nSo without further ado, please welcome Mr. Brad.\nHey Brad, welcome to the show.\nHey Brad, hey to be here.\nFirst time we've got two Brad's on the show.\nBut no, I appreciate you doing this and before we get started,\nyou want to give everybody a bit about your background and how you ended up at your role over at Algar.\nSure.\nWell, I've done a lot of things in my 25-year career.\nI've been an investor and managing money and an analyst.\nI've also been a Southside publishing analyst and I've done those things both bottom up.\nSo analyzing companies, you know, one by one, as well as top down from a systematic or strategic, you know, big picture.\nSo I started off working on the Southside doing equity research in home building and housing products and wireless telecommunications.\nAnd I worked for a couple of chief investment strategists at Lower Southside Bank.\nAnd then spent a decade at a couple of hedge funds managing money until I came to Algar a little over 10 years ago.\nAnd Algar, I am the director of market strategy.\nSo I published our fall leadership.\nAnd I also, I'm the portfolio manager on the recently launched Algar Russell Innovation ETF.\nYeah, and that's what we're going to be talking about today.\nI want to dive into, you know, that product specifically.\nBut before we get to and in the weeds and to into the business, any hobbies?\nWhat do you like to do when you're not working?\nWell, three young kids, so they keep me busy.\nI do like tennis a lot and actually they're involved in tennis.\nSo it's me playing plus me coaching them and shadowing them around to different tournaments and stuff like that.\nSo I've keeps you busy.\nI'm also kind of obsessed with anything activities on the water and being on the water.\nAnd so kayaking, powerboarding, voting, you know, all that kind of stuff.\nSo yeah, let's bring those shit.\nIt seems to be the most recent set of answers when I ask this question is everybody has young kids and they seem like they're just shadowing them around.\nIt seems to be the hobby of of most these days.\nBut so can we talk about Algar as a whole?\nLike you do more than just ETFs.\nYou guys have a, I was looking at your website. You have a lot going on there.\nSo can you just talk about all the things that you guys are doing for clients on a day to day basis?\nSure.\nSo yeah, I'll just be around for over 60 years.\nWe were found in 1964, one of the pioneers of growth equity investing.\nAlways been kind of on the leading edge of innovation.\nAnd, you know, our business, which is, you know, we managed about $25 billion in assets is split between institutions and retail.\nAnd so, you know, on institutional sites and endowments and pension funds, things like that.\nAnd then on the retail side, we generally sell through financial advisors and more recently moving from mutual funds that are distributed through financial advisors to ETFs.\nWe have 60 ETFs that are, you know, the helpful for purchase by individual investors through financial advisors.\nSo can you talk about, you know, maybe the overall investment philosophy of the firm like how do you guys approach, you know, building portfolios, building strategies.\nIs there kind of an overall theme or mantra as a firm that seems to kind of flow through everything you do?\nSo thankfully, we've had a wonderful philosophy that's been in place for, like I said, over 60 years.\nAnd we haven't had to modify it and it's called positive dynamic change.\nSo this is Fred Alger's philosophy when he founded the firm, essentially where there's changed there's opportunity.\nAnd, you know, opportunity is a big driver.\nI think of the big drivers of performance as opportunity time scale.\nSo it's not just how skills you are.\nIt's also where there's a lot of dispersion of potential returns that you cannot perform.\nAnd so change is a change or where there's a lot of dispersion of returns.\nAnd so if we can apply skills to those areas, we have a form and, you know, we think change.\nTo get to growth and both get to value creation.\nAnd so we go to where the change is and that changes kind of two types.\nHigh and divine growth, which is kind of your traditional growth companies that are gaining market share rapidly.\nAnd the second one is a positive life cycle change and those are companies that are going through growth run-offs.\nMaybe because of product introduction, M&A, or regulation, etc.\nIt's interesting.\nSo just kind of staying on that for a little bit.\nAre you using, I guess, like some fundamental screening factors to identify those types of opportunities.\nAnd find where that changes occurring or, like, how are you guys doing your analysis to really pinpoint those opportunities for the portfolios.\nSo the, the way you do it and have done it for 60 years is generally bottom up fundamental investing.\nSo we've got a whole team of analysts that are experts in their industries.\nAnd we do a lot of proprietary field work.\nSo we talked to customer suppliers, competitors.\nI wish there was a simple formula for how we did it.\nBut if it was, then it could be duplicated.\nIt's, you know, think about, you know, your favorite sports analogy of football game.\nYou know, the best, the best football team.\nYes, they have talented players, but a lot of it comes down to just, you know, the executing practice, you know, all the little things coming together.\nSo because our ears to the ground, we're finding where there's change and finding, you know, where companies are gaining market share or where they have a product that may begin to gain market share.\nAnd that's kind of the way we do it.\nMost recently with the launch of the address on a nation ETF, which I know we're going to get to in a bit.\nWe've just started to do this systematically top down and that does use kind of a quantitative screening mechanism that we can talk about.\nBut generally most of our director is bottom up fundamental.\nGot it. And yeah, I mean, I do have that on the list. I saw that as I was kind of doing some due diligence on the fun.\nSo let's talk about the algebra Russell innovation ETF, the ticker is INVN.\nSo can you talk about what inspired the creation of this ETF and really what gaps are you trying to fill in the market?\nYeah, I think it's really unique.\nI think there's a huge gap in the market.\nSo that's the exciting part.\nSo first off, the innovation is more important than ever before.\nWe think the speed of disruption is accelerated.\nSo innovation is really important.\nAnd there's kind of two ways that I think investors can try to invest in innovation.\nOne is, you know, the bottom up fundamental way that we talked about.\nAnd two is try to figure it out systematic and systematic approach rather than in videos and product approach.\nSo in other words, you know, cop with some kind of methodology that invest in innovation will say as a factor.\nThat second way of investing has not existed.\nI don't think before we created the outer Russell innovation index and the ETF that tracks it.\nSo, you know, when we invest investors in the past, we've done surveys with folks like Granted Associates.\nWe've surveyed institutional retail customers, investors, you know, do think innovation is important.\nWe just did this the other day also on a webinar.\nYou know, almost everybody thinks innovation is important and should you should have in your portfolio.\nBut then we ask investors, how do you measure innovation?\nAnd can you define it?\nWe get most people, you know, not knowing how to define it or or measure it.\nSo that's the big gap.\nThe big gap is how do you invest directly in innovation?\nAs your innovation, then invest directly in it.\nAnd that's what I think we're showing with this.\nHow do you also innovation index and ETF that follows it?\nIt's unique and then invest directly in innovation.\nAnd we think that it's identifying innovation that's undervalued potentially finding innovative assets before our investors.\nSo when you kind of think about innovation as like this investable theme.\nYou simply avoiding just like buying the hype or overpaying for excitement.\nYou think about, you know, most recently it was just AI chips, right?\nAnd I looked at the portfolio and kind of how it's constructed and it's not constructed that way.\nSo how how are you as a firmer or you as a portfolio manager thinking about this theme, which is innovation?\nWell, one of the beautiful things about in my opinion, the index and the ETF that follows it is that it has been created.\nIt has very well overlapped with the benchmarks and, you know, I think most people will find some relatively significant portion of the magnificent 70th portfolio today.\nThis has, you know, a high 90s active share percentage, meaning more than 90, you know, high 90% of the strategy or ETF is different.\nThen the benchmark, whether you look at the S&P 500, the NASDAQ composite, the Q's, the Russell 1000 growth and any of those things, so it's really different.\nSo how your question is how is it avoiding stocks that are just simply, you know, have a lot of momentum or something like that.\nWell, you know, and it is, not only is it different than indexes, it's a very attractively valued. So I call it, you know, you probably give listeners probably heard of Garth, growth and a reasonable price.\nI call this strategy hip, HIP, HP, highly innovative, but prudently priced companies.\nSo the reason we can do that is through the methodology and the fact that we tie research, we don't just invest in research and development.\nWe invest in research and development, companies have a lot of research and development that's being undervalued by the market.\nSo it's research and development relative to market value. So maybe it's helpful now if I take you through just the whole methodology.\nIt's not that's complicated, but so we start with the Russell 1000.\nAnd we first really do two things to Russell 1000 to get down to the portfolio. We first weed out the bottom, one third, a free cash flow margin companies.\nSo the worst companies ranked by free cash flow relative to revenue. Why do we do that? Two reasons.\nOne, we don't want, you know, very early stage companies, you can imagine if you were just investing in R&D, maybe get a lot of biotech companies that are pre-honings or maybe even pre-revenue.\nWe didn't want that. We also didn't want to invest in companies that were spending a lot on research and development, but works successful with that spending.\nWe want companies with a proven track record of turning that research and development into commercial viable products that produce free cash flow.\nSo to do that, we weeded out, eliminated the bottom, one third of free cash flow margin companies.\nSo we share with Russell 1000, we're left with the top two thirds of free cash flow margin companies.\nFrom those companies, within those companies, we simply write them all by research and development spending over the past 12 months relative to their market value,\nor to get technical enterprise value, which is the market capitalization of the equity plus the value of the debt plus minority interest and preferred stock less cash, but essentially the market value of the company.\nSo we take the top 50 companies, write by research and development to market value, we equal weight them, and we we cost to that each quarter.\nI should say Russell does this.\nWe came up with this methodology, brought us Russell, they were very impressed with it when they studied how it performed in the past.\nAnd so there are the ones who determine, you know, the constituents of the index now we have to do is imagine ETF that tracks this index.\nSo you talked a lot about about a different metrics that the index uses such as free cash flow margin, R&D enterprise value ratios to help kind of like select these companies.\nWhy are those metrics so important to really identify innovation like why is that really key here.\nSo there's been a lot of academic research on this.\nThe research and development companies with strong research and development have gone on to have strong sales and earnings growth and you know that's that's in the public domain several papers that have been published about that.\nAnd so for a live in particular then why you has has come up come out with some of those findings.\nAnd so.\nSo research and development is we think indicative of, you know, new products and services that maybe.\nWe're not necessarily successful, but research and development relative to market value we think shows where the market is undervaluing that research development.\nSo for example, I get a lot of questions that have wealth that strategy.\nSo innovative, how come it does not happen or something like that, which you know, everyone hasn't, the probably thinks that Apple is a pretty innovative company right.\nour companies, the way I'll think of this innovative,\nis because we are using that research development\nrelative to market value.\nSo Apple may be innovative, although I would argue\nthat their innovation is very visible.\nEveryone knows they're going to come out with another phone.\nEvery September, and most of the value of the company\nis actually based on its existing products.\nSo I wouldn't say in the model wouldn't say\nthat Apple is under value based on its research\ndevelopment pipeline.\nThat doesn't mean it's not a great company,\nor even a good stock.\nIt's just that the model wouldn't say that its research\ndevelopment is undervalued.\nSo the average, the weighted median research\nand development rather from market value in the ETF,\nis about 6%.\nSo if you're talking about these $3, $3, $3 companies,\nthey are very innovative.\nBut in my spend, tens of billions of dollars\non research and development, but they don't spend\nwhat's necessary relative to their market cap,\nwhich in this case would be $1,580 billion\nto get them included in the index.\nSo it's just a question of valuing that research\nand development.\nYeah, no, it makes a lot of sense to me.\nI couldn't imagine spending $180 billion on R&D.\nBut the fund is equally weighted.\nAnd so what was the decision going into that\nto kind of, instead of to equal weight all these selections\nrather than maybe a more traditional market cap-weighted approach?\nWell, we do a lot of work on, it's really the factor,\nthe innovation factor, the research and development\nenterprise by, that we believe is the signal here.\nAnd so simply having a larger market calculation\ndoesn't make that signal or score on that metric any better.\nSo that's one reason why we want to do it.\nWe really just want to have broad exposure\nto that innovation factor, as I would call it.\nAnd the best way to do that, make sure you get that,\nis to equal weighting.\nYou know, we also, one of the beautiful things about this strategy\nalso is that you don't have to, many other factors,\nif you can find a factor that works, many factors only work\nfor a short time, if you think about learning surprises\nand things like that, if they work,\nthey only work, you know, we're talking days or weeks.\nOur belief is that this is a much longer term signal,\nthe innovation factor, and so we don't have to turn the portfolio\nover very much, that's why it's only quarterly.\nAnd that actually allows us to hopefully avoid some capital gains\nfor the investors, because instead of selling stocks,\nthey've appreciated, we're able to exchange them in kind.\nSo that's another advantage to portfolio.\nAnd just to carry on, so you like, how often are you turning\nover the portfolio or rebalancing?\nYes, it was just once a month, once a quarter,\nI should say, sorry, four times a year, you know,\non average, it's about eight stocks that enter an exit\non that quarterly basis.\nBut, you know, we only want to, this past January,\nso that eight stocks is just, you know, if you went back and looked\nat it historically, you know, using this methodology,\nbut we've only had one new balance so far in March,\nand there was four stocks that entered an exit the portfolio.\nSo innovation and thematic innovation ETFs,\nwe've seen a lot of launches, whether they're passive,\nwhether they're active.\nSo what would be, you know, kind of the main differentiators\nbetween your product and some of the other thematic innovation ETFs\nthat we've seen at the market more recently?\nSo I would say almost all of the ones that you're talking about\nare, you know, qualitative rather than quantitative.\nThere are things that people think are innovative.\nAnd this is quantitative and systematic.\nAnd I think that has, you know, a lot of advantages, you know,\none of them is just that the story doesn't have to get out\nand be told to, you know, investors.\nLike CEO does not have to get on the road.\nThis strategy can simply evaluate where there's a lot of research\nand development in a company that's been,\nthat's generated free cash, where there's a lot of research and development.\nIt's not being valued a lot by the market.\nSo it's able to find, you know, some, you know,\nI think under the radar companies, like there's a stock in there,\nright now on the portfolio of co-dsalventum,\nwhich, you know, most people haven't heard of,\nbecause it's a healthcare spin-off from 3M,\nand it's only been in existence for,\nnow, you know, just about a year.\nSo it's systematic, that's a huge difference.\nAnd then, if you can find any other systematic innovation strategies,\nI don't think any invest in the innovation factor,\nas we've defined it where you're looking at innovation relative to market value.\nSo, you know, I think it's pretty much the only option out there\nwhen they tell us this.\nSo if you're, you know, sitting down,\nyou're having a conversation with an advisor,\nthey have their, you know, firm's model portfolio.\nHow would you position the CTF?\nWhere would you put it in terms of allocation?\nWould you compliment it with someone?\nSomething like, how would you fit this in kind of an\nalready diversified model portfolio?\nSo the easy answer to have it match just, you know,\nto the traditional thought process of most of that investors,\nis this thing, this strategy maps to make cap core.\nSo it has elements of value and growth.\nAgain, it's something new, it's innovation.\nSo I don't know if, like, say, the Morningstar style box defines it correctly,\nbut if you're going to use the traditional Morningstar style box,\nit maps to make cap core.\nWe think it can be a replacement for, you know,\nsome of your either make cap core, active strategies\nor maybe more particular passive strategies.\nIn that it solves a couple, I think, of the passive problems\nthat people have now, which is one over exposure\nor concentration to large cap tech.\nLike I said, this has very little exposure.\nThe other big problem, it solves is the elevated evaluations\nin the market, particularly amongst the largest companies,\nthe evaluation, you know, as of March 31st,\nfor this portfolio, ETF, three cash flow,\nprice to three cash flow was 12 times,\nwhich is just about half that of the Russell 1,000 index\nand way less than half of the Russell 1,000 growth,\nwhich most people think of as innovation index.\nYou know, then the harder answer is,\nthis is probably the first time that, in my opinion,\nthe investors can best directly in innovation.\nAnd so how big should your innovation allocation be?\nAnd that's something people have to wrestle with.\nThere is, there's a paper that Russell wrote about this,\nthat people might want to check out on Russell's website.\nYeah, no, I think the timing here is really good.\nI mean, mid and small has been on love.\nAs you said, large cap has largely dominated,\nlarge cap tech has largely dominated for the better part of G's,\nmaybe three years now.\nAnd so some of that mid cap exposure, as well as some equal weight.\nSince it is kind of a relatively newer ETF,\nas you said, at launch in January,\nhow are you as a firm kind of thinking about marketing and distribution\nand getting this in front of people?\nThat tends to be the hardest part, as we launch new ETFs.\nYeah, we probably know all about this probably better than me.\nYou know, like I said, how do you had grown up around mutual funds?\nAnd that was, that has been our bread and butter on the retail side.\nObviously, we do a separately managed accounts,\net cetera, on institutional side.\nOn the retail side, it had been mutual funds.\nAnd we have huge presence in a lot of the large wire houses.\nWhen you start an ETF from scratch, as we did just a few months ago,\na lot of those wire houses want, you know, water track records,\nor seeing if you're not possible from day one.\nSo we have to market this ETF and other ETFs more to RIAs.\nAnd independent advisors.\nAnd so that's what we're doing.\nWell, Brad, I really appreciate you spending some time with me.\nBefore I let you go, where can people learn more about the firm\nand get information on your ETFs?\nYeah, so I would definitely encourage people to go to www.outhr.com.\nYou can find this strategy.\nI linked to this strategy there.\nIf you go on the strategies tab, you can also find a lot of other\nfollow leadership that we've done under the insights tab.\nSo there's plenty of there.\nAnd there's a video where I walk through the methodology,\net cetera, and how this strategy came to be on the website,\non the product page.\nWell, again, Brad, thanks for being here with me today.\nThanks so much, Brad, and it was great.\n"}