{"transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology, they are run on and you want more customization and flexibility.\nAs well as a AI-driven model marketplace, UX wealth partners is your destination.\nOn top of that, they have institutional trading.\nSo if you are an ETF issuer or an SMA provider looking for outsourced institutional trading, UX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and make your practice more efficient.\nWelcome to Behind the ticker.\nToday we have on Bob Elliott.\nHe's a chief investment officer over at unlimited funds and we are talking about their newest ETF, the unlimited HF GM global macro ETF, ticker HF GM.\nIt is a global macro hedge fund replication strategy, although it offers two X leverage on that index.\nWe talk about the benefits of alternatives in the portfolio and we talk about how Bob and the team over at unlimited runs their entire process.\nThere is a small section of this podcast.\nHe lost audio for about, I don't know, 20 seconds instead of re-recording, I'm just going to edit it.\nSo I'm sorry about the technical difficulty, but without further ado, please welcome Mr. Bob Elliott.\nHey Bob, welcome back to the show.\nThanks so much for having me.\nSo why don't you just give everybody a quick refresher about who you are, what you do, and what all unlimited ETFs is trying to accomplish their clients.\nYeah, I've been in the 220 businesses.\nI like to call it for a couple of decades now.\nI spent the majority of my career at the world's largest hedge fund, Bridgewater Associates almost 15 years, where I was creating investment strategies across a wide range of different asset classes.\nAnd you know, my later time there as well as running a $125 million venture capital fund sort of increasingly realized that,\nyou know, 220 businesses, they're pretty good for the manager and they're not that great for the investor.\nAnd the core reason why that is is managers generate plenty of good returns.\nIt's just that the fees that they charge are too high.\nThe access is very limited to their returns for sort of the common investor.\nAnd almost always they're put into, in a tax inefficient structures.\nThat got me to thinking starting a few years ago about whether there was a way to bring concepts of diversified low cost indexing to the world of 220 really starting with hedge fund strategies.\nAnd instead of, you know, investing directly in managers.\nBasically building proprietary technology that allows us to look over the shoulder of the managers see how they're running in real time in terms of their positioning and then just take that understanding and package it into a wide variety of different products.\nWe started a few years ago with our, our initial product, which was HFND, which is really a lot of ways you can think about like spy for hedge funds.\nYou know, it's intended to track the index.\nBut what it's done probably more importantly is proven out the technology that we're using works.\nAnd there's allowed us to then start to package hedge fund returns in more interesting ways.\nAnd what we're focused on right now is bringing individual hedge fund substratages, which is global macro equity long short managed futures.\nBring those to market in an ETF wrapper.\nBut instead of just taking the returns out of the boxes, the managers offer them what we're doing is we're targeting a two X return.\nSo using the same position, the same position understanding targeting a two X return.\nAnd also doing that at a much lower fee point than two and twenty at ninety five basis points.\nAnd so that HFGM, which is our global macro product is the first one of those that kind of gives you a whole sense of it.\nAnd you know, that's that's our first product and I was part of this sort of two X strategy and we'll be launching a series of those later in the year as well.\nNo, it's great.\nIt's super.\nI definitely want to talk about the process of, you know, how you're building this out.\nRight in to HFGM, it's the unlimited HFGM global macro ETF.\nSo you kind of gave me a little bit there, but you know, what really expect, you know, inspired you to start here first.\nAnd then really how does it, how does it aim to replicate the global macro hedge fund sector in this, you know, ETF wrapper.\nYeah, so the first thing I'd say is that global macro alpha is is one of the more compelling returns that that.\nThat investors can add to their portfolio and the reason.\nEating a wide variety of different asset classes at any point in time.\nYou know, they'll trade global currency commodity, fixing, come credit equity indices, things like that.\nAnd so when they're doing that, they have much more flexibility in particular to go long and short different asset classes and really find those opportunities.\nAnd so, you know, as a result, what you see through time is in a lot of ways they sort of create a, I like to kind of call it like an all weather alpha return that is quite complimentary low, you know, the shown low correlation to things like 60 40 or the stock market and pretty consistent returns over time.\nSo how do you kind of define global macro and today's market environment and really how is that reflected in your.\nIn your factor inputs.\nYeah, so global macro managers are.\nIn many ways, just there's different hedge fund styles and really what it comes down to is where are those hedge fund managers focused in terms of generating, you know, alpha or or positioning themselves.\nSo global macro managers are generally trading that global set of currencies commodities, you know, fixing, come equity long short, et cetera.\nAnd a key differentiator, you might think that that sounds like what management features managers do and while they have a similar opportunity set global macro managers are using indications that are, you know, beyond just price elements in terms of determining.\nWhether they're good opportunities. So they're often considering elements of macro economic dynamics policy dynamics things like value oriented strategies that are related to to what they're doing and really thinking about.\nYou know, in addition to price trend elements as well, and so in that sense, it's it's like, you know, it's a comprehensive set of lenses that are applied to these global assets and bringing all those together into into one return profile and so that's really what they're looking at and functionally what we do.\nYou know, when we're tracking these managers is managers essentially identify themselves in terms of how they're what sort of strategies they run.\nAnd so, you know, we're drawing on the positioning information or we're inferring the positioning information from about you know, 500 or so of these global macro managers, some of which are systematic, some of which are discretionary.\nWe're putting all those lenses together and understanding sort of the wisdom of the crowd when you when you put all that essentially all that horsepower together to see where they're positioned in this sort of environment.\nYeah, well, this sort of environment, you know, global macro, somebody who's looking at policy and has got to be pulling their hair out a little bit with.\nIt changing seemingly every couple of days and on a tweet, but or tweets or truth social wherever it comes out any of these days, but what I find interesting and I'd love to learn more about this so you're using machine learning process.\nNot to really come up with an opinion of the market you are using machine learning to look at the positioning information of this global macro subset of managers and trying to replicate positioning based off of that so can you go into that a little bit deeper and I hope I got that right, but it's a super interesting concept.\nYeah, I think what we're trying to do is we're trying to understand how these managers are positioned in as close to real time as we can.\nBecause, you know, if we can understand their positioning using technology instead of, you know, having to pay them the two in 20, then you know, we can make those returns available to all investors and the way that we do that.\nStart talking about machine learning and everyone kind of their eyes glaze over and they're like, this is a black box and what the heck are you doing.\nWhat we're doing is in many ways relatively simple, which is and it's something that basically any investor looking at an active manager has done thousands of times in their career, which is if you know what a manager is doing, meaning you know what sort of strategy they're pursuing, you know what happened in the asset markets.\nAnd you see their returns, you basically know you you can probably have a pretty good intuition about how their position or the overweight tech, you know long bonds short gold whatever it is.\nAnd all we're doing is we're taking that core intuition and and running that in a more systematically rigorous way than eyeballing it.\nAnd so, functionally, what that's really taking advantage of is the fact that positioning is continuous and I think that's a really important insight because a lot of people will look at hedge fund managers and say, oh well they're like, you know hot shots flipping positions left and right, you know long stocks one day short stocks the other.\nIt's not how hedge fund managers operate and the reason why that is is because there are transactions costs that they have to deal with and so what it means is they can only move so fast if you're managing any reasonable amount of money.\nYou can't instantaneously shift positions and so that actually gives a real advantage because what it allows us to do is to look at the path of returns and infer what set of adjacent portfolios must have described that path of returns that we're seeing given the market action.\nAnd so there's a lot of information value in the path of returns to understand how they're positioned today and and I draw a contrast with sort of traditional replication techniques which have traditionally used techniques like you know regression type approaches where you have to have a long back moving average basically a long long backward data sample in order to infer what positioning is.\nAnd so you're getting things that are called like you know they're like the average of the positions of the last three or five years that's not really helpful right because obviously managers are technically shifting.\nOne of the neat things about approaching at the way that we are which you know in some ways you just think about like a sophisticated amount of color assimilation is we're using past information.\nBut what it's doing is contextualizing and helping us understand what is the highest probability portfolio that the managers are holding.\nYou know as close to today as we can get and that's very important so we're solving for today's portfolio in the context of the past but not averaging in the past.\nNo, it's it's super interesting I love the concept and just curious why you decided as you mentioned earlier you were going to run this is like a two x levered index so.\nIs that just because some of these indexes if you look at some of the hedge fund indexes.\nI mean they don't blow you away in terms of kind of total return is that one of it and and honestly the risk profile is is pretty low is that was got that kind of the frame of thinking there.\nYeah, unfortunately since we launched our first product we got it idea I've had the opportunity to talk to.\nHundreds maybe even thousands of advisors over the course of the last couple years and so part of what we're doing is designing product leveraging it's the same exact technology which is you know demonstrated.\nAn ability to track these positions but we're just we can just combine it in different ways.\nAnd in this case advisors told us that they were looking for one strategies that had lower correlation to 6040 that were diversifying and and in particular macro oriented strategies are uniquely diversifying.\nTo something like 6040 strategies through time and then second they said look you know the the returns that generally are are that come from hedge fund.\nLike hedge fund indices and things like that aren't that compelling and so we're solving that two ways one by reducing the fees which is an important component of it because those indices include you know fully loaded fees but two by raising the target return and as you know typically what hedge funds are managing.\nEssentially bond risk in terms of their return and and there's a lot of I'd say bad incentives related to that because you know they're incentivized to basically collect management fees and then if they outperform great but otherwise they collect the management fees.\nBy targeting something at a higher return we're basically just matching S&P volatility which is you know totally normal volatility and the nice thing about that strategy is if you want.\nThe you know if you want the full S&P volatility you can just do that or you can hold a smaller amount in your portfolio if you wanted to be less impact.\nYeah no makes it on a sense to me so when building out kind of the holding profile of the strategy it looks like it's ETFs and some futures contract so.\nWhat types of investments are you holding I know it's going to change but what are you kind of targeting and what can investors kind of expect to see in the portfolio at any given time.\nYeah I mean really focused on you know roughly 30 to 40 of the largest liquid markets and if you think about it you know there's say a trillion dollars of assets in global macro hedge funds strategies essentially they have to be.\nExposed to the 30 or 40 largest liquid markets on the short and so we predominantly do that through the use of futures which are which is nice in the ETF wrapper because what it allows you to do is you can you could take long and short positions in the ETF wrapper and from an investors perspective all they see is a single ticker a single.\nAnd instead what's going on under the hood is that you know we can shift you know to be long gold to short gold to long gold under the hood without the investor having to basically do anything.\nAlso without the investor having to you know absorb short term capital gains that could come from say a separately managed account or investing in LP structure and so that's what we're really doing is is basically expressing those views through through futures contracts and then a few index ETFs went appropriate.\nAnd it can go anywhere right I mean we you could be in rates you could be in equities you could be in commodities currencies I mean you've got go anywhere capabilities yeah and that's that's the great the great thing about.\nYou know I think part of this is look I'm an old macro guy so you know part of it is is talking my history but that's the thing that I really love about macro is that you really can go anywhere you know it doesn't mean that you're limited to.\nYou know our US equities should be longer short US equities only like you know the question is not US equities if being long Japanese equities is a much more compelling trade then that's the trade that you can put on.\nUsing this using these positions and so it really is a go anywhere hold anything trade focused of course on macro markets so you know you're not going to see individual stock selection in this portfolio.\nBut you know amongst the major global macro markets any anything is is fair game and anything that these managers are really focused on is is what we're going to hold.\nAnd so how often you turning over the portfolio looking at you know re running your machine learning to kind of see positioning is at daily weekly monthly.\nI know it's probably fairly frequent.\nYeah I mean actually the the neat thing is we we get a lot of daily information both in terms of how markets are transferring as well as how managers are performing that we use to incrementally update our inference on how they're positioned and so.\nFunctionally what we're actually doing is running every single day we're updating our views with incremental information doesn't mean we necessarily trade every day.\nBecause you know you want to balance how far you are from your desired positions versus your health positions versus the transaction costs.\nBut we are updating that view consistently and as a result you know we will we will trade when those are desired positions and our health positions start to diverge.\nYou know sufficient to make sense and you know functionally that means we're trading I'd say you know roughly four times a month on average roughly weekly on average.\nIn terms of our positioning but you know there are certain times when that may move considerably faster when there are larger market moves.\nLike what we've seen in recent days and there are times when you know during more docile environments where it might trade a little slower than.\nSo when when you're seeing positioning changes you got to move into a new asset class kind of what is the thought process behind selecting you know ETF exposure versus futures exposure versus maybe swaps like how are you.\nMaking that decision I'm sure the purest form of exposure with the lowest cost is probably the answer.\nAnd you've already answered the question now yeah I mean I think I'll I'll say this way like in general futures contracts are the most efficient way to do this from an economic exposure standpoint and the reason why that is is on the on they are very liquid in general.\nWe've actually seen an improvement in liquidity and new and some new products in the futures space that have broadened so things particularly like in the credit space you know new.\nHigh-led bond futures and things like that which are beneficial which of which basically you know basically this point really for equity currency credit commodities or fixing come.\nThere's a future future contract for that and they're deep and liquid and one of the nice things is on the short side essentially embedded in the futures contract is the cheapest financing that you can get.\nAnd so and so essentially it's the most efficient way to gain exposure from our perspective.\nThere are some there's some you know corners where there has yet to be yet yet to be some developments in the futures market like emerging market US dollar sovereign bonds is a you know is a place where there isn't.\nRobust futures market or or other derivatives that we can use but in general that's what we're focused on is using those because they're just very efficient and then the other thing.\nThis is an ETF podcast.\nThe other thing that's neat is under the hood you can structure typically when you're trading futures contracts you get something called bad income and so you have to it's less tax efficient.\nWhat you actually do in an ETF wrapper is you structure it so that the securities held the securities that would generate bad income are held in a in a substructure that means that you're able to wash the bad income so that the investor only sees essentially a dividend of you know of good income so to speak.\nIn the positioning and so that's you know that's an important component is that structuring to ensure that investors are getting the best tax treatment they can.\nIt's very interesting and so most of I mean the the whole process seems model driven what if any human elements kind of live here.\nWhat is it that maybe you guys have to implement with the human brain rather than just let the model run or is it just fully model driven.\nYeah, when I say it's a systematic process which means we rely on the systematic outputs on a day to day basis but that systematic does not mean without human oversight.\nAnd anyone who's run a systematic process responsibly knows that you you have to you have to check everything that comes out because you know any systematic process could.\nA break you can have a data vendor change something that creates a break upstream you could have you know for whatever reason calculations being incomplete et cetera et cetera and so everything that we're doing.\nEvery day that we trade we are we actually have two people who are both a co-founder Bruce and I are looking at the positions checking to make sure they're right fixing any problems so that we're most accurately reflecting the systematic process and so that's what we're doing there's no discretionary views there's no this is not Bob's you know random views on global macro.\nCheck me out on Twitter if you want those random views on global macro the this is the wisdom of the crowd systematically determined and then of course.\nAgain, like any systematic approach there's always what I'd call portfolio research that's going on where we're.\nAsking ourselves are their elements of our underlying technology that could be improved to you know make it more accurate less followed well et cetera and that is you know in some ways a never ending task is constantly going through that that research process it's it's the sort of thing that if you have a robust.\nsystematic process you you won't find that much you'll do a lot of work and realize most of the time that what you've got is in pretty good shape but you know it's a it's a consistently evolving process that that we're that we're doing.\nYeah, so when you're talking to advisors like you saved up thousands of advisors how are they.\nIncorporating hfgm or alternatives in general in their portfolio you starting to see you know a broader use of alternatives we know the importance of them in their port in the portfolio but.\nAnd how are you explaining or and or kind of recommending how they should view this asset class and kind of what type of allocation it should get an an an an an overall portfolio I know that's variable based on risk tolerance but just kind of an in general.\nYeah, I think I think in general.\nWe're moving from a world that was sixty forty for a long time to one that looks more like fifty thirty twenty.\nWe're 20 is the is an ults bucket and in that ults bucket you know a lot of advisors are are going to sort of I call it.\nYou know more traditional ults like trying to get into private equity or or venture or or various private credit structures but they also recognize that you know public markets offer.\nA compelling opportunity particularly a compelling liquid opportunity to add all exposure to their portfolios and so.\nYou know in some ways what I'd say is the advisors I see are sort of fifty thirty ten illiquid ults ten liquid ults and so.\nYou know the idea of of hfgm and really are overall suite of products is you know rather than trying to pick an individual manager.\nYou know you wouldn't go pick individual stocks or you know you might not want to pick individual stocks so you hold spy or the equivalent right.\nThis is a way to gain access to you know a diversified a manager diversified set of exposures around global macro which you know many many many advisors we talk to.\nReally like the complimentary return properties of of this something that could go long and short regardless of sort of the economic environment.\nThat is a good compliment to the rest of the portfolio which in a lot of ways in one form or another is a long are long only strategies.\nRight so I'll let you make the list here but just for the listener.\nWhat is the benefit of doing this in an ETF wrapper getting I'm saying getting hedge fund or alternative exposure in an ETF wrapper rather than going direct to an LP and getting that exposure directly like what are the main benefits.\nYeah I think you know the there's a couple of challenging things for getting a hedge fund style exposure into a portfolio so from an advisor is perspective.\nThe first is there's a lot of single manager idiosyncrasy a lot of volatility of any individual manager and from a advisor's perspective.\nThat idiosyncrasy is not just in the return volatility but it's also in if you invest in a single manager you're essentially responsible for making sure that that manager you know doesn't have let's say of compliance or operational issues right so that's a big issue.\nThe second is the fees are too high I mean super expensive right to in 20 strategies and particularly if you're not you know if you're not a big institutional investor you're you're you're often paying you know rack rate or worse to get access to those strategies so high fees.\nThey're almost all in tax inefficient structures often in LP structures where you know essentially you're paying ordinary income.\nYou know having to deal with K ones and all that and then the the last thing I'd I'd say that almost always comes up.\nAnd actually in some ways is the most important thing for most advisors is if you invest in individual LP strategies you got to deal with the paperwork and the paperwork stinks and you'll talk to all these advisors and they'll be like yeah I got to like Jason's guy down and you know he's like you know doing his business and he doesn't want to talk to me and I don't you know but there's a deadline you know all this stuff and just and even there's been a lot of streamlining of.\nPaperwork for these sorts of things but even in the most streamlined circumstances like someone's got to sit in a chair and sign the docs and someone's got to get the K ones and give them the tax account and all of that is a pain.\nAnd it's also individualized and so what we're finding you know if you look at an ETF ahead from strategy ETF it basically hits each one of those elements.\nSo we'll start at the at the last one which is you can just execute it like spy so it's very easy to execute and fits into your securities portfolio.\nThe fees are considerably lower than LP positions it's also more liquid than traditional LP structures.\nIt's manager diversified and you know the tax it's about as tax efficient as you're going to get for a diversified you know moderate turnover alpha strategy and so you put all those things together.\nAnd I think it's a very compelling package for advisors and particularly in this world where advisors you know they're moving towards model ETF portfolios and those model ETF portfolios are valuable because you know they're a bit agnostic to the size of the client and a lot of these folks.\nWhat they'll have is they'll have you know they'll have a couple big anchor clients that maybe they are those clients are right to invest in individual head trend managers and they'll have dozens of folks for whom you know they're not really.\nThey're not qualified they're not accredited all of those things how do you show them.\nHow do you build a good quality portfolio for those investors because you need to service them effectively without having to go through all the hassle that you're doing for your big.\nTake it investors and and a lot of advisors who talk to you love these products because they they see the ability to basically deliver something unique.\nIn a way that's actually pretty easy to execute.\nYeah you made me chuckle over the couple things just you know questions you get like you know what do you mean I got to go get a medallion signature I have no idea what that is and then you know.\nYou're getting emails in April wondering where K ones are and those are going to just put it on extension if you if you invest in an LP just put your tax return on extension and wait till.\nJune or July to get that K one.\nBut in the paper or it's you brought up all the points I thought you were going to bring up it just made me chuckle because I've I've had those conversations in the past and I've seen deals fall through because people just don't want to pay for.\nYeah you just the person's got something else to do right.\nYeah I don't have 25 minutes to fill out all these subscription documents or go and get.\nNotarized and all the others right.\nWell Bob I really enjoyed this conversation before let you go.\nWhere can people learn more about unlimited and your suite of funds and excited to see obviously what you guys are going to be coming out with here in the future give us a little bit of teaser I know you're not going to be able to talk about it but we'll keep an eye on it.\nExactly exactly so if you want to learn more about what we're up to unlimited ETFs dot com which has lots of information about our products that are in the market and the ones that are coming.\nAnd you know if you want to keep up with a variety of different takes that I have on sort of macro and markets and investing.\nYou could find me on all the social media platforms and one former and other.\nAnd so definitely say hello and check it out.\nYeah I mean if you want to go for a walk with Bob and hear about Japanese interest rates and figure out try to figure out what's going on definitely get on his Twitter.\nThere you go.\nAll right.\nThanks for having me.\nYeah we'll see you soon.\nThanks.\nThank you.\n"}