{
  "id": "17335420",
  "transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a Tampa user and you're sick and tired of the legacy technology, they are run on and you want more customization and flexibility.\nAs well as a AI-driven model marketplace, UX wealth partners is your destination.\nOn top of that, they have institutional trading.\nSo if you are an ETF issuer or an SMA provider looking for outsourced institutional trading,\nUX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and make your practice more efficient.\nWelcome to Behind the ticker.\nToday we have on Kirk McDonald, he is from Argent Capital.\nAnd we are talking about the Argent Capital mid-cap ETF ticker AMID or AMID.\nHe's a pretty concentrated set of 40 to 50 mid-cap stocks.\nThey use a quantitative and fundamental approach to screen fairly low turnover,\nbut I'll let Kirk kind of explain how the strategy works.\nThey've also released two other ETFs, their large cap and small cap ETFs.\nSo without further ado, please welcome Mr. Kirk McDonald.\nHey Kirk, welcome to the show.\nHey Brad, thank you for having me and glad to be here.\nYeah, so before we get started, why don't you kind of give everybody a bit about your background and how you eventually ended up in your role over there at Argent?\nOkay, I'm really incredibly fortunate in that the only two things I wanted to do professionally were fly airplanes in the Air Force and be a portfolio manager\nand I've been able to do both of those things.\nSo I went to the Air Force Academy for undergrad and spent a decade as a pilot near Force.\nAnd then I'm incredibly fortunate I got into this industry and now I'm a portfolio manager here at Argent Capital Management.\nSo what planes did you fly? Because I've always had an effectuation with the Air Force.\nAnd I think it's really, really cool. So what were you flying around it?\nSo actually, I wanted to be a fighter pilot, but that ended up not being a choice.\nThere was no fighter assignments from my UBT class, my pilot training class.\nSo I went and flew to the C5 Galaxy, which is the exact opposite was the biggest plane in the Air Force.\nYou know, huge transport plane that just dwarfs the 747.\nAnd you know, I loved it. I had the time of my life traveling around the world.\nReally working on all different types of missions for the country and loved it.\nVery cool. I don't know if you could tell. I've got my top gun maverick hat here at home at behind me.\nSo, oh yeah, I had noticed that for the hands of cool.\nYeah.\nIt was my wedding gift from my, all the guys, my best men in the wedding. They bought me a full, full replica helmet.\nAnd I've carried it along with me for the last, I don't know. We'll guess going on 11 years on Friday. So yeah, that's cool.\nSo I guess, too, you know, any hobbies, apparently you love to fly.\nYou and I were actually talking about how miserable or flight experiences have been trying to fly commercial.\nBut any other hobbies when you're not working?\nYeah, so obviously my big one is flying. I love to fly in my spare time and my wife and I and my kids sometimes they're both in college now.\nBut we, we take trips so we can avoid the airlines.\nThat's a nice perk. That's a very nice perk.\nAnd sometimes after work, I just go up and fly for no reason and just fly around Missouri.\nI live in St. Louis and do touching goes at different little airports.\nSo that's my main one. But I work out, you know, six days a week and just push my body to the limit and my job.\nMy job, it's an all intellectual job. So I love the physicality of sports and my wife and I play a ton of golf too.\nNo, love it. You and I share a lot of the same hobbies.\nAlthough I was forbidden after having children to go and get my pilots license, but maybe when they're older and in college maybe I can go get it.\nThat's the time. I didn't admittedly my kids were young. I couldn't go fly. There's no way.\nSo why don't you kind of give us a quick overview of Argent Capital and maybe how, how are you helping clients?\nWhat are all the things you guys do? And maybe talk about, you know, the overarching kind of investment mantra that they kind of live through the front.\nYeah. So Argent Capital is 27 years old now. We were started in 1998 and we were started by a person that was a financial advisor.\nAnd one thing and his practice he gave great client service. I was a hugely important thing for him.\nBut with the investment manager said he was using, you might get pretty good investment performance, but you did not get good client service.\nSo he really wanted to create an investment manager that had only gave great investment performance, but also great client service.\nSo that's how Argent Capital was formed. And our investment philosophy is based on what we call identifying enduring businesses.\nSo we have five strategies in Argent Region from large cap to small cap.\nBut every portfolio manager and every research analyst is looking for the exact same thing.\nIt's what we call that enduring business. So it's a company that's growing cash flows. They have a durable competitive advantage.\nAnd they have a management team that's a good allocator of capital. And they've shown the ability to reinvest those cash flows back into the business and grow the business assets over time.\nAnd when they run out of good investment projects at the company, they return the excess capital to shareholders from the form of dividend growth and share buybacks.\nSo that's really what we're looking for.\nYeah, so I was doing a little bit of my due diligence. I keep kept seeing this kind of compounding cash flow growth.\nSo what does that really mean in practice, as you guys are trying to select stocks?\nYeah, so what that means is typically the companies we invest in have been in business for multiple decades.\nSo we're able to look back over time through different types of economic cycles, different types of technology cycles and technology development areas.\nAnd watch that management team continually find ways to create products and services that are in demand and then reinvest back into the business and maintain some sort of a competitive advantage.\nSo while they're reinvesting your own the business, they're also able to maintain really above average return on assets.\nSo that's generally what it means.\nSo you know, what is really inspired you guys is affirmed going to jump into what we kind of called the ETF Thunderdome right it's it's a very crowded space.\nThere's a lot of a lot of products out there and it's growing every day, so you've been around for a long time what was kind of the precipice of saying, okay, let's let's put our foot into the ETF game.\nYeah, so when we started out for 24 years, we were focused on separately managed accounts.\nAnd then we needed another vehicle to give more people access really to the our investment management services.\nAnd when you're doing separately managed accounts, you need, you know, $100,000 to $250,000 at a time.\nBut if we created it either mutual fund or an ETF, people could just do it, you know, for a few dollars at a time.\nAnd ETFs when we when you look at it, they are tremendously advanced over mutual funds in terms of there's no capital gains whenever I trade a stock within the portfolio.\nThat doesn't happen in ETF, so you can postpone a capital gains until you finally sell the ETF years down the road.\nAnd they're less expensive to operate so you can have a lower expense ratio as well.\nSo the ETF really came about really to kind of democratize our investment services and give anybody the chance to invest in them.\nYeah, no, I love it.\nIt also adds a ton of efficiency for an advisor who, you know, once to use multiple SMAs kind of in single registration.\nSo that's why we're seeing a lot of people kind of move to the ETF space.\nBut we're here to talk about one of your products specifically, which is the Argent mid-cap ETF, ticker AMID.\nSo kind of, it is really high level. How would you describe this fund and really, what is the unique ad you guys are bringing to the mid-cap space?\nOkay, so the AMID, the Argent mid-cap ETF.\nSo I would describe this fund as really a concentrated low turnover fund.\nSo there's 40 to 50 securities in there, right now there's 43.\nAnd the turnover over a long span of time is about 20% a year.\nSo we're looking for these enduring businesses and we want to own them as long as we possibly can and really take advantage of that compounding cash flows over time.\nAnd I think our edge over other mid-cap portfolio managers out there is this combination of quantitative and qualitative or fundamental investing that we do.\nAnd I can, I'm happy to get into that if you want me to.\nI can walk me right into my next question, you know, a perfect, which was going to be, you know, how would you really describe this, this unique process between fundamental and quantitative research and how those two approaches kind of integrated together give you that ad you're looking for.\nYeah, so a little bit more about my background.\nWhen I first got into investing, I got into it on the quantitative side of things.\nSo I was a quantitative research analyst and then a quantitative portfolio manager as building models of factors.\nAnd for people that are familiar and a factor is essentially.\nBalance financial ratio like from the income statement or balance sheet simple swam would be like price to earnings ratio.\nBut it's a financial ratio that correlates with stocks outperform the market over time.\nSo I was building these models and managing purely quantitative portfolios.\nAnd when I came over to urgent 14 years ago, they hired me to build them a stock selection model.\nThen one of these models to help them identify potentially how performing stocks.\nAnd then over time, I realized they were fundamental investors here and they taught me actually started to cover some stocks fundamentally.\nAnd then I realized there's this really ability to have this intersection of quantitative and fundamental investing and always looking for an alignment between the two.\nSo over time, I've really enhanced the urgent alpha model.\nIt has 25 factors in there, but they're all fundamental factors that help us find these enduring businesses.\nSo for example, that growing cash flows, one of the factors in the model is called unexpected cash flow from operations.\nBut as identifying businesses, they're growing their cash flow for unit of sales faster than they have historically.\nSo for each of these characteristics of an enduring business of growing cash flows,\ndurable competitive advantage, good allocator of capital, I put factors in the model to help us identify these enduring businesses.\nAnd then what I look for when we do the deep dive fundamental research we do is an alignment between those factors.\nSo it's really a good check and balance on each other.\nAnd I think that has been in our edge over time.\nYeah, I think, you know, when I talk to, I've talked to a handful number of managers, probably hundreds of managers now.\nAnd I love that kind of like quantum mental approach where you can look at the numbers and then really figure out the business use case.\nAnd I think it makes for, you know, a very unique investment offering.\nAnd one of the things you guys do is you, as you said earlier, is it's a pretty highly concentrated portfolio, right?\nYou're holding 40 to 50 stocks.\nAnd so what kind of drives that high conviction?\nI'm sure it has a lot to do with that quantitative and fundamental approach.\nBut why really choose that concentrated portfolio type?\nYou know, that's, is that where your alpha is really coming from is that stock selection\nand trying to stay concentrated rather than maybe just kind of hugging the benchmark?\nYeah, so over time our alpha is generated by, you know, 80 to 90 percent stock selection.\nSo that's part of the reason to be concentrated.\nThe other reason is it's really hard to find these truly enduring businesses.\nSo let's, I'd be hard press to find, you know, 150 mid caps that would fit that definition in any given time.\nSo that's part of the reason is the state concentrated is it forces us to be very, very proactive, very, very diligent to make sure we truly understand these businesses.\nAnd I've done a deep dive and watched them for a while before we buy them.\nSo that concentrated approach.\nIf it's in really nicely with just the difficulty of finding these companies.\nAnd then it forces us to be very, very selective.\nYeah, and you mentioned as well, you got about 20 percent turnover.\nHow often are you kind of rerunning your screens and, you know, deciding whether you want to add or remove anything from the portfolio?\nYeah, so we really run the screens actually every single month and I'll take them.\nAnd so there's slight changes.\nWe wait these factors. I talked about dynamically.\nSo they're weights and importance in the model. It changes just a tiny bit each month.\nSo we rerun those each month. But the model is built to really align with our investment philosophy of low turnover.\nOnly these companies for a long time. So the model scores don't change that rapidly either.\nAnd I found the more that I enhanced the model that find these types of enduring businesses we're looking for.\nReally even the lower turnover that that model gets.\nSo for us, we're we're always considering trades. I have a really always a list of names that from through our risk management process.\nI've kind of bubble up to the top as these are the ones that watch the most closely.\nAnd the have a list of names you've already done the homework on that are potential ads to the portfolio.\nAnd the way I like to look at it, you know, I'm here in the Midwest so it's farm country.\nSo just imagine you're on a farm.\nAnd there's a bunch of pigs out of trough. They're all eaten and they're grown just as fast as they can possibly grow.\nBut behind them, there's a group of younger, hungry or hogs, maybe a little bit smaller.\nBut they're always pushing in shove and trying to get their turn at the trough.\nEvery now and then one of those pigs is happy.\nIt's how big they are. They don't fight as hard for their space at the trough.\nThey get pushed out of the way by a younger, hungry hog.\nAnd that's the names in our portfolio and they bubble up to the top of a risk management process.\nAnd you know what's identified as a sale. That hog gets out of the way.\nThe new one comes in.\nNo, I love I love the analogy and let's talk about a couple of the holdings in the portfolio.\nI was just kind of looking just specifically.\nYou know, what do you kind of like about a couple of these names?\nSo I've picked, you know, really two here.\nThere's co-part and then there, which I've never heard of.\nAnd then you might have to help me with this.\nIs it fortnight, fortnight?\nYeah, fortnight. Yeah, you got it.\nSo those are two long-term holdings and very different types of businesses.\nSo co-part, their whole auto auction, like salvage company.\nSo they were started in Sacramento, California.\nAnd initially, you know, auto auctions when the cars get totaled.\nYou know, they would just tow it to a field.\nAnd then people would auction that off in the field.\nAnd it didn't matter whether it could be incredibly high.\nTo be raining on you, it could be stowing on you.\nAnd the person that that own co-part had this great idea of was actually sounding long.\nIt was working with them.\nHad this great idea in 1998.\nWell, this thing called the internet was invented.\nAnd I came out and started to get bigger.\nAnd his son-in-law said, let's put these online.\nSo people can sit inside and be comfortable.\nAnd he said, yeah, sure, sounds like a good idea.\nSo they put their auto auctions online.\nBut what happened was it opened it up to a worldwide audience.\nSo they got higher prices.\nAnd the higher prices attracted more buyers, which in turn made the prices higher.\nSo they could get the best prices for their cars.\nAnd they went out to insurance companies and just signed contracts with them.\nAnd said, hey, we can get you the best price for your car.\nAnd we'll just charge you a percentage of that.\nSo essentially, we're our interest online to get the best price.\nAnd then the other thing they did, that was very smart.\nThey went around the country and they bought property real estate.\nThat was advanced.\nThat was close to all the metropolitan areas.\nAnd that's something that can't be recreated.\nBecause nobody else has that convenient storage site from these cars.\nSo that combination of online auto auctions at technology.\nThey've still invested in more than their competitors.\nAnd that advantage real estate has been a huge advantage for co-part.\nAnd cars are increasingly totaled.\nYou can, you may have experienced it or certainly your friends have.\nYou get in what seems like not that big of an accident.\nAnd your insurance company totals the car because all the electronics\nIt's too expensive to repair.\nSo that's co-part's business.\nSuper simple.\nYeah, no simple business.\nI love the story.\nAnd so your benchmark here is the Russell midcap index.\nSo kind of over over a full market cycle.\nYou're really trying to find some out performance there.\nSo are there certain types of environments that are probably more favorable for you?\nOr is it just, you know, the luck of the,\nNo, I shouldn't say the luck, the skill of the stock pick.\nYeah, I never say luck.\nYeah, I took that back.\nI took that from the episode, but the skill of the stock picking is that,\nIs that really where you're, you know, the secret sauce is or\nAre there certain, like I said, cycles that might make a little bit more sense\nTo own aim it.\nYeah, so for us, the, the time is least advantageous for us.\nAnd most difficult for us to outperform.\nWe'll typically underperform for two or three months is that a change in a cycle.\nSo it could be a change from a bull market to a bear market or bear market\nTo a bull market.\nThat's typically where we underperform for two or three months.\nPretty strongly why that change is happening.\nWe don't necessarily turn over our portfolio or change it at that point in time.\nBut that's the, that's the signal we'll underperform for a few months.\nBut then once the cycle research itself, whichever direction,\nWe tend to outperform for, you know, the next several months until the next change happens.\nBut that's, it's historically, we're, it's difficult.\nSo I've learned a ton, it really take advantage of that.\nAnd I will trade.\nSo some of my names are the portfolio that are long term holdings.\nI've had conviction in if their stock price is underperforming significantly.\nI'll take advantage and sell some of the relative winners.\nTrim them actually not sell them.\nAnd then reinvest in some of the, the lower, the lower performing underperforming stocks.\nSo having kind of relatively number of small holding,\nwe'll talk a little bit about the risk management process.\nIs that almost inherently embedded in the monthly kind of reallocation of capital a little bit?\nOr how do you view risk management?\nYeah, so that actually goes back to my Air Force days where risk management was invented for aviation.\nAnd so we started the risk management process when we were planning a mission.\nSo it, so we do the exact same thing with the Argent midcap strategy.\nRisk management is built in throughout.\nWhen we're considering even adding a name to a portfolio.\nThroughout the research process, we're always thinking.\nWhat are its exposures to different risk characteristics?\nAnd we have two different risk models.\nWe use an in-house risk model that we call the Argent risk model that I built as, as well as the Bloomberg risk model.\nWe're going to make sure when we fit that that stock in the portfolio.\nIt does a keep our risk exposures where we want them.\nAnd we have some pretty tight limits on that.\nSo it's built in that way.\nAnd we're also managing the overall volatility of the stocks within the portfolio.\nAnd the portfolios overall beta, meaning it's volatility relative to the benchmark.\nSo it's very important to us to manage that with some tight ranges since we are so concentrated.\nSo when, you know, your sales team or you guy, you were talking to, you know, an advisor or an RAA.\nThey've got an existing kind of diversified model portfolio already put together.\nWhere are you positioning a met for a seat in that portfolio?\nHow are you kind of talking to them about it and how it fits and why they need to be adding it?\nWell, generally, I'd like to describe the midcap stock is really like the forgotten asset class.\nSo it's sort of like the middle has a negative connotations.\nLike nobody wants to get stuck in the middle of nowhere.\nIf your career gets stuck in middle management, you can't get to upper management.\nSo oftentimes, and if you look at the data, midcap stocks are about 25% of the US market cap.\nBut they're only 11% weighted to people's expo portfolios.\nSo that's really how we position it.\nAnd then midcap stocks, this group of stocks from roughly four billion to, you know, 60 billion dollars down.\nThey've gotten pretty big is over the long run, the best performing group of stocks within the US domestic equity asset class.\nSo that's really how we position it.\nLike, don't forget about this asset class that will give your clients the best performance.\nWell, I would almost argue now, or in this type of environment.\nWe've been so focused on large cap.\nEverybody's been chasing large caps, specifically market cap weighted large cap.\nAlmost like midcap and small caps have kind of been forgotten left behind.\nThat's exactly right. Everybody just is talking about the mag seven and all that.\nAnd right now, people talk about it more and more with small caps, but it's the same with mid caps.\nOn a relative valuation basis, small caps and mid caps are the cheapest they've ever been compared to large caps stocks.\nAnd eventually, you know, the cycles do turn in those valuations mean revert.\nYou just don't know when that's going to start.\nYeah, that's that's the tricky part, right? It's not going to start.\nI've been hoping equal weight factor has been would be coming back for us over the last handful of years.\nAnd it continues, you know, the large cap mag sevens continue to dominate.\nSo you have a couple other ETFs as well.\nSo what areas are they focused on? What are the tickers there?\nAnd really, I would assume they all kind of work together in some way shape or form.\nYeah, they do.\nSo we just open two new ETFs in addition to Amid.\nWe have a big A, B, I, G, which invest in large caps stocks.\nIt's our large cap core strategy and a little A, L, L, which is our small cap strategy.\nSo they're just exact clones of our SM separately managed accounts that with fairly long track records and those two asset classes.\nAnd we're positioned there.\nEssentially, we have two more investment strategies here, an urgent high yielding portfolio as well as a SMid cap.\nAnd we'll eventually have ETFs for them as well.\nSo people have the opportunity to invest our full suite of investment services.\nYeah, no, that's exciting.\nSo before we can let you go and in Kirk, I really appreciate the time and you sit down and talking to me about a mid,\nbut where can people learn more about urgent, where can people learn more about your ETFs?\nOkay, so, urgent, we're at urgentcapital.com.\nThat's ARG, ENT, capital.com, as well as urgent ETFs.com, and that's ETFs.com.\nAnd that's specifically focused on our ETFs.\nWell, again, Kirk, thank you so much for being here with me.\nOh, I really appreciate the opportunity, Brad.\nNice meeting you.\nThanks for watching.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}