{"transcript": "
Behind the ticker is brought to you by UX wealth partners. If you're a TAMP user and you're sick and tired of the legacy technology they are run on and you want more customization and flexibility, as well as a AI-driven model marketplace, UX wealth partners is your destination. On top of that they have institutional trading, so if you are an ETF issuer or an SMA provider looking for outsourced institutional trading, UX wealth can also be your destination. So check out UXwp.com to find out all the ways UX wealth partners can help grow and make your practice more efficient. Welcome to Behind the ticker. Today we have on Ryan Thomas, he is a portfolio manager at Hotkiss and Wiley and we are talking about their newest ETF, Ticker HWSM, which is the Hotkiss and Wiley SMI-D smid cap diversified value ETF. We talked about how the process works, it is a mix of quantitative as well as human analysis review. I think it is very thoughtful portfolio construction, so without further ado, please welcome Mr. Ryan Thomas. Hey Ryan, welcome to the show. Thanks for having me happy to be here. So before we get started, why don't you take a little bit of time to talk a little bit about your background and how you ended up at Hotkiss and Wiley? Sure, well I started my career in investment consulting and I worked at a couple different places, the last of which was called Slokum and Associates, which has since been acquired and I think is now part of the under the Mercer Consulting umbrella. But I had a great experience there that firm had a very fun culture, great leadership, talented people. So I learned a lot, one of my primary, primary, primary responsibility that I had there was to conduct due diligence on equity asset managers and as it happened, Hotkiss and Wiley was one of those firms that I was researching and I was impressed by the firm, it's people, it's culture, it's process, it's leadership and so I was ultimately advocating that our clients would use them and then you can fast forward a bit at some point, Hotkiss and Wiley was actually looking to add someone to their team, included me as a potential candidate and I ended up joining in 2008. Since then, my roles evolved a bit, most notably becoming a cohort folio manager on our small cap, diversified value strategy a little more than a decade ago, I joined Jud Peters as a co-manager for that, he had been managing it as the long PM for 10 years and it's been the two of us for the last 10 years and then more recently we started two other strategies that leverage that same process, just apply to a different opportunity set, one is an international small cap strategy and the other is this smid diversified strategy for which we just launched this ETF. Yeah, no, we're definitely going to talk about the ETF in greater detail on the show but before we kind of get into business, any hobbies, what do you like to do when you're not working? Yeah, well I have a couple of daughters, the older one is well into routines and pretty self-sufficient at this point, the younger one is 10 and she's a competitive dancer which makes me a competitive dance dad so depending on the time of year, I'm likely watching competitions or recitals. Not exactly how I've probably envisioned it as a younger man growing up but it's fun to watch and I wouldn't trade it for the world and if I have kind of true runtime I guess I'm probably at the golf course, I just like the outdoors spending time with friends and that's probably the way that anybody that loves golf but isn't very good at it, would describe it. And I'm sure dance competition weekends, eat into your ability to sneak out on a Sunday or Saturday morning. Excellent point. Yeah, well any any young dad can relate to that who likes golf. So look, why don't we talk a little bit about the firm in general? I mean what all do you guys do to help clients? I know you have the products which we're going to definitely move into but what are all the things you're really doing to help support your client base and the things that you're delivering to them? Sure, so how'd you get somewhere, Ali? It's a 45 year old firm founded in 1980 by John Hachkus and George Wiley. They both retired in the mid 1990s and have unfortunately passed away since then and we managed today somewhere between 30 and 35 billion dollars across a suite of value equity strategies and also a high-yield credit business. So the firm's majority employee owned and outclassified very much as a research firm. If you were to just look at the head count alone, if you add up the research team, the research associates, the trading team. So basically everybody that's solely dedicated to the research effort that's more than half the head count of the firm and I think that's a pretty uncommon ratio in our industry today. I've been here 17 years and I'm pretty confident I've never been the smartest person in the room in those 17 years and I've been in a lot of meetings probably one on one meeting with everybody at the firm by now. So I'm constantly impressed by the intellectual horsepower that team which can be intimidating in some circumstances but here it's not and I think it's because of the culture which I view is very phenomenal. It's challenging, you had very collegial, very collaborative and so I definitely think highly of where I work and I'm proud to be part of it. That's great. So you guys recently launched the smid cap diversified value ETF ticker HWSM. Can you talk about having such a long history at the firm? What kind of inspired you guys to enter the ETF game and if you wouldn't mind, if you just talk about what the funds trying to accomplish at a high level? Sure so yeah like you mentioned this the smid ETF we just launched at the end of March or early April of this year. The smid strategy so not the ETF vehicle but the strategy itself via separate account dates back two and a half years but the investment process that we use for that strategy is effectively identical to our small cap diversified value strategy which is a $3 billion strategy that dates back 20 years. So the strategy is only a few years old. The ETF only a couple months old but the process dates back 20 years and the firm offers value equity strategies really across the cap spectrum and also globally and we offer different vehicles to access those strategies like SMAs, collective funds and mutual funds and we hadn't until recently hadn't ETF but I think we're just sort of learning that they're becoming increasingly popular with investors and so we thought it would be a prudent time to get in that game so to speak and so we started this with this strategy because I guess you have to start somewhere and also it didn't appear that there were a ton of small and midcap ETFs out there so we thought it would be a a good place to start. So what do you walk us through kind of the core investment process behind HWSM and kind of what I've read and again you're the expert here. It looks like there is some quantitative factor to this as well as some analysts working on it and those two things kind of work together so if you could kind of walk us through the core investment process here behind this particular fund. Sure so basically it's a three-step process is the way I think about it. The first step like you alluded to the quantitative element where we run these proprietary models the second step is we have an analyst review of those models and then the third step is portfolio construction. You could sort of consider a four-step being ongoing monitoring of it but you know that three-step process might not sound like a terribly unique strategy but I actually believe it's a little more unique than it might sound on the surface and there's a few reasons for that first. I think these models that we use are different than what most quantitative screening tools that I've seen in the past. Typically what those do is they look at various characteristics like you know evaluation characteristics, price to earnings, price to book maybe some other growth metrics and then sort of come up with a weighted score or ranking. ours do not do this. Our models are basically designed to try and replicate what a hotchcus and widely analyst would do if they were analyzing this company by hand given our investment philosophy and that philosophy is basically that we believe the best way to value a company is based on its normal earnings power or you know what a company should earn and sort of a mid-cycle equilibrium environment not necessarily based on the current environment although that's what market prices typically reflect and so put another way margins and returns on capital tend to revert towards sort of normal or average levels over time and so our models try and estimate these long-term normal margins and returns on capital which ultimately leads to an estimate of normal earnings per share and that can be very different than current earnings which again or typically would market prices reflect. They also make a variety of pretty straightforward accounting adjustments just to better capture the true cash economics of a business but then we take the output of those models and if it looks attractive we'll distribute those to our analyst team to do a review. Our models are not perfect and that's something that we fully acknowledge and something that is really I think remedied by the second step of our process which is the analyst review stage which is by far in my view our key competitive advantage you know we have a 24 person investment team it's a stable team the average industry experience of that group is 25 years and the average tenure with the firm is nearly 20 years so you know that's a it's an important asset for a firm like ours it's it's the primary asset that knowledge base that that team is accumulated in their experience and in their experience is working together and the strategy is really designed to tap into that asset or tap into that body and knowledge. So the analyst will review the output of the models they'll make adjustments or override any element of the model based on their no subjective fundamental view of the industry and the business and then we take those adjustments and save them in our database so that the next time we run our models that adjustment is now reflected in the model's output so that helps again with the efficiency of the process and then from there we go to the third step which will be portfolio construction. No that's so it's interesting so how can you how do you view kind of balancing that systematic model output with the human judgment right like how much credence I guess when you go to rerun the model does that most recent kind of I'm going to use the terms well let me use a different term kind of human judgment how how much weight does that really hold in your next run of that of the model. Right it's a good question so I guess the way I think about it is it's it's really the human adjustments that we're after and I think that's what we would place greater value on. The models I think in my view are a way to sort of house all those adjustments in an efficient way and when you run a diversified portfolio having efficiency embedded in your process is paramount and so that's that's kind of how I think of it like the models are almost a research prioritization tool for our analyst team. That makes it that makes a lot of sense to me as well so one of the things I read too is you guys emphasize investing in out of favor and under followed stock so like why is that a segment that's really compelling for you and your team? Yeah I think this process lends itself well to I'd say that the less efficient segments of equity markets and those tend to be on the smaller and mid side you know side of things. You just have a lot of stocks there that are overlooked because there's less wall street coverage there's also less biceite coverage. There's also a lot of stocks in that group that you probably wouldn't want to you know negative earners subpar businesses those with a lot of financial leverage those that might have below average management teams that aren't sureholder friendly. You know and so active management is of course about what you've owned but it's also you know about what you don't own because we are compared to passive indexes and you know I think these out of favor under followed stocks just present themselves in greater magnitude in these small and mid segments of the equity markets. So I was reading as well that HWSM uses a proprietary fundamental risk rating system like what is that score actually measure and how does it impact your portfolio construction? Yeah so this is something that we employ firm wide across all strategies in this strategy this would occur during the analyst review stage. So I referenced earlier that the analyst give us these financial adjustments to the models they also give us these fundamental risk ratings and basically what these are there's scores of one to five one being very positive five being very negative on three different sort of risk pillars. One would be the quality of the business the second would be the strength of the balance sheet and the third would be the quality of its corporate governance. So simply put the better these scores are the higher the valuation that we're willing to pay and you know vice versa. So if these scores were not great we would need a very attractive valuation and if they were flat out bad we you know probably wouldn't own it any valuation. So let's talk about like rebalance frequency or or cadence how often you kind of rerunning the model how often or analyst relooking and everything and you know how often are you going in and making adjustments into a rebalancing the portfolio. So we do that kind of whole process that I walk through we refer to that as our major rebalance process which is really going from the process to beginning to end. We do that twice a year and it takes about six to eight weeks you know to go through that entire process. The in between that we have minor rebalances which take place no less than monthly and that really involves primarily trading back to target weights just to take advantage of volatility in the market but we'll change target weights if there's been a major change in valuation or risk. And we've we've used this cadence really just because we found it to be sort of the right balance of you know making sure the work is fresh, letting the process work and then also minimizing trading costs. So I want to talk a little bit more about kind of portfolio construction and portfolio structure. It looks like the ETF holds quite a number of between 150 to 200 stocks they have what I look at is like a tiered waiting kind of what's the rationale behind the tiered waiting is that have to tie back into the fundamental risk rating system so like how are you waiting these names inside the portfolio? So the 150 to 200 and we've been closer to 150 than 200 you know represents somewhere in the neighborhood of 10% of the eligible universe in which we can invest and that's similar to this small cap strategy that we've been running for 20 years that's worked pretty well so it just kind of feels like the appropriate balance of being diversified but but still not in enhanced index strategy you know the active share for for this strategy is somewhere in the mid to high 80s at the moment. And so that's kind of the justification behind it that the waiting the tiered waiting structure the way it works is and this is approximate but we have approximately 50 names at 1% 50 names at 0.6% and 50 names at 0.4% I get to 200% so and that's largely based on just the attractiveness of the risk return profile so in other words half the portfolio will be invested in our favorite 50 names so to speak. I got it so the fund focuses on this smid category and it's funny the the last the episode prior this is also it's a mid cap strategy not a smid strategy but as we've known kind of mid caps and small caps have been a little bit out of favor which I think could make them a little bit more attractive in today's market environment especially from a value perspective what is the firms overall kind of take on this area of the market and why smid caps or small and or mid or the both of them combined in this particular instance kind of attractive given how the market is kind of relied largely on large cap growth over the last gosh 36 months. Yeah I mean it's almost more like the last you know it's it's a good point um I think the large cap growth index is up like 350% over the last decade came elitably which is I don't know what that would be quite too annualized 15 16 17% something like that where I think the index that we're being compared to the 2500 value is up you know like 100% which would be whatever 78% over 10 year period per year so to say it's under performed is kind of an understatement I mean large cap and growth has done it incredibly well and you know to be to be fair a lot of that all performance I think is rational considering that you know some of these meg seven type companies have grown at a pace that we've just never really seen before at that scale so operationally they've they've sort of all performed expectations and have grown earnings at a pretty rapid rate so that explains some of that all performance but there's also a lot of it that is simply a widening of the valuation gap that you kind of alluded to you know where if you look at sort of the area that we're investing in today so again if you just took the Russell 2500 value the PE ratio on a forward forward PE ratio is right in line with its say 20 year median or very close to it if you look at the Russell 1000 growth it's like 30 times forward earnings while it's you know 20 year meeting median is 20 times so well above it's sort of long-term average and well above other parts of the US equity market and so if you believe that you know a valuation reversion is more likely than the nut we would be in that camp I think that would be good for small and mid caps and also good for value relative to growth but I also got acknowledge this is probably a better case against large growth and it is for you know smaller and value companies so what this is always a million dollar question right you working with an RA who's already has a diversified portfolio where is HWSM kind of where is its role in that portfolio is it kind of a core holding is it or you're looking at kind of satellite exposure like how would you kind of go into that conversation recommending how to use this particular product yeah I think a core long-term holding would make sense and if you have an individual or plan that's looking to simplify other line up so maybe not have small and mid and get that together you know maybe we would pair well with a mid growth manager I think that would be a pretty logical balance you know and I think so investing in this even though the track record isn't very long it does provide access I think to again the knowledge base of a very large and experienced team well I think too you have as you just said I mean you ran a very similar small cap diversified value strategy for for 20 years and so there's enough track record there for people to kind of leverage but you know as you just alluded to this this fund was was launched fairly recently and it's you guys are newer to the ETF space so so far how is talking with investors going and really how are you trying to position this and in the overall market to try and start getting distribution because as we've seen there are so many funds entering the market place it's becoming very noisy and crowded so I would love to hear how you're trying to reach advisors yeah yeah so I mean I think to be honest I think our our marketing folks could answer this a little better than I could at this point and the reality is it's it's been so early right now it's it's really hard to say how things are going so far because it's been literally you know months and I believe our focus is is generally on say large RRAs bank trust broker dealers and really you know any individual that's kind of the do it yourself investor so I think time will tell what the interest level is going to be but I think at this stage it's really just too early to give you you know clarity on that. Well Ryan I mean congratulations on the launch I know it's you know it's definitely exciting and you know it's it's it's a way for the firm to kind of continue it's legacy uh even though it's been kind of in the SMA business for so long it's kind of a new chapter so it's exciting for you guys but I really appreciate your time here with me today but before I let you go where can people learn more about the firm and where can they find information on your ETS. The best places are website hwcm.com it has a bunch of information on the ETF and our other strategies we also have a LinkedIn page where we post content occasionally so you just search for hot tickets and widely capital management on LinkedIn. All right well again Ryan thanks so much for being with me. Yeah I appreciate you having me. you "}
