{
  "id": "17496282",
  "transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology, they are run on and you want more customization and flexibility.\nAs well as a AI-driven model marketplace, UX wealth partners is your destination.\nOn top of that, they have institutional trading, so if you are an ETF issuer or an SMA provider,\nlooking for outsourced institutional trading, UX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and make your practice more efficient.\nWelcome to Behind the ticker. Today we have on Eric Lutton. He is a CIO of sound income strategies.\nWe were talking about their fixed income ETF ticker FXED. If solving a problem in the market where\nthere's a lack of fixed income ETFs that combine traditional bonds with higher yielding alternatives like\nBDCs, REITs preferred, non-core bond ETFs. The end result is a little bit more yield as well as a little bit more risk,\nbut it's really geared towards retirees looking for income, but I'll let Eric explain how the product works.\nSo out further ado, please welcome Mr. Eric Lutton.\nHey, Eric, welcome to the show.\nThank you for having me.\nSo before we get started, why don't you give everybody a little bit about your background and how you\nended up in your role over its sound income strategies?\nSure. Well, I kind of started off after school studying finance and I moved to Chicago\nto trade and work on the Chicago Board Options Association. So that's why I was introduced to\nderivative instruments and kind of a fast-paced crowd. First time I ever saw grown men\nactually throw punches at each other. It was in the pits of Chicago. After that, I had an opportunity\nto move closer to back home to Indianapolis and work at a big insurance company on the money\nmanagement side. I can see co-capital management. So we managed about 36 billion at the time.\nThis was back in the late 90s. Insurance company money tapped heartily and downman found\nAsian money. You know, a lot of pension fund money. That's where I kind of was introduced to fixed\nincome. You know, deep dives of valuing companies going through the case and the cues\ngetting on management goals. Great opportunity. But I always knew someday,\nprobably wanted to move to warmer climate after, you know, some Chicago winners that kind of\ndid me in. So I now opportunity work at an RIA slash hedge fund down in South Florida.\nTook the opportunity. It was great. So I've had a few positions down here, private bank,\nrunning their fixed income and helping out with equities and then an RIA hedge fund and then\nactually did a stint on the sell side after 08 selling, helping RIAs out with their fixed income\nneeds. So building portfolio, selling bonds, trading bonds for them. And over 10 years ago,\nmutual friend put me in contact with Fave Strand, who's the principal of sounding\nincome strategies. Brian Matt now and Dave wanted to start an RIA. We got in contact and I thought,\nhey, this is great. Here's a guy that came from the insurance side that doesn't see\nunderstands how important income is to retirees and their portfolios. So it's probably been\n10 years now. So that's what led me to sounding income strategies and the firm. We focus,\nwe have about 100 advisors now. We start out with just, you know, one, I think Dave won and we've\ngrown to over 100 different advisors, you know, from 30 around 30 million Dave won to we're about\n3.7, 3.8 billion dollars today. That's all organic growth. We've been very fortunate that hasn't\nbeen by any books of business. And that's kind of been our niche to focus on income. We have equity.\nWe have growth strategies as well, obviously. But most of our clients are near retirement or in retirement.\nSo that's kind of our thing. It makes you look, you know, definitely want to talk about more\nthe firm and your experience with building fixed income strategies before we kind of go there.\nWhat do you like to do, Eric? You know, when you're not working, when you're not, you know,\nI always like to know, you know, the things that you like to do outside the office.\nNow, well, my wife says I'm always working. So I need to work on the life balance,\nwork life balance a little more. You know, living in self-forward being based here, it's great.\nYou know, I grew up in the west. So now the fact that I've got palm trees and the beach down the street.\nSo we spent a lot of time with friends and family. You know, probably have kids here before too long\nwhere you get too old. But you know, just just enjoying the lifestyle down here.\nYeah. Yeah. That's great. I'm envious. As you, I'm still in the Northeast and Pittsburgh.\nI'm not as harsh as a Chicago winner, but still aren't the best. So if you talk a little bit\nabout sounding come strategies as a firm, you guys are, you know, a pretty large RA with 100 advisors.\nYou know, how would you describe the core investment philosophy at the firm? Like, what do you\nguys, I know you're focusing on retirees, but is it, you know, are you really leading? It sounds\nlike with fixed income and can you just talk about the overall investment philosophy? Sure. Sure.\nWell, philosophy is pretty easy. It's in our name income. So, you know, like I said, we have\nequities. We have equities. We have growth strategies as well. But our niche is producing cash flow or income for clients.\nBecause, you know, as you know, as clients get older, a lot of them want to lower their risk.\nAnd they want that they want to know if their income needs are going to be met.\nAnd the best way in our opinion to do that instead of trying to guess the tops and bottoms of the\nstock market constantly throughout the retirement is kind of like an insurance company. You're\nimmunizing those liabilities. You're saying, hey, we're going to have these cash outflows in the future.\nLet's kind of lock in. Let's look to match up those assets with those future liabilities.\nSo, you know, it's kind of similar to an institutional style immunization of saying, all right,\nhere's what your needs are. Here's how we're going to produce that with the lowest risk\npossible. Hopefully, that's what we're shooting for. And for younger clients that aren't there yet,\nthat's where it's going to be more equity, more growth strategy until they get to a place in the future.\nAnd some people believe you're not that are young. Really don't. I found some clients don't want\na lot of risk either, even though they're working so hard. They're like, listen, I don't want to see\na 20% decline, you know, even though I'm not going to need the money next a couple of years,\nI don't want to see that. So we're finding some people that are a lot less risk-revert or adverse\nthat are younger, actually kind of like a little more fixed than coming there for,\nthan otherwise most advisors will probably put in there. But again, it's up to the advisor\nin the incline, what the risk tolerance that are and what their needs are. And that kind of\nobviously determines our asset allocation. Sure. So, what led to the launch of F-E-F-X-E-D?\nYou know, what gap in the market where you guys really trying to aim, really aiming to fill\nwith the launch of this product? Because it sounds like you're more of a traditional RAA.\nI would assume you have some sort of use case for your clients as to why you originally launched it,\nbut given the uniqueness of the product, which we'll talk about, you know, really,\ncould you talk about that gap that you were looking to fill? Sure. Originally, we were looking,\nthere's a lot of clients we have children with smart portfolios, maybe, you know, 20,000.\nAnd we were looking for smart portfolios, a way to diversify and put our core plus strategy,\na similar strategy into smart portfolios. Because, you know, with bonds, you don't want to have\nmore than, you know, you don't want to have a one or two lot in your portfolio. If the client\never left them trying to sell that, you know, they could get very, very poor prices, you know.\nSo, it was originally started for a smaller portfolios. And we've noticed, when we went out\nin the market to look before, because launching ETF's pretty expensive, and it would be time\nconsuming. So, we looked in the market and we couldn't find anything like our core plus strategy.\nSo, that's one, you know, as folks today and I said, you know, maybe we should think about launching\nour own, not only will that be good for a smaller internal clients, but also, there's probably\na need out there, you know, for investors that might not become direct clients to ours,\nor of our advisors, but this might fill a niche for them. So, that's when we launched it.\nSo, what makes it, what gives it that your strategy, the uniqueness? I mean, it looks like\nyou're blending traditional core bond fixed income with other things, like BDC's reads,\npreferred, some other specialty bond ETF. So, like, what's the thinking behind that structure?\nAnd what makes this way of investing in fixed income a little bit more advantageous than just\ngoing out and buying, you know, the Ag? Sure. Well, we kind of aim for about 75% to actual fixed\ncoupon instruments. As you mentioned, we hold BDCs and rates, which aren't traditional fixed\ncoupon securities, but I wouldn't call them traditional equities either. They pay, as you know,\nthey pay out 90% of their taxable earnings as dividends to the investor, and therefore,\nthey're not doubly taxed like, let's say, traditional common income stock or equities.\nWe refer to them as cash flow securities. And so, the nice thing about them, like, if you remember\nin 2015, interest rates were pretty low. I mean, we were at basically at zero, and our advisors\nwere looking for 5% plus type of yields. And I'm like, oh, you want to, you want to hold high yield\nportfolio? Oh, no, no, no, we can't take that kind of risk. We want to have, you know, a mix.\nSo, I was like, all right, well, I started thinking of shares I've used in the past and I thought,\nwell, let's build this. Let's add on BDCs because as you know, they're floating rate loans\nunderlying the BDCs. So, we new interest rates were going to go from zero and up. And so, the BDCs\nhave helped us as fixed income fixed coupon securities get heard. As interest rates go up,\nas the Fed moves up, these BDCs actually bring in more income and pay out higher dividends,\nhelp balancing that loss, you know, you might see in the value of a traditional fixed coupon\nsecurity. And similar to Reeds, Reeds, as long as you're looking for Reeds that are adding\nin their masterly instruments, have step-up language for their rents are based on CPI or some floating\nrate thereof that can also over time, help out with that. So, that was why we kind of added those\ninto a traditional portfolio. Because overall, as you know, when we're building these out,\nyou know, we're trying to shoot for building, if you look at BDCs and Reeds and sovereign debt\nversus traditional investment rate bonds for a second. If you're looking for BDCs and Reeds,\nthey have, you know, they're in the low 50s to mid 50 correlation to investment rate bonds.\nAnd the low 60s to mid 60s with sovereign debt. So, here's an opportunity where we're adding\nmore yield and since they're lower correlated, you know, the higher risk of just to return. So,\nwe fill that's what's adding value to the portfolio versus just fine as you put out, as you said\nthe act. Right. So, can you talk about how the, you know, your internal process for kind of\nevaluating some of these non-core opportunities? I'm sure you have some sort of way of\nfinding, selecting, doing due diligence on them before they're added to the portfolio. Can you\ntalk about that security selection process a little bit? Sure. Sure. For BDCs, management's\nvery important. Talking, speaking to management, finding out their background. Really looking at\nthe pipeline of how they're bringing in loans. Are they doing mostly club deals? Are they bringing\ntheir own companies into the market and evaluating them? So, obviously, we're looking at net interest\nand we're looking at the non-accruals. Are they growing? Are they managing those? Well, what's the\npayback? You know, if there is, happens to be a loss. We're just looking at the growth of that\ncompany. Is their net asset value growing? You know, a lot of people always look at those talk about\npremiums or discounts in that asset value. And one thing you'll notice is the companies that are a\nlittle bit higher that you're paying a premium for. Those tend to stay at premiums. Where the discounts,\neverybody thinks, oh, I'm going to buy a discount and it's going to increase to a premium and it\nnever does. And people are like, why has it in the why is it still a discount? Because the market\nis estimating the value of that image. And one nice thing about BDCs and rates of constantly issuing\nequity and debt to grow, because obviously their earnings are getting paid out in the form dividends.\nSo, if a BDCs are premium, guess what? They're issuing stock at a premium. So, it's creative. So,\nthat's not a horrible thing. Obviously, we want to see the leverage stake fairly low.\nI'm in good managers, usually keep it pretty low. And then with the rates, you're dealing with 11,\n12 different sectors and equity rates. I don't go into mortgage rates, because now I'm betting on\nhow good as management, playing the trade spread game. In other words, we'll borrow an X and we're\ngoing to buy more each paper at Y. And you're always trying to guess, as management good at that\nspread game. What with equity rates, we're buying real property with real cash flows. For me,\nthat's an easier thing to understand and manage. So, we'll look at health care rates, how they\ncame through COVID. What's the government? How's Medicaid, Medicare? How's that going to reimburse them?\nYou're looking at the future that you're looking at how they're managing their cost to cost\ngot a little off control with skilled nursing facilities and hospitals. So, you're looking at\nhow management's controlling that. Are their operators good at managing those facilities or not?\nAnother type of triple net lease rate where the lease is paying the interest, the upkeep,\nelectricity. So, you can understand the spread a little bit better for that management company,\nfor that rate. How are their tenants? Are they investment grade tenants? Are they big box\nstores that aren't probably going to go out business aren't going to have trouble paying the\nreeds to their rental rental rates, how long are their terms? So, you're kind of looking\nall these agreements to try to justify, hey, this reeds are going to have, they're not going to have\na problem with their dividend any time soon. In fact, they're probably in the future years,\nlook to increase those dividend yields. So, that's what we're looking for. How the management\nis managing those cash flows in the future? Yeah, very traditional, you know, almost analyst type\napproach you guys have taken. And so, when you built this strategy out, how are you thinking about\nthat balance between income generation and then, as you've said, the importance of capital preservation?\nSo, where does that, what comes first, or how do you balance it? Sure. Well, minimizing risk is great.\nWhether we like it or not, our global financial system is set up. It's hard-coded, if you will,\nto force us all into some level risk. Otherwise, inflation, you know, if we just sell the\nsidelines, cash, money market cities, inflation's going to eat away our capital over time.\nSo, we have the balance capital preservation, withering a positive return over an above inflation.\nAnd while there's definitely times, you know, things like COVID or 2022, worst fixed income\nmarket for decades, worst government, U.S. treasure market, ever. There are times,\nor I was like, you know, I'd love to go sitting 30% cash right now and go play golf because this\nis just going to get bad, but you have to understand, someone's using fixed and using that strategy,\nthey're getting a dividend every two weeks. So, what happens if I have to have a cash balance\nand I do not want to cut that dividend? It's better to look at the best companies we can\ninvest in during that time because we need to stay fully invested and people just have to understand,\nthere's going to be some level downside risk. It's easier for them to manage their portfolio\nand have them go to cash than me, just jumping to 30% cash, which they're probably not expecting\nand all of a sudden, where's my dividend? It's supposed to hit today. You know, like, oh,\nwe'll try to pay in a couple of weeks or next month. You know, investors don't want to hear\nthat. That really can throw off portfolio managers and investors. So, you know, capital preservation\nis key. It's important, but we can't always go sit on the bench, you know, in high cash.\nWe've got to split up, just take the best companies and try to find other ways to manage\nthat volatility. Sure. So, how are you determining when to adjust the mix between investment\ngrade and some of this high-yield exposure? Is that on a weekly basis, a monthly basis, a\nquarterly basis? Is it fully active where you guys are doing it on the fly? Like, can you kind of\ntalk about when you're when you're adjusting that mix and what's driving that decision?\nYeah, I know a lot of funds will look to do certain calendar rebalances. That's not how we manage\nin fixed income because fixed income. It's not like, you know, if I'm an equity manager\nand I've got a lot of Nvidia, I was sudden it's up huge. Now, I've got to rebalance\nbecause I don't want to get too overweight. Well, with fixed income, it kind of, you know,\nyou're not going to get negative yields. So, I let the market kind determine our mix,\nlike the mix between investment grade or high-yield bonds. So, for instance,\nyou know, when the market turns risk off and spreads start to widen out,\nwe might, you know, I might look a little bit more high-yield and say, hey, these yields are\na little too wide. These are good. Some of these, we're looking at our good credits.\nWe're going to get paid over time to add these. And if investment grade gets too wide,\nthen we look at investment grade games. But we also consider the overall level of yields.\nIf U.S. Treasurer yields are pretty high as they had been in less, you know, year and a half,\nall else equal. And spreads really aren't moving too much, pushing U.S. investment grade\nor high-yield out of whack. We might just look at the overall yield and say, you know, what?\nI can add investment grade names, quality names, low risk. And, oh, the overall yield is pretty\nhealthy. So, I'm just going to look to start adding more investment grade time.\nYeah. No, it makes sense today. You kind of answered the question. They're a little bit\nfor me. But what advantages kind of does FXEDs, active management approach that you guys are taking\nprovide over just, again, back to, I don't mean to pick on the Ag, but just that's how a lot of\nRIAs kind of put their 60, 40 together. They don't care about the fixed income side. They're basically\nusing it as a risk argument. And so, can you talk about the advantages? I'm sure there are many\nof actively doing it the way that you're doing it. Sure. Well, for adding alpha and equity has\ngotten very hard over the years. Equity markets are extremely efficient. And that's why you don't see\ntoo many majors year after year meet the index. Well, fixed income, it's a little bit easier. You can\nstill add alpha. Like I said, I used the example before in video. If a major is underway in video\nor Mag7 or AI names, they're going to clearly underperform. And if they get too heavy in that,\nthinking they're going out performing the market turns now they're underperforming. So,\nthere's a constant zigging and zagging with equity. With fixed income, like I said, if a company's\nearning out earns, they're, you know, let's say they're a nickel over expected earnings for\nthe board. It's not like their bonds are going to rally 10, 20, 20. So, it's a little more stable\nand fixed income. So, something like the ag, which has to be heavily invested in agencies and\nUS Treasury debt. Now, for the first six months this year, the ag is done fairly well. It's\nperformed very well. But the problem is once that settles down, once interest rates, you know,\nas people say, you know, maybe the Fed isn't going to move as much as we thought. And that settles\ndown. And then you get some more tariff news as we've had come out recently. Like Trump says he's\nnot going to back down this time. And if that's the case, you start to see Treasury yields,\nwhy are Treasury starts to sell off a little bit because we're like, well, maybe we've got some\nmore headwinds coming. Well, with fixed income, with a nontraditional, like fixed,\ntelling you, do we have those other asset classes? But we can zig and zag more. I can say, you know,\nwhat? Now's the time to put on more high yield, where a major in the ag, or a major in towards\nthe ag, or an index like that, they have to focus on kind of matching that.\nAggregate. So they've got good bonds and they've got bad bonds. Well, an active major,\nlike us, we can say, you know what? Let's add more weight to good bonds and let's try to avoid\nall together the bad bonds. So over time, we should outperform.\nSo if you're kind of talking to an advisor or a client with an already diversified model portfolio,\nhave got fixed income exposure in there, where does FxED kind of fit in and overall diversified\nportfolio? Is it going to be your core fixed income exposure or how do you see it?\nYeah. Well, it's, it's, you have to consider the investors target rate return or income need.\nYou know, what's, what's that need? And back into their allocation, they need from fixed income\ninvestments, given their state of yield. So the advisor is going to have to sit down with\ninvestors, figure that out. And, you know, they can reach their target return, obviously, with\nless weight to fixed versus dean, up more capital, going into a, a Ag-like or passive fixed income fund.\nObviously, they could buy less of fixed and then take that difference and then either invest\nin the risk free rate, potentially lowering risk further, or maybe potentially using some of that\nextra capital from growth. Yeah. So when, when you're talking, it sounds like your firm\ntalked to like a lot of retirees. What role do you see this ETF in particular, playing in their\nportfolios? I mean, you kind of just answered it, you're going to back into it. So it's really at\nthe end of the day, how much income do they need, type question, is, is that right? Yeah, yeah,\nwe don't, we're not competing versus certainly a growth equity or even the S&P. What we're trying\nto say is, all right, if this client has a target return, let's say their need is 6%.\nWell, if they were to pick up the Ag or a traditional investment grade bond fund, they're not\ngoing to get 6% yield. I'm, you know, I'm free with the Ag is yielding right now, pretty low to\nunless it's who's up together. That's how much I follow it now because we're focused on\na little more growth than that, but that's, that a lot of those traditional funds aren't going\nto meet that need. But with something like fixed, we're, you know, right now we're in the upper\nsixes, you know, it was what we're projecting. So if we can yield 6.8, 6.9 and the majority of that\nreturns coming from income and we're meeting that need, I think it's better for them to put it\nin something like ours than eating up a bunch of capital, you know, and then hoping, then what\nhappens with the, you know, 60, 40 types. For full of the majors or the investors, they've got to\ngo after growth and really time that well to make up for that loss of the yield and the Ag or\na traditional fixing gum, you know, ETF. But when they're going into acclimaties or something like\nfixed, that's trying to boost those yields and also lower the overall risk adjusted return,\nthat's where we think we're adding value for them and freeing up some capital that they can use\nfor, you know, for even lower risk or saying, you know, what? Let's pick up a little of the\nmagnificent seven or some of the few AI stocks that's in the hands of the overall portfolio.\nWell, I mean, Eric, we're not too far from the period in time where the only place to get income\nwas inequities, you know, I mean, the amount of excess risk retirees were having to take in that,\nyou know, around 2000 area, year 2020 area, not 2020 area where, you know, it yields\nbasically zero and, and a lot of clients that we talked to in a lot of advisors were like,\nthe only place we can get income is in, you know, quality dividend paying equities and it's\nexcess-resistant retirees just didn't want to take. So the product like FXED, I feel like, is a,\nis a good product for people who are looking for yield now, now that rates are a little bit higher,\nsix, anything over six is super healthy. And so I think you guys are going to have a lot of success.\nSo before I let you go, I always need to ask where can people learn more about your firm,\nwhere can they find information about this ETF? And as well, you have another one, am I right?\nYeah, we have our on our equity side. We have another one, Divi, which is a high dividend\npaying equity strategy, value, blue chip type of companies. So a lot, you know, our, our strategy is\na lot more boring than, you know, going into, you know, the growth equities and AI, which is\nthree hot right now. But anyone that finds wants to find out more about our firm or our funds,\ncan go to our website, soundincomestrategy.com. We have our fact sheets on all of our strategies there.\nAnd, you know, access to all of our advisors across the country, if they want to talk to one of our\nadvisors directly, you know, if they don't want to call the headquarters here in Florida.\nSome people like to do that and they want to get out of this snow and ice and come down,\nhave a good excuse. Well, Eric, again, thanks so much time for spending\nsome time with me. I appreciate it. Good luck as you guys, you know, continue to grow and expand,\nyou know, this particular product. Thank you for having me.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}