{
  "id": "17529585",
  "transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology they are run on\nand you want more customization and flexibility, as well as a AI-driven model marketplace,\nUX wealth partners is your destination.\nOn top of that they have institutional trading, so if you are an ETF issuer or an SMA provider\nlooking for outsourced institutional trading, UX wealth can also be your destination.\nSo check out UXwp.com to find out all the ways UX wealth partners can help grow and\nmake your practice more efficient.\nWelcome to Behind the ticker.\nToday we have on Seth Cogswell, he is the portfolio manager and founder over at running\na capital.\nWe are talking about their ETF, RU and N, the running oak efficient growth ETF.\nThis is a long running SMA strategy going back decades, Seth's father actually put\nthe original ideas and pieces together.\nThey have been running this as SMAs and UMAs and now have jumped into the ETF business.\nThey've had a ton of success already.\nThe strategy is a mix of large cap as well as mid cap 50 to 75 names in the portfolio.\nReally, really well thought out.\nSo I think you'll find the set up really interesting.\nBut I'll let Seth tell you all about it.\nSo without further ado, please welcome Mr. Seth Cogswell.\nHey Seth, welcome to the show.\nThank you.\nGood to be here.\nSo before we get started, why don't we talk about what inspired you to start running oak\nand a little bit about your background and how you got here?\nIt's been a long path beginning before I was born.\nIt's a little different from probably the most similar managers.\nMy father actually created our strategy in the 70s, again, before I was born.\nSo pretty much out of the womb, I was surrounded by investment management.\nSo I grew up kind of hearing about what my father was doing, pre-internet.\nThey had these blue and orange stock chart books for the New York Stock Exchange and NASDAQ.\nAnd I would steal those and comb through them and imagine how easy it would have been\nto buy low and sell high.\nAnd you know, got my dreams going and at some point when I was in college and had a few\nhundred dollars to my name, set up a brokerage account, did a lot of really dumb things,\nwhich luckily taught me with a pretty small amount of money that maybe I should actually\nlearn what I'm doing.\nBut everything I could find basically lived in the library, I'd run from math class to\nthe computer lab and you know, day trade, which is maybe not the best.\nBut did well, loved it.\nAnd then when I graduated, I became a trader in New York, that firm technically created\na small hedge fund around what I was doing.\nSo between trading and the fun I did that for a while.\nAnd I always thought that was my dream job, partially because of the market wizard's\nbooks.\nSo I don't know if you've ever read those.\nBut they always made it seem so amazing to kind of trade on your own.\nAt some point, I realized that I was basically just playing a high-stakes video game for\na very wealthy family.\nAnd at the best of times, I almost felt like I was stealing money from a grandmother.\nSo it just wasn't very fulfilling.\nAnd so I, you know, opted to pivot.\nMy father had been wanting to go off on his own for a while, but he's a very introverted\nindividual.\nAnd so I opted to go to business school to see if it made sense, partnered up with the\ninvestment management professor there, put it through the ringer and concluded that his\nstrategy was actually far better than even he realized.\nAnd despite probably my better judgment and the advice of pretty much every single person I\nknew, I launched running oak with a whopping $800,000 under management.\nSome of my professors were my first clients, which is cool.\nBut yeah, I mean, it was a circuitous path that led to where we are today.\nYeah.\nNo, it's one of you.\nAnd I have similar backgrounds.\nI mean, my dad wasn't in the financial services industry, but I caught the bug early\ntoo.\nAnd I think I'm a little younger than you.\nI was able to at least day trade while I was in class.\nI didn't have to run from math class to the computer lab.\nI had it in my pocket at that point, but no, it's great.\nAnd before we kind of get into the nuts and bolts and the boring stuff of investing,\nit's, I was like to know, what do you like to do, hobbies, anything that keep you busy\nwhen you're not working?\nWell, I have three kids, which means that I don't have a whole lot of spare time and\nrunning a business is also not exactly the best way to have a lot of spare time either.\nI have some odd hobbies, I'd say, I don't know if this counts as a hobby, but I do\nspend a lot of time meditating.\nI try to spend 30 to 40 minutes every day doing that, really, just trying to be present.\nIt's easy to get lost in the moment when you're chasing kids and running a business.\nAnd then otherwise, I've always been really into music, so in middle school high school,\nI started playing trumpet and then moved to Tuba and was quite good, but I quit for very\ndumb reasons, despite loving it.\nAnd so when I graduated from college, I wanted to teach myself how to play saxophone,\nbut I couldn't afford one.\nSo I bought a clarinet for $200, taught myself how to play, played for a few years and then\njust sort of, you know, life got in the way.\nAnd then recently, over the last two years, my oldest kid started playing and his music\ninstructor also taught clarinet, and so she took me on and so, you know, any given Saturday\nmorning, I'm probably online playing clarinet for 30 minutes, maybe not the most macho\nof instruments, but the more I learned about it, actually, the more excited I'm about\nit.\nAnd then actually recently, I started taking lessons on the tenor sax, too.\nSo that's, there's some of the benefits to music, not to mention, if done right and I\nprobably rarely do it right, but it has the ability to kind of speak to your soul.\nSo it's, it's a cool hobby that I get a lot of fulfillment out of.\nNo, that's great.\nI've tried to learn instrument multiple times, whether it be piano or guitar.\nI just don't have the brain for it.\nSo, kudos to you, I'd love to be able to play an instrument, just not, not, I'm not\nbuilt for it, but so let's get back to running out.\nYou guys run like an efficient, you call it efficient growth approach, and really, how\nis that evolved over time?\nAnd then you kind of talk about some of the foundational principles that's really built\nthis investment mantra that you guys hold.\nIt can be really the basis of the strategy as the fact that we don't feel that we are\ngood at predicting the future.\nSome might be able to do it, but we don't feel that we can.\nAnd so the strategy is really based on what we know versus what we don't know.\nSo it's based on three very simple economic principles which are maximized earnings growth\nbecause nothing drives performance like earnings growth when you buy a stock, you get\nto share that company, if that company is growing great, the value is going to grow.\nThe maximize earnings growth, the second, those being very disciplined around valuations.\nEverybody talks about investing in undervalue companies and certainly we seek to do the\nsame, but the last thing you want to do is hold companies consistently or assets that\nshould go down.\nAnd so again, that goal is to maximize earnings growth to really kind of up that exponential\ngrowth for our clients, but then also nothing kills exponential growth like large draw\ndowns.\nAnd so to focus or that discipline on valuations and then there's an extra focus on downside\nrisk in general, one of the mean ways we look to protect clients in that regard is dead.\nBut that's my father actually settled on those simple principles by and large.\nIt's changed a little bit, but in the 70s.\nAnd so it really hasn't changed much.\nWe are effectively doing what he created and has been running for almost four decades.\nOne of the reasons why it hasn't changed much is because it didn't need to.\nAnd that's because the simplicity and kind of common sense nature of the investment strategy.\nAnd so that sort of simplicity has led to it being very robust in standing the test of time.\nSo it really hasn't changed or evolved much.\nWhen I took it over, I have a lot of confidence in my intelligence, whether it's well-founded\nor not, you know, we can debate.\nBut I'm very good at making something better.\nBut on this, I've had to hold myself back from the very beginning my goal is to just let\nit be because it did so well for so long.\nI had my chance to create something that was better and I didn't.\nSo it really, what we do right now is almost identical to what we've been doing for four decades.\nYeah, and you also do this not only in the ETF, which we're going to talk about, but you also offer\nUMA models, SMA.\nAnd so how did you guys decide to kind of go from traditional SMA UMA type to deciding\nhow I want to get in the ETF business?\nSorry, you froze up for a second.\nI didn't get the entirety of that question.\nThat's okay, Seth.\nNo, I was just saying, you guys run a variety of different things.\nSMA is UMA's ETFs.\nYou know, the ETF, how did you guys decide really to go from that structure and then move\ninto and get into the ETFs?\nWhat corporate decision went into saying, okay, look, I want to make this thing public,\nwe're going to go out and get into the ETF market.\nLaunching an ETF has always been on the table.\nIt was one of the options even when I started running Oak over 12 years ago.\nAnd it was one of the things that I considered the ETF markets changed dramatically since then.\nBefore it was probably more a matter of licensing it to a big company and getting five basis points\nor something.\nAnd so the world has changed, but again, when I started the company, I started out of my\nhome savings account and with a whopping $800,000 again.\nSo I had to be very mindful of the sustainability of the company.\nI had, again, I had watched the strategy perform very well over decades.\nAnd I felt that the only way it wouldn't be very successful was if I ran out of money.\nAnd I wasn't able to pursue it indefinitely.\nAnd so severed accounts made the most sense initially, just because you can run them very efficiently.\nAnd there were a number of benefits.\nThe ETF just wasn't a great option at that time, it just didn't seem like it.\nWe opted to run the ETF two years ago when a firm that I've known for seven years, I'd actually\ncold-called them quite a while ago and spent tons of time with them, grabbing lunch,\ngrabbing drinks and then out of nowhere they're like, you know, we're not going to invest in SMS.\nAnd I was like, well, why didn't you tell me that seven years ago?\nAnd then they're like, but if you had an ETF, we'd invest a significant amount of money.\nAnd I was like, well, why didn't you tell me that seven years ago?\nRight. So it was really ETF was always on the table, it was really just waiting for the right\ntime. And the right time presented itself, you know, I have a lot of made-up statistics I like to throw\naround, but one of them is I have a feeling that roughly 80% of managers that launch ETFs\nregret it, just because they're very expensive to manage. And they're very difficult to grow.\nAnd so that was always at the top of my mind, again, it's my company, right? It's my savings\naccount, basically. And I have three children and wife dependent on me. So I had to be very mindful of\ntaking on that risk and launching it at the right time, and the perfect time presented itself.\nAnd so we launched it two years ago.\nThat's great. So let's talk about the running oak efficient growth ETF,\nticker, are you and N? So for listeners that are new to run, how does ETF work at a very high level?\nAnd then there's about 50 to 70 stocks in that portfolio. You talk a little bit about that\nefficient growth process, but maybe dive a little bit deeper on the process from getting to\nyou know, a giant universe to 50 to 70 next.\nYeah. So one of the things that really separates run, or if you're a caddy-shack fan, run,\nwhat really separates it from many of our peers is actively managing ETFs are fairly new.\nOur strategy on the other hand has a five-decade history, right? Our SMA has a 12-year audit\nof history. And the ETF is the exact same holding, the exact same strategy and process.\nSo there's really nothing new about the ETF, other than the structure itself. That's it.\nAs far as how we end up with the portfolio, we begin with companies that are above\n$5 billion trade on U.S. exchanges. When you constrain your universe, you constrain your potential.\nAnd so the first thing is to be just very thoughtful of where you're going to apply those constraints.\nAnd we can strain our portfolio at $5 billion below because it's hard to argue that you don't\ntake on more risk as you invest in smaller companies. Whether they're less liquid, whether they're\njust simply less proven. But we're open to anything about $5 billion. So that's that is our\nstarting point. Our goal is to maintain a portfolio consistently that has significantly higher earnings\ngrowth in the S&P because, again, nothing drives performance like earnings growth. Historically,\nthe portfolio is averaged around 12 to 13% earnings growth versus the S&P, which is around 67.\nThat's in B's earnings can be wildly volatile. But over the longer in the average around 67,\nthere's reason to think that maybe even that begins to decline a little bit.\nBut regardless, that's about a 6 to 7% gap on average that we maintain that we would expect to\ndrive performance. In order to reach that 12 to 13% average earnings growth, we have to have a\ncutoff that's below it. So generally, it's 10% anything that we don't expect to\nperform at that level going forward, we eliminate. We then run our valuation model on\neverything that made that first cut. The valuation is the way in which we value companies is\ncertainly one of the biggest differentiators. I haven't seen other people doing it the way that we do it.\nMany do either discounted cash flow models where you're sort of trying to predict the future\nand discounted back. And for us, that's we don't feel that that's something that we really\nthat we do best. Many will look within a sector and invest in the cheapest price to book or\nPE. We don't do that either. Instead of what we do as we really measure the wealth creation of a company\nover an extended period of time, compare that to the S&P 500 and then have create a relative comparison\nfor the price do. It's a lot more complicated than that, but just to give like a little bit of an\noverview, it's a relative valuation, which I really haven't seen other people doing.\nAnything that's deemed to be overvalued, we cut. We don't want to invest in companies that should go\ndown. And then at that point, if we look at a number of simple metrics that we believe very\nclearly lead to greater downside risk, the most important of which, especially over the next decade,\nis debt. As individuals, we know if we take on too much debt, it's not going to work out well.\nAnd that's the same for small businesses and large corporations. And so we invest away from companies\nwith high debt levels. And we look at some other smaller things. We then score each company that\nmade it to this point based on those different qualities or characteristics. Obviously, higher\nearnings growth has preferred more attractive valuation, lower debt levels. And then we force\nrank the less and invest from the most attractive to the least. As we do, there's a few considerations\nthat we have in mind. We know we want 50 to 75 companies right now. We hold 54. Usually that number\nstarts as a decline as we get later in bull markets. On average, it's probably in the 60s. And then\nwe look at industries, which is a little more granular than sectors. Value line breaks the market\nup in the 99 different industries. And we want to make sure that we're diversified in that way as\nwell. And so our goal is to maintain a portfolio that has a minimum of 30 industries. Usually\nit's in the low to mid 30s. We have a hard cut off of 25. And then we'll cap any one industry at\n15%. So the end result is you get this portfolio that is very risk-focused as far as the stock\nselection. They have to be a track of value per numbers. And they have to be lower risk in the\nnumber of ways. And then we build the portfolio with risk in mind as well. So it's diversified across\nnames. There's a larger number of names again, 50 to 75. It's equally weighted. And then\nwhat's also diversified across industries with the goal to really reduce idiosyncratic risk.\nNow, so that one company doesn't really matter. The goal is to just consistently maintain\nthose qualities that we feel are highly likely to provide higher return and lower risk of\nlong run, which again, are higher needs growth, attractive valuations, lower downside risk.\nYeah, well, I love the portfolio construction process. I agree with a lot of things to just said\nthere. The what if you're going through a cut this, you come going through and scoring these\ncompanies and arriving at your list. However, the portfolio is you're equally weighting.\nSo have you put why do you prefer that equally weight weighting approach rather than maybe\na score way to approach by weighting heavier, maybe some of your better scoring names? But\ncan you talk about why you've kind of decided that equal weight is superior?\nSo most simply, if we compare equal weighting to cap weighting, equal weighting, up until the\nlast decade had outperform their cap weighted counterparts over every single rolling\ndecade in history except for very recently. Yeah, so somebody who runs an equally weighted S&P\nsector strategy, I believe me, the last handful of years have hurt pretty bad. Yeah, not on the reason\nwhy equal weighting outperforms cap weighting of the long run is because it takes advantage of\nmean reversion. Cap weighting is basically a momentum play. Luckily, we haven't seen a bear market\nwe could argue in 16 years which is really favored cap weighting as people just pile into the same\nthings driving that way of larger and larger. But of the long run, stocks can be noisy,\nright? You've got people buying and selling based on different reasons, emotions and so\nequal weighting takes advantage of that noise. Now for us, as far as equal weighting versus\nalternative weightings, that's something that I've thought about a lot. In that really touches on\nan important philosophical point of our strategy which as many managers have heard, maybe not\nheard, but lean toward more concentrated approaches because that's a way to differentiate yourself\nfrom the indexes potentially provide outsized returns. If you're taking a concentrated approach,\nmaybe you do a very deep fundamental dive on a company and you decide this is a great investment.\nYou do that for some other companies and now you've got a portfolio of high conviction names.\nWe have a totally different approach. We have, particularly me, I have absolute conviction\nthat if we maintain a portfolio with higher and ex-growth, attractive valuations,\nlower downside risk, that we will, over the long run, provide higher return, lower risk.\nNobody will ever be able to convince me otherwise. Now, we don't necessarily\nhave that level of conviction for the individual companies though, right? We're not talking\nto management. For us, we don't feel that's where we have an edge. So, we look at each\ncompany as long as it meets our criteria as a coin flip. Basically, you can think about flipping\na penny, you can flip a penny ten times and get ten tails in a row. It's unlikely but I could have it.\nThe more you flip it though, the more likely it approaches 50%. So, 50% have 50% tails.\nWe look at each company as a coin flip. Each company gives us an opportunity to deliver those\nqualities that we aim to provide our clients.\nNo, it makes a ton of sense. The whole process is we've talked about is a completely\nrules-based approach but it is actively managed. So, where do you think the team adds the most\nvalue and can you also talk to me about how often you're re-running the process to either\nselect new names, add, remove, re-weight and you can just talk about that a little bit as well.\nSo, the difference between passive and active or the definition, I feel like is ever changing.\nI don't even know if I know what ever definition people want to apply these days, but we are\ndefined as active because we use thought. That's basically it, right? You're either thinking\nor you put on autopilot. And you put on autopilot in a way that the S&P or whoever owns the\npassive world agrees that that's okay. So, our strategy is very common sense and thoughtful\nas far as how it's constructed but it's actually very passive like as far as the rules-based\nnature of it. You could easily argue that our strategy is indexed like. Now, it's not a black box.\nThere is a little bit of complexity there, but it's largely defined as active because it's thoughtful\nand it's not just run of the mill. Now, as far as the role that we play otherwise in an act of\nmanner, the purpose of the rules-based nature is really to remove us from it. It's well documented\nthat a well thought-out process will outperform an in a thoughtful individual most of the time.\nJust because as people, we are inherently emotional, we have opinions. I certainly don't lack\nfor opinions. In the goal of the rules-based nature is to really remove those opinions, remove\nthose emotions so that we are very consistently providing precisely what we tell clients will\nprovide. And so, again, the goal is to not be especially active. There's very rare moments where\nwe step in and those are kind of one-off. And largely just if the data, if the world is changed\nbut the data doesn't yet reflect it, maybe we'll step in. So if there's a SEC investigation or\nsomething, the we'll step in. But otherwise, we really try to adhere to the rules with as much\ndiscipline as possible. That's their job and purpose. So he just talked real quickly though about\nhow often are you going to rerun that process? How often is the end? We'll call out your index\nlike, how often is that changing rerun and quarterly monthly weekly daily? How often do you make\nconditions? So the data that we utilize is somewhat slow moving. We're largely using quarterly\ndata. And so, yes, the price is moving a little bit day-to-day, but we hold the average company\nfour to five years. So there's no reason to be running a day-to-day of a pretty fruitless.\nAnd so, we reconstitute the portfolio where we make additions and deletions three times a year.\nWe do that at the end of April or early May because that enables us to take into account\nthe full prior year worth of data. We do it late November, early December. That gives us the opportunity\nto kind of build the best portfolio heading into year end as well as certainly on the SMA side,\nrealize gains if it makes sense while realize losses before a year end if it makes sense and then\nkick gains just a few weeks out so that we can push that off. And then we split the difference in\nAugust. And then we'll rebalance the portfolio because again, it's intended to be equally weighted.\nWe usually rebalance the portfolio at that time and then we'll also rebalance as needed depending\non what's going on within the market. That's great. So, you know, you guys have had a lot of success\nout of the gate. I mean, you launched with just a few million dollars in assets and you've quickly\nscaled beyond 350 million. What do you think really drove that early moment? I know you had mentioned\nyou had somebody who was already interested, but that's significant growth in a fairly short period\ntime. I mean, the answer is hard work. Maybe a little bit of luck in that again, I didn't create\nthis strategy, so I inherited it. But it's been very hard. We launched with two million,\nwe're up to a 370 now, not that I'm counting in two years. And but again, a lot of that was driven\nby relationships that I had built for years leading up to it. I mean, we had, I did not launch the\nETF until we had at least 50 million committed that I thought was dependable. And then it also helped\nthat at the time a launch, we were in the top one percentile of midcap core managers. So that's\ncertainly helped. That's a nice little sound bite to get people's attention. And then again, hard work.\nA lot of people, I think a lot of people launch ETFs with a little bit of a field of dreams\nmentality, where if you build it, they will come. And it's just not true. It's very, very hard to grow.\nAnd I have never worked harder in my life than the six months leading up to the launch,\nand then after it. I mean, there were times, hopefully this is an over share, but there were times\nwhere my wife couldn't find me. And I was laying in bed in tears because I was just not sad,\nbut just so exhausted from just pushing so hard. And at the time it made sense. And it was\nvery fulfilling. But it is not easy. Getting from going from 2 to 3 and 70 million,\nthere was some luck that helped. But it was again a lot of hard work.\nWell, no, it's a great story. And I think too, you're coming, you're actually coming into a\ntime. As you said, you think midcaps could be an attractive space right now. I mean, we've seen\nso much go on in large cap growth. Everybody's chasing and binge chasing the max 7. But you have\nsome midcaps exposure here. So how was run and then position to take advantage of that? And\nyou know, as midcaps, hopefully about to have their time over large gaps, like we've seen\nover the last, I don't know, 36 months. We might have to do another podcast just to fit all\nthis, whatever I could say on midcaps. But, you know, there's four words that I'd say are the\nreason to really, for many to rethink their approach to investing. And consider midcap or just\nthe slightly unconventional approach. And those four words are higher return low risk.\nMidcap stocks over the last 33 years have outperformed large cap by last I checked 60 basis points\nin the annualized. That adds up to over a 20% return, I believe, over that period, right? So very\nmeaningful. And midcap absolutely smoked small cap over that same period. Keep in mind, mid-outperformed\nlarge, despite large and make-up destroying everything for the last decade in mid-still\nupper-form by 60 basis points. And why, so first of all, you've got that data, right? You also have\nthe philosophy for the rationale back and that up, which is midcap stocks, or they've kind of graduated\nfrom small cap. They must have had some product that was successful to get to that point.\nAnd so therefore we'd expect them to be less risky than small.\nLarge, the bigger you get, the harder it is to grow. Generally speaking, now there's a network effect\nat times for some companies. But, you know, if you think of Apple, it's such a large, massive company.\nIt's really hard to see how they can double. Whereas the midcap company, if they got there\nbased on one product, now they only need one more product, potentially double. And so midcap\nis the sweet spot of asymmetric return and risk, which is what we should all be seeking. So again,\nhigher return, lower risk. Again, there's a number of different ways I could be. I could really\nrun with this because I love talking about this, but there's a few very important considerations\nas far as this goes. One is the idea of, actually let me back up for a second. As I've\nspoken with more and more large firms and got in a better view of how many people most people\nare building portfolios, it's become really obvious. Why? One, how few people actually have midcap\nand two why they should. One is, most people build portfolios in a similar manner, many of the\nbiggest firms. They started with large cap growth because if you didn't have large cap growth\nover the last decade, you got fired. So you started with that. And then you compliment it with\nmost use mid, so small and mid, it's sort of a one-stop shop to just sort of add some diversification\nin the invaluable. And the problem is, many don't realize we invest in these large cap portfolios\nthinking their diversified when they're not. And I would be guilty of the same, many don't look\nunder the hood. So if you look at SCHG is one that I use a lot, just because I see it regularly.\nVery recently SCHG at 60% of the portfolio invested in only eight companies. Those eight\ncompanies are very highly correlated. They're all mega gap, like they're, so you're getting 60%\nof your portfolios in this tiny sliver. And the problem is people invest in it thinking they're\ngetting this diversification when they're not. And then if you think about investing in smid that's\ncentered around that small midline and so you get very little upper midcap. And so there's this\nhuge gap in most people's portfolio in a place where we would never expect there to be absolutely\nnothing invested, right? So we're talking upper mid lower large cap is a woefully under\ninvested area. And we're not talking micro, we're talking big companies. And again, why that\nreally matters and why people should seriously consider it is very simple concept that I never hear\nanybody talk about. And that's investing where other people aren't. If you're investing where other\npeople are. And so over the last decade, you could argue that the big tech names, the S&P 500,\nis maybe the most overcrowded trade in history. And so if you're investing in those companies,\nyou're investing after everybody else or with everybody else. And just fly supply and demand that means\nthat you're paying higher prices. If you pay higher prices, you get higher valuations,\nwhich implies lower potential returns and higher downside. So lower return, higher risk, not\nnot what we generally would say we're going for. Whereas if you invest where others aren't,\nyou get lower prices because there's the demand's not there driving it up, which implies lower\nvaluations, which implies higher potential return and a margin of error, lower downside risk.\nSo that's where you get that asymmetry. You take less risk to get higher return. That is why\nit's a, maybe not just midcap, but just really rethinking how people are investing or at least\nkind of diversifying. It's an uncertain world. It's a good time to really be hedging your bets\nand make sure that you're not setting yourself up to, for things to turn.\nSo with that being said, and some midcap tilt here is you're talking to advisors,\nyou know, they already have a diversified portfolio of ETFs as well as other things.\nWhere are you recommending Ron Goes? Is it in that midcap tier or do you think it belongs\nmore as a core equity holding? Historically, our strategy has generally, you're had about 50%\ninvest in mid, 50% invested in large. It's an important note to say first of all, that line between\nmid and large is made up, right? There's multiple firms that can't even agree on what that line is.\nIt's a made up line. So yes, we said midcap, but it's a general area, same with lower large cap.\nAnd that's really where we fit and where I generally recommend using us is as that sort of\ntruly core holding because it, again, walks the line between mid and large cap. But also it's\ngrowthy. You know, we want to maximize growth, but that discipline around valuations and debt\nbrings it back into core. And so you get this diversified portfolio, very risk focused,\nthat fits just in the center of your portfolio and then it makes it really easy to complement\nwith more innovative growth, right? So think of, you know, whether it's Nvidia, Palantir,\nthings that aren't yet that for a while weren't profitable or the valuations,\ngot ahead of themselves, we won't invest in us because it just doesn't meet our rules.\nThat's a great compliment. And then you can complement on the value side as well as small cap.\nBut again, it's really meant to be that very dependable core holding in the rules-based nature\nmeans that you know what we're doing at all times. We've been doing it for four decades, right?\nSo ideally, it's kind of that very consistent steady sort of foundational holding in the middle of your\nportfolio. Yeah, no, I love it. And Seth, I really appreciate your time with me here today.\nSuper thoughtful discussion. I think the strategy is great. And you've made, uh, you're right.\nYou and I probably could have talked about the differences between, um, why made caps or\ninteractive space, or probably another 35 to 45 minutes. But, um, before I let you go, though,\nwhere can people learn more about running Oak? Where can they learn more about the ETF?\nUh, when you can definitely check out running Oak.com or running Oak ETFs.com.\nI have very begrudgingly become far more active on social. So LinkedIn is a, it could be a really\ngood resource. There's a lot of, I've been a lot more active as far as posting both our letters\nas well as short videos that that are a little more poignant and go into different topics.\nThose are probably your best resources. Great. Well, again, Seth, thanks so much,\ntime for spending some time with me. Thank you.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}