{
  "id": "17606312",
  "transcript": "Behind the ticker is brought to you by UX wealth partners.\nIf you're a TAMP user and you're sick and tired of the legacy technology they are run on\nand you want more customization and flexibility, as well as a AI driven model marketplace.\nUX wealth partners is your destination.\nOn top of that, they have institutional trading, so if you are an ETF issuer or an SMA provider\nlooking for outsourced institutional trading, UX wealth can also be your destination.\nSo check out UXWP.com to find out all the ways UX wealth partners can help grow and make your practice more efficient.\nWelcome to Behind the ticker.\nToday we have on Sam Ramen and John McNamara.\nThey're from HGIS at Management and we are talking about their newly issued ETF, the HGI Quality Growth ETF, ticker,\nHGRO.\nIt's really a concentrated large cap portfolio.\nThey're looking at risk adjusted returns.\nMost large cap growth ETFs are either over-deversified or two benchmark hugging.\nThis focuses on three core themes, which is kind of those deep-mote compounders innovators as well as some special situations.\nBut without further ado, please welcome Sam and John.\nHey guys, welcome to the show.\nHey, how are you, Brad?\nGood.\nSo I've got John and Sam here from HGIS.\nI think maybe I'll just start with you, John.\nCould you give me a bit about your background?\nHow you ended up at HGIS and maybe some things you like to do when you're not working?\nSure.\nYeah.\nSo I started my career in a very traditional Wall Street sense.\nWorked kind of a myriad of roles at Deutsche Bank, ended up on the trading desk there.\nEventually, transition over to the buy side.\nWorked for kind of a macro long short equity type fund where HGIS was actually\nour largest research input.\nSo you know, became very aware of the process that, you know, HGIS instills and, you know, the research they put out there into the world.\nYou know, when we were kind of, or when I was kind of deciding what I wanted to do next,\nyou know, I along with another individual approached.\nHGIS about launching an asset management business with kind of, you know, the thought being, you know,\nHGIS founded in 2008 by Keith McCola, you know, coming off of, you know, managing a hedge fund and, you know,\nbuilding an asset management business in his own right to, you know, really kind of democratize.\nI don't know if you think democratizes a word in 2008.\nI think that's a, you know, that's a recent addition to the vocabulary, but, you know,\nhe basically was trying to provide, you know, institutional grade research, you know, to the masses hedge eye.\nYou know, if you could look into what a hedge fund was doing every day, you know, what would that look like?\nSo, you know, fast forward to today, what we're kind of doing at HGIS management is, you know, building upon, you know,\nthat goal of providing, you know, institutional grade research, the masses by providing, you know, institutional grade\nmanagement strategies to the masses.\nAnd, you know, that was kind of back when I started down this path of kind of, you know,\nbuilding hedge eye asset management back in 2018.\nYou know, that was kind of the thought that was going through my mind, like, you know,\nthey have such tremendous research coming out of the firm, you know,\nhow can we take that and package it and, you know, really provide the market with institutional grade strategies.\nAnd, you know, that's kind of where we're at today.\nGreat. Thanks Sean. Sam, why don't you take the floor?\nYes. So, I've been in the industry for over 30 years now.\nOf that 25 years, actually, managing portfolios.\nSo, over those 30 years, I've only been at two firms.\nThe first firm was a British investment firm called bearing asset management,\nwhich is part of the old bearings bag.\nA very backpack, maybe knows her history.\nBut it goes back like almost a couple of centuries back to the Napoleonic Wars.\nWhen they were like funding trading for the British Empire,\nand it was the queues back for many, many years.\nSo, it was a pretty blue blooded place when I joined there in 1993.\nBut for that 15 years, I was there. I got a great education,\nbecause I spent my first year or two with the Chief Investment Officer there.\nSo, he was in charge of all global investments and not just equities,\nbut bonds, half-ax commodities and emerging markets.\nSo, sitting next to him and listening to how he was talking to other portfolio managers across different regions,\nit was a great way to learn about the global markets, macro investing,\nhow all these pieces fit together, how bonds and equities and currencies work.\nSo, that was fantastic for me.\nBut always know, I knew I want to be like a stock investor.\nSo, as I was writing research for the global investment strategy team,\nit caught the eye on the then-head of the U.S. team in Boston.\nAnd I was based in London.\nSo, he took a religious award and my work, and he got to chat with me.\nI said, look, it helped me.\nI'd love to be an equity analyst and learn how to pick stocks and invest in stocks and market portfolios.\nHe said, well, when you come to Boston, you can start as a stock capitalist\nand kind of learn the ropes, learn how the market works.\nYou know, a great piece of advice somebody gave me when I was,\nI spent a year or so in Hong Kong working for, for bearings,\nand I was kind of toying between, do I stay in Asia because it was booming,\nAsia markets were on fire, it was like the place to be.\nAnd, but I want to be like a really good stock picker,\nand a great, it's so p.m. to me, like if you really want to be a really good stock picker,\nyou've got to go to the US because that's where you have access to all that information.\nYou're competing with the best investors in the world.\nAnd so you want to go then really kind of cut your teeth there.\nSo that's kind of how I kind of navigate my way to Boston.\nAnd you know, through through that time there,\nI kind of worked my way up the ranks.\nI eventually became head of the US team in Boston in 2004,\nand was there until 2008 when I got, you know,\na fortuitous call from a head hunter with a guy to a job opportunity,\nto work at the Philadelphia Family Office,\nwhich was the Johnson Family Office.\nI had no idea about the specifics of that.\nYou know, I wasn't going to short a family office,\nas well as to be honest with you.\nAnd while I had known about the Johnson,\nhe was kind of this mythical figure that built the neutral fund business.\nI didn't really know a lot about him.\nBut as I went through the process,\nI got to kind of learn about the scope of what was going to be involved.\nAnd it was a big deal.\nI mean, it was, you know, at hindsight,\nI'm kind of like, I'm still kind of shake my head that I got to job.\nBut it was literally going to take over the race from one of the best investors\nin the history of the world.\nAnd, you know, run his public equity investments\nwhile he's busy running fidelity.\nSo I'm like, wow.\nOn the one hand, that's a great opportunity.\nThat had to happen.\nI'm like, you know, this is going to be,\nthis is scary as hell.\nI think he's still like a huge deal.\nMy final interview was with him.\nSo I walk into a lunch meeting with him.\nHe walks in.\nAnd I'm like, oh my god, this is not Johnson.\nAnd we start talking.\nI literally can't talk for the first couple of minutes.\nBut we've actually kind of like,\nI kind of loosened up and started to talk.\nAnd it was a fantastic conversation\nbecause all he wanted to talk about was different companies,\ndifferent stocks, how they work.\nYou know, what makes one better than the other.\nAnd he was clearly probing to see kind of like,\nhow I think, how I think about different investment ideas,\ndifferent investment themes.\nAnd, you know, luckily I got the job.\nAnd I was there for 15 and a half years.\nAnd I ended up running, you know, 80% of his A.U.M.\nPublic equity, absolutely.\nThe family had other investments.\nAnd private equity venture cap in other companies.\nBut, you know, it was, it was an unbelievable learning opportunity.\nBecause I really developed as an investor.\nBecause I was kind of in this retail institutional mindset of bearings.\nThat a lot of institutional managers are.\nAnd then I went to this family office,\nwhere their investment horizon is very, very long term.\nAnd it was, it was literally, it was really an eye-opening experience.\nBecause I had to really change the way I thought about investing\nin terms of swapping durations.\nYou have a certain duration when you're retail,\nP.M. or institution P.M.\nBut when you go to a family office,\nit's a whole different universe.\nAnd that mindset shift was, you know,\ntook me a little bit of time.\nTook me a couple of quarters to figure it out.\nAnd I had a real bad to miss a fire with that.\nBecause I joined an April of 2008.\nAnd then the world blew up in September 2008.\nAnd we were kind of like, you know, debating from September 2008,\nFebruary March 2009.\nLike, it is our civilization.\nOur civilization has been never going to continue.\nYou know, it was like, it was pretty bad.\nBut having that experience,\nand then sort of understanding this duration issue,\nwas really changed the way I invested.\nAnd it helped me a lot to, to do what I need to do for a family\nof the next 15 plus years.\nNo, I mean, what took, that's a great story.\nAnd I'm, it's a pleasure to have both of you here.\nJohn, why wouldn't you help the listeners who might not be familiar with\nhedge eye?\nYou know, there's a couple different layers of the business.\nYou have hedge eye asset management.\nYou have the research.\nYou also have, I've done,\nwhen I think is probably the best in the business in terms of your content.\nSo the cartoons that Keith in the morning at the macro show,\nand, you know, the attitude of the whole thing,\ncan you just talk about kind of the culture of hedge eye\nand how you're helping clients on a myriad of different things?\nYeah, yeah, absolutely.\nI mean, I think it really has kind of, you know,\nturned into a full blown media platform, if you will.\nI mean, you know, I think the cartoons were kind of a,\na fun differentiator and certainly, you know, got my attention back,\nyou know, when I was, you know, consuming the research in previous roles.\nBut, yeah, I mean, it's, it certainly has,\nhas really, you know, transformed into, you know,\nwhat initially kind of was just a, you know,\nmacro economic research firm into, you know,\nkind of a full blown media platform.\nAnd, you know, to that end, you know,\nwhen Keith founded the business back in,\nyou know, 2008, it was really just kind of like a macro blog where,\nyou know, he was taking his experiences as a hedge fund portfolio manager\nand, you know, just putting out there into the world,\nwhat he was seeing and what he was doing on a day-to-day basis.\nYou know, fast forward to today, you know,\nas we've alluded to here, you know,\nfull blown media platform, you know, multiple TV studios,\npodcast studios, you know, all the kind of, you know,\nproduction and, you know,\ndigital media capabilities that you would imagine from a, you know,\na platform like that.\nBut, you know, also, you know, 40 plus stock analysts covering,\nyou know, thousands of stocks, you know, across, you know,\ngeographies around the world.\nAnd then, you know, at least from my perspective,\nprobably what they're best known for is,\nyou know, the macro economic research,\nwhich, you know, is headed up by Keith McCalla,\nhas a team of about 10, I believe they're now.\nAnd, you know, basically they're measuring and mapping data across,\nyou know, 50 plus economies, you know,\nand, you know, providing, you know,\nbasically guidance through a framework that, you know,\nthey and we refer to as the quads, which basically just measures\nand maps, you know, the rate of change of growth and inflation\nand, you know, thus provides guidance around asset allocation,\nyou know, overweights underweights or kind of do nothing's,\nyou know, as per those macro economic expectations.\nSo, you know, that's kind of a framework of the macro,\nyou know, kind of drilling into kind of how things work on the macro side,\nyou know, from a day to day basis, obviously, you know,\nthat quad framework, I like to refer to it as just kind of like the map.\nSo, you know, if you're driving your car, you know,\nyou get your map out, you see where you're going,\nand then, you know, what key flakes refer to as the signals,\nwhich are, you know, proprietary model that, you know,\nproduces price volume and volatility driven kind of buy and sell levels\nacross multiple durations.\nThose are really, you know, kind of your ways or, you know,\nyour, you know, your traffic monitoring GPS system.\nSo, you know, the quad kind of quad framework provides kind of the map\nand then, you know, as far as like picking the direction or the,\nyou know, the roads with which you take, you know,\nthat's really driven off the signals and, you know,\nthat's, that's probably, you know, at least for my,\nmy position, what they're, what they're best known for.\nSo, yeah.\nBut I saw, you know, I'm reading, I read a lot of keys to tweets\nand he's pound on table on quad two right now.\nSo, I'm familiar with the framework and how it works.\nAnd, you know, it's definitely, I've watched,\nit's actually funny when I was talking to Dan\nwhen we were setting this whole thing up.\nYou know, I was, I was an intern in public accounting\nand I read keys book.\nAnd I was like, you know, I think I'm going to go\nto the asset management route and then I followed head to the whole way\nand you're right.\nIt went from this blog to now, you know, you,\nit's, and I mean this with a ton of respect.\nIt's almost like the bar stool of,\nwith how much media you guys are doing\nwhere you're constantly in front of people and passing along.\nSo, it's funny you say that, you know,\nfrom the media perspective, you know,\nand kind of the bar stool.\nI mean, you know, I do think, you know,\njust thinking back, like I said,\nI kind of have been at this since around 2018,\nbut, you know, thinking of kind of the viral nature\nduring COVID of bar stool.\nI mean, hedge I had, you know, similar\nif not the same tailwinds.\nAnd probably, you know,\nwe're diving into kind of the same audience.\nI mean, if you think of the Davy day trader,\nyou know, daily, like, you know,\ndaily video camera trading session that he put on.\nI mean, it's not, you know,\ntoo far removed from what Keith does every day\non the macro show.\nSo, yeah, no, it's great.\nIt's good stuff.\nBut you guys are jumping into, you know,\nwhen I call the ETF Thunderdome,\nhere you've got HGRO,\nthe hedge I quality growth ETF.\nSo, you can kind of,\nwhat was the inspiration behind launching it\nand kind of, how does it align\nwith that overall hedge I framework?\nYeah, so basically,\nbut I was trying to keep about this last summer\nwhen we first started discussion about\nabout me coming over.\nAnd one of the things we talked about\nwas just how,\nat least in the ETF world,\nwhen you look at the large cap growths universe,\nit wasn't really,\nthere wasn't really a product\nout there at the time that\nthey really sort of focus on active management,\nbut with some risk parameters around\nin terms of portfolio construction,\nand, you know,\nthe objective of trying to drive risk adjustment returns.\nSo, if you look at the large cap growth\nequity universe,\nnow in the ETF space you have\nthe really, really big players\nthat have ETFs that I don't have,\nlike 75, 100, 100,\nplus stocks in them.\nIf you look at all the whole things,\nit kind of looks like the benchmark.\nThey're really,\nso much active management there.\nAnd if you look at some of their perspectives,\nas you'll see that a lot of\nis kind of quant driven\nin terms of its management.\nAnd then the other spectrum,\nyou have these very high-flying\nthematic,\nbest ideas,\nconcentrated thumbs,\nsome which, you know,\nwe know very well,\nlike arc and granny shots blah blah blah.\nAnd they're being incredibly\nsuccessful.\nThey've raised a lot of money.\nThey've,\nthey're on TV and media all the time.\nAnd, but if you look at what they own,\nand how they hold it,\nyou know, there's some interesting names\nin the sound of what they're trying to do.\nBut in terms of,\nportfolio construction,\nthere is not much going on there.\nThere's no construction of any sort.\nSo we just thought that there was a really decent gap\nin the market where,\nas John was saying earlier,\nhow do we deliver,\nyou know,\ninstitutional level of expertise,\nan asset management to a\nretail slash RIA family office marketplace,\nbut they,\nyou know, to get,\nyou know,\nI'm going from\nmanaging\nbillions of dollars for,\nyou know,\nexclusively for\none of the most wealthiest families in the world.\nTo deliver in the same strategy pretty much,\nis that anybody can buy?\nThat's just,\nthere's no limit,\nbut anybody can buy.\nSo to be able to deliver that kind of product,\nor you have,\nyou know,\nboth my project and David Selam's project,\nwhere,\nyes,\nexperience that you institutional managers,\nthat are fully constructed of portfolio,\nthat is going to weather all sorts of markets.\nIt's just not going to weather a bad market.\nI mean,\nhey,\nI'm a longer lead portfolio.\nI'm not going to be,\nit's going to be tough at a time market.\nBut,\nyou know,\nif you can deliver a portfolio that,\nthe weather is also to markets.\nAnd you can still invest in these big themes that everybody's talking about,\nwithout giving up,\nwithout having to take on tremendous risk,\nlike some of these thematic portfolios are.\nAnd I think that,\nthat's kind of what we're trying to do,\nlike to be like a staple,\nstaple,\ngrowth,\nactually,\ngrowth product for a very large audience of people looking for that.\nYeah,\nI mean,\none has from,\nlike,\nmy research is going to go anywhere large cap mandate.\nSo,\nlike,\nhow do you kind of define that flexibility and,\nand you touched on this a bit,\nbut that is kind of a differentiator from traditional large cap,\nfunds that are out there and available now.\nOne of the things we did when we were talking about the construction of this product,\nwas,\nwhat's the proper benchmark to,\nto kind of measure itself again.\nSo,\nwe chose,\nyou know,\nthe loss of 1000 growth was,\nwas an option,\nbut as you probably know,\nthat is such a concentrated portfolio,\nthat really you have learned to like maybe two,\nthree sectors.\nAnd I think we wanted the option to say,\nwell,\nthe S5500,\nwhy that is pretty concentrated,\ndoes give us the ability and the flexibility to go from technology,\nto energy,\nto financials,\nto utilities,\nto industrials where,\nyou know,\nas I did at the family office,\nwhich where I was benchmarked against the S5500,\nyou know,\nwe could find good ideas in any sector,\nin any given time.\nThat didn't mean that those sectors are always in favor,\nthere were times when they were not a dream,\nbut we would always be able to find great ideas.\nAnd so, having a diversified pool of holdings,\neven in a concentrated part of 40 or 50 stocks,\nyou can get pretty good diversification,\nbecause,\nyou know,\nthat's like,\nthe correlation between technology and energy,\nand financials,\nI think they're pretty,\nyou know,\nanti-carly to be chosen.\nSo, you get natural diversification benefits\nof sector diversification,\nand then start diversification.\nSo,\nyou know,\nif you have a momentum market,\nthen suddenly it goes out of favor for a month,\nyou know,\nblown up like some of the cinematic funds you're going to be.\nYou know,\nthat's the key thing,\nit's the basically be able to,\nto be in all weather pool fully,\nand it also's a market,\nand that diversification gives us the opportunity,\nalso to find good ideas,\nwhere people on this field I was looking.\nYeah,\nand I think,\njust kind of doing my own little research,\nI kind of see,\nHGRO build around these like three core investment\nthemes,\nwhich are deep-mote compounders,\ninnovators,\nand disruptors,\nand special situations.\nSo, like,\nhow on your process,\nso you kind of identifying the companies\nthat fit into those categories,\nand like the importance of those core kind of theme pillars,\nthat your framework is kind of being guided on.\nYeah, so,\nwith those three categories,\nit's really a forcing mechanism to say,\nokay,\nyou know,\nthese are the three types of stocks I want to focus my portfolio,\nand so that it provides a funnel or a lens.\nSo, I'm looking for these characteristics\nin what is like a universe of,\nyou know,\na thousand companies.\nSo, through my own final research in my 25 years of covering your securities,\nyou know,\nwhen the first category of looking for compounders\nwith very deep-motes,\nI mean,\nas self-explanatory as it is,\nI mean,\nyou know,\nthese,\nor magazines that have built these modes of many, many years.\nBut also,\nthey keep deepening at one time.\nSo, as they generate three cash flow\nthat they're compounding every year,\nthey're not just always just giving it back to shareholders\nand reinvesting it back.\nIt's the business to deepen those modes\nto strengthen those superb advantages,\nso that I'm also investing in innovative areas\nthat keep extending their reach in their mode.\nI mean, I'll be honest with you.\nIt's kind of an obvious category.\nBut if you look at everybody's growth portfolio in large-cap,\nthey own their own design.\nIt's like,\nit's like table stakes for being a growth manager.\nBut the difference I think is that\na lot of managers that I've seen\nin terms of how they manage to perform,\nthey're very,\nthey're overly sensitive to valuation,\nand I can understand that.\nBut valuation,\nas a starting point,\nto decide on its stock is a really bad way to look at companies.\nSo, I know when I ran my team at the family office,\nI always had this saying was like,\nokay,\nthe value which is a lesser way to look at.\nWe're going to look at the company\nand the merits of the management team,\nthe structure of the industry,\nthe return structure of the whole space,\nand analyze that for what it is.\nDecide what we think about the future growth prospects\nin the company,\nand then base off of that,\nkind of backward integrated.\nWhat would we pay for this business\nrather than to the opposite?\nAnd I thought that was really helpful.\nBecause a lot of times,\nwhat looks like an expensive stock right now\nis that expensive,\nbecause the future growth rate assumptions\nthat we had were much higher than the market.\nSo, our internal valuation\nmade this company look a lot cheaper than it was.\nSo,\nall right, so,\nyou kind of were explaining there\nhow research then turns into stock selection.\nSo,\nwe get to stock selection.\nLike you said,\n40-50 names in this portfolio.\nHow are you then sizing those positions?\nIs it basically on conviction?\nSure, you're looking at macro exposure,\nvolatility, all these different things.\nSo, can you talk about the position sizing mechanism\nonce you've gone from this gigantic universe\ndown in your 40-50 names?\nThere's a number one consideration\nis just the fundamental analysis and conviction of the name.\nSo, the high-to-conviction,\nthe high-to-acting way in the portfolio.\nBut, I cap myself to like a three-person overweight\nover the benchmark.\nJust as a rule that I've kind of instituted\nfor myself for decades,\nbecause you don't want to have one stock\nor two stocks that are so large in your portfolio\nthat they take the nature of your performance\ngood and bad.\nI mean,\nwe know of one high-profile,\nyou know,\nETF that has Tesla,\nas it's large as holding.\nAnd if Tesla works as great,\nit's going to be the driving force of the performance\nof that fund.\nBut if it doesn't work,\nthen everything else is irrelevant\nbecause that one stock is dictating.\nSo, I never want to be beholden to one stock\nno matter how much I liked or how good I thought\nI understood the business.\nSo, I kind of had these own built-in risk parameters,\nboth on the stock levels,\nplus or minus 3%.\nBut also the sector level,\nplus or minus 3%.\nSo, I'm not like finding myself\noverly exposed in certain areas\nwhere I shouldn't be or I'm not aware.\nSo, we talked about how things get in to the portfolio.\nCan you maybe talk about the criteria\nand or the signals that would typically lead\nfor you to maybe trim or start exiting a position?\nIs that just as it gets closer to your predicted valuation?\nOr, I mean,\nyou talk about the other side of the trade too.\nYeah, so as well.\nIt's a fundamental to try this all to a discipline.\nSo, if,\nand I have to track these companies,\nthere are these calls and follow them closely.\nIf I start to see fundamental,\nstart to deteriorate or change from\nmy original thesis of why I bought the stock,\nthat kind of becomes a regular flag for me.\nSo, those stocks are kind of a my watch list\nwhere I spend even closer attention to\nand how they're doing and where the stocks are\nshaking that negative news off for\nis it, is it something that is going to be a bigger problem?\nUltimately, also,\nif the performance of the stock\nis so off from a technical analysis perspective,\nit starts to break down.\nThat becomes another trigger for me to really say,\nwell, maybe I should start with decent position\nat the very least,\nbecause something clearly has changed\nand I don't want to ride this thing down\nbecause I'm missing something.\nSo, there's like a multiple steps of process\nof fundamentals driving the sort of second\nof what's going on,\nand if the stock starts to break down,\nthen it becomes another force in my kind of\nokay, maybe the position size has to change.\nSometimes it's the market,\nthe market goes down, everything breaks down.\nYou kind of have to think about\na more relatively than that.\nSo, it doesn't mean you sell,\nstock got to break down if a market source\nis coming down.\nBut, and also, the fundamentals is still intact,\nbut those are sort of the key things that I would use,\nokay.\nThey kind of moved to my sort of\nwatch the sort of, okay,\nif this thing doesn't change,\nmaybe if it's for the better,\nthey're on the way out.\nYeah.\nSo, John, you know,\nwas this HGRO kind of seems to me\nlike it would be a core and large cap equity holding\nan already diversified portfolio.\nSo, like in your mind,\nwho's kind of the ideal investor for this strategy,\nand then how would you kind of recommend\nthey use that in, like,\nbroader asset allocation?\nYeah.\nI mean, we're definitely,\nyou know, the conversations that we're having\nare definitely around, you know,\nlarge cap core equity allocation.\nYou know,\ncandidly yesterday,\nwe had three back-to-back calls,\nyou know, all with large scale RIAs,\nyou know, who run, you know,\nmany billions of dollars.\nAnd, you know,\nthey're definitely thinking about this,\nand in the core large cap space,\nyou know,\nI think there is,\nyou know, we've been in this,\nthis world where, you know,\njust hugging the index,\nyou know, has become so pervasive,\nI think that, you know,\nthere are, excuse me.\nThere are a lot of, you know,\nkind of smart, you know,\nfolks out there who are saying,\nwell, hang on a second,\nyou know,\nmaybe that the, you know,\nthe past however many years\nyou want to,\nyou want to, you know,\nquote it,\nyou know,\nthings are about to change,\nand, you know,\nactive management,\nyou know,\nreally may become,\nyou know,\nmuch more of a necessity,\nyou know,\nrather than just a nice to have.\nSo, you know,\nthat's,\nI think how people are thinking about it certainly,\nyou know,\nwe've had interactions with,\nyou know,\nmom and pop retail investors,\nlarge scale RIAs,\nyou know,\nsome of the largest investors on earth,\nand obviously that's just,\nyou know,\nfrom the nature of the hedge eye client base.\nSo,\nwell, and also too,\njust got to curiosity.\nI mean,\nthe fund is pretty newly launched,\nyou know,\nhow are you thinking,\nhow are you guys thinking about kind of\nmarketing and distribution,\nand,\nI mean,\nthe hedge eye brand is already out there,\nbut not as an ETF issue or so,\nyou know,\nwhat's your experience been like so far,\nand where do you kind of see yourself going from here?\nYeah, look,\nI mean,\nI think,\nyou know,\nthe hardest part of these things is the,\nyou know,\nwhen you come right out of the gates,\nyou know,\nI mean even salmon eye,\nyou know,\nhave been working on this,\nyou know,\nfor the better part of,\nof the last year or so,\nand,\nyou know,\nthe question that he kind of was asking all on the ways,\nlike,\nwell, you know,\nwhat do you think A,\nI'm going to look like right out the door?\nI mean,\nif I could tell you that,\nyou know,\nI'd probably be doing some other stuff as well.\nSo,\nyou know,\nthat's always the hardest part,\nbut look,\nI think,\nyou know,\nas you've alluded to,\nyou know,\nand an active,\nyou know,\na group of people around,\nand I think,\nyou know,\nthe hedge I made in the Twitter handle,\nor ex handle has like 280,000 followers.\nI think Keith has something like 250,000 followers.\nSo, I might be mixing those numbers up,\nbut, you know,\nthey have a broad and significant,\nyou know,\nfollower base,\nand also, you know,\nthere's an active group of people who are,\nyou know,\ntuning in to the call of the first thing in the morning,\nthe macro show,\nyou know,\nevery day,\nI mean,\nit's,\na shorter way,\nto allocate capital.\nSo, you know,\nI think,\nmaybe I'm speaking a little bit too much for Sam here.\nI think that gave him the sum degree,\nyou know,\nlevel of confidence that we would be able to have success\nin raising assets,\nand, you know,\nI think we're sitting just north of,\nyou know,\n20 something million bucks right now,\nand the fund with,\nyou know,\nnot even a month,\nand a half,\nyou know,\nunder, under our,\nunder our belt.\nSo, you know,\nI think,\nto sum degree,\nyou know,\nthe,\nif you will is kind of really showing up.\nAnd I think as far as the growth of assets\nand marketing from our perspective,\nlike I think the thought is we can get to kind of where\nwe need to be with regard to having dialogues\nwith platforms and kind of larger scale investors\nthrough kind of that head donation, if you will.\nAnd then from there, assets and performance\nare going to speak for themselves and we're very confident\nin that.\nSo yeah, no, it's great.\nIt's just kind of, I guess, quickly on the business side\nof things is more ETF launches or ETF issuance\nfrom a hedge eye, kind of a part of the business plan\nis it wait and see, I mean, what are your thoughts\non where your guys might continue to add value\nin the ETF space?\nAbsolutely, yes.\nSo I mean, we're definitely, I mean,\nI was on the phone with our lawyers yesterday\nwith the trust board who we work with yesterday.\nAnd we have some stuff in the pipeline for sure.\nAnd I think we're eager to get more differentiated strategies,\nkind of in the similar vein of institutional quality management\nin an accessible to everyone wrapper.\nAnd we have some additional opportunities\nin the pipeline and kind of thought processes around,\nhow will deliver that going forward?\nCertainly more to call.\nNo, that's great.\nSo both of you, I really, really appreciate you spending some time\nwith me.\nVery interesting stuff.\nIt was a pleasure to meet both of you.\nBut before I let you go, where can people learn more\nabout hedge eye work?\nWe find information on the actual lead to ETFs you guys have launched.\nYeah, absolutely.\nSo hedge eye am.com.\nThat's going to have all the information you need.\nAnd then we're obviously very active on Twitter X as well\nat hedge eye am.\nAnd then from the research side perspective,\nhedge eye.com, Keith McCullough on Twitter,\nhedge eye on Twitter.\nThose are those are going to be the places\nwhere you can get all the information that you need.\nWell, again, both of you, thank you so much for being here.\nAppreciate it.\nThanks for that.\nWe really appreciate it.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}