{
  "id": "18580525",
  "transcript": "Welcome to Behind the Ticker.\nThe podcast where we go beyond the symbol and into the strategy.\nI'm Brad Roth, founder and chief investment officer at Thor Funds, and in each episode\nI sit down with ETF managers, CIOs, and industry leaders to break down how these funds\nare actually built, how they behave in real markets, and how advisors use them in real\nportfolios.\nThose people just see a ticker symbol, but we know much more goes on behind the ticker.\nHey, Ray, welcome to the show.\nThank you, Brad.\nIt's great to be here.\nSo before we get started, why don't you take just a little bit of time, tell everybody\na bit about your background, saw you were a civil engineer at Notre Dame, then you went\nin engineering at Princeton, and now you're a founder, and I would assume chief investment\nofficer over at relative sentiment technologies.\nThat is correct.\nSo yes, I studied engineering in grad school, and people often think it's a big leap going\nfrom the grad school, the engineering I was doing to Wall Street, but it's actually an easy\ntransition because in grad school my focus was on what's called probabilistic\nengineering mechanics.\nSo it's essentially looking at engineering systems that were subject to random vibration.\nSo if you can think of like a building in an earthquake or an airplane flying through turbulence,\nand the math that's used to analyze the systems is the same math that they used price\noptions.\nSo it was kind of like an easy segue into Wall Street from there.\nIn the early part of my career, I was doing systematic long short equity, and then global\nmacro, and then around 2014, I switched over to tactical acid allocation, didn't really\nknow much about it at the time.\nSo did a lot of Google searches, came up with papers that I was reading, and put together\nsome value, momentum, sentiment strategies.\nBut I thought I needed a few other strategies to kind of round out the suite, and I had\nthis pamphlet on my desk from 10 years earlier, from Wemen Brothers, when they were still\non existence, it was a quant equity presentation, flipped through it, and I saw this indicator,\nand it was looking at how institutions were positioned in the market relative to retail\ntraders.\nAnd I thought, well, I like that concept.\nYou know, there are smart money, there's dumb money, I often felt like I was dumb money.\nSo I really was interested in this indicator.\nI implemented it, tested it out, and it was okay, but not great, but I really loved\nthe concept.\nI didn't let it go, I added some new information, smoothed it out, and all of a sudden,\nit was pretty interesting.\nSo I threw it into the mix.\nAgain, didn't think it was anything special, but then in August, this was late 2014, when\nI stumbled upon it, and then in August of 2015, the market had solar off, all of my indicators\nwere bearish, except for this one relative sentiment indicator, and market rally 10% in\nthe straight line.\nI thought, oh, that was interesting.\nFast forward another six months, market solar off 10% again, everything was bearish.\nIn my indicator suite, except for road of sentiment, market took off and didn't look back,\nand I was like, darn, it's not cool being on the wrong side of that.\nSo I went and I looked, and it turned out that any time momentum was negative, but institutions\nwere buying the dip, market tended to have their best annual hours returns.\nSo when I learned that, I just started focusing on road of sentiment, I wrote a paper\non it, sent that paper to West Gray, an alpha architect, and, you know, he has a PhD\nfrom Chicago studying under Nobel Prize winner, you know, he has sort of the pedigree to kind\nof critique what I had done, and, you know, I knew that I was making bold claims in the\npaper about market timing, factor timing, and he looked at it and he said, okay, well,\nyou controlled for a lot of things, but did you control for X, Y, and Z, and these were\nsome things that were sort of outside of the scope of what I had controlled for.\nI said, no, he goes, well, control for those, so I controlled for them, the results\nheld up.\nHe said, wow, this is interesting.\nIt's not momentum, trend, it's not value, it's its own thing, you should launch it as\nan ETF.\nThat was about 2018.\nI was working at an RIA, they had sort of, you know, different interests, so I kind\nof put that on the back burner, but then COVID came, and I was looking for a new opportunity,\nand West, you know, revisited the idea of launching this as an ETF.\nHe said he had people lined up to invest in the company, and in the ETF, and, you know,\nlet's do it.\nSo, that's how it happened, and that was four years ago, so yeah, we're going to\nwork with you.\nWe're going to talk a lot about Moode today, I'm fascinated by your process, and it\ncan't wait to hear more, it's funny when you and I first met a couple weeks ago, I was\njust joking with you.\nI've got 19 inches of snow, West actually also outside of talking, you end\nto starting an ETF, talking and moving to Puerto Rico, so as we were talking, I'm a\nlittle bit jealous.\nSo, I like to ask all of our guests, you know, what do they like to do for fun?\nWe could, you and I can geek out on technical indicators and quantitative indicators all\nafternoon, but what do you, what do you like to do for fun when you're not behind the\ndesk, click and buttons?\nWell, see, that's the thing.\nIf you ask my wife, you'll say, I don't know how to have fun, and that I never leave\nthe house, because to be honest with you, what I really love is puzzles and brain teasers,\nand what bigger puzzle or brain teas are, then the market, right?\nSo I love trying to decipher what's happening in the market, testing my ideas against reality,\nwhich is basically your P&L, so I really, so I do my work as a hobby, but outside of\nthat, we have a five-year-old son that keeps us busy, I try to hit the gym, I try to\npractice the piano, I try to every week, West and I meet at the golf range, we have\nlittle competition so you can get the ball's closest to that practice pins, that's\nbasically it, so it's work, family, piano, golf, gym, it's basically love it.\nSo let's talk about the moody TF, at a very high level, first of all, I love the ticker,\nand it's perfect for what you're doing, but at a very high level, what is kind of the\ninvestment methodology behind moody and really what is it trying to accomplish?\nOkay, so it's a very high level, it's a multi-asset, go anywhere, tattoo ass of the\nallocation ETF, it seeks capital appreciation, it tries to do this by attempting to align\nits allocations with how the so-called smart money is positioned relative to how the not-so-smart\nor, I don't like to say, dumb money, but the dumb money that you could do it, I feel like\nI'm on Twitter too, Ray, I see a lot of the dumb money, and the reason is is because there's\na lot of empirical research that shows that institutions tend to have better outcomes in\nthe financial markets than retail traders, and you might ask why is that, and I believe there\nare several structural reasons why institutions tend out before, and one is that they just\nhave better information networks, when I was at hedge funds, they would have XFET governors\ncome in every week and just discuss what their friends at the Fed were going to do, senators\nwould come into the office, they would back senators for political positions, so you just\nhave better information, they have lobbyists, they have Fed governors on speed dial, they talk\nthe corporate CEOs, better information, so that's one thing, secondly, they have just\ndeeper pools of human capital, every year they're hiring new MBAs, new CFAs, new PhDs,\nthey have the best data, the best technology, how does someone in their basement compete\nwith that?\nAnd then lastly, and I think this could be the most significant advantage that they have,\nis that, where do retail traders get their ideas, they tend to get their ideas from\nCNBC, FoxBusiness, Bloomberg, or institutional research reports, so essentially you have the\ndefense calling the offense as plays for it, and so if the defense knows what play the\noffense retail is going to run, they can front run that, take advantage of it, they probably\nalready front run it when they're talking about it publicly, so you have all these structural\nadvantages and institutions had, and if you can align yourself with how their position\nrelative to how the not so smart money's position, you might be able to participate in\nthose better outcomes, so that's sort of high level what it seeks to do and be happy to discuss,\nin more detail how it goes about doing this.\nSure, so when you're actually quantifying this and deriving a signal, what actual data sources\nare you pulling from, if you can share that, and how do you quantify that institutional\nversus retail positioning as it just flows, or how are you quantifying all this and\nderiving signal from it?\nSure, there's two primary data sources, there's actual positions that separate classes of\ninvestors have, so they're actual positioning, that's one source, and the other source is\nsurvey data where the surveys are posed to institutions and private investors in the\nseparately, so that you have an institutional sentiment index and a retail sentiment index, and\nthen I just use that and compare them to each other.\nOn the positioning side, it comes from the commitments of traders report.\nA lot of people are very familiar with the commitments of traders report.\nI see people talk about it all the time on Twitter.\nPersonally, I don't think that people are looking at it in a way that you can maximize\nit the information content in it.\nI think that a lot of people look at it just raw contracts and the most short ever,\nwell, okay, well, the money supplies increased and GDPs increased, so shouldn't you be normalizing\nthat in some way, shouldn't it always increase through time, and that's what we do see.\nIf you look at the normalized percentage of open interest and how it, and then if you look at\nthe separate investor classes, how they're currently positioned, relative to how they're typically\npositioned, and then how those compare to each other, that tends to give you a fairly strong signal\nfor various instruments, not only equities, but commodities, currencies, fixed income, etc.\nSo I look at actual positioning, and then I also look at separate surveys posed to institutions\nand retail separately.\nWell, you walk me right into my next question, because you alluded to this earlier, which was,\nyou know, this just isn't in equities, right?\nIt's multi-asset class, it's ETFs, or I'm sorry, equities fixed income, dollar, precious metals,\ncommodities, so can you kind of walk me through how you build these different models and how they\ncan really work together in a portfolio to provide the best result?\nSure, so when I started, I was looking soliet equities, and I had a few models, and I would come\nup with an equity allocation from those models, and then whatever was left over was just put into\nbonds. And this was in the 2014 to say 2018 period, and that was a secular environment where\nequities and bonds had negative correlations. So if you weren't in equities in your\nbonds, you were kind of diversified, and if you had less equities, you would want more bonds,\nbecause bonds would probably do well if equities weren't going to do well.\nSo that was, I didn't really give a second thought to developing relative sentiment models\nfor non-equities assets, until we launched this ETF, and we launched it in a secular environment where\nequities and bonds had positive correlations. And so now it's like, okay, well, how do you get a diversifying\naspect to your non-equity portfolio? And from there, it was just a matter of, you know, just doing\nresearch on, you know, the various positioning indicators that I mentioned, primarily how the\nseparate asset class investors classes are positioned in the futures and options market,\nand just looking at, you know, which ones were predictive for each of those asset classes,\nand, you know, testing in, make sure it was just statistically significant, and then going from there.\nSo when we launched, I was still using road-assentment primarily only for properties, but in the\nseveral years since, as you mentioned, we are relatively sensitive for the dollar, for various\nbonds, nominal inflation-protective corporate government, precious metals, currencies, etc. And it's\nnever ending thing, right? So continuing looking for new models and strategies, you know, within\nthe commodities complex, different currencies, etc. So I think you just answered this, but are\nyou creating different relative sentiment indicators or a model for each different asset class,\nbecause they act so different, or is there kind of, you know, certain data or what I would call\nmaybe like a master sentiment indicator that you're deriving all of your allocations from,\nor do they all kind of work independently? You know, it's a little bit of both. So for the equity side,\nI have five separate relative sentiment indicators, and I average those. So each one ranges between\nzero and 100%, and each one represents a desired tactical allocation to equities. And so I just,\nI average across those to get my portfolios overall equity allocation. And if you look at those,\none, two, three, four. So three or four of them are what I would call across asset relative\nsentiment. In the sense that they look at relative sentiment in asset or asset class A to predict\nequities. And the more asset class A is not equities. It could be how people are positioning\ncurrencies. It could be how they're positioned in natural gas. It could be how they're positioned\nalong duration bond. There was a paper written in 2000, it was in the journal of finance,\nit talked about predicting futures returns. And one of the big takeaway from that paper is that if\nyou want to predict, say, equity returns, you have to look at instruments that are highly correlated\nto equities. And in that case, it was like long duration bonds and other things where\nhow they're positioned in equities complimented by how they're positioned in long duration bonds\nor along the yield curve was what would actually give you more predicted for her. And that's\npretty much what I do. One of my models looked at how investors are positioned directly in\nequities. So the S&P, the NASDAQ, the Russell 2000, aggregate data information, but also added to\nthat how they're positioned in long duration bonds. And in addition to that, how are they positioned\nalong the yield curve? Are they more relatively bullish the 10-year or the 30-year? You know,\nwhere are they more bullish or more bearish? All of that information kind of as a composite is\none of my indicators. So that's direct relative sentiment plus some cross asset. And I have,\nyou know, purely cross asset strategies. And then I have some survey-based strategies as well.\nSure. Now, just out of curiosity, because some signal processes are built this way\nin some, some are. Do you find that when you get a certain spread between, we'll call it,\nthe smart money and the dumb money again in terms of sentiment, that that signal is more telling.\nIt's stronger. Is there any statistical about validity to, you know, the spread between retail\nand institution that you're really going to be confident in that signal? And if so, yes,\ndo you work on, is that how you kind of deriving asset allocations? So if you find a better\nopportunity, you might overweight something that's showing a relative spread between that?\nThe answer is no. And I'll explain. So it turns out that these indicators are really,\nfor kind of simple, but they're very robust. In the sense that you mentioned, okay, if there's a\nbig spread, does that mean it's more predictive? What actually is predictive is just, okay,\nhow are institutions typically positioned, how are how is retail typically positioned,\nhow do they relate to those, like take a z score of their current positioning relative to\ntheir typical positioning, because the z score subtracts out their average positioning,\ncompare those to each other, and then compare that to what that comparison tends to be.\nIf it's above that, it's bullish. If it's below that, it's bearish. And it's, it's like,\nyou know, I don't want to, you know, oversell it's it's not a holy ground or anything, but it's so\nsimple, and it's concept. It's like, there's no advanced math. It's just greater than or less\nthat. It's basically if it's above that median, boom, you want to be long. If it's below that\nmedian, you want to be flat or short. But so where the interesting stuff comes in is that I use\nvarious different combinations of the underlying predictors and different parameters. So now,\nI have like an array of these, you know, binary ones, zero indicators. And then I look at\nwhat proportion of those are signaling. And if that is a larger proportion, then it gets more\nway. If it's above a critical mass, I want to be long with it's below that critical mass,\nI don't want to be in. And if it's way above that critical mass, I really want to be in. So yes,\nthat's sort of the way to the evidence approach where it does have a signal strength based on\nthe number of nearby strategy parameter cases that are all lined up in the same direction.\nBut on an individual basis, I'm not really looking at the strength of how far apart the\npositioning is. Currently, it's more just as it is a plus or a minus. And then looking at plus,\nor minus across many different variations of that same strategy, essentially with different\nparameter cases. It makes the tonic sense to me. Thanks for getting into it. Because, you know,\nit's, you've got, you know, an array of different decision trees that you've got to put together\nin order to get to, you know, your final allocation, which I read it correctly. This is a weekly\nrebalance. So you're looking at all of these indicators and everything and rebalance the fun.\nIf it needs to weekly or you're, you can wait until there's drift, can you just explain your\nrebalance process? Sure. So I run the models once a week on Wednesday. The data is primarily\nweekly for three of the models monthly for one of the models in daily for the fifth model. But I kind\nof smooth out that I take a multi-day average of that daily to kind of slow it down a little bit.\nSo I run those models once a week and I average them to get my desired equity allocation. Now,\nif that desired target equity allocation is within 10 percentage points of where we currently are,\nin terms of our equity allocation, I would just leave it like that. So for currently 50%\nequities in the target is 56 this week, I'll leave it at 50. If it goes down to 42, I'm going to\nleave it at 50. If it goes up to 65, won't it go into movement? Because 65 is outside that 10 percentage\npoint range. Just to keep turn over and check and also, if it's anything less than 10 percentage\npoints on the equity side, it doesn't necessarily move the needle over short time horizon. So\nno need to make that trade. So everything you do from an allocation standpoint and\nwaiting standpoint or rebalance standpoint, I mean, you got a checklist of rules, or is there any\nart that finesse that you guys are putting into the portfolio, or you just strictly created a\nchecklist of rules, which you're going to follow, and it's a fully ruled it rules-based process.\nSo when we started it, it was fully rules-based. And we had the equity side of the portfolio,\nwas entirely rules-based, and I had non-row to sentiment strategies, as I mentioned, when I launched\nfrom the non-equity portion, and those were rules-based as well. But as I developed new equity,\nor new non-equity relative sentiment strategies, it's not purely science on the non-equity side.\nThe equity side is still purely science. On the neck, non-equity side, I look at three things. One\nis the signal bullish. If it is, it could be in the portfolio. If it's not bullish, it can't be.\nSo that's rules-based. But then I look at the length of the signal. So these signals are created\nin such a way that you can get an idea of what the minimum length of time is for the signal.\nAnd if you have a longer signal, I'd want to give more weight to data, everything else being equal.\nAnd then I also look at the historical performance of the sharp ratio, the compound annualized growth,\nrate, the maximum drawdown. The stronger the signal is, it's sorely, I'd also want to give more\nweight to that. So that, working on drawing that into an optimization, to make it purely science,\nbut at the moment it's sort of arts in a way that how I kind of just look at it and say,\nokay, this is a stronger signal. It's going to be in longer. I need to give more weight to that\nthan I'm going to give it a signal. And when I look at the signals, the signals are essentially\nthe dollar, loan duration bonds, precious metals, and commodities. And of those, the best signals\nhistorically have been precious metals. And then I would say commodities. And then\nlong duration bonds. And then the dollar in terms of, you know, their sharp ratio and in return,\npotential. So when I have those to choose from, my checklist is okay, I'm going to give more\nprecious metals. And then if commodities are in, I'll give them the next amount. And then long duration\nbonds, and then the dollar. So that's sort of a thought process. It's not purely rules based on the\nnon equity site. Now, since we added these new models, but I'm working on making a rules based.\nYeah, that's great. And just, I should have probably asked this earlier. You're investing across\nalways different asset classes. How are you actually making those getting that exposure? Is it\na fun to fund funds or how, like, what does the holdings look like if someone were to, you know,\ngo to the website and take a look at your holding space, like, what's in it? It is a fun to\nETFs. So we tried to use the the most liquid lowest cost ETFs to represent the various exposures.\nYou know, for broad US equity exposure, we want to have BTI or spy, small caps. You know, some\nVanguard, small cap ETF or IWM, QQQ, etc. Same thing on the bond side. And certainly for the commodities,\nsome disparity. So, like the most liquid commodities, say, for example, gold and silver,\nGLD and SLV, they also have fairly high managements. So we go for commodity ETFs and press\nsnails ETFs that have a lower management fees, but still have reasonable amount of AUM and\npretty small bid assets. I always like to keep the I tell everybody, I like to keep these\nepisodes evergreen, but I'd be remiss to ask you had mentioned that your relative strength signals\nin commodities are pretty strong. And we're seeing something I think is fairly unprecedented in\nrecent future, which is, you know, gold and silver going nuts. So I'm sure that it's helping your portfolio\nsomewhat as in the most recent time period here. Absolutely. So we benefited greatly from\nprecious metals in 2025. Our model for precious metals turned bullish the last week of 2024.\nSo December 2019, I believe we entered into it. And I think I actually made it tweet like,\nyou know, it's happening. We're getting into precious metals. And one thing that's kind of\nnotable is that you look historically, those signals tend to last seven weeks, 12 weeks,\nmaybe you'll get a four month, you know, precious metal signal. This signal would be exception\nof a two week period around liberation day. When it turned bearish, it just briefly got right back in.\nIt's been bullish since the end of December 2024 into the end of January, 2026. So as you can\nimagine, given what they've done and given our constant near constant exposure to it, yes, that's\nhelped. Our performance immensely. And interestingly, if you look at the positioning on it,\nso a lot of people are writing servers a bituary and, you know, it's going vertical and I would never\nadvise anyone to jump in anything vertical. And a lot of people are saying it's driven by a\nspeculative of a mania. But if you look at the positioning, that's not what it's saying. What it's saying\nis that retail and speculators are getting skittish and they're adding to their short positions\nand the commercial traders, the market makers and the producers are buying silver contracts and\nthey're covering short. So they're getting relatively more bullish while the so-called dumb\nmoney is getting relatively more bearish. And so we're still in precious metals. And, you know,\nI'm not going to say that they're definitely going up. But if they continue to go out, it wouldn't\nsurprise me giving how positioning it's. Yeah. That's great. And, you know, it's funny. I'm getting\na lot of, I'm getting a lot of questions from advisors that I talk to, like, is now the time to\nget silver back. And it was so hated for so long. And, you know, now everybody's trying to get their\ntheir hands back on it. But, um, one of where one of the places I wanted to go is just in general,\nwhen you talk to advisors about tactical strategies, they're number one and number two thing that they\nalways say is, oh, it gets web-solid and choppy markets and it's late to get in or late to get out.\nYou know, how does your process kind of, nothing ever takes it completely out? Um, we know that,\nno signal is perfect. But, how do you try to combat that choppyness those web saws? How do you try to,\nyou use the word a couple of times smoothing things out? So, you know, how do you avoid, you know,\ngetting web-solid, like a lot of tactical strategies have a tendency to do.\nIt's a great question. So, I think the nature of road of sentiment, so I think,\nthen the context of of advisors being wary of tactical strategies because of a web saw potential,\nit's probably because they're looking at momentum or trend falling to do the tactical adjustments.\nAnd so, yes, something can, you know, a price can fall below moving average. You get out.\nIt can rise back above it. Oh, you got to get in and it goes back below. So, if you're doing\nit purely based on price, you can be web-solid fairly easily. Road of sentiment is based on\npositioning, which doesn't change nearly as quickly. And on top of that, we're averaging across\nfive different indicators. And so, it tend to be fairly smoothly varying in the week to week change.\nUm, yeah, you can go from having, you know, say 80% equity is this week and now all of a sudden\nyou want only 40% next week. But it's not all that often. But what happens is if you go\nfrom 80 to 40, you're not going to go back to 80 the next week. You'll probably be somewhere between\n40 and 50, the next week, which we wouldn't change because of our 10% window rule. But, um, so I just\nthink the nature of road of sentiment kind of wards off that type of whipsa that you see in other\ntactical strategies because it's not based on price. But where road of sentiment, uh, where that could\ncome hurt you, is there's been several times historically, uh, in 2009 at the market bottom,\nthe fourth corner of 2018 into 2019. And then, most recently, in April of 2025, where\nthe smart money was appropriately extremely bearish. And the markets were complying with what\nhow the smart money was positioned. But apparently, it didn't, uh, occur to the smart money that,\noh, the policy makers can come in and change things on a dime. So whenever they changed the\ngap rules in March of 2009, smart money was super bearish. It took them four weeks to get back\nbullish. That was the market bottom. You missed out on four weeks. But those four weeks were very\nmeaningful as it rebounded. And then, um, in 2018, policy will know when their neutral market\nsales off 20% smart money was super bearish there. So they missed that drawdown. But then in January\n19, after Trump humiliated Powell, Paul's like, well, I'm just kidding. We're not going to raise rates.\nAnd then market took off. It took two, three weeks for road of sentiment to get backwards. So\nand the same thing happened when Trump plus tariffs in April of this year, um, it took it four\nweeks to get back on the board side. So that's where being kind of a little bit less price sensitive\ncan hurt you. Yeah, make sense. So million dollar question, you know, you got an advisor in front of\nyou who's got a diversified portfolio. You know, who is mood designed for and how should they look at it?\nRight? Is this a core holding? Is it, it's not, it's not really a hedge in, in, in, in, in the,\nthe practical sense. But how would you to sit down and advise an advisor to use mood and\ncyber portfolio? It could be used in several different ways. So I think if you are someone who\nlikes passive investing, um, but wants to be a little bit more tactical, but aren't sure quite\nhow to be tactical or, you know, it's a tough decision, you know, something's falling in a free\nfall. Do you want to add to it? You might be a little scared. Um, and same thing, if, you know,\nsomething's rising, you might want to hold onto it when you maybe should be selling. So this kind of\ntakes away that, uh, you know, responsibility of having to do the decision making yourself. It doesn't\nunder the hood and it tax efficient ways. You don't have to worry about the tax consequences,\na beat tactical. So you can add it to a core portfolio as a satellite. Um, so that's one way to\nlook at it. Another way to look at it is if you're a factor investor and you like value and\nmomentum and quality, trend falling and what have you, uh, wrote a sense to make good fit into a\nfactor portfolio. In fact, um, I should talk about maybe not, uh, with this question, but there's a lot\nto be said about trend falling and, and roll out of sentiment in a portfolio together. And then\nlike another way to think of roll out of sentiment is just as an alternative. So you have an\nalternative sleeve. It could fit into that alternative sleeve. Um, now I guess I'll double back and\ntalk about the trend falling thing because I brought it up. But if I'm sitting down with someone and\nI tend to ask them to you like trend falling because if you like trend falling, then\npairing trend falling in roll out of sentiment could possibly make your life a lot easier. And the\nreason as it's the very complimentary to one another. If you think about what trend falling\ndoes, if something goes up, it's buying it or adding to it, if something goes down, it's reducing\nit or exiting from. So it's buying high and it's selling low. Now roll out of sentiment tends to\ndo the opposite. And the reason it tends to do the opposite is because institutions tend to be on the\nother side of retail. And what does retail do retail buys high and sells low? So you see, we are\nroll out of sentiment buying low and selling high. So what you find is that if you put low to sentiment\nand trend falling together in a portfolio, it has thinner tales of the distribution. And it has a\nlower tracking error to a perfect foresight strategy where if you had a crystal ball and you could\nsee which of those two strategies was going to outperform at the beginning of every month and switching\ninto it. If you knew that perfect foresight strategy, a 50 50 combination of the two strategies\ntrend falling in a row of sentiment would have a lower tracking error to it than either of them\nstand alone. So it's one of those things where you'll never be euphoric because you're never going\nto have the absolute best return, but you're not going to be despondent because you're not going to have\nthe absolute worst return. It's kind of like even kill lower tales of distribution, less trust,\nless regret. So yeah, so I think it pairs very well with trend falling around dry downs and\noutperforms trend falling and strong up trends trend falling out from draw to sentiment. So they're\nvery complimentary. Yeah, no, it's Ray. I, you and I talked a couple of weeks ago, you were kind\nof like, hey, you know, we wanted to get our track record in this thing. I actually found out\nabout your fun from an advisor that I work together with. And you know, the performance and the\nrisk adjuster returns have been great. So now that you've kind of got these couple of years\nunder your belt, you're starting to take it as to market. Like how are you thinking about distribution\nand and going to start making some noise in the space? Because like I said, you know, fun's\ndone great. And I think the concept is awesome. And I think it fits well in an investor's portfolio.\nSo how are you thinking, you know, as a, we'll call you a boutique asset manager around distribution\nand start to get some flows in here. Well, so that's a great question. The first three years\ndid no marketing, I asked Wes, I said, how do we, you know, pitch this? And first of all, I have to say\nthat, you know, you asked me a lot of hobbies. And I'm telling you my hobby is to kind of\ndecipher the market. So I'm like, one of those plant guys that just wants to be kind of left alone.\nI'm not a sales guy. I don't like going out and, you know, talking to people and having to sell something.\nIt's just not how I'm built, constitutionally. So he said, Ray, you're not going to be able to sell it\nfrom the first three years. So just sit back and relax. I'm like, oh, that's good. That's fine by me.\nI don't want to be out there selling this. You know, we're, I'm grateful for the performance\nand it's done well. And in the process, people will found us in a briefs out to us. So again,\nI haven't had to do a lot of direct selling, but I do have a relationship with the media company\nand they have a very vast network of RIAs, especially RIAs that are tactically oriented. And\nthrough them, I get warm introductions to these advisors. And so, you know, I'm having one on one\nmeetings, you know, several times a month with people. And, you know, it's been very good. So far,\nthey're very receptive. And it's, that's sort of how I, that's really in my wheelhouse, as far as\nmarketing goes, like one on one conversations is supposed to, you know, pitching to a large group or\nblasting things out there. And to be honest with you, well, you know, I love the flows and the AUM\nincreasing. I wouldn't want it to take a huge step function from where it is now to some huge number.\nAnd then, you know, if you go through a period of mediocre performance and you have all these\ndisappointed people, I'd want it to just kind of gross steadily and slowly. And kind of the way it's\nhappening now is it has been ideal. So that's what we see it. Well, RIA, again, I love it. I really\nappreciate you spending some time with me today. I always find these conversations and these types\nof strategies very fascinating. But before I let you go, where can people find out more about\nyour company and where can people learn more about the new DTF? I'm going to make you do a little\nselling here. Sorry. No problem, right? So we have an RIA website, which is just www.relativecentimate.com.\nAnd that's the RIA. And you can sign up for our free week news later where I talk about how\nthese positioning is changing and what that like means from a different asset classes. And then we also\nhave our ETF website, which you can get to you from the RIA website. But that website is\nGoldofcentimateDTFs.com. And you can find me on Twitter at\nrelcenttech. R-E-L-S-E-N-T-T-E-C or just Google my name and it'll come up. But no, thank you, Brad. I\nhad a great time. I appreciate the invite. Yeah, sure. Thanks again. Thanks for spending some time\nin your life. Thank you.",
  "keyQuotes": [],
  "topics": [],
  "guestBio": ""
}