[
  {
    "title": "Raymond Micaletti - Relative Sentiment Technologies - MOOD ETF",
    "date": "2026-02-01",
    "guest": "Raymond Micaletti",
    "company": "Relative Sentiment Technologies - MOOD ETF",
    "duration": "36 min",
    "youtubeId": "wg1U2qPvCPo",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>Raymond Micaletti built the MOOD ETF around a single idea: institutions consistently outperform retail traders, and you can measure the difference. After watching a relative sentiment indicator correctly call two major market bottoms while all his other signals failed, he stopped ignoring it and started building.</p><p>In this episode, Ray breaks down how he uses Commitments of Traders data and sentiment surveys to construct signals across equities, bonds, commodities, and currencies. We dig into the structural advantages institutions have over retail, why his approach avoids the whipsaw problem that kills most tactical strategies, and where it can still get you in trouble. He also makes a strong case for pairing relative sentiment with trend following—two strategies that naturally offset each other&apos;s weaknesses.</p><p>Website: <a href='http://www.relativesentiment.com'>www.relativesentiment.com</a> ETF site: relativesentimentetfs.com Twitter: @relsenttech</p>",
    "slug": "raymond-micaletti"
  },
  {
    "title": "Sam Rahman & John McNamara - Hedgeye Asset Managment",
    "date": "2025-08-03",
    "guest": "Sam Rahman & John McNamara",
    "company": "Hedgeye Asset Managment",
    "duration": "35 min",
    "youtubeId": "nnip7NG_pGg",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>Sam Rahman and John McNamara joined Brad to discuss the launch and philosophy behind the HGRO ETF. Hedgeye, originally built on delivering institutional-quality macroeconomic research to a broader audience, has now extended into the asset management space with active ETF offerings.</p><p><br/></p><p>Sam, who previously managed public equity investments for the Fidelity family office, explained how HGRO fills a gap in the ETF landscape: it offers a concentrated, actively managed large-cap growth portfolio that emphasizes risk-adjusted returns. He emphasized that most large-cap growth ETFs are either over-diversified and benchmark-hugging or overly concentrated and thematic, leaving little in between. HGRO aims to provide thoughtful portfolio construction and institutional-quality research to everyday investors.</p><p><br/></p><p>The strategy focuses on three core themes: deep moat compounders, innovators and disruptors, and special situations. Sam described the selection process as conviction-driven but bounded by disciplined portfolio risk constraints, with max 3% active weights on both stock and sector levels. Sell decisions are typically driven by fundamental deterioration or technical breakdowns.</p><p><br/></p><p>John shared that HGRO is intended to be a core large-cap equity position in diversified portfolios and is gaining early traction among large RIAs. He also confirmed that Hedgeye has more ETF launches in the pipeline and plans to build on its highly engaged research community and media platform to drive continued growth.</p>",
    "slug": "sam-rahman-john-mcnamara"
  },
  {
    "title": "Seth Cogswell - Running Oak",
    "date": "2025-07-19",
    "guest": "Seth Cogswell",
    "company": "Running Oak",
    "duration": "38 min",
    "youtubeId": "bGR5T7Ov34c",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In this episode of <em>Behind the Ticker</em>, Brad Roth speaks with Seth Cogswell, Portfolio Manager at Running Oak Capital, about the firm’s flagship ETF—<b>RUNN</b>, the Running Oak Efficient Growth ETF. With a background that spans fundamental equity research and derivatives trading, Cogswell shares his journey to Running Oak and how the firm’s roots in separately managed accounts (SMAs) laid the foundation for its ETF strategy. Originally launched in 2009 for advisors seeking a smoother ride through market cycles, the strategy behind RUNN has delivered strong results with an emphasis on downside protection.</p><p><br/></p><p>Cogswell breaks down how RUNN combines a core equity portfolio of 30–50 high-conviction U.S. large-cap stocks with a tactical allocation to fixed income and cash equivalents. What sets RUNN apart is its ability to dynamically shift its allocation between risk-on and risk-off environments. The fund can reduce equity exposure as low as 30% or raise it up to 90%, based on a rules-based framework that evaluates macro indicators, valuation metrics, and market trends. This allows the fund to dial down risk during market stress and re-enter more aggressively during recovery phases.</p><p><br/></p><p>The equity sleeve of the portfolio focuses on quality companies with strong free cash flow and sustainable growth—avoiding overvalued, speculative names. Meanwhile, the fixed income sleeve remains flexible, emphasizing high credit quality and shorter durations when risk is elevated. Cogswell notes that RUNN is actively managed daily, with oversight to ensure discipline in both the equity and fixed income allocations. The team also maintains a consistent philosophy that prioritizes risk-adjusted returns and long-term capital appreciation rather than chasing short-term performance.</p><p><br/></p><p>Designed for use as a core equity holding or a risk-managed growth strategy, RUNN offers advisors and investors an efficient, transparent vehicle to navigate unpredictable markets. With a track record rooted in the firm’s SMA history and now offered in a more tax-efficient ETF format, the fund aims to deliver smoother performance without sacrificing long-term upside. </p>",
    "slug": "seth-cogswell"
  },
  {
    "title": "Eric Lutton - Sound Income Strategies",
    "date": "2025-07-13",
    "guest": "Eric Lutton",
    "company": "Sound Income Strategies",
    "duration": "26 min",
    "youtubeId": "uXuWOmDkI-s",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In this episode, Brad sits down with <b>Eric Lutton</b>, CIO of <b>Sound Income Strategies</b>, to discuss the firm’s actively managed ETF: <b>FXED</b>, and its unique approach to fixed income investing.</p><p>Eric shares his professional journey from trading in the pits of Chicago to managing institutional assets and ultimately building out Sound Income’s fixed income platform. The firm has grown from managing $30M with one advisor to nearly $4B with over 100 advisors, all through organic growth. At the core of their approach is a clear focus on income generation—particularly for retirees and conservative investors looking to preserve capital and generate steady cash flow.</p><p>Eric explains that <b>FXED</b> was created to solve two problems: making the firm’s core-plus fixed income strategy available to smaller accounts and addressing the lack of fixed income ETFs that combine traditional bonds with higher-yielding alternatives like <b>BDCs</b>, <b>REITs</b>, <b>preferreds</b>, and <b>non-core bond ETFs</b>.</p><p>He outlines how the portfolio targets around 70-75% fixed coupon instruments and layers in non-traditional income-generating securities—especially those with lower correlation to investment grade bonds—to deliver better risk-adjusted returns than broad benchmarks like the Agg. He discusses their bottom-up selection process, focus on management quality in BDCs and REITs, and commitment to avoiding names with poor underwriting or operational risks.</p><p>FXED is <b>actively managed</b> to allow dynamic rebalancing between investment-grade and high-yield allocations depending on market conditions. Eric makes the case that active management in fixed income still has an edge—unlike equities, where alpha is increasingly hard to find. The fund aims to outperform by overweighting stronger names and avoiding the losers—something passive indexes can’t do.</p><p>He emphasizes that FXED is especially useful for <b>retirees or near-retirees</b> who need reliable income and want to avoid relying too heavily on equities for yield. With a <b>target yield in the upper 6% range</b>, the fund allows for reduced capital commitment to fixed income, freeing up room for growth investments or risk-free cash buffers elsewhere in the portfolio.</p>",
    "slug": "eric-lutton"
  },
  {
    "title": "Ryan Thomes - Hotchkis & Wiley",
    "date": "2025-06-29",
    "guest": "Ryan Thomes",
    "company": "Hotchkis & Wiley",
    "duration": "25 min",
    "youtubeId": "S-B1Dla2cgU",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In this episode of <em>Behind the Ticker</em>, Brad Roth interviews Ryan Thomes, Co-Portfolio Manager at Hotchkis &amp; Wiley, to discuss the launch and strategy behind the firm’s newest ETF—HWSM, the Hotchkis &amp; Wiley SMID Cap Diversified Value ETF. Ryan shares his career journey from investment consulting to portfolio management, explaining how his early due diligence work led him to join the very firm he once evaluated. Over the past 17 years at Hotchkis &amp; Wiley, Ryan has been deeply involved in refining the firm’s value-based equity strategies and co-manages both the small-cap and SMID strategies.</p><p><br/></p><p>The conversation centers on the HWSM ETF, which launched in early 2024 and represents a natural extension of Hotchkis &amp; Wiley’s long-standing small-cap value process. Although the ETF is new, the underlying investment methodology dates back over 20 years. Ryan breaks down the firm’s three-step process: proprietary quantitative modeling, human analyst review, and thoughtful portfolio construction. Unlike traditional quant screens, Hotchkis &amp; Wiley’s models attempt to emulate how a human analyst would value companies based on normalized mid-cycle earnings rather than current market conditions. This combination of rigorous modeling and fundamental judgment allows them to focus on out-of-favor, under-followed stocks with long-term value potential.</p><p><br/></p><p>HWSM typically holds between 150–200 names, balancing diversification with high active share, and utilizes a tiered weighting system that ties directly to fundamental risk ratings. Analysts assess companies across three pillars—business quality, balance sheet strength, and corporate governance—and these scores directly impact the weightings in the portfolio. The fund is rebalanced biannually with monthly adjustments as needed, helping maintain both conviction and efficiency.</p><p><br/></p><p>Ryan explains that SMID caps—especially value names—are historically underappreciated and undervalued compared to large-cap growth, making them especially compelling today. Despite large-cap tech’s dominance over the past decade, he sees potential mean reversion in valuations that could favor smaller, overlooked companies. HWSM is positioned as either a core equity holding or a complement to growth-oriented SMID allocations, offering access to Hotchkis &amp; Wiley’s institutional-quality research through a tax-efficient ETF vehicle. </p>",
    "slug": "ryan-thomes"
  },
  {
    "title": "Kirk McDonald - Argent Capital",
    "date": "2025-06-15",
    "guest": "Kirk McDonald",
    "company": "Argent Capital",
    "duration": "24 min",
    "youtubeId": "EuD4WJ1MeN0",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In this episode of <em>Behind the Ticker</em>, host Brad Roth speaks with Kirk McDonald, Portfolio Manager at Argent Capital Management, about his unique path from Air Force pilot to managing the Argent MidCap ETF (ticker: AMID). McDonald shares how his firm’s mission to deliver both strong investment performance and top-tier client service inspired their move into the ETF space. With a deep-rooted philosophy focused on “enduring businesses,” Argent seeks companies with consistent cash flow growth, durable competitive advantages, and strong capital allocation by management.</p><p><br/></p><p>Kirk dives into the construction of AMID, which holds a concentrated portfolio of 40–50 midcap names with low turnover—around 20% annually. What differentiates Argent’s approach is the integration of both quantitative modeling and fundamental research, a methodology McDonald calls “quantamental.” This framework is built on 25 fundamental factors that guide stock selection, continually refined to ensure alignment with their long-term investing philosophy. Kirk shares a memorable analogy comparing portfolio candidates to pigs at a trough—emphasizing the constant drive to prioritize younger, hungrier contenders that can generate future outperformance.</p><p><br/></p><p>McDonald also breaks down key portfolio holdings, including Copart and Fortinet, and explains how AMID performs across different market cycles. While the strategy may lag during market regime shifts, it tends to outperform once trends stabilize. He stresses the importance of risk management, drawing from his aviation background to describe a systematic process embedded throughout the stock selection lifecycle.</p><p><br/></p><p>Finally, McDonald explains how AMID fits into broader client portfolios, describing midcap stocks as a “forgotten” asset class underrepresented in most investor allocations despite historically delivering strong returns. He also previews Argent’s growing ETF lineup, which now includes large cap and small cap offerings and will eventually expand to cover SMID and high-yield strategies.</p>",
    "slug": "kirk-mcdonald"
  },
  {
    "title": "Rob Thummel - Tortoise Capital",
    "date": "2025-06-08",
    "guest": "Rob Thummel",
    "company": "Tortoise Capital",
    "duration": "25 min",
    "youtubeId": "EMB1hDVr4Ys",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In this episode of <em>Behind the Ticker</em>, Brad Roth sits down with Rob Thummel, Senior Portfolio Manager at Tortoise Capital Advisors, to dive into the firm’s active ETF, the Tortoise Essential Energy Fund (Ticker: TPZ). Rob shares his decades-long journey in the energy sector—from working in gas stations and oilfields as a teenager to helping lead one of the most focused energy investment firms in the country. Tortoise Capital is devoted entirely to energy, aiming to deliver superior risk-adjusted returns by investing across the full spectrum of the sector, including infrastructure, utilities, and renewables—not just traditional oil and gas producers.</p><p><br/></p><p>TPZ, which recently transitioned from a closed-end fund to an active ETF, offers investors a dynamic approach to the evolving energy landscape. Rob explains how the fund is positioned to capture opportunities stemming from electrification and increased U.S. energy exports, with particular focus on natural gas and liquid infrastructure. He emphasizes that energy is no longer just about oil—natural gas and electricity are central to powering data centers and AI advancements, and TPZ is designed to align with that megatrend.</p><p><br/></p><p>The portfolio maintains an active share of 86%, reflecting its substantial divergence from traditional benchmarks like the S&amp;P Energy Index or ETFs like XLE. TPZ typically holds 80-90% in equities and 10-20% in fixed income, with additional option overlays to generate income and reduce volatility. Rob describes the fund’s hybrid approach—combining top-down macro analysis with bottom-up fundamental research—to find undervalued names with strong cash flows and management quality.</p><p><br/></p><p>With a current dividend yield of about 5% and one-year performance exceeding 40%, TPZ has outpaced many passive energy benchmarks by leaning into secular shifts and tactically avoiding cyclical pitfalls. Rob positions TPZ as a core energy allocation for diversified portfolios, not just for total return potential, but for its robust income stream and long-term exposure to the energy-AI convergence. </p>",
    "slug": "rob-thummel"
  },
  {
    "title": "Bob Elliot - Unlimited Funds",
    "date": "2025-05-25",
    "guest": "Bob Elliot",
    "company": "Unlimited Funds",
    "duration": "31 min",
    "youtubeId": "pCiHcnnsqdo",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of <em>Behind the Ticker</em>, Bob Elliott, co-founder and Chief Investment Officer of Unlimited, discussed the firm’s mission to democratize hedge fund strategies through innovative ETF structures. Drawing on his experience managing strategies at Bridgewater Associates and running a $125 million venture capital fund, Elliott launched Unlimited to address what he sees as fundamental inefficiencies in traditional hedge funds—high fees, limited access, and tax-inefficient vehicles. Unlimited’s approach uses proprietary technology to replicate hedge fund strategies at lower costs, inside liquid, tax-efficient ETFs.</p><p><br/></p><p>The firm’s latest offering, the Unlimited HFGM ETF (ticker: HFGM), seeks to replicate the returns of global macro hedge funds, offering a 2x exposure to the strategy at just 95 basis points. Elliott explained that global macro is one of the most attractive and diversifying hedge fund styles due to its flexibility across asset classes—currencies, commodities, rates, equities—and its historically low correlation to traditional 60/40 portfolios. By leveraging a machine learning-driven process, HFGM infers the positioning of roughly 500 macro hedge fund managers in near real-time, using public market data and return streams to replicate their exposures.</p><p><br/></p><p>Elliott emphasized that HFGM is fully systematic, with daily updates to inferred manager positioning and weekly average rebalancing. The ETF primarily uses futures contracts for efficiency, allowing both long and short exposure across global macro markets while benefiting from tax-friendly ETF structuring. Elliott stressed that the firm avoids “black box” opacity by grounding its machine learning in intuitive, transparent modeling—essentially scaling the same logic any investor might use to reverse-engineer a manager’s trades, but with far greater accuracy and breadth.</p><p><br/></p><p>He positioned HFGM and Unlimited’s broader ETF suite as part of a shift in portfolio construction—from the old 60/40 model to a more modern 50/30/20 framework, where 20% is allocated to alternatives, including both liquid and illiquid strategies. HFGM, with its manager-diversified exposure, ease of execution, and lack of paperwork or K-1s, offers a compelling way for advisors and institutions to gain hedge fund-like exposure without the drawbacks of traditional LP structures.</p>",
    "slug": "bob-elliot"
  },
  {
    "title": "Brad Neuman - Alger",
    "date": "2025-05-11",
    "guest": "Brad Neuman",
    "company": "Alger",
    "duration": "26 min",
    "youtubeId": "i9hnsd-vstA",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of <em>Behind the Ticker</em>, Brad Neuman, Director of Market Strategy and Portfolio Manager at Alger, joined the show to discuss the firm’s rich history in growth investing and the launch of their latest ETF: Alger Russell Innovation ETF (ticker: INVN). Neuman, who has a 25-year investment background spanning bottom-up and top-down roles on both the buy and sell sides, explained how Alger’s philosophy of “positive dynamic change”—a principle rooted in identifying growth opportunities amid market disruption—has remained consistent since the firm’s founding in 1964.</p><p><br/></p><p>Neuman described Alger’s long-standing emphasis on change as the foundation for identifying outperforming businesses. This philosophy is implemented through deep, fundamental research conducted by a seasoned analyst team that conducts proprietary field work—speaking directly with customers, competitors, and suppliers. While most of Alger’s strategies have been actively managed and bottom-up, INVN marks a shift toward a more systematic, top-down process designed to isolate innovation as an investable factor.</p><p><br/></p><p>The INVN ETF seeks to directly invest in innovation by identifying companies with strong R&amp;D investment that is underappreciated by the market. Starting with the Russell 1000, Alger removes the bottom third of companies ranked by free cash flow margin to avoid early-stage or inefficient businesses. From the remaining universe, they select the top 50 companies based on R&amp;D-to-enterprise value. The result is an equally weighted portfolio reconstituted quarterly to maintain exposure to what Neuman calls “HIPP” stocks—Highly Innovative, but Prudently Priced. This approach avoids overlap with typical growth benchmarks and excludes megacap names like Apple, whose R&amp;D may be large in absolute terms but not relative to their vast market caps.</p><p><br/></p><p>Neuman positioned INVN as a mid-cap core exposure that can serve as a replacement for traditional passive or active mid-cap strategies, while solving for issues like overconcentration in large-cap tech and inflated market valuations. With low turnover, high active share, and a valuation profile significantly below traditional growth indices, INVN provides a unique, quant-driven solution for investors looking to allocate directly to innovation. </p>",
    "slug": "brad-neuman"
  },
  {
    "title": "Wayne Penello - NextGen EMP",
    "date": "2025-05-05",
    "guest": "Wayne Penello",
    "company": "NextGen EMP",
    "duration": "36 min",
    "youtubeId": "CnhrjG0rLyI",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of <em>Behind the Ticker</em>, Wayne Penello, founder of NextGen EMP, shared the fascinating journey that led him to launch the NextGen Efficient Market Portfolio Plus ETF (ticker: EMPB). With over 40 years of experience as a commodity trader—including a decade on the floor of the New York Mercantile Exchange and years advising global trading firms—Penello developed a deep understanding of risk management. He later patented the Performance Risk Management System, which earned his clients over $13 billion in hedging profits and was detailed in his book, <em>Risk as an Asset</em>. After selling his firm, Penello turned his attention to equities, frustrated by the industry’s overreliance on diversification and lack of active risk management, ultimately leading to the creation of EMPB.</p><p><br/></p><p>EMPB is a long/short equity ETF designed to actively manage systemic market risk using a proprietary, statistically driven methodology Penello describes as a “foggy ball”—an imperfect but highly effective algorithm that identifies the weakest sectors (“nags of the market”) and shorts them to dampen volatility. Rather than attempting to predict market direction or time the best 90 days, the fund focuses on avoiding the worst periods, which historically have the most destructive impact on long-term performance. The ETF holds about 16 sector or thematic ETFs, balancing long and short exposures to achieve a Sharpe ratio above 2, with the aim of consistently outperforming the S&amp;P 500 while maintaining a maximum drawdown of less than 10%.</p><p><br/></p><p>A key differentiator for EMPB is its accessibility: Penello was determined to build a sophisticated hedge-fund-like strategy for everyday investors, not just accredited institutions. By launching as an ETF rather than a private fund, NextGen EMP made the strategy available to anyone with $25, offering hedge-fund-caliber active management in a tax-efficient, low-minimum format. Despite an advertised expense ratio of 2.21%, Penello explained that the effective net cost to investors is closer to 1% or less when accounting for the offsetting interest income from short positions and dividends on long holdings. The fund is rebalanced monthly.</p><p><br/></p><p>Penello positioned EMPB as a core equity exposure solution rather than an alternatives sleeve, emphasizing its potential appeal to both young investors seeking equity growth with controlled risk and retirees who cannot afford major portfolio drawdowns. With a disciplined, systematic process that removes emotional decision-making and a structure that works efficiently within tax-advantaged accounts, EMPB represents what Penello calls the “next generation” of equity investing.</p>",
    "slug": "wayne-penello"
  },
  {
    "title": "Rob Harvey - DFA",
    "date": "2025-04-27",
    "guest": "Rob Harvey",
    "company": "DFA",
    "duration": "30 min",
    "youtubeId": "AlGTRFn0CS8",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of <em>Behind the Ticker</em>, Rob Harvey, Vice President at Dimensional Fund Advisors (DFA), shared his personal journey into asset management and gave an in-depth look at DFA’s unique approach to building portfolios, particularly their work in the ETF space. Harvey described how he first encountered Dimensional while managing external asset managers at Cisco Systems, where their emphasis on evidence-based investing and disdain for market predictions immediately stood out. After attending a Dimensional conference and hearing academic legends like Eugene Fama and Ken French present, Harvey was convinced and eventually joined DFA, relocating to Austin, Texas.</p><p>Harvey explained that DFA’s core mission is to help investors achieve their financial goals by providing investment solutions based on robust academic research, rather than focusing on marketing or chasing hot trends. He emphasized Dimensional’s long-standing partnership model with financial advisors, which prioritizes education, client communication, and long-term outcomes over product sales. This commitment to advisors and evidence-based investing remains central even as DFA expands its reach through ETFs, making their historically advisor-only strategies accessible to a broader audience without compromising their foundational principles.</p><p>The conversation focused heavily on DFA’s investment philosophy, particularly their emphasis on factors like size, value, and profitability, which are systematically applied across all portfolios. Harvey noted that DFA is highly disciplined in vetting new research before incorporating it into their strategies, ensuring that any new factors—such as profitability, which was added in 2012—meet a high bar for robustness and persistence across time and markets. DFA’s portfolios are managed actively on a daily basis, providing flexibility to capture real-world developments in ways traditional index funds cannot, while maintaining low fees and broad diversification.</p><p>Harvey also provided an overview of DFAI, Dimensional’s International Core Equity ETF. He described DFAI as a market-wide, low-tracking-error strategy that lightly tilts toward premiums like small size, value, and profitability, offering enhanced expected returns over a standard index fund. DFAI differs from traditional international index funds by including a broader set of securities, especially micro-caps, and by incorporating real-time momentum screens to avoid value traps and boost performance. Harvey positioned DFAI as an ideal core international equity holding for advisors seeking to move beyond passive indexing without sacrificing diversification or cost efficiency. </p>",
    "slug": "rob-harvey"
  },
  {
    "title": "Clark Allen - Horizon Investments",
    "date": "2025-04-20",
    "guest": "Clark Allen",
    "company": "Horizon Investments",
    "duration": "29 min",
    "youtubeId": "Q3qs5ujTXDI",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of <em>Behind the Ticker</em>, Clark Allen, Head of ETFs at Horizon Investments, shared his journey from public accounting and family office investing to leading Horizon’s entrance into the ETF space. With a deep background in institutional asset management and quantitative research, Allen joined Horizon to help bridge the gap between sophisticated investment strategies and emotionally resonant, goals-based planning for financial advisors and their clients. Horizon, founded in the mid-1990s, evolved from a wealth manager into a strategist firm with a focus on outcome-oriented models. Today, the firm offers a blend of mutual funds, OCIO services, and now, actively managed ETFs as part of its growing product suite.</p><p><br/></p><p>Horizon’s ETF push began with two initial launches, BENJ and HBTA, and the firm has filed for seven more ETFs in 2024. Allen explained that Horizon’s motivation was largely advisor-driven—many advisors were already using Horizon’s mutual funds and model portfolios but needed ETF-based solutions to better integrate with their workflows. BENJ, the Horizon Landmark ETF, is a cash management strategy built around box spreads, offering a T-bill-plus total return without kicking off taxable income. Allen emphasized that this feature is ideal for model portfolios, particularly in retirement distribution strategies, where advisors need liquidity but prefer to manage tax exposure and reinvestment activity with precision.</p><p><br/></p><p>HBTA, the firm’s second ETF, is designed as a high-beta equity strategy with put spreads to offer greater upside capture than the S&amp;P 500. Allen described it as a product built for certainty—not to time markets, but to provide clear expectations around performance, particularly for advisors seeking risk-aligned tools for growth-oriented allocations. He noted that many advisors in Horizon’s OCIO network had asked for such solutions to complement their existing exposures without relying on small caps or thematic tech names.</p><p><br/></p><p>What sets Horizon apart, according to Allen, is its emphasis on being a solution provider rather than a product pusher. The firm’s ETF lineup is crafted to fit within model portfolios and financial plans, not just to chase the latest trend. Horizon’s focus remains on outcome-driven investing, where each ETF serves a clear role—whether providing liquidity, risk-managed equity exposure, or a building block for custom advisor models. </p>",
    "slug": "clark-allen"
  },
  {
    "title": "Paisley Nardini - Simplify",
    "date": "2025-04-06",
    "guest": "Paisley Nardini",
    "company": "Simplify",
    "duration": "32 min",
    "youtubeId": "adkHwF3lRxg",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent special edition of <em>Behind the Ticker</em> recorded live at the Exchange ETF Conference, Paisley Nardini, Vice President and Client Portfolio Strategist at Simplify Asset Management, joined the show to discuss her path from bond trading to ETF strategy—and dive into Simplify’s Managed Futures Strategy ETF, ticker CTA. With a career that began on a bond trading desk and later evolved through roles at PIMCO and in institutional portfolio management, Nardini has developed a strong passion for bringing hedge-fund-caliber strategies to a broader investor base.</p><p><br/></p><p>Simplify launched in 2020 following a key SEC rule change that expanded the use of derivatives in ETFs. Since then, the firm has grown to over $7 billion in AUM across 35 ETFs, becoming known for its innovative use of options and derivatives. While often categorized as an “alternative ETF issuer,” Nardini emphasized that Simplify’s lineup includes not only pure diversifiers like CTA but also core active fixed income and systematic equity strategies. She described CTA as a capital-efficient, hedge-fund-style managed futures fund focused solely on commodities and interest rate futures—excluding equities and currencies to offer a cleaner source of diversification.</p><p><br/></p><p>CTA stands out by employing a multi-signal model composed of four drivers: trend, mean reversion, intermarket (or risk-off), and carry. The trend signal captures directional market movements across short, medium, and long-term timeframes. The mean reversion signal acts as a counterbalance, scaling exposure when trends become extended. The intermarket factor assesses cross-asset relationships—such as equities selling off while bonds rally—to adjust positioning dynamically. Finally, the carry signal evaluates the interest rate curve to avoid negative carry in periods of inversion. This hedge-fund-inspired, daily-rebalanced model is powered by research from Altis Partners, a UK-based CTA firm.</p><p><br/></p><p>The fund uses futures contracts, which naturally embed leverage, but Simplify imposes a 25% margin-to-equity constraint to manage risk. Unlike many peers, CTA has no sector or position caps, allowing for high-conviction trades—such as its profitable exposure to the cocoa market in 2023. Nardini also addressed the ETF’s performance through volatile periods, highlighting its ability to pivot quickly, reduce drawdowns, and remain uncorrelated to both stocks and bonds. With negative correlation to equities and the potential for equity-like returns, CTA is increasingly being used as a key diversifier in modern model portfolios.</p>",
    "slug": "paisley-nardini"
  },
  {
    "title": "Matt Kaufman - Calamos",
    "date": "2025-03-30",
    "guest": "Matt Kaufman",
    "company": "Calamos",
    "duration": "23 min",
    "youtubeId": "2rZj9KENAks",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent special edition of <em>Behind the Ticker</em> recorded live at the Exchange ETF Conference, Matt Kaufman, Head of ETFs at Calamos Investments, joined the show to talk about Calamos’ expanding lineup of structured outcome ETFs—including their latest innovation: a suite of protected Bitcoin ETFs. With a legacy in risk-managed strategies, especially convertible bonds, Calamos has built a reputation over the past 50 years as a leader in delivering upside equity potential with downside protection, a philosophy that now extends to one of the most volatile asset classes—Bitcoin.</p><p><br/></p><p>Kaufman introduced the firm’s new structured protection Bitcoin ETFs: CBOJ (100% downside protection), CBTJ (10% at risk), and CBTX (20% at risk), offering varying degrees of risk-reward profiles depending on an investor’s tolerance. These funds use a combination of zero-coupon U.S. Treasuries and option strategies built on a custom Bitcoin index developed with the Chicago Board Options Exchange (CBOE). That index, tracking all 11 spot Bitcoin ETPs, enables Calamos to construct call spread strategies that allow for capped upside with predefined downside exposure—offering investors a much-needed safety net in the crypto space.</p><p><br/></p><p>Kaufman explained how these ETFs are built: most of the portfolio is allocated to Treasuries to secure principal (e.g., 96% for the 100% protected product), while the remaining yield is used to buy a call spread on Bitcoin. The result is a defined one-year outcome period with options-based exposure to Bitcoin’s price movement. Kaufman emphasized the appeal of these products during periods of high volatility, noting that current upside caps are as high as 50–60% for the 20% floor product—making them attractive even amid Bitcoin’s recent drawdown.</p><p><br/></p><p>Designed for both crypto-curious investors and advisors looking to include Bitcoin in client portfolios with risk control, the Calamos suite of protected Bitcoin ETFs fills a significant gap in the market. Whether used as a “risk-off” sleeve in a crypto model portfolio or as a bond-alternative with meaningful upside, these ETFs offer a more traditional framework for incorporating Bitcoin. </p>",
    "slug": "matt-kaufman"
  },
  {
    "title": "Jeff Cullen - Schafer Cullen",
    "date": "2025-03-23",
    "guest": "Jeff Cullen",
    "company": "Schafer Cullen",
    "duration": "31 min",
    "youtubeId": "cXOqDoQk8eQ",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of <em>Behind the Ticker</em>, Jeff Cullen, Managing Director at Schafer Cullen Capital Management, sat down to discuss the firm’s first ETF, the Cullen Enhanced Equity Income ETF (ticker: DIVP). With over 30 years in the asset management industry and experience across mutual funds, SMAs, and ETFs, Cullen provided a deep dive into how the firm’s long-standing dividend-focused value strategy evolved into an actively managed ETF. Schafer Cullen, which manages over $24 billion in assets, has built a reputation over four decades as a value manager with a strong emphasis on dividend-paying stocks, and DIVP represents a natural extension of that philosophy.</p><p>DIVP is a high-conviction, actively managed strategy that holds 30 to 40 large-cap, household-name value stocks with above-average dividend yields—typically above 3%. What sets DIVP apart is its selective covered call overlay, where the team writes short-dated, out-of-the-money call options (typically 2–4% out and expiring in two weeks to one month) on about 25–40% of the portfolio. The calls are written on individual stocks, not an index, and are chosen based on market volatility and the underlying fundamental outlook of each holding. This approach allows the portfolio to enhance income without significantly capping upside potential, thanks to thoughtful partial-position writing and sector diversification.</p><p>Cullen emphasized that the ETF is designed to deliver two sources of income—dividends from quality value stocks and call option premiums—leading to a historical yield between 7.2% and 8.3% in the SMA version of the strategy, with more than half of that coming from qualified dividend income. The strategy is intended for investors seeking higher income with equity market participation and downside resilience. While the ETF may underperform in sharp bull runs or during periods of low volatility, it performs particularly well in sideways or volatile markets where premium harvesting and dividend yield can shine.</p><p>Cullen also shared his enthusiasm for entering the ETF space, highlighting the structural benefits of the ETF wrapper, including tax efficiency, ease of implementation, and the ability to reach a broader set of advisors and investors. He noted that Schafer Cullen plans to expand its ETF offerings, potentially via ETF share classes of existing mutual funds, depending on upcoming SEC rulings.</p>",
    "slug": "jeff-cullen"
  },
  {
    "title": "Dan Petersen - New York Life",
    "date": "2025-03-15",
    "guest": "Dan Petersen",
    "company": "New York Life",
    "duration": "26 min",
    "youtubeId": "ob2x0mHCrr8",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of <em>Behind the Ticker</em>, Dan Petersen, Head of Product Management at New York Life Investments, discussed the firm’s international equity strategy and the mechanics behind the NYLI FTSE International Equity Currency Neutral ETF (ticker: HFXI). With over two decades in the industry, Petersen has held various roles in financial advisory and ETF distribution, playing a key role in the growth of IndexIQ before its acquisition by New York Life in 2015. Since then, he has focused on product development, helping expand the firm’s ETF offerings.</p><p><br/></p><p>HFXI was designed to provide a balanced approach to international investing by hedging 50% of currency exposure while maintaining full equity market exposure. Petersen explained that historically, investors in international equities had to accept full currency exposure by default, which could add or detract significantly from returns depending on currency fluctuations. Fully hedged products emerged to remove this risk entirely, but many investors found it difficult to time when to hedge and when not to. HFXI was created to offer a middle ground—allowing investors to benefit from currency movements when favorable while reducing the risk of extreme fluctuations.</p><p><br/></p><p>The fund achieves this partial hedge by using forward contracts that are rolled monthly, adjusting for changes in currency valuations. Petersen highlighted that currency exposure can have a substantial impact on performance, often contributing or detracting by as much as 600 to 1,000 basis points annually. By hedging half the exposure, HFXI aims to smooth out volatility while still allowing investors to participate in foreign currency strength when it occurs. This strategy is particularly beneficial in periods of global economic stability when foreign currencies tend to appreciate, as well as in risk-off environments where excessive currency exposure can compound equity drawdowns.</p><p><br/></p><p>Petersen positioned HFXI as a long-term core allocation within international equity portfolios. Advisors can use it as a standalone replacement for unhedged international ETFs or pair it with traditional market-cap-weighted international funds to create a customized level of currency exposure. He also pointed out that international equities currently present a compelling valuation opportunity, with price-to-earnings ratios at historically attractive discounts compared to U.S. markets. Given the extreme valuation gap between U.S. and international stocks, he suggested that now may be an opportune time for investors to consider increasing international exposure.</p>",
    "slug": "dan-petersen"
  },
  {
    "title": "Kirsten Chang - VettaFi",
    "date": "2025-03-09",
    "guest": "Kirsten Chang",
    "company": "VettaFi",
    "duration": "23 min",
    "youtubeId": "6BR3mL4Rgmc",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of <em>Behind the Ticker</em>, Kirsten Chang, Director of Editorial and Content at VettaFi, shared insights into her journey from CNBC to her current role, as well as details about the upcoming Exchange ETF Conference, the largest ETF industry event of the year. With over a decade of experience at CNBC—working on <em>Squawk Box</em>, covering markets from the floor of the NYSE with Bob Pisani, and helping launch <em>ETF Edge</em>—Chang transitioned to VettaFi to further develop her own voice and contribute to the growing ETF landscape.</p><p><br/></p><p>Chang explained that VettaFi is more than just the organizer of the Exchange conference. It serves as an index provider, a data analytics firm, and a digital distribution company focused on bridging the gap between advisors and ETF issuers. With over 4,000 ETFs available in the market, VettaFi helps investors and financial professionals sift through the noise by offering research, webcasts, and educational content. Through its partnerships with asset managers, the firm provides timely insights on ETF flows, market trends, and new product developments.</p><p><br/></p><p>The discussion then shifted to the Exchange ETF Conference, now taking place in Las Vegas after years in Miami. Chang highlighted that the conference is designed to offer advisors actionable insights and analysis, with sessions covering everything from private credit and hedge fund-led multi-asset ETFs to the explosive growth of active ETFs. The event brings together the biggest names in the industry, including keynote speakers like David Kelly and Ian Bremmer, and features panels on thematic investing, ESG trends, crypto, AI, and international equities. With record-breaking fixed income ETF flows and the continued rise of AI-related investments, the conference aims to provide a roadmap for advisors navigating today’s markets.</p><p><br/></p><p>Chang also emphasized Exchange’s focus on networking and community building, calling it the must-attend event for anyone in the ETF space. She shared details on new initiatives like the <em>Putt for Pink</em> charity event benefiting Susan G. Komen, a March Madness basketball connect-four game hosted by State Street, and an interactive app that allows attendees to schedule meetings and customize their experience.</p>",
    "slug": "kirsten-chang"
  },
  {
    "title": "Adam Patti - VistaShares",
    "date": "2025-02-23",
    "guest": "Adam Patti",
    "company": "VistaShares",
    "duration": "25 min",
    "youtubeId": "OsGtOinALtg",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of <em>Behind the Ticker</em>, Adam Patti, founder and CEO of VistaShares, discussed the launch of the VistaShares Artificial Intelligence Supercycle ETF (ticker: AIS) and how it differentiates itself in the growing AI investment space. With over two decades in the ETF industry, Patti previously founded IndexIQ, one of the earliest issuers of liquid alternative ETFs, which was later acquired by New York Life. After spending several years outside the industry, Patti partnered with John McNeil of DVX Ventures to launch VistaShares, focusing on building high-quality thematic ETFs with a more thoughtful and targeted approach.</p><p>Patti explained that AIS is designed to provide <em>pure exposure</em> to the AI supercycle by focusing exclusively on the infrastructure driving artificial intelligence, particularly in data centers and semiconductors. Unlike many AI-themed ETFs that hold broad tech exposure dominated by the &quot;Magnificent Seven&quot; stocks, AIS takes a supply chain-driven approach, investing in companies that manufacture the essential components—such as GPUs, VRAMs, cooling systems, and fiber optic networks—needed to power AI. By analyzing the bill of materials for AI data centers and semiconductors, VistaShares identifies companies with substantial AI-driven revenue, ensuring that the fund is directly tied to AI growth rather than being diluted by large-cap tech names with only partial AI exposure.</p><p>AIS follows a <em>rules-based, actively managed strategy</em> that combines systematic supply chain analysis with an active overlay. The core portfolio is constructed based on a transparent, rules-driven methodology—one that VistaShares has filed for a patent on—ensuring that holdings are determined by their relevance to AI infrastructure rather than arbitrary weightings. The fund undergoes a semi-annual rebalance, but Patti emphasized that the active overlay allows for adjustments in response to new developments in the rapidly evolving AI space. The investment committee, which includes AI industry practitioners such as former Tesla president John McNeil and AI entrepreneur Sonny Madra, helps identify emerging trends, new players, and risks within the AI ecosystem before they become widely recognized.</p><p>Patti also highlighted the <em>global nature</em> of the AI supply chain, with AIS holding companies from the U.S., Taiwan, China, and Europe. Currently, about 60% of the portfolio is U.S.-based, with the remainder distributed across key AI manufacturing hubs. Looking ahead, VistaShares has the flexibility to expand the portfolio’s focus, potentially incorporating consumer-facing AI applications and energy solutions as the industry matures. However, for now, the fund remains centered on AI infrastructure, which Patti believes is still in the early stages of exponential growth, as evidenced by record-breaking capital expenditures from major tech firms.</p><p>For investors and advisors looking to incorporate AIS into portfolios, Patti suggested a 3-5% allocation within a core equity strategy, positioning it as a high-conviction growth satellite. </p>",
    "slug": "adam-patti"
  },
  {
    "title": "Emma Harper - Sage Advisory",
    "date": "2025-02-16",
    "guest": "Emma Harper",
    "company": "Sage Advisory",
    "duration": "31 min",
    "youtubeId": "H9dcusXKSGs",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>n a recent episode of <em>Behind the Ticker</em>, Emma Harper, a research analyst at Sage Advisory, shared insights from the firm’s 2024 ETF Stewardship Report, which evaluates how ETF providers engage with companies, vote on shareholder proposals, and integrate sustainability and governance practices. With a background in finance and research, Harper plays a key role in Sage&apos;s analysis of responsible investment strategies, ensuring the firm’s investment decisions align with best stewardship practices. Sage Advisory, which manages approximately $28 billion in assets, focuses on institutional and retail clients, blending investment management with rigorous research.</p><p>Harper explained that Sage’s annual stewardship report examines ETF providers&apos; voting and engagement practices, governance structures, and transparency efforts. The report analyzes how asset managers influence corporate behavior through proxy voting, engagement strategies, and sustainability considerations. One key aspect of the research is assessing whether providers have dedicated stewardship teams and clearly defined voting policies. Given that ETF holders delegate their ownership rights to fund issuers, understanding how these rights are exercised is crucial for fiduciary responsibility.</p><p>A major trend identified in the 2024 report is a decline in transparency among ETF providers, particularly in response to regulatory scrutiny and political pressures. Harper noted that while early versions of the report saw growing disclosures from asset managers, recent years have shown a more cautious, legalistic approach to describing stewardship activities. Additionally, there is a widening divide between active and passive ETF managers, with active managers generally exhibiting stronger stewardship practices. Passive managers, on the other hand, tend to rely more on third-party proxy advisors and have less direct engagement with portfolio companies.</p><p>Harper also highlighted concerns about the concentration of voting power among a few major ETF providers, such as BlackRock, Vanguard, and State Street. These firms control trillions of dollars in assets and exercise substantial influence over corporate governance. The report found that larger providers tend to support management more often than smaller firms, which raises questions about their commitment to shareholder advocacy. Harper emphasized that investors should carefully evaluate ETF issuers’ stewardship policies, particularly as issues like ESG, artificial intelligence, and cybersecurity become more relevant in corporate decision-making.</p>",
    "slug": "emma-harper"
  },
  {
    "title": "Rob Arnott - Research Affiliates",
    "date": "2025-02-09",
    "guest": "Rob Arnott",
    "company": "Research Affiliates",
    "duration": "32 min",
    "youtubeId": "jEJOfmqj7RM",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of <em>Behind the Ticker</em>, Rob Arnott, founder and chairman of Research Affiliates, shared insights into the firm&apos;s latest innovation, the Research Affiliates Deletions ETF (ticker: NIXT). With nearly 50 years in investment management, Arnott has built a reputation for pioneering quantitative investing strategies, particularly through the development of the Fundamental Index methodology. Research Affiliates, founded in 2002, now indirectly oversees $158 billion in assets through partnerships with firms like Schwab, Invesco, and PIMCO.</p><p>Arnott explained that NIXT was created to exploit inefficiencies in traditional market-cap-weighted indexes. When companies are removed from major indices like the S&amp;P 500 or Russell 1000, they often experience exaggerated price declines, pushing them to deep value levels. Historically, these &quot;deleted&quot; stocks tend to recover significantly, often outperforming the market in the years following their removal. NIXT systematically captures this mean reversion by identifying and investing in stocks that have been dropped from indices due to temporary underperformance rather than fundamental deterioration.</p><p>The fund follows a rules-based process where deletions from the top 500 and top 1,000 market cap rankings are screened for quality metrics, eliminating the bottom 20% to avoid value traps. The remaining stocks are then held in equal weight for five years, allowing time for revaluation and recovery. Arnott noted that this approach benefits from both the structural inefficiencies of index deletions and the broader opportunity in small-cap and deep value stocks, which are currently trading at historically low relative valuations.</p><p>Arnott positioned NIXT as a unique completion strategy, complementing traditional market-cap-weighted portfolios by reintroducing stocks that indices have discarded too soon. While not intended as a core allocation, NIXT provides an alternative way for investors to gain small-cap value exposure with a systematic, contrarian approach.</p>",
    "slug": "rob-arnott"
  },
  {
    "title": "John Davi - Astoria Advisors",
    "date": "2025-02-02",
    "guest": "John Davi",
    "company": "Astoria Advisors",
    "duration": "23 min",
    "youtubeId": "9SPVXAgxruQ",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>n a recent episode of <em>Behind the Ticker</em>, John Davi, founder and CIO of Astoria Advisors, discussed the firm&apos;s latest ETF launch, the Astoria US Quality Kings ETF (ticker: GQQQ). With over two decades of experience in quantitative investing and asset allocation, Davi founded Astoria in 2017, building a firm focused on macro-driven and quantitative investment strategies. Managing approximately $2 billion in assets, Astoria serves financial advisors, institutions, and ultra-high-net-worth individuals.</p><p>Davi explained that GQQQ was created to address a gap in the growth investing space. While many existing growth ETFs are purely market-cap weighted, GQQQ combines growth with a quality filter, ensuring exposure to high-growth companies while maintaining fundamental financial strength. Unlike broad Nasdaq-based ETFs, which include all non-financial large-cap stocks without quality screening, GQQQ applies quantitative selection criteria focusing on return on equity (ROE), return on assets (ROA), and return on invested capital (ROIC). This results in a portfolio that captures growth opportunities while reducing exposure to weaker companies.</p><p>The ETF blends large-cap and mid-cap stocks, aiming to identify the next generation of market leaders. Davi highlighted AppLovin as an example—GQQQ included the stock in its launch portfolio in October 2023, months before it was added to the Nasdaq 100, allowing early participation in its strong performance. By including mid-cap growth names, GQQQ seeks to capitalize on emerging winners while mitigating the concentration risks seen in traditional growth ETFs dominated by the &quot;Magnificent Seven&quot; mega-cap tech stocks.</p><p>Davi also emphasized the risk management strategies within GQQQ. The ETF undergoes an annual rebalance with quarterly quantitative reviews, allowing for adjustments when stocks significantly de-rank in quality metrics. While not a tactical allocation product, this process ensures that the fund remains aligned with its quality-growth mandate. He positioned GQQQ as a complementary holding to existing growth ETFs like QQQ or Vanguard&apos;s growth ETFs, offering a more refined and risk-conscious approach to growth investing.</p><p>For advisors and investors looking to incorporate GQQQ into their portfolios, Davi suggested it as a way to diversify traditional growth exposure, especially given the heavy concentration in a few stocks within broad-market growth indices.</p>",
    "slug": "john-davi"
  },
  {
    "title": "Mike Loukas - TrueShares",
    "date": "2025-01-25",
    "guest": "Mike Loukas",
    "company": "TrueShares",
    "duration": "26 min",
    "youtubeId": "plQjD1vMreM",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of Behind the Ticker, Mike Loukas, CEO of TrueShares, shared insights into the firm’s journey and the unique approach behind their ETFs, including their latest launches, QBUL and QBER. Loukas, with over 30 years of experience in the financial industry, founded TrueMark Investments in 2019 with the purpose of establishing TrueShares as a solutions-based ETF platform. TrueShares aims to take traditional active strategies and institutional hedging techniques and incorporate them into ETFs that offer investors smarter portfolio construction tools.<br/><br/>Loukas explained that TrueShares’ ETF lineup started with fundamental active management products and expanded to include thematic and structured outcome ETFs. Their defined outcome or buffered ETFs have been popular among investors seeking downside protection while maintaining exposure to equity growth. Most recently, the firm launched QBUL and QBER, two quarterly resetting hedged equity ETFs designed to offer principal protection with directional market exposure.<br/><br/>QBUL aims to capture market gains beyond a 5% threshold within a quarter while maintaining treasury-level downside protection. In contrast, QBER generates positive returns when the market drops by more than 5%. Both funds use a structure where principal is invested in treasuries, and the yield is used to purchase out-of-the-money call options (for QBUL) or put options (for QBER). This approach ensures low risk exposure with the potential for asymmetric returns based on market movements.<br/><br/>Loukas highlighted the flexibility of these ETFs within a portfolio, explaining that they can be used as standalone investments or blended with other asset classes to create diversified, risk-adjusted strategies. Advisors can use QBUL in bullish markets to enhance upside potential while maintaining principal security, and QBER in bearish markets to hedge against significant declines without taking on the risks associated with shorting the market.</p>",
    "slug": "mike-loukas"
  },
  {
    "title": "Catherine LeGraw - GMO",
    "date": "2025-01-19",
    "guest": "Catherine LeGraw",
    "company": "GMO",
    "duration": "28 min",
    "youtubeId": "39Ml-weKfXg",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of Behind the Ticker, Catherine LeGraw, asset allocation strategist at GMO, shared insights into the firm’s approach to value investing and their newly launched ETFs, including GMOV, their U.S. value ETF. LeGraw, who joined GMO in 2013 after working at BlackRock and Barclays Global Investors, brings a top-down perspective to asset allocation, seeking valuation-driven opportunities across asset classes. She emphasized GMO’s commitment to long-term value investing and its employee-owned structure, which allows the firm to focus solely on clients’ best interests.<br/><br/>LeGraw explained that GMOV stands out among value-focused ETFs due to three key differentiators. First, GMO takes a top-down approach, looking for entire groups of dislocated or misvalued stocks, rather than relying solely on bottom-up stock selection. Currently, the fund focuses on the cheapest 20% of the market, which GMO believes represents a tremendous opportunity for deep value investing. Second, the firm does not rely on standard accounting data but instead restates financials to reflect true underlying value, such as treating research and development expenses as investments rather than operating costs. Lastly, GMO incorporates forward-looking projections tailored to each company’s unique characteristics, providing a more accurate estimate of future profitability.<br/><br/>GMOV also applies rigorous portfolio construction techniques to balance deep value opportunities with quality and growth characteristics, avoiding common value traps. LeGraw highlighted GMO’s use of proprietary red flag screening, which examines accounting metrics, management behavior, and market signals to identify potential risks. The fund consists of approximately 150 names, with sector weightings determined by valuation attractiveness rather than traditional market cap constraints. Unlike many passive value ETFs that may be overweight in sectors like utilities, GMO’s active approach allows them to avoid sectors they consider overvalued.<br/><br/>In addition to discussing the U.S. market, LeGraw also touched on GMOI, their international value ETF, which she believes offers an even greater opportunity given the relative cheapness of international equities and the potential tailwind of currency valuation shifts. She emphasized that value investing is currently priced for significant outperformance, with deep value trading at historically attractive levels.<br/><br/>For advisors and investors looking to diversify their portfolios away from an overconcentration in U.S. large-cap growth, LeGraw suggests GMOV and GMOI as substitutes for passive value exposure or as tactical allocations to capitalize on the current value opportunity. </p>",
    "slug": "catherine-legraw"
  },
  {
    "title": "Kevin Carter - EMQQ Global",
    "date": "2025-01-11",
    "guest": "Kevin Carter",
    "company": "EMQQ Global",
    "duration": "46 min",
    "youtubeId": "TADEnxHrD9E",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of Behind the Ticker, Kevin Carter, founder of EMQQ Global, shared his journey into investment management and the inspiration behind his suite of emerging market internet ETFs, including INQQ, which focuses on India’s rapidly growing internet sector. With a background that began at Robertson Stephens in 1992 and included pioneering direct indexing and active indexing, Carter’s passion for emerging markets and digital transformation culminated in the creation of EMQQ Global and its targeted ETF offerings.<br/><br/>Carter discussed the investment thesis for INQQ, highlighting India’s unique position as the world’s largest and fastest-growing emerging market. With a population exceeding 1.4 billion, robust demographics, and a booming middle class, India presents unparalleled opportunities for consumption-driven growth. Carter emphasized India’s ongoing infrastructure and technological advancements under Prime Minister Modi, particularly the “India Stack,” a revolutionary digital public infrastructure. The stack has transformed India’s economy by enabling biometric identification, digital payments, and financial inclusion for over 800 million people in just a few years.<br/><br/>INQQ provides investors exposure to the burgeoning internet sector in India, which Carter described as being in its early stages of growth. The ETF focuses on publicly traded Indian internet companies that meet market cap and liquidity thresholds, offering a diversified portfolio across various verticals, including e-commerce, payments, and online travel. Companies like Paytm and MakeMyTrip exemplify the opportunities available as digital adoption accelerates, with many sectors still in the nascent stages of development.<br/><br/>Carter underscored the importance of INQQ as a standalone investment opportunity within emerging markets, appealing to those seeking targeted exposure to India’s digital transformation.</p>",
    "slug": "kevin-carter"
  },
  {
    "title": "David Dziekanski- Quantify Funds",
    "date": "2024-12-15",
    "guest": "David Dziekanski- Quantify Funds",
    "company": "",
    "duration": "24 min",
    "youtubeId": "38UT2seuvXc",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of Behind the Ticker, David Dziekanski, founder and CEO of Quantify Funds, introduced his firm’s first ETF, the STKD Bitcoin and Gold ETF (ticker: BTGD). With 17 years of experience in the investment and ETF industry, including 11 years as a partner at Tidal Financial Group, Dziekanski launched Quantify Funds to bring innovative, efficient investment solutions to market. BTGD represents a novel approach to leverage ETFs, offering exposure to both Bitcoin and gold in a single investment vehicle.<br/><br/>BTGD is structured as a “stacked” ETF, providing $1 of exposure to Bitcoin and $1 of exposure to gold for every $1 invested. This 50-50 blend offers a leveraged, long-term approach without the typical path dependency or decay associated with traditional leverage products. The fund utilizes a combination of futures and exchange-traded products to optimize leverage and manage rebalancing efficiently. Dziekanski explained that the fund targets a 5-7% rebalance drift to minimize trading costs while maintaining the desired asset allocation.<br/><br/>The rationale behind combining Bitcoin and gold lies in their shared status as scarcity assets. Gold, with its historical role as a store of value, and Bitcoin, often referred to as “digital gold,” both offer protection against currency debasement. Dziekanski noted that the mining rates of Bitcoin (0.86% annually) and gold (1.75% annually) are significantly lower than the 7-9% annual currency printing rates of developed nations, making them ideal assets for a hedge against inflation and declining currency values.<br/><br/>Dziekanski also highlighted how the differing volatility and correlations of Bitcoin and gold enhance the portfolio’s resilience. Bitcoin’s higher volatility is balanced by gold’s stability, allowing for effective rebalancing during market shifts. Historical data shows that gold has performed well during past crypto winters, providing diversification benefits and mitigating drawdowns. Advisors are encouraged to view BTGD as a debasement hedge or a high-volatility alternative in portfolios, with suggested allocations ranging from 2-5%.</p>",
    "slug": "david-dziekanski-quantify-funds"
  },
  {
    "title": "Ai in Finance - UT CATT 2024 Global Analytics Conference - Kyle Wiggs, Suhir Holla, Tal Schwartz",
    "date": "2024-12-08",
    "guest": "Ai in Finance",
    "company": "UT CATT 2024 Global Analytics Conference - Kyle Wiggs, Suhir Holla, Tal Schwartz",
    "duration": "63 min",
    "youtubeId": "egq0n5fJlFM",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a special edition of Behind the Ticker recorded at the UT CATT 2024 Global Analytics Conference, host Brad Roth moderated a panel discussion exploring the future of AI in finance. The panel brought together leading voices in the field: Kyle Wiggs, co-founder and CEO of UX Wealth Partners; Sudhir Holla, founder and CEO of MyStock DNA; and Tal Schwartz, founder of AI Funds. Together, they examined how artificial intelligence is revolutionizing portfolio management, addressing longstanding industry challenges, and opening up new possibilities for smarter investment strategies.<br/><br/>Kyle Wiggs highlighted the operational challenges and opportunities AI presents to financial advisors. He explained how UX Wealth Partners bridges the gap between sophisticated AI-driven strategies and practical implementation for end clients. By focusing on trading, billing, and reporting across multiple custodians and account structures, Wiggs emphasized the importance of scalability and efficiency in delivering cutting-edge solutions to the wealth management community. He also stressed that AI’s role should complement human advisors rather than replace them, describing the concept as “man and machine” working together to enhance outcomes.<br/><br/>Sudhir Holla brought a different perspective, emphasizing MyStock DNA’s philosophy of “winning by not losing.” He explained how their AI engine, Darwin, helps mitigate downside risk while managing large volumes of data and human emotions that often derail investment decisions. Holla introduced the concept of an “emotional risk frontier,” suggesting that AI could help create individualized portfolios tailored to each investor’s emotional tolerance for market volatility. His analogy of AI as a “self-driving car” for portfolios resonated, showcasing how the technology navigates complex market conditions while aiming for safety and efficiency.<br/><br/>Tal Schwartz provided insights into the quantitative and predictive power of AI in active portfolio management. He shared details about his AI engine, BAILA (Bayesian AI Learning Algorithm), which acts as both a macro strategist and portfolio optimizer. BAILA’s ability to identify market environments and adapt to changing conditions offers a smarter alternative to traditional active strategies. Schwartz highlighted AI’s capacity to outperform human managers by leveraging massive datasets and eliminating emotional biases, enabling portfolios to achieve asymmetric returns with minimized downside risk.<br/><br/>The panelists agreed on the transformative potential of AI but acknowledged challenges, including regulatory hurdles, biases in training data, and the need for human oversight. They emphasized that while AI has made significant strides, its most impactful applications lie ahead, particularly in democratizing access to sophisticated investment tools. The discussion underscored AI’s potential to reshape finance, from enhancing risk management to delivering tailored solutions for investors at all levels.</p>",
    "slug": "ai-in-finance"
  },
  {
    "title": "Al Chu - American Beacon GLG Natural Resources ETF - MGNR",
    "date": "2024-12-01",
    "guest": "Al Chu",
    "company": "American Beacon GLG Natural Resources ETF - MGNR",
    "duration": "29 min",
    "youtubeId": "CBDPXbXkLfQ",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of “Behind the Ticker,” Al Chu, portfolio manager at Man GLG, discussed his role managing the American Beacon GLG Natural Resources ETF (ticker: MGNR). Chu, who has over two decades of experience in natural resources investing, described his journey from managing natural resources strategies at BNY Mellon and various hedge funds to leading this strategy at Man GLG. With the backing of Man Group, a UK-listed alpha-focused alternative manager, Chu’s expertise is now accessible to a broader audience through the active ETF structure.<br/><br/>Chu explained that MGNR takes a long-only, equity-based approach to natural resources investing, distinct from many other commodity ETFs that rely on futures or fund-of-funds models. The ETF focuses on equities within the natural resources space, such as oil producers, oilfield services, and mining companies, aiming to capitalize on alpha opportunities driven by commodity cycles. The active strategy allows the fund to adjust exposures dynamically, targeting subsectors and companies that offer the highest return potential based on commodity trends, regional dynamics, and bottom-up company analysis.<br/><br/>A unique aspect of MGNR is its structured investment process, which begins with identifying favorable commodity cycles, then drilling down into specific subsectors, and finally selecting companies with strong fundamentals, management, and assets. Chu highlighted the importance of maintaining diversification within the fund, capping individual positions at 5% and limiting sector and subsector concentrations to manage risk effectively. The fund typically holds 40 to 50 names, representing a concentrated yet diversified exposure to the natural resources space.<br/><br/>Chu also addressed the fund’s appeal to advisors and investors looking for exposure to real assets with low correlation to traditional equities and bonds. MGNR is positioned as an alternative to passive commodity exposure, providing not only a hedge against inflation but also an opportunity to benefit from the operational and financial leverage of resource companies.</p>",
    "slug": "al-chu"
  },
  {
    "title": "Raymond Holst - Practus",
    "date": "2024-11-24",
    "guest": "Raymond Holst",
    "company": "Practus",
    "duration": "27 min",
    "youtubeId": "VJ2l55MDARA",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of “Behind the Ticker,” Raymond Holst from Practus LLP discussed the intricacies of 351 exchanges and their relevance to the ETF industry. Holst, a tax attorney with over 20 years of experience, joined Practus in 2023, bringing extensive expertise in financial products and taxation. Practus, a fully virtual law firm with attorneys across the United States, specializes in ETF and mutual fund markets, offering tailored legal and tax solutions.<br/><br/>Holst explained that a 351 exchange refers to a provision in the Internal Revenue Code allowing for the transfer of property into a corporation in exchange for shares without triggering immediate tax recognition on built-in gains. This mechanism is particularly useful for asset managers looking to convert separately managed accounts (SMAs) or private funds into an ETF wrapper. The process enables investors to transfer diversified securities portfolios into an ETF while maintaining their original tax basis and avoiding taxable events.<br/><br/>Key requirements for a successful 351 exchange include maintaining at least 80% ownership in voting and value by transferors post-exchange and adhering to diversification rules. Holst elaborated on the 25/50 diversification test, which ensures that no single security exceeds 25% of the portfolio and the top five securities do not exceed 50%. These safeguards are essential to comply with tax regulations and ensure the exchange qualifies under the 351 provision.<br/><br/>Holst emphasized the importance of partnering with experienced professionals for 351 exchanges, noting the complex coordination required among custodians, fund administrators, and legal advisors. While the process is tax-efficient, it involves significant logistical work, particularly in transferring tax information and establishing proper valuations. Once completed, however, ETFs formed through 351 exchanges operate like any other ETF, offering investors liquidity, marginability, and tax advantages.<br/><br/>For asset managers considering launching an ETF using a 351 exchange, Holst highlighted the long-term benefits, including improved tax efficiency and operational flexibility.</p>",
    "slug": "raymond-holst"
  },
  {
    "title": "Garrett Stevens & Rich Malinowski - Exchange Traded Concepts",
    "date": "2024-11-17",
    "guest": "Garrett Stevens & Rich Malinowski",
    "company": "Exchange Traded Concepts",
    "duration": "25 min",
    "youtubeId": "PaOg8GD96dU",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of “Behind the Ticker,” Garrett Stevens and Rich Malinowski from Exchange Traded Concepts (ETC) discussed the firm’s unique position as the first white-label ETF issuer and its role in supporting clients from concept to launch. ETC, which has been operating for 13 years, has launched over 100 ETFs with a combined $7.5 billion in assets under management. The firm provides a turnkey platform for ETF issuers, handling everything from regulatory filings and portfolio management to marketing and website development, while also offering individual services for established funds.<br/><br/>Stevens highlighted a growing trend in the ETF industry: wealth management firms launching their own ETFs based on existing strategies. This shift allows advisors to offer tax-efficient, liquid, and operationally streamlined investment vehicles to their clients. He emphasized that these advisor-driven ETFs are often not marketed publicly but are used as tools to enhance the client experience and differentiate wealth management firms from competitors.<br/><br/>The conversation also touched on the growing popularity of actively managed ETFs, which now account for about 75% of new launches. Stevens explained that while thematic and passive ETFs dominated early growth, the focus is now shifting toward active strategies that allow for sector rotation, cross-asset class exposure, and unique management styles. He noted that active ETFs require a longer runway for success, as they often depend on performance to attract investors, contrasting with the quicker adoption of thematic passive products.<br/><br/>Rich Malinowski added insights on mutual fund-to-ETF conversions and semi-transparent ETF structures. He explained that while mutual fund conversions have slowed due to operational challenges and intermediary resistance, they remain an area of interest. Additionally, semi-transparent ETFs face hurdles related to their limited visibility for market makers and custodians, but Malinowski expects gradual acceptance as the industry adapts to these innovative products.<br/><br/>Both Stevens and Malinowski emphasized the importance of preparation and infrastructure for ETF issuers. They advised aspiring ETF managers to secure sufficient assets at launch, target a $30 million breakeven point, and build strong relationships with service providers to ensure operational success.</p>",
    "slug": "garrett-stevens-rich-malinowski"
  },
  {
    "title": "Brett Eichenberger - Cohen & Co.",
    "date": "2024-11-10",
    "guest": "Brett Eichenberger",
    "company": "Cohen & Co.",
    "duration": "28 min",
    "youtubeId": "vdcjmNmejRk",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of “Behind the Ticker,” Brett Eichenberger from Cohen &amp; Company discussed the intricacies of auditing in the ETF and mutual fund industry. Eichenberger, based in the firm’s Cleveland office, has worked his way up over a 19-year career with Cohen &amp; Company, which now audits over 1,800 registered funds, making it the fourth-largest auditor of registered funds in the U.S. and the second-largest in the ETF space. Eichenberger emphasized Cohen’s role in maintaining public trust through transparency and strict regulatory compliance, working with a range of investment products including ETFs, mutual funds, closed-end funds, and interval funds.<br/><br/>One of the central differences in auditing ETFs versus mutual funds, Eichenberger explained, lies in the valuation of securities. ETFs report returns on both NAV and market value bases, due to their trading on secondary markets, whereas mutual funds focus solely on NAV. Additionally, ETFs rely on authorized participants for capital activity through in-kind creation units, which introduces unique audit considerations, especially in managing the in-kind exchange of securities.<br/><br/>Eichenberger highlighted several key areas of focus in ETF audits, such as ensuring accurate valuation, particularly in complex portfolios that may include derivatives, foreign securities, or illiquid assets. For products like ETFs, Cohen &amp; Company pays close attention to maintaining diversification standards and testing qualified income, which is essential for regulatory compliance. Eichenberger explained how Cohen’s audit teams perform regular assessments to verify all positions are accurately valued, confirming assets held in custody and ensuring that clients’ funds meet regulatory diversification requirements.<br/><br/>The discussion also touched on the impact of technology, including advancements in data-driven auditing that allow Cohen to move toward 100% testing of transactions, improving accuracy over traditional sampling methods. Eichenberger shared that the firm’s adoption of automation enables more efficient audits, allowing for better oversight and faster processing.</p>",
    "slug": "brett-eichenberger"
  },
  {
    "title": "Petra Bakosova - Hull Tactical",
    "date": "2024-11-03",
    "guest": "Petra Bakosova",
    "company": "Hull Tactical",
    "duration": "26 min",
    "youtubeId": "2gfjIhmxR3o",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of “Behind the Ticker,” Petra Bakosova from Hull Tactical discussed the unique approach behind the Hull Tactical Asset Allocation ETF, HTUS. Bakosova, who has been with Hull Tactical since its inception, has a background in applied mathematics and previously worked at proprietary trading firms. She explained that Hull Tactical’s investment strategy draws inspiration from founder Blair Hull’s background as both a blackjack card counter and a legendary options trader. Hull’s principles—making frequent, proportional bets based on advantage, and prioritizing risk management—form the backbone of HTUS’s tactical approach.<br/><br/>HTUS, launched in 2015, is a tactical asset allocation fund that aims to outperform the S&amp;P 500 without exceeding its volatility. The fund combines data-driven market timing with quantitative models that analyze approximately 40 publicly available indicators. These indicators are organized into categories: macroeconomic factors, fundamentals, technical anomalies, and sentiment. The strategy is fully dynamic, adjusting S&amp;P 500 exposure daily based on signals generated from these models. HTUS typically ranges from 50% to 150% exposure, though it has flexibility from fully invested to flat or even short.<br/><br/>A unique feature of HTUS is its daily rebalancing, a process that allows the fund to remain agile and responsive to market changes. Bakosova detailed that HTUS leverages SPY and E-mini futures for S&amp;P 500 exposure and incorporates SPX options to adjust for market sentiment and volatility. The fund’s sentiment indicators include sources like MarketPsych, Halbert, and Ned Davis, which track social media and news sentiment. Bakosova highlighted the importance of diversification in HTUS’s modeling process, as each indicator provides different market insights over various time horizons.<br/><br/>HTUS is intended as a sophisticated, hedge fund-like strategy within an ETF structure, appealing to advisors seeking an alternative to traditional large-cap core holdings. Bakosova emphasized that Hull Tactical is focused on continual research and model refinement, with plans to incorporate more advanced AI and machine learning techniques.</p>",
    "slug": "petra-bakosova"
  },
  {
    "title": "Joe Benoit - Grimes & Co.",
    "date": "2024-10-27",
    "guest": "Joe Benoit",
    "company": "Grimes & Co.",
    "duration": "27 min",
    "youtubeId": "4ToJfm88Lmo",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of “Behind the Ticker,” Joe Benoit, portfolio manager at Grimes &amp; Company, discussed the firm’s collaboration with Little Harbor Advisors on their ETF, the LHA Risk Managed Income ETF (ticker: RMIF). Benoit, who began his career with Grimes, now oversees portfolio management and research for the firm. Grimes &amp; Company, a Massachusetts-based RIA managing over $5 billion in assets, follows a holistic approach to client portfolios, integrating stock, fixed income, and alternative strategies. Grimes’s partnership with Little Harbor Advisors, known for tactical equity ETFs, stemmed from a mutual interest in providing a tactical fixed income solution, ultimately leading to RMIF.<br/><br/>RMIF, as Benoit explains, aims to generate consistent income while preserving capital and managing downside risk. This strategy originated in response to the post-2008 low-interest environment, as Grimes sought alternatives to traditional high-quality bonds. The ETF applies a fully tactical, unconstrained approach to fixed income, allocating based on positive price trends and yield. RMIF can shift entirely into areas like high yield, bank loans, or even cash, depending on market conditions. This flexible allocation model allows the ETF to adjust risk exposure as trends change, making it a versatile solution for income-focused investors.<br/><br/>Benoit details RMIF’s approach to asset allocation, explaining that it prioritizes ETFs offering the highest yield within the current positive trends. Currently, the portfolio includes five ETFs, with equal weighting, primarily focusing on bank loans and short-duration high yield bonds. The strategy is momentum-based, utilizing price trends, volatility assessments, and yield comparisons to determine allocations. In periods of heightened volatility, RMIF can de-risk quickly, shifting allocations to safer assets like short-duration Treasuries or cash.<br/><br/>Designed as an alternative to core fixed income, RMIF fits into portfolios as either a substitute for or complement to traditional bond investments. For advisors seeking “conditional credit,” RMIF’s ability to tactically adjust to market shifts provides a reliable source of income with an added layer of risk management.</p>",
    "slug": "joe-benoit"
  },
  {
    "title": "David Allen - Octane Investments",
    "date": "2024-10-19",
    "guest": "David Allen",
    "company": "Octane Investments",
    "duration": "34 min",
    "youtubeId": "",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of “Behind the Ticker,” David Allen, CFA and founder of Octane Investments, discussed his background in finance and the firm’s strategy for its recently launched All-Cap Value Energy ETF (ticker: OCTA). Allen, who began his career in 1992 as a trader at Merrill Lynch and witnessed significant market events like the breaking of the Bank of England, developed a keen interest in geopolitics and energy markets early on. His experience spans institutional sales and trading, which later inspired him to start Octane Investments to capitalize on what he identified as a market gap created by divestment from traditional energy sectors.<br/><br/>Allen explains that Octane Investments was founded to take advantage of the “carbon risk premium” and other risk premiums inherent in the energy market, such as the equity risk premium, the small cap premium, and the value premium. The firm focuses on identifying undervalued companies in the energy sector, particularly those that are being overlooked or divested due to environmental concerns. OCTA, Octane’s All-Cap Value Energy ETF, is structured around an all-cap value strategy, investing in energy companies with stable earnings, strong balance sheets, and a commitment to returning capital to shareholders.<br/><br/>Throughout the conversation, Allen emphasized the significant opportunity in traditional energy sectors, despite the increasing focus on sustainability and renewable energy. He highlighted that many investors are avoiding energy stocks, leading to a scarcity of capital and undervalued opportunities in the market. OCTA seeks to capture this value by focusing on companies that are profitable, financially stable, and returning capital to shareholders, such as through buybacks and debt elimination. Allen explained that the fund’s holdings are curated based on a decision tree that screens for price-to-earnings ratios, balance sheet strength, and capital return strategies.<br/><br/>Allen also touched on how OCTA offers exposure to a range of energy subsectors, including refiners and tankers, and discussed how the fund’s structure mitigates risks by limiting exposure to any single company. The ETF is rebalanced weekly, and the portfolio includes companies from developed markets, avoiding exposure to non-OECD markets where political risks are higher. Allen sees OCTA as a strong complementary allocation for investors who are underweight in energy and stressed that, with energy representing less than 4% of the S&amp;P 500, there is a structural underweight in the sector that his ETF addresses.<br/><br/></p>",
    "slug": "david-allen"
  },
  {
    "title": "Federico Brokate - 21Shares",
    "date": "2024-10-13",
    "guest": "Federico Brokate",
    "company": "21Shares",
    "duration": "28 min",
    "youtubeId": "pIE1i7ux5D8",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of “Behind the Ticker,” Federico Brokate, Head of U.S. Business at 21Shares, shared insights into the firm’s approach to digital asset ETFs, including their products ARKB (Spot Bitcoin ETF) and CETH (Spot Ethereum ETF). Having joined 21Shares three months ago, Brokate brings a wealth of experience from his ten-year tenure at BlackRock, where he focused on U.S. ETFs. 21Shares, headquartered in Zurich, is dedicated to making digital assets more accessible through innovative products and has been rapidly expanding with over 50 products in 16 global markets.<br/><br/>Brokate explained that 21Shares was founded in 2016 with a clear mission to bridge the gap between traditional finance and digital assets. The company’s founders, inspired by their mothers’ interest in Bitcoin, realized there was no easy way for retail investors to access digital assets without understanding the complexities of wallets, keys, and encryption. This led to the creation of 21Shares’ digital asset ETPs, which now offer institutional-grade products in both Europe and the U.S.<br/><br/>Regarding the current digital asset landscape, Brokate highlighted the tremendous success of Bitcoin ETFs, noting that digital asset ETFs, including 21Shares’ ARKB, have become some of the fastest-growing ETFs in history. He emphasized the importance of educating advisors and clients, particularly in the wealth advisory and institutional spaces, where interest in digital assets is rising but knowledge gaps remain. He mentioned that a significant portion of digital asset ETF holders are retail investors, but interest from institutional investors and wealth advisors is growing steadily.<br/><br/>Brokate also discussed the operational aspects of 21Shares’ products, explaining that both ARKB and CETH utilize a multi-custodial model with custodians like Coinbase, Anchorage, and BitGo to reduce single points of failure and ensure robust operational security. He noted that 21Shares is the only issuer currently offering this level of transparency, allowing investors to verify the holdings of each product through a partnership with Chainlink, which provides proof of reserve technology. This transparency, combined with the firm’s experience in managing digital asset products, has positioned 21Shares as a leader in the space.<br/><br/></p>",
    "slug": "federico-brokate"
  },
  {
    "title": "Nancy Davis - Quadratic Capital",
    "date": "2024-10-05",
    "guest": "Nancy Davis",
    "company": "Quadratic Capital",
    "duration": "29 min",
    "youtubeId": "Z5GJ6KQdLSs",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of “Behind the Ticker,” Nancy Davis, founder and CIO of Quadratic Capital, discussed her journey from Goldman Sachs to launching her firm, as well as the innovative strategies behind her ETFs, including IVOL and BNDD. Davis, who founded Quadratic in 2013 after spending ten years at Goldman Sachs, explained that her entrepreneurial leap was driven by the desire to start something new, embracing the learning curve of building a business from scratch.<br/><br/>Quadratic Capital initially started with managing separate accounts and a hedge fund before entering the ETF space in 2018. Davis was intrigued by the ETF structure for its tax efficiencies and saw an opportunity to address gaps in traditional fixed income products like the Aggregate Bond Index (AGG) and TIPS (Treasury Inflation-Protected Securities). IVOL, Quadratic’s interest rate volatility and inflation hedge ETF, was designed to complement core bond holdings, addressing issues in the AGG such as its lack of inflation protection and embedded short optionality through mortgages. IVOL provides investors with exposure to TIPS and the rates market, offering inflation protection and interest rate volatility hedging, which is generally inaccessible to individual investors.<br/><br/>Davis explained that IVOL’s portfolio consists of about 80% TIPS and is structured to give investors access to inflation expectations beyond the consumer price index (CPI). By providing exposure to interest rate volatility through long options, IVOL helps mitigate risk in fixed income portfolios during periods of rising volatility or unexpected rate cuts, as demonstrated during events like the March 2020 market turmoil.<br/><br/>The conversation also touched on BNDD, Quadratic’s deflation-focused ETF, which is designed for long-duration exposure to nominal treasuries. Davis highlighted that BNDD offers asymmetric exposure to interest rates without the leverage risks that are prevalent in other bond market products. While IVOL addresses inflation risks, BNDD offers protection during deflationary periods, making both ETFs complementary tools for managing interest rate risks in a portfolio.</p>",
    "slug": "nancy-davis"
  },
  {
    "title": "Mike Venuto - Tidal: The ETF Masters",
    "date": "2024-09-29",
    "guest": "Mike Venuto",
    "company": "Tidal: The ETF Masters",
    "duration": "36 min",
    "youtubeId": "f-n_KqwhGsM",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of “Behind the Ticker,” Mike Venuto, co-founder and CIO of Tidal Financial Group, shared insights into the company’s approach to launching, growing, and operating ETFs. Tidal, a firm that has grown significantly over the years, now manages and supports over 160 funds with more than $19 billion in assets under management. Venuto, who has a background in ETFs dating back to his time at WisdomTree and Global X, highlighted Tidal’s unique platform that helps clients from initial idea generation to full-scale ETF operations.<br/><br/>Venuto discussed his hands-on role at Tidal, which involves structuring ETFs, managing active funds, and collaborating closely with clients to develop innovative products. A key focus of the conversation was on the breadth of Tidal’s capabilities, from handling compliance and legal matters to marketing and product development. The company prides itself on offering a comprehensive service, allowing ETF issuers to focus on managing their portfolios while Tidal handles the operational complexities.<br/><br/>One of Tidal’s standout achievements is its ability to launch ETFs quickly and affordably, compared to the traditional process. Venuto explained that while starting an ETF independently can cost hundreds of thousands of dollars and take up to nine months, Tidal can often bring funds to market in under four months at a fraction of the cost. This efficient process, combined with the firm’s expertise in complex strategies such as options, derivatives, and leverage, has allowed Tidal to grow rapidly, especially in the active ETF space, which has seen significant demand.<br/><br/>Venuto also touched on trends in the ETF market, including the growing interest in active strategies, single stock ETFs, and the potential for mutual fund-to-ETF conversions. He noted that while mutual fund conversions have been slow, the demand for more tax-efficient ETF structures continues to rise. Additionally, Venuto emphasized that Tidal only partners with clients who have strong, viable product ideas, ensuring that the firm maintains a low fund closure rate and helps clients succeed in a competitive market.</p>",
    "slug": "mike-venuto"
  },
  {
    "title": "Sylvia Jablonski - Defiance ETFs",
    "date": "2024-09-21",
    "guest": "Sylvia Jablonski",
    "company": "Defiance ETFs",
    "duration": "29 min",
    "youtubeId": "QOBf8Pmc7Rc",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of “Behind the Ticker,” Sylvia Jablonski, CEO &amp; CIO of Defiance ETFs, shared her background in finance and the innovative strategies driving the firm’s success. Jablonski, who has a rich history in sales &amp; trading and a decade of experience with ETFs, decided to join Matt Bielski to help launch Defiance, a company that aims to create ETFs targeting cutting-edge themes. Over the last four and a half years, Defiance has grown significantly, expanding its product lineup to include thematic, income, and leveraged ETFs.<br/><br/>Jablonski discusses the firm’s thematic approach, with a special focus on their quantum computing ETF, QTUM. Launched in 2018, QTUM was ahead of the curve in recognizing the potential of quantum computing, artificial intelligence, and machine learning. Jablonski explains that Defiance worked with Bluestar to construct an index that includes the top companies in quantum computing and AI, from major players like IBM and Hewlett-Packard to smaller, pure-play names like IonQ and D-Wave. The fund offers investors diversified exposure to the key sectors driving these transformative technologies.<br/><br/>The QTUM ETF targets companies that derive at least 50% of their revenue from supercomputing, machine learning, and AI. The fund holds around 70 equally weighted names and is rebalanced semi-annually, providing exposure to both large and small-cap companies. This includes established tech giants like Nvidia and Google, which act as a ballast for the fund, while also capturing the potential high growth of emerging players in quantum computing. Jablonski highlights that quantum computing’s ability to process data exponentially faster than traditional computers can revolutionize industries such as biotech, aerospace, and defense, making QTUM a powerful thematic play for long-term growth.<br/><br/>In addition to discussing QTUM, Jablonski touches on the overall strategy at Defiance, emphasizing the importance of speed, adaptability, and listening to market demands. She explains that Defiance’s ability to be nimble and respond quickly to trends has been key to their success. The firm has also built an in-house marketing and distribution platform, leveraging AI and digital marketing to efficiently promote its ETFs. This unique approach has allowed Defiance to punch above its weight, attracting attention in a competitive market without the extensive budgets of larger issuers.</p>",
    "slug": "sylvia-jablonski"
  },
  {
    "title": "James St. Aubin - Ocean Park Asset Management",
    "date": "2024-09-07",
    "guest": "James St. Aubin",
    "company": "Ocean Park Asset Management",
    "duration": "24 min",
    "youtubeId": "jq_BhtZvZK0",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of “Behind the Ticker,” James St. Aubin, Chief Investment Officer of Ocean Park Asset Management, shared insights into his firm’s approach to managing risk and growing client assets. With over two years at Ocean Park and a background that includes stints at Smith Barney, Wilshire, and Ibbotson Associates, St. Aubin has extensive experience in asset allocation and portfolio construction. He explains that Ocean Park’s core philosophy, dating back to its founding in the mid-1980s, is focused on downside protection and mitigating exposure to left-tail risk, particularly for retirees or those nearing retirement.<br/><br/>Ocean Park offers a range of solutions, including four ETFs, eight mutual funds under the Sierra brand, and packaged fund strategist portfolios for advisors. The firm’s investment strategy revolves around quantitative trend-following techniques, using banded moving averages to identify buy and sell signals in its target markets. This methodology, which emphasizes capital preservation by limiting exposure to market downturns, is particularly important for investors seeking to avoid large losses during volatile periods.<br/><br/>The discussion also centered on Ocean Park’s recently launched ETF, DUKQ, which focuses on U.S. domestic equities. St. Aubin explains that DUKQ applies the same quantitative, trend-based approach as the firm’s other strategies, investing in ETFs that cover a broad range of market exposures, including small cap, mid cap, and factor-based strategies. DUKQ holds around 10 to 12 ETFs when fully invested and has the ability to move entirely to cash during market sell-offs if all assets signal a downturn.<br/><br/>One of the key advantages of DUKQ, according to St. Aubin, is its ability to protect against extreme market events while still participating in market gains. The ETF can redeploy capital to other sectors if certain segments trigger a sell signal, rather than immediately moving all assets into cash. This flexibility ensures that the fund remains actively managed, with turnover averaging around two trades per year.<br/><br/>As ETFs become a more critical part of Ocean Park’s overall offering, St. Aubin emphasizes the importance of meeting advisor demand for these products. The firm’s decision to launch ETFs, including DUKQ, was driven by the growing preference for ETFs among advisors due to their tax efficiency and ease of use. St. Aubin believes that ETFs, along with the firm’s mutual funds and managed portfolios, provide advisors with flexible, tactical tools to manage client risk and return.</p>",
    "slug": "james-st-aubin"
  },
  {
    "title": "Springer Harris - Get ETF'd",
    "date": "2024-08-24",
    "guest": "Springer Harris",
    "company": "Get ETF'd",
    "duration": "39 min",
    "youtubeId": "7EqFRqfj7ck",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of “Behind the Ticker,” Springer Harris, the author of Get ETF’d: An Insider’s Guide to Starting and Running an ETF, shared his extensive experience in the ETF industry and the inspiration behind his book. Harris, who has spent his entire career at Teucrium, initially entered the finance industry without even knowing what an ETF was. After a brief stint in corporate PR, he found his passion for ETFs and has spent over 14 years as a portfolio manager and chief operating officer at Teucrium. As he engaged with aspiring ETF creators over the years, Harris found himself answering the same questions about launching and managing ETFs, which ultimately led him to write his book as a comprehensive guide for future ETF entrepreneurs.<br/><br/>Harris explains that Get ETF’d is aimed at educating asset managers and entrepreneurs about the intricacies of launching an ETF. His book walks readers through the entire process, from understanding industry terminology to selecting the right service providers, regulatory structures, and marketing strategies. He emphasizes the importance of planning, particularly the need for a three-year business plan to ensure the sustainability of a new ETF. Harris stresses that simply launching an ETF is not enough—entrepreneurs must be prepared to invest in marketing, build their brand, and stay committed for the long haul.<br/><br/>One of the key insights Harris provides is the distinction between different paths to launching an ETF. He discusses the advantages and drawbacks of building your own ETF business, partnering with a white-label provider, or creating a hybrid approach. While white-label solutions offer a faster and more cost-effective way to launch an ETF, they also come with trade-offs in terms of control and profitability. Harris advises entrepreneurs to evaluate their long-term goals and business plans before deciding which path to take.<br/><br/>Throughout the conversation, Harris emphasizes the importance of perseverance and adaptability in the ETF industry. He acknowledges that not every strategy will succeed, and closing an ETF can be a difficult but necessary decision. However, he encourages entrepreneurs to view such setbacks as learning experiences and to remain focused on their long-term vision. For more information on Harris’s book and his insights into the ETF industry, readers can visit his website at howtostartanetf.com or connect with him on LinkedIn.</p>",
    "slug": "springer-harris"
  },
  {
    "title": "Howard Chan - Kurv Investment Management",
    "date": "2024-08-17",
    "guest": "Howard Chan",
    "company": "Kurv Investment Management",
    "duration": "33 min",
    "youtubeId": "sCgH7fBbjJ4",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of “Behind the Ticker,” Howard Chan, founder of Kurv Investment Management, discussed his unique approach to ETFs and how his firm leverages institutional-grade strategies to benefit all investors. Chan, who began his career as an engineer, transitioned to finance after stints at Goldman Sachs and PIMCO, where he led the ETF business in Europe. After returning to the U.S., Chan was inspired by discussions with advisors to launch Kurv Investment Management with a mission to make tax-efficient, institutional-grade strategies accessible to a broader range of investors.<br/><br/>Kurv’s focus on tax efficiency and institutional-grade strategies is central to its product design. Chan explains that while many institutional strategies are highly effective, they are often tax-inefficient for retail investors. Kurv’s goal is to bring these sophisticated strategies to all investors while minimizing tax implications. One way the firm achieves this is by incorporating techniques such as volatility risk premia and other derivatives, previously only available to the largest institutions, into their ETFs.<br/><br/>A key highlight of the conversation is Kurv’s innovative technology-focused ETF, the KQQQ ETF (also referred to as “KQs”). This fund targets strategic exposure to the largest technology companies, aiming to deliver asymmetric upside while mitigating downside risk through dynamic covered call strategies. Chan explains that KQQQ is designed for investors who seek growth in technology but are also concerned about the sector’s inherent volatility. The ETF combines momentum signals with a dynamic covered call strategy to capture upside during growth phases and generate income during periods of market correction or sideways trading.<br/><br/>Chan further discusses how KQQQ leverages smart security selection by focusing on 15 to 20 of the most dominant technology names, including companies that have fundamentally changed their industries through technological innovation. The fund dynamically overweights stocks showing positive momentum and deploys covered call strategies on those exhibiting negative momentum, creating a balanced approach that seeks to maximize returns while protecting against downside risk. The strategy offers a way for advisors and investors to maintain tech exposure in their portfolios with added income and downside mitigation.</p>",
    "slug": "howard-chan"
  },
  {
    "title": "Joanna Gallegos - BondBloxx",
    "date": "2024-08-10",
    "guest": "Joanna Gallegos",
    "company": "BondBloxx",
    "duration": "40 min",
    "youtubeId": "JT0v7s9x7tY",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of “Behind the Ticker,” Joanna Gallegos, co-founder of BondBloxx, shares her extensive background in ETFs and the innovative fixed income strategies her firm employs. Gallegos, who has been in the ETF industry her entire career, began at Barclays Global Investors during the early days of iShares before moving to JP Morgan to help start their ETF business. She co-founded BondBloxx in October 2021 with a team of experienced ETF professionals from firms like BlackRock, Vanguard, and JP Morgan, aiming to address the underdevelopment of fixed income products in the ETF market.<br/><br/>Gallegos explains that BondBloxx was created to bring more precision to fixed income investing through ETFs. The firm’s product line focuses on high-yield sector and credit rating ETFs, offering a range of tools that allow investors to tailor their exposure more precisely. The company identified a gap in the market for more specific fixed income products, particularly in the high-yield space, where traditional broad market exposures were no longer sufficient for the evolving financial landscape.<br/><br/>One of the standout products discussed is the BondBloxx CCC Rated US High Yield Corporate Bond ETF (ticker: XCCC). This ETF provides diversified exposure to over 220 bonds in the CCC rating category, which typically comprises about 10-11% of a broad high-yield index. Gallegos highlights that XCCC offers investors a significant yield pickup, with yields around 12%, and has shown impressive price appreciation in 2023. This ETF is designed to complement broad high-yield exposures by allowing investors to add a higher concentration of CCC-rated bonds, benefiting from their higher yields and potential price appreciation as interest rates decline.<br/><br/>Gallegos addresses common misconceptions about CCC-rated bonds, emphasizing that the current market fundamentals for high-yield bonds are strong, and the overall default rates are not above historical norms. She explains that the diversified nature of XCCC, with hundreds of bonds, mitigates individual default risks and offers a more stable investment compared to picking individual high-yield bonds. The ETF’s monthly rebalancing ensures it stays aligned with the ICE BofA CCC &amp; Lower US High Yield Constrained Index, providing consistent exposure to the target credit rating.<br/><br/>For advisors and investors, Gallegos suggests that XCCC can be a valuable addition to an existing high-yield allocation, rather than a replacement. It allows investors to lean into the higher yield opportunities within the high-yield spectrum, especially in an environment where rates are expected to remain high for longer. This approach can enhance overall portfolio yield and performance, making XCCC a strategic tool for optimizing fixed income investments.</p>",
    "slug": "joanna-gallegos"
  },
  {
    "title": "Taylor Krystkowiak - ThemesETFs",
    "date": "2024-08-03",
    "guest": "Taylor Krystkowiak",
    "company": "ThemesETFs",
    "duration": "30 min",
    "youtubeId": "pqJW3WEineA",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of “Behind the Ticker,” Taylor Krystkowiak, co-founder of ThemesETFs, shared insights into his career and the innovative strategies behind ThemesETFs. Krystkowiak, who has worked at various firms ranging from Fortune 500 companies to boutique asset managers, brought his extensive experience in macroeconomic analysis and investment strategy to ThemesETFs. The firm, founded by Jose Gonzalez, focuses on providing thematic and fundamental investment strategies at competitive price points, offering a range of ETFs that cater to current market demands.<br/><br/>ThemesETFs aims to differentiate itself by offering niche investment strategies at about 40% lower fees compared to the category average. Their first batch of ETFs includes sectors like artificial intelligence, cybersecurity, cloud computing, banks, airlines, and European luxury brands. Krystkowiak emphasizes that their goal is to provide investors with targeted exposure to specific market sectors while minimizing fees to enhance overall portfolio performance. By offering a variety of investment options, ThemesETFs seeks to cater to investors’ diverse needs and preferences.<br/><br/>A focal point of the discussion was the Global Systematically Important Bank ETF (GSIB). GSIB targets the 28 globally systemically important banks, often referred to as “too big to fail” institutions. These banks are held to higher regulatory standards to ensure financial stability, making them more resilient during economic downturns. Krystkowiak highlights that GSIBs have outperformed other banks and the broader market, especially during rising interest rate environments. Since January 2022, GSIBs have shown a return of over 35%, compared to a 7% decline in the broader banking sector and modest gains in major indices.<br/><br/>Krystkowiak explains that GSIB’s success is attributed to their lower exposure to commercial real estate, higher capitalization, and better liquidity. These banks have also benefited from increased customer deposits and diversified income streams, such as investment banking and wealth management fees. With a quarterly rebalancing strategy, GSIB maintains an equal-weight exposure to all 28 banks on the Financial Stability Board’s list, ensuring a balanced investment approach.<br/><br/>In terms of positioning within a portfolio, Krystkowiak suggests that GSIB can replace broad financial sector exposure or even serve as a core equity growth component. The ETF offers a way to diversify growth beyond tech-heavy names, providing stability and performance amidst market volatility. ThemesETFs employs a lean business model, utilizing artificial intelligence for efficient outreach and distribution, which allows them to offer lower fees to investors.</p>",
    "slug": "taylor-krystkowiak"
  },
  {
    "title": "Will Rhind - GraniteShares",
    "date": "2024-07-27",
    "guest": "Will Rhind",
    "company": "GraniteShares",
    "duration": "25 min",
    "youtubeId": "BG51WwqeOxM",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>Join us for an insightful episode as we dive into the fascinating world of Exchange-Traded Funds (ETFs) with a true industry veteran, Will Rhind. With over two decades of experience in the ETF arena, Will has carved a unique path by focusing on providing investors with high-conviction stock positions through innovative and disruptive ETF investments.</p><p>GraniteShares, Will&apos;s brainchild, boasts a diverse ETF suite covering everything from commodities to income, equities, and leveraged single stocks. In this episode, we have the privilege of delving into the world of these disruptive single stock ETFs, including red-hot names like Nvidia, Tesla, Meta, and Apple.</p><p>Will expertly articulates the case for single stock ETFs,  and conviction investing. He explores the remarkable demand surge witnessed in recent months, particularly with earnings season on the horizon, and offers insightful glimpses into what the future may hold for these investment vehicles.</p><p>Our guest, Will Rhind, isn&apos;t just a seasoned professional; he&apos;s the Founder &amp; CEO of GraniteShares, managing over $1.7 billion in total assets under management. His impressive journey includes a stint as a Principal at iShares and as a key member of the original European ETF team. Notably, he also spearheaded ETF Securities in the U.S. and helmed the world&apos;s largest commodities fund, the SPDR Gold Shares ETF (GLD). Find more information at graniteshares.com</p>",
    "slug": "will-rhind"
  },
  {
    "title": "Tim Kramer - CNIC Funds",
    "date": "2024-07-21",
    "guest": "Tim Kramer",
    "company": "CNIC Funds",
    "duration": "30 min",
    "youtubeId": "XFoJeceeRLo",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of “Behind the Ticker,” Tim Kramer, founder of CNIC Funds, shares his extensive background in the energy industry and the innovative approach behind CNIC’s latest offering. Kramer, who has been in the energy sector since 1997, brings a wealth of experience from working with various energy companies and a private equity firm where he managed commodity exposure. This diverse background led him to identify a gap in the market: the lack of electricity in commodity indexes. To address this, Kramer and his team created the first-ever electricity index and subsequently launched the AMPD ETF (ticker: AMPD) in May 2023.<br/><br/>Kramer explains that CNIC’s electricity index is a groundbreaking development, given that electricity is the most consumed commodity in the U.S. but was previously absent from major commodity indexes like the Bloomberg Commodity Index (BCOM) and the Goldman Sachs Commodity Index (GSCI). The AMPD ETF provides direct exposure to electricity futures, which are traded on the Intercontinental Exchange (ICE). By including electricity in an investable format, CNIC aims to offer investors a new way to diversify their portfolios and hedge against inflation, given electricity’s significant impact on CPI and overall economic activity.<br/><br/>One of the unique aspects of the AMPD ETF is its carbon-neutral status. Kramer elaborates on the use of carbon offsets in the fund, ensuring that its operations align with environmental sustainability goals. The ETF purchases carbon offsets corresponding to the electricity futures it holds, making it compliant with SFDR Article 8 standards in Europe. This approach not only addresses investor concerns about environmental impact but also positions the ETF as a forward-thinking product in the commodities market.<br/><br/>Kramer also highlights the strategic and tactical benefits of investing in the AMPD ETF. Strategically, it provides long-term exposure to the electrification of America, encompassing trends like AI, electric vehicles, and increased demand for renewable energy. Tactically, it offers a compelling investment due to current market conditions, where demand for electricity is rising, supply is constrained, and the grid’s reliability is increasingly volatile. Moreover, the fund’s structure, which parks a significant portion of its assets in three-month treasuries, allows investors to earn a risk-free rate while maintaining full notional exposure to electricity futures.<br/><br/>As CNIC Funds continues to grow, Kramer emphasizes their approach to marketing and distribution, focusing on partnerships with established platforms to leverage their exclusivity on the electricity index data. This strategy aims to maximize the fund’s reach and capitalize on the unique market position of offering the first electricity-focused commodity ETF. For more information, investors can visit CNIC’s website at CNICFunds.com, where they can access white papers, podcasts, and other educational resources about the AMPD ETF and the broader electricity market.</p>",
    "slug": "tim-kramer"
  },
  {
    "title": "Meb Faber - Cambria Investments",
    "date": "2024-07-14",
    "guest": "Meb Faber",
    "company": "Cambria Investments",
    "duration": "40 min",
    "youtubeId": "tmohV3DFuz0",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of “Behind the Ticker,” Meb Faber, CEO and CIO of Cambria Investments, shares insights into his career journey and the innovative investment strategies employed by his firm. Faber, who has a background in engineering and biotech, founded Cambria Investments and has led the firm to manage approximately $2.5 billion in assets. Based in Manhattan Beach, California, Cambria is known for its quantitative, rules-based investment approach. Over the past decade, the firm has launched 15 funds, attracting over 150,000 investors worldwide.<br/><br/>Faber emphasizes Cambria’s commitment to launching funds that fill gaps in the market. The firm’s investment philosophy revolves around creating ETFs that either don’t exist or are implemented significantly better or cheaper than existing options. This approach has led to the development of a diverse range of ETFs, all backed by substantial academic and practitioner research. Faber’s passion for educating investors is evident through Cambria’s free research service, the Idea Farm, which curates valuable investment insights for over 100,000 subscribers.<br/><br/>A significant portion of the discussion centers around Cambria’s Shareholder Yield ETFs, particularly SYLD, which focuses on U.S. stocks. Shareholder yield goes beyond traditional dividend yield by incorporating net stock buybacks, providing a more comprehensive measure of a company’s return to shareholders. Faber explains that the methodology behind these ETFs includes screening for companies with high shareholder yield, favorable valuation metrics, and strong financial health. The final selection process also considers intermediate-term momentum to avoid value traps.<br/><br/>The Shareholder Yield ETFs, including SYLD, FYLD (foreign developed markets), and EYLD (emerging markets), are designed to offer investors high-quality, cash-generating businesses at attractive valuations. These funds aim to provide superior risk-adjusted returns compared to traditional dividend-focused strategies. Faber highlights the current undervaluation of international and emerging market stocks, making them attractive investments given their potential for significant returns.<br/><br/>Faber also touches on Cambria’s trend-following strategies, which serve as a premier diversifier in portfolios. These strategies have proven effective during market downturns, offering protection and opportunities for gains in various market conditions. The firm continues to innovate and expand its ETF offerings, guided by the principle of creating products that Faber and his team would invest in themselves. For more information about Cambria and its range of ETFs, investors can visit CambriaFunds.com.</p>",
    "slug": "meb-faber"
  },
  {
    "title": "John McHugh - WealthTrust Asset Management",
    "date": "2024-07-05",
    "guest": "John McHugh",
    "company": "WealthTrust Asset Management",
    "duration": "33 min",
    "youtubeId": "YvOOVP4G-oA",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of “Behind the Ticker,” John McHugh, founder of WealthTrust Asset Management, shared his extensive experience in portfolio management and the innovative strategies his firm employs. McHugh, who began his career at Merrill Lynch in 1988 and later joined Oppenheimer and Wells Fargo Advisors, eventually founded WealthTrust in 2015. His motivation stemmed from a desire to manage portfolios on a discretionary basis and offer superior performance, which he has successfully achieved with WealthTrust’s long-term growth portfolio outperforming the S&amp;P 500 65% of the time since 2000.<br/><br/>WealthTrust Asset Management provides a wide range of portfolio management services across six turnkey asset management platforms. The firm manages 12 different strategies, including small-cap, mid-cap, fixed income, and large-cap portfolios, as well as two balanced portfolios. WealthTrust is notable for its GIPS (Global Investment Performance Standards) compliance, a testament to its rigorous performance measurement and presentation standards. McHugh emphasizes the firm’s commitment to educating advisors and their clients through webinars and collaborative presentations, highlighting the importance of understanding their investment methodology.<br/><br/>A significant focus of the podcast was on WealthTrust’s flagship ETF, WLTG (WealthTrust Long-Term Growth ETF). This ETF employs a growth-at-reasonable-price strategy, competing with benchmarks like the Russell 1000 but with a stronger growth orientation. McHugh detailed the rigorous screening process used to identify companies with high-quality earnings and dividends, aiming to construct a portfolio of 25 to 30 large-cap and mega-cap stocks. The selection process relies heavily on quantitative analysis, including earnings quality, dividend quality, and quantitative rankings that signal the likelihood of companies beating earnings estimates.<br/><br/>In addition to its fundamental analysis, WLTG incorporates an AI-driven momentum overlay, which enhances the portfolio’s performance by identifying stocks with strong momentum. This dual approach allows WealthTrust to dynamically adjust its holdings based on market trends, ensuring the portfolio remains well-positioned for growth while managing risk. McHugh highlighted the flexibility of the ETF to shift between growth and value stocks and even include passive ETFs or defensive assets like treasuries and gold during market downturns.<br/><br/>WealthTrust’s innovative approach to portfolio management and the WLTG ETF provides a compelling option for advisors and investors seeking to enhance their large-cap growth exposure. McHugh’s extensive experience and commitment to rigorous analysis and education underscore the firm’s dedication to delivering superior investment solutions. For more information about WealthTrust and their ETF offerings, visit their websites at WealthTrustETF.com and WealthTrustAM.com.</p>",
    "slug": "john-mchugh"
  },
  {
    "title": "Andrew Skatoff - Bancreek",
    "date": "2024-06-28",
    "guest": "Andrew Skatoff",
    "company": "Bancreek",
    "duration": "30 min",
    "youtubeId": "PWYYh7K6jgE",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of “Behind the Ticker,” Andrew Skatoff, founder of Bancreek, shared insights into his journey and the innovative investment strategies his firm employs. Skatoff, who graduated from Columbia Business School’s value investing program in 2009, began his career in the family office world, where he developed a deep understanding of long-term capital compounding. This experience led him to create a strategy focused on investing in structurally advantaged businesses, which he later spun out into Bancreek in 2021 to serve other family offices and investors.<br/><br/>Skatoff explains that Bancreek’s investment approach is heavily data-driven, relying on a combination of fundamental and quantitative factors to identify businesses with long-term compounding potential. The firm employs a chief data scientist and utilizes sophisticated modeling and simulation techniques to analyze a vast array of data. This quantitative approach allows Bancreek to identify companies with unique competitive advantages, such as robust distribution pipelines, significant brand equity, and strong network effects, which can sustain growth and compounding over long periods.<br/><br/>Bancreek has launched two ETFs to bring their investment strategy to a broader audience: BCUS, which focuses on US large-cap companies, and BCIL, which targets international large-cap companies excluding the US. Both ETFs are constructed using a proprietary ranking system that identifies and weights approximately 30 top businesses based on their structural advantages. This methodology aims to provide investors with a diversified portfolio of high-quality, growth-oriented companies. The ETFs are refreshed monthly to ensure they reflect the latest data and insights from Bancreek’s quantitative models.<br/><br/>Skatoff also discusses the challenges and opportunities of entering the ETF market. He emphasizes that Bancreek’s unique value proposition lies in its ability to apply quantitative analysis to long-term investing, differentiating it from other short-term or momentum-driven strategies. To promote their ETFs, Bancreek focuses on education and transparency, offering data visualization tools and resources on their website to help investors understand their investment process. By engaging with advisors and attending industry conferences, Bancreek aims to build awareness and demonstrate the potential of their innovative approach to portfolio management.</p>",
    "slug": "andrew-skatoff"
  },
  {
    "title": "Danielle Gilbert - Panagram",
    "date": "2024-06-21",
    "guest": "Danielle Gilbert",
    "company": "Panagram",
    "duration": "34 min",
    "youtubeId": "EEW7Wg-UGnQ",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of “Behind the Ticker,” Danielle Gilbert, head of business development at Panagram, discusses her career path and the innovative structured credit solutions offered by Panagram. Gilbert began her career in structured credit at UBS and spent 18 years on the sell side. In that role, she met the investment team at Eldridge. Panagram provides a deep dive into the complexities and benefits of structured credit and CLOs (collateralized loan obligations). Panagram, launched in 2021, leverages its expertise in structured credit to offer institutional-grade investment strategies to a broader audience through <b>ETFs</b>.</p><p><br/></p><p>Gilbert explains that structured credit involves creating diversified pools of contractual cash flows from various assets like mortgages, credit cards, and corporate loans. CLOs, a subset of structured credit, bundle senior secured loans from large corporations into different tranches of bonds with varying risk levels. These tranches, ranging from AAA to equity, offer investors tailored risk and return profiles. Unlike the subprime mortgage products that contributed to the 2008 financial crisis, CLOs are backed by higher quality, senior secured loans with historically low default rates and high recovery rates.</p><p><br/></p><p>Panagram manages about $17 billion in assets, with more than half invested in CLOs. Their investment approach focuses on high-quality CLO managers and active management to optimize returns. Gilbert highlights that CLOs offer floating rate exposure, providing a hedge against rising interest rates and adding diversification to fixed income portfolios. The two ETFs Panagram launched in 2023, CLOZ and CLOX, provide different levels of exposure to CLO tranches. CLOZ focuses on BBB and BB tranches, offering higher yields around 9%, while CLOX targets AAA tranches for more conservative investors.</p><p><br/></p><p>Gilbert emphasizes the importance of education in promoting these products to advisors and individual investors unfamiliar with structured credit. Panagram’s strategy includes educational seminars, webinars, and one-on-one discussions to demystify CLOs and highlight their benefits in portfolio diversification and income generation. By providing access to institutional-grade CLO investments through ETFs, Panagram aims to offer investors better yield opportunities with strong historical performance and lower correlation to traditional fixed income and equity markets.</p>",
    "slug": "danielle-gilbert"
  },
  {
    "title": "Yang Tang - Arch Indicies / VWI",
    "date": "2024-06-14",
    "guest": "Yang Tang",
    "company": "Arch Indicies / VWI",
    "duration": "31 min",
    "youtubeId": "q2-tpxjcNEg",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of “Behind the Ticker,” Yang Tang, co-founder of Arch Indices, discusses his career journey and the innovative approach his firm takes in constructing investment portfolios. With a background in commodity sales and macro solutions at major financial institutions like Barclays, Morgan Stanley, and Citi, Tang brings a wealth of experience to Arch Indices. The firm, founded in August 2022, aims to build better portfolios through a unique methodology focused on risk-adjusted contributions, departing from traditional market cap or equal-weighted strategies.<br/><br/>Tang explains the core principles behind Arch Indices’ approach, which revolves around variance optimization, a concept rooted in modern portfolio theory. This methodology emphasizes creating portfolios that achieve specific investment goals, such as income generation or total return, with the least amount of volatility. Unlike traditional methods that rely on expected returns, Arch Indices uses market-observed volatility and correlation to dynamically adjust portfolios. Their recursive optimization technique further refines this process, continually adjusting asset allocations to maximize returns while minimizing risk.<br/><br/>One of the standout products from Arch Indices is their ETF, VWI (Arch Indices Income ETF), which combines dividend-paying stocks and bond ETFs to deliver high income with low volatility. The ETF aims to provide investors with the highest possible income while minimizing fluctuations in portfolio value. Tang highlights the dynamic nature of the ETF, which rebalances quarterly to adapt to changing market conditions, ensuring that the portfolio remains optimized for both yield and risk. This approach allows the ETF to maintain a high yield, typically around 6.8%, while keeping volatility low.<br/><br/>Tang discusses the practical applications of the VWI ETF for different types of investors. He notes that the ETF is particularly well-suited for retirement-focused advisors and individuals, offering a stable income stream with lower volatility, which is crucial for managing sequence of returns risk in retirement planning. Additionally, the ETF can serve as a core holding within a broader portfolio, providing a foundation of income and stability while allowing for the inclusion of other growth-oriented assets. Tang also mentions that Arch Indices offers the strategy through SMAs via a partnership with Quorus, catering to clients who prefer a more tailored approach.<br/><br/>Overall, Tang emphasizes the importance of staying invested and managing risk effectively, particularly in volatile markets. The VWI ETF and Arch Indices’ broader strategy provide a robust solution for investors seeking to balance income generation with risk management. The firm’s innovative approach to portfolio construction, rooted in rigorous mathematical optimization, sets it apart in the competitive ETF landscape.</p>",
    "slug": "yang-tang"
  },
  {
    "title": "Burke Ashenden - Innovator ETFs",
    "date": "2024-06-06",
    "guest": "Burke Ashenden",
    "company": "Innovator ETFs",
    "duration": "25 min",
    "youtubeId": "fYqDTH615Eg",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of &quot;Behind the Ticker,&quot; Burke Ashenden, Head of Capital Markets at Innovator ETFs, delves into the unique offerings of Innovator ETFs with host Brad. Ashenden, who started his career in ETF trading and later transitioned to the issuer side, shares his journey and how it led him to Innovator. Innovator ETFs, founded by industry veterans Bruce Bond and John Souther, focuses exclusively on Defined Outcome ETFs. This singular focus has made Innovator a leader in this niche, with a variety of products designed to offer downside protection and defined outcomes for investors.</p><p>Ashenden explains the core concept behind Innovator&apos;s Defined Outcome ETFs, which provide a buffer against market losses in exchange for a cap on upside gains. These ETFs are constructed using a basket of flex options, which offer customizable tenors and strikes, allowing for precise defined outcomes. The firm offers various buffers, including a 9%, 15%, and 30% buffer against market losses over different periods, such as quarterly or annually. Additionally, Innovator has expanded its offerings with 100% buffer ETFs, providing complete downside protection, which has been particularly appealing to advisors and investors looking to equitize cash without principal risk.</p><p>The conversation highlights the practical applications of these ETFs. Ashenden emphasizes their utility in different market environments, particularly for conservative clients or those wary of investing at market highs. The ETFs&apos; ability to reset within the structure without triggering taxable events and their flexibility make them an attractive alternative to traditional fixed income, especially in a high-yield, low-tax environment. Ashenden points out that these products can be effectively used as a conservative equity allocation or even as a fixed income alternative, providing attractive caps with full downside protection.</p><p>Ashenden also discusses the strategic use of Innovator&apos;s model portfolios, which combine different Defined Outcome ETFs to create customized risk-return profiles. These models help advisors implement diversified and risk-managed portfolios. He underscores the benefits of Innovator&apos;s tools available on their website, which assist advisors in analyzing potential outcomes and historical performance. Innovator ETFs&apos; commitment to Defined Outcome strategies and their innovative approach to structured products make them a compelling choice for advisors looking to navigate volatile markets with confidence.</p>",
    "slug": "burke-ashenden"
  },
  {
    "title": "Jerry Parker - Chesapeake Capital",
    "date": "2024-05-31",
    "guest": "Jerry Parker",
    "company": "Chesapeake Capital",
    "duration": "34 min",
    "youtubeId": "HY1eMVv9krY",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of &quot;Behind the Ticker,&quot; Jerry Parker, founder of Chesapeake Capital an industry veteran in trend following and systematic trading, shares his professional journey and insights into the systematic investing approach that defines Chesapeake. Parker&apos;s career transition from accounting to trading was catalyzed by his training under Richard Dennis in the famous &quot;turtle trading&quot; program, which profoundly shaped his investment philosophy. His foundational experience at Dennis&apos;s training program led him to establish Chesapeake Capital, where he has dedicated his career to refining and applying systematic trend-following strategies.</p><p>Parker elaborates on the philosophy of trend-following, emphasizing its reliance on strict system rules and objective price data to drive trading decisions. This method contrasts sharply with more subjective or discretionary trading approaches, relying on historical price actions to guide future trading decisions, aiming to capitalize on market trends irrespective of market conditions. This disciplined adherence to system rules, according to Parker, allows traders to manage risk effectively and achieve consistent performance over time.</p><p>In discussing Chesapeake&apos;s operations, Parker highlights the firm&apos;s evolution towards offering ETFs and mutual funds that democratize access to trend-following strategies, previously the preserve of institutional investors. The ETF, symbolized as TFPN, encapsulates Chesapeake&apos;s commitment to pure trend-following, applying this strategy across a broad array of markets including commodities, currencies, and equities both domestically and internationally. Parker&apos;s passion for trend-following is evident as he advocates for its effectiveness in managing portfolio risks and capturing market trends.</p><p>Parker concludes by reflecting on the broader implications of systematic trend-following for portfolio management. He suggests that while Chesapeake&apos;s strategies can serve as core portfolio components due to their comprehensive market coverage and disciplined risk management, investors often incorporate them as supplementary allocations to diversify and stabilize existing portfolios. His insights underscore the adaptability and enduring relevance of trend-following in the dynamic world of investment management.</p>",
    "slug": "jerry-parker"
  },
  {
    "title": "Bob Elliott - HFND",
    "date": "2024-05-17",
    "guest": "Bob Elliott",
    "company": "HFND",
    "duration": "31 min",
    "youtubeId": "YiYVCOL12dg",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of &quot;Behind the Ticker,&quot; Bob Elliott, founder of Unlimited and former employee at Bridgewater Associates, shares insights into his journey and the innovative approach his firm takes in the hedge fund industry. Elliott&apos;s experience at Bridgewater and overseeing a venture fund shaped his understanding of the limitations of traditional hedge fund fees, leading him to create Unlimited. The firm leverages modern machine learning to replicate hedge fund strategies at lower costs, making these strategies accessible and tax-efficient for a broader audience.</p><p>Elliott discusses the potential of hedge fund strategies when stripped of exorbitant fees. He explains that these strategies typically offer solid returns with lower volatility compared to the equity market, but the traditional fee structure significantly dampens their attractiveness. At Unlimited, Elliott aims to harness these strategies&apos; intrinsic value through a low-cost, diversified indexing approach that mimics the broad hedge fund market without the typical fee burden.</p><p>The podcast delves into Unlimited&apos;s flagship ETF, HFND, which embodies the firm&apos;s philosophy of making hedge fund returns accessible. Elliott describes the ETF&apos;s construction using a machine learning model that analyzes current hedge fund manager positions to replicate their strategies. This model ensures the ETF reflects an accurate, up-to-date representation of the hedge fund landscape. Through this innovative approach, Unlimited not only democratizes access to hedge fund strategies but also enhances transparency and tax efficiency for investors.</p><p>Elliott concludes the discussion by emphasizing the importance of including hedge fund-like strategies within diversified portfolios, suggesting a blend of such strategies can significantly enhance risk-adjusted returns. He envisions HFND as a core component of investors&apos; alternative allocations, ideally complementing other investment strategies within a well-rounded portfolio. The conversation highlights Elliott&apos;s commitment to breaking down the barriers to sophisticated investment strategies, making them accessible to investors of all scales.</p><p><br/></p>",
    "slug": "bob-elliott"
  },
  {
    "title": "Andrew Beer - DBMF",
    "date": "2024-05-10",
    "guest": "Andrew Beer",
    "company": "DBMF",
    "duration": "41 min",
    "youtubeId": "8FuZc4GXLOs",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of &quot;Behind the Ticker,&quot; Andrew Beer, an established figure in the hedge fund and ETF industries, shares his experiences and insights with host Brad. Beer discusses his journey through the hedge fund world, where he initially worked with prominent managers and later co-founded hedge funds, ultimately focusing on making hedge fund strategies more accessible and less costly through ETFs. This led to the development of hedge fund replication strategies, helping wealth managers transition from traditional 60-40 portfolios to more diversified approaches, especially amidst changing market conditions.</p><p>Throughout the podcast, Beer delves into the challenges and strategies of asset allocation in the current financial landscape, characterized by higher interest rates and increased market volatility. He argues that while the traditional 60-40 portfolio excelled during periods of low interest rates, the changing economic environment necessitates a more dynamic approach to asset management. Beer emphasizes the importance of diversification and introduces the concept of &quot;crisis alpha,&quot; where managed future strategies provide significant value during market downturns by not correlating directly with traditional stocks and bonds.</p><p>Beer further explains the technical aspects of his firm&apos;s managed futures ETF, DBMF, emphasizing its systematic, quantitative approach to replicating hedge fund strategies affordably. He outlines how the ETF is structured to maximize efficiency and transparency, making it an attractive option for investors seeking hedge fund-like returns without the associated costs. The conversation concludes with Beer advocating for managed futures as a necessary component of modern portfolios, providing crucial diversification that can enhance long-term investment outcomes.</p>",
    "slug": "andrew-beer"
  },
  {
    "title": "Matt Kaufman - Calamos / CPSM",
    "date": "2024-05-03",
    "guest": "Matt Kaufman",
    "company": "Calamos / CPSM",
    "duration": "32 min",
    "youtubeId": "-0_pgiV7ErU",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In a recent episode of &quot;Behind the Ticker,&quot; host Brad delves into the innovative financial products from Calamos with guest Matt Kaufman. Kaufman, with a rich background in the ETF and insurance industries, discusses his journey through various financial sectors and how these experiences have shaped the development of new ETF products at Calamos. The episode focuses on the launch of Calamos&apos;s new ETF, CPSM, which offers 100% downside protection with capped upside potential, a novel approach in the ETF space aimed at providing investors with a safety net in volatile markets.</p><p>Kaufman explains the technical aspects of CPSM, describing it as a structured product that combines options to deliver both capital protection and potential gains linked to the S&amp;P 500 index. This ETF is particularly relevant in a rising rate environment where traditional low-risk investments like CDs and money markets become more attractive due to higher returns. Kaufman’s detailed explanation sheds light on the potential of CPSM to be a game-changer for risk-averse investors looking for equity exposure without the downside risk.</p><p>Throughout the podcast, Kaufman not only details the specific mechanics of CPSM but also discusses broader financial strategies and the future of ETFs. He envisions a significant shift of assets from traditional mutual funds to more tax-efficient and liquid ETFs, predicting growth in active ETFs. The conversation also touches on how these structured products can be incorporated into diversified investment portfolios to manage risk effectively. This episode provides deep insights into the intersection of ETF innovation and risk management, positioning Calamos at the forefront of this evolving market landscape.</p>",
    "slug": "matt-kaufman-2"
  },
  {
    "title": "Jason Hsu - Rayliant",
    "date": "2024-04-26",
    "guest": "Jason Hsu",
    "company": "Rayliant",
    "duration": "23 min",
    "youtubeId": "zH89oXtZT38",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In this episode of &quot;Behind the Ticker,&quot; host Brad Roth sits down with Jason Hsu, co-founder of Rayliant, to discuss the integration of quantitative research with institutional investment strategies. Jason shares his journey from an academic setting into the finance industry, detailing the transition and how it led to the founding of Rayliant. He explains how his firm has evolved from focusing solely on institutional clients to offering sophisticated active ETFs that make complex investment strategies accessible to a wider audience.</p><p>Jason also discusses Rayliant’s significant role in managing assets for government and sovereign wealth funds in Japan, Taiwan, and Canada. He highlights the development and strategic approach behind their Japan equity ETF, RAYJ, which aims to capture underexplored market segments through a blend of local expertise and quantitative methods. Throughout the conversation, Jason relates his personal experiences in basketball to his professional strategies, emphasizing the importance of teamwork and strategic planning in both arenas.</p><p>This episode provides listeners with detailed insights into the creation and operation of innovative financial products. It is particularly valuable for financial advisors and investors interested in understanding the application of quantitative research within the institutional investment landscape.</p>",
    "slug": "jason-hsu"
  },
  {
    "title": "Greg Reid - Westwood MDST",
    "date": "2024-04-21",
    "guest": "Greg Reid",
    "company": "Westwood MDST",
    "duration": "28 min",
    "youtubeId": "TaRvCV07fes",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>The podcast episode of &quot;Behind the Ticker&quot; featuring Greg Reid, the president of Real Assets at Westwood, offers a detailed insight into his background, the firm’s operations, and the innovative strategies they employ. Greg Reid has a lengthy career in investment, dating back to 1987, and currently manages a team in Houston overseeing $2.3 billion in assets. Westwood, a public company based in Dallas, focuses on real asset management, particularly in the energy sector, with a strong emphasis on value equities and income-generating real assets.</p><p>In the episode, Reid discusses the launch of Westwood’s new ETF, the Westwood Enhanced Midstream Income ETF (MDST), which is particularly innovative due to its use of covered calls to enhance yield. This strategy aims to offer investors double-digit dividend yields by combining high-yielding stocks with covered call writing, which provides additional income and reduces portfolio risk.</p><p>Reid also elaborates on the construction of MDST’s portfolio, which selects stocks based on dividend yield and growth potential, aiming to optimize returns and manage risk. The fund’s strategy involves a rigorous selection process, leveraging in-house research to identify the best-performing stocks within the energy sector, focusing on midstream companies.</p><p>Marketing strategies for the ETF target high-net-worth individuals and RIAs, positioning it as an attractive option for those seeking income solutions within their investment portfolios. Reid’s approach underlines the importance of combining sophisticated financial instruments with strategic marketing to appeal to a broad audience, highlighting the balance between innovative financial products and practical investment solutions for retirement and income-focused portfolios.</p>",
    "slug": "greg-reid"
  },
  {
    "title": "Kim Mayer - GMO",
    "date": "2024-04-12",
    "guest": "Kim Mayer",
    "company": "GMO",
    "duration": "25 min",
    "youtubeId": "cbhYW1Ucj8o",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In this episode of &quot;Behind the Ticker,&quot; host Brad interviews Kim Mayer from GMO. Kim has been with GMO for over 18 years, starting his career on the sell side at Morgan Stanley before transitioning to the buy side. He currently holds a dual role at GMO as a portfolio strategist and covers several sectors including luxury goods, beer, spirits, and retail.</p><p>Kim discusses the launch of GMO&apos;s QLTY ETF, which marks GMO&apos;s strategic entry into the ETF market. He explains how the ETF aims to make high-quality investment strategies accessible to a broader audience through a focus on U.S. equities. The approach combines both qualitative and quantitative methods to ensure a robust selection process that emphasizes quality and proper valuation.</p><p>The episode also delves into Kim&apos;s personal interests, highlighting his love for activities on water, reflecting his move from New York to Boston. Overall, the podcast provides insights into GMO&apos;s investment philosophy and operational strategies, as well as offering a glimpse into the personal life of one of its key figures.</p>",
    "slug": "kim-mayer"
  },
  {
    "title": "Simeon Hyman - ProShares",
    "date": "2024-03-29",
    "guest": "Simeon Hyman",
    "company": "ProShares",
    "duration": "12 min",
    "youtubeId": "rOuyrmWbXSU",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In the latest episode of Behind the Ticker, Brad Roth engages with Simeon Hyman from ProShares, delving into the intricate world of ETFs and the innovative strategies behind them. Hyman, with over three decades of experience in asset and wealth management, discusses his role at ProShares, a firm that manages around $65 billion across various ETF solutions. The conversation highlights Hyman&apos;s personal interests, such as music and outdoor activities, providing a glimpse into the individual behind the professional expertise.</p><p>A significant focus of the episode is on ISPY, ProShares&apos; unique covered call ETF that leverages daily options, a novel approach aiming to optimize investor returns while generating income. Unlike traditional monthly covered call strategies that might cap gains early in the month, ISPY&apos;s daily options strategy seeks to capture the full potential of the S&amp;P 500&apos;s performance. Hyman elaborates on the competitive yield and monthly distribution of ISPY, positioning it as an attractive option for investors looking to incorporate income generation into their equity portfolios. He also addresses the risk profile associated with ISPY, aligning primarily with the S&amp;P 500, and outlines how the ETF can fit into investors&apos; core equity holdings.</p><p>The conversation also touches on the broader ETF market, with Hyman speculating on the future of covered call ETFs and ProShares&apos; commitment to innovation. For listeners interested in the intersection of investment strategy and innovation within the ETF space, this episode provides valuable insights into one of the leading firms in the industry and their approach to creating investment solutions that meet the evolving needs of investors.</p>",
    "slug": "simeon-hyman"
  },
  {
    "title": "Dodd Kittsley - Davis Funds",
    "date": "2024-03-24",
    "guest": "Dodd Kittsley",
    "company": "Davis Funds",
    "duration": "17 min",
    "youtubeId": "0nYwbhchXZ8",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In this episode of &quot;Behind the Ticker,&quot; Brad Roth engages with Dodd Kittsley from Davis Funds to explore their ETFs and mutual funds. Kittsley brings a wealth of experience from his early involvement in the ETF industry in the late 1990s to his present position at Davis Funds, offering insights into the development of ETFs as tools for broadening market access.</p><p>Davis Funds, founded in 1969, has evolved from focusing on institutional clients to offering mutual funds, SMAs, and ETFs, partnering with financial advisors to address investment strategies and investor behavior. The conversation highlights two particular ETFs: the Davis Select U.S. Equity ETF (DUSA) and the Davis Select Worldwide ETF (DWLD). DUSA aims for selective investment in undervalued, durable companies with effective management and potential for sustainable growth, adopting a Growth at a Reasonable Price (GARP) approach. DWLD, on the other hand, offers a global investment perspective, aiming to invest in the best businesses worldwide without geographic constraints.</p><p>Kittsley emphasizes the role of deep research and a focus on long-term wealth over short-term earnings, advocating for a conviction-driven, actively managed approach. Beyond the professional insights, Kittsley shares personal interests in family activities, gardening, and sports, reflecting on the balance between personal life and professional commitments.</p><p>This episode provides a comprehensive overview of Davis Funds&apos; investment strategies, emphasizing the importance of informed, active management. For more information about Davis Funds and their approach to investment, their websites offer detailed resources for investors looking to understand the choices available in different investment vehicles.</p><p><br/></p>",
    "slug": "dodd-kittsley"
  },
  {
    "title": "Sal Esposito - Zacks",
    "date": "2024-03-15",
    "guest": "Sal Esposito",
    "company": "Zacks",
    "duration": "23 min",
    "youtubeId": "O0f0KZkYyyw",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>The episode of &quot;Behind the Ticker&quot; features Sal Esposito from Zacks, focusing on two of their ETFs: ZECP (Earnings Consistent Portfolio) and SMIZ (Small Mid Cap Core ETF). Sal&apos;s journey began at UBS, transitioning from various roles to Zacks, where he embraced the ETF space. Zacks, starting in 1978, specializes in earnings estimate revisions and surprises, crafting strategies around quality and consistency.</p><p>ZECP, designed as a core portfolio piece, invests in large cap, quality companies demonstrating consistent earnings and resilience through market cycles. It typically includes 50-65 names, chosen through a rigorous screening process emphasizing historic and forecasted EPS stability.</p><p>SMIZ targets opportunities in the small and mid-cap space, focusing on earnings estimate revisions and market anomalies, holding around 198 names. Unlike ZECP, it does not prioritize earnings consistency but rather seeks to exploit less covered market segments for alpha.</p><p>Zacks also offers &quot;Zacks Plus,&quot; a unique product combining ETFs and SMAs into holistic solutions, tailored across risk spectrums without strategist fees. It allows advisors to deliver more sophisticated, efficient portfolio options, focusing primarily on domestic equities.</p><p>Sal suggests ZECP can complement large cap equity exposures like SPY, offering downside protection through its focus on quality. SMIZ serves as a dynamic small to mid-cap exposure, aimed at capturing alpha in less scrutinized market segments. For more information on Zacks and their ETF products, Sal recommends visiting zacksetfs.com or contacting etfproducts@zacks.com.</p>",
    "slug": "sal-esposito"
  },
  {
    "title": "Johan Grahn - Allianz",
    "date": "2024-03-08",
    "guest": "Johan Grahn",
    "company": "Allianz",
    "duration": "26 min",
    "youtubeId": "OQz0djF3kJM",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>The podcast episode of &quot;Behind the Ticker,&quot; hosted by Brad Roth, features Johan Grahn from Allianz discussing the intriguing world of buffered ETF products. Johan Grahn, with his extensive background in investment and asset management over two decades, delves into how buffered ETFs provide investors with defined outcomes, integrating protection against market downturns with a cap on maximum gains. These innovative products, primarily based on the S&amp;P 500, aim to manage investment risk while ensuring transparency and building investor confidence.</p><p>Grahn&apos;s journey through university endowments, consulting, and roles in large insurance companies has honed his expertise in risk-managed strategies and portfolio construction. This experience underpins his current role at Allianz, where he oversees the launch of buffered ETFs, a testament to his commitment to developing products that balance risk and return efficiently.</p><p>The conversation explores the mechanics of buffered ETFs, including their reliance on an options package to achieve predefined outcomes. With different levels of protection (buffers) and durations available, these ETFs cater to a broad spectrum of investor needs. Grahn explains the reset process at the end of each outcome period, which allows for continuous protection and potential growth.</p><p>Buffered ETFs emerge as a flexible investment solution amidst a noticeable shift towards more conservative strategies among retiring individuals. The podcast highlights how these ETFs can serve a wide range of investors, from those seeking to reduce equity risk in their portfolios to those looking to add risk in a controlled manner.</p><p>Listeners interested in Allianz&apos;s buffered ETFs can find more information on their website, which offers comprehensive resources, including videos and product tables. </p>",
    "slug": "johan-grahn"
  },
  {
    "title": "Weldon Rice - QRAFT Ai",
    "date": "2024-03-01",
    "guest": "Weldon Rice",
    "company": "QRAFT Ai",
    "duration": "24 min",
    "youtubeId": "sm1TrwWiqIQ",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In the episode of &quot;Behind the Ticker,&quot; Brad Roth and Weldon Rice from Qraft Technologies discuss the integration of artificial intelligence within the investment landscape, particularly through Exchange-Traded Funds (ETFs). This conversation provides a detailed look at how Qraft applies AI to develop and manage ETFs, offering insights into the practical implications and methodologies behind AI-driven investment strategies.</p><p>Weldon Rice introduces two specific ETFs during the discussion: the QRFT and the AMOM. The QRFT ETF is designed to leverage AI in managing a portfolio of U.S. large-cap stocks, aiming for a balance between diversification and performance by analyzing large datasets to identify market trends and inefficiencies. The ETF maintains a portfolio of roughly 300 to 320 stocks and is adjusted monthly based on AI&apos;s analysis.</p><p>The AMOM ETF, in contrast, focuses on capturing momentum within the U.S. large-cap space, holding a more concentrated portfolio of around 50 stocks. This ETF seeks to dynamically adjust to market conditions, emphasizing stocks or sectors displaying strong momentum. It&apos;s described as having a more focused investment strategy, with potential for higher volatility given its concentration and rebalancing approach.</p><p>Rice emphasizes the role of AI as a tool to complement, rather than replace, human decision-making in the investment process. The discussion highlights how AI can enhance traditional investment strategies by providing deeper insights into market data and trends, thus aiding in portfolio construction and risk management.</p><p>By examining QRFT and AMOM, the episode explains how AI technologies are applied in the creation and management of ETFs. These examples illustrate Qraft&apos;s approach to integrating AI into finance, aiming to offer innovative solutions for investors looking to benefit from the advancements in AI for portfolio management and investment decision-making.</p>",
    "slug": "weldon-rice"
  },
  {
    "title": "David LaValle - Grayscale / GBTC",
    "date": "2024-02-23",
    "guest": "David LaValle",
    "company": "Grayscale / GBTC",
    "duration": "31 min",
    "youtubeId": "nPx6SAoaoRA",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In this episode of &quot;Behind the Ticker,&quot; host Brad Roth welcomes David LaValle, a notable figure in the ETF industry and a current leader at Grayscale, the premier digital currency asset manager. The discussion provides an in-depth look at the intersection of Exchange-Traded Funds (ETFs) and digital assets, highlighting LaValle&apos;s significant contributions and Grayscale&apos;s innovative efforts in this space.</p><p><b>Background and Industry Experience:</b> David LaValle shares his extensive experience in the financial markets, tracing his path from the early days of trading to his pivotal role in Nasdaq&apos;s ETF listing and trading business, and now, his leadership position at Grayscale. His journey reflects a deep commitment to advancing financial products and the ETF ecosystem.</p><p><b>Grayscale&apos;s Approach to Digital Assets:</b> The conversation delves into Grayscale&apos;s mission to make digital assets accessible through regulated investment products. LaValle discusses the importance of regulatory compliance and the company&apos;s strategy in offering products like the GBTC, aiming to provide investors with secure access to digital currencies within a familiar investment framework.</p><p><b>Educational Initiatives:</b> A significant part of the episode focuses on the challenges surrounding the adoption of digital assets and the crucial role of education in this process. LaValle emphasizes Grayscale&apos;s efforts to dispel myths and provide clear, comprehensive information about digital currencies, highlighting resources like the Grayscale Bitcoin Book designed to inform and guide investors and financial advisors.</p><p><b>Regulatory Journey and Milestones:</b> LaValle recounts the challenging but ultimately successful journey to obtain regulatory approval for Grayscale&apos;s bitcoin ETF. This narrative underscores the complexities of integrating digital assets into traditional financial systems and the perseverance required to navigate regulatory landscapes.</p><p><b>Looking Forward:</b> The episode concludes with LaValle&apos;s insights into the future possibilities for ETFs and digital assets. He shares his vision for expanding the ETF ecosystem to include a wider range of digital asset products, potentially transforming how investors engage with these emerging technologies.</p>",
    "slug": "david-lavalle"
  },
  {
    "title": "Keri Riemer & Hazel Doyle - K&L Gates",
    "date": "2024-02-16",
    "guest": "Keri Riemer & Hazel Doyle",
    "company": "K&L Gates",
    "duration": "29 min",
    "youtubeId": "usnAG7RPMyo",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>Special Live From Exchange ETF Series<br/><br/>In this live and in-person episode of &quot;Behind the Ticker,&quot; host Brad Roth welcomes Keri Riemer and Hazel Doyle to explore the evolving landscape of Exchange Traded Funds (ETFs) from both a U.S. and European perspective. This engaging conversation offers a deep dive into the intricacies of ETFs, their legal frameworks, and the burgeoning growth within the industry.</p><p>Keri Riemer, with a rich background in corporate law, asset management, and regulatory roles, including a stint at the SEC, shares her journey into the world of ETFs. She emphasizes the importance of detail-oriented and hardworking attributes that propelled her into a successful career in asset management and ETFs. Keri’s current role at K&amp;L Gates allows her to leverage her comprehensive experience to assist clients in navigating the complex regulations governing ETFs, particularly under the Investment Company Act of 1940.</p><p>Hazel Doyle, representing the K&amp;L Gates Dublin office, brings a unique path to the legal world, from paralegal to a specialist in funds, including ETFs. Her Irish and geography background, coupled with hands-on experience in the funds industry, underscores the diverse skills and knowledge required in the evolving ETF space. Hazel highlights the growth of ETFs in Europe, noting the differences in regulatory environments and market trends compared to the U.S., with a particular emphasis on ESG investing, thematic ETFs, and the challenges and opportunities of cross-border distribution.</p><p>The discussion provides valuable insights into what it takes to launch and manage ETFs, the role of attorneys in the ETF industry, and the legal and operational complexities involved. Both guests underscore the importance of innovation, patience, and thorough preparation in achieving success in the competitive ETF market. They also discuss the challenges and considerations for U.S. issuers looking to enter the European ETF market, including regulatory compliance, distribution strategies, and the need for a robust understanding of investor preferences and market dynamics.</p><p>Listeners gain a comprehensive overview of the ETF landscape, including the growth drivers, the impact of regulatory frameworks in different jurisdictions, and practical advice for those considering launching or investing in ETFs. Keri and Hazel&apos;s expertise and experiences provide a rich resource for understanding the challenges and opportunities within the global ETF market.</p>",
    "slug": "keri-riemer-hazel-doyle"
  },
  {
    "title": "Adam Curran - YALL",
    "date": "2024-02-02",
    "guest": "Adam Curran",
    "company": "YALL",
    "duration": "49 min",
    "youtubeId": "A47H_TgwZ0U",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>Adam Curran shares his background growing up in a household focused on money and his journey to starting his own financial planning firm. He introduces the God Bless America ETF, which aims to provide conservative investors with an investment option that aligns with their values. He explains the screening process for selecting companies based on their political and social activism. Curran also discusses the weighting and selection of holdings within the ETF and the challenges of marketing the fund. He emphasizes the importance of focusing on business and returns for shareholders. Adam Curran discusses his firm Retire Y&apos;all and the God Bless America ETF. He shares his inspiration behind creating Retire Y&apos;all and the importance of investing in the American Dream. Curran emphasizes the need for financial education and building a community of investors. He also discusses the role of technology in investing and shares his vision for the future of Retire Y&apos;all.<br/><br/>Takeaways<br/><br/>Adam Curran&apos;s background growing up in a household focused on money and his journey to starting his own financial planning firm<br/><br/>The God Bless America ETF aims to provide conservative investors with an investment option that aligns with their values<br/><br/>The screening process for selecting companies based on their political and social activism<br/><br/>The weighting and selection of holdings within the ETF and the challenges of marketing the fund Retire Y&apos;all is a firm focused on helping people achieve their retirement goals.<br/><br/>The God Bless America ETF is an investment fund that supports American companies.<br/><br/>Investing in the American Dream is a key aspect of Retire Y&apos;all&apos;s philosophy.<br/><br/>Financial education and building a community of investors are important for success in investing.<br/><br/>Technology plays a significant role in making investing more accessible and efficient.<br/>Retire Y&apos;all aims to continue growing and providing valuable resources for investors.<br/><br/>Chapters<br/><br/>00:00 Background and Early Influences<br/>05:00 The Inspiration Behind Retire Y&apos;all<br/>10:00 The God Bless America ETF<br/>15:00 Investing in the American Dream<br/>20:00 The Importance of Financial Education<br/>25:00 Building a Community of Investors<br/>30:00 The Role of Technology in Investing<br/>35:00 The Future of Retire Y&apos;all<br/>40:00 Conclusion and Final Thoughts<br/><br/></p>",
    "slug": "adam-curran"
  },
  {
    "title": "Todd Rosenbluth - VettaFi / Exchange ETF",
    "date": "2024-01-26",
    "guest": "Todd Rosenbluth",
    "company": "VettaFi / Exchange ETF",
    "duration": "31 min",
    "youtubeId": "DMzeFcZxAtE",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In this conversation, Brad interviews Todd Rosenbluth, an industry veteran and current member of VettaFi. They discuss Todd&apos;s background, VettaFi&apos;s business, and the upcoming Exchange conference. Todd shares his insights on the future of the ETF industry and offers advice for new ETF issuers. The conversation highlights the collaborative nature of the ETF community and emphasizes the importance of ongoing engagement and communication. Todd provides information on where to learn more about VettaFi and access his research.</p><p>Takeaways</p><p>·      VettaFi is an ETF services company that aims to educate financial advisors and provide them with content, webcasts, and data to help them make informed investment decisions. </p><p>·      The Exchange conference, organized by VettaFi, brings together industry experts, asset managers, and financial advisors to share ideas, discuss trends, and provide training and education. </p><p>·      The future of the ETF industry is expected to see continued growth in actively managed ETFs, conversions of separately managed accounts (SMAs) into ETFs, and a focus on education and collaboration within the community. </p><p>·      To make the most of the Exchange conference, financial advisors are encouraged to review the agenda, attend sessions that align with their interests, and take advantage of networking opportunities. </p><p>·      The ETF community fosters collaboration and a sense of community, with industry participants willing to help and support each other. </p><p>·      New ETF issuers should engage with platforms like VettaFi to get their word out and stay in front of industry experts and writers who can help promote their products. </p><p>·      To learn more about VettaFi and access Todd Rosenbluth&apos;s research, visit the VettaFi and ETF Trends websites, as well as connect with Todd on LinkedIn.</p><p>Chapters</p><p>00:00 Introduction and Background </p><p>01:35 VettaFi&apos;s Acquisition and Products </p><p>07:35 Overview of the Exchange Conference </p><p>10:09 The Future of the ETF Industry </p><p>12:12 Making the Most of the Exchange Conference </p><p>15:02 Highlighted Sessions at the Exchange Conference </p><p>19:30 Planning for the Exchange Conference </p><p>21:45 Information and Registration for the Exchange Conference </p><p>23:40 The Collaborative Nature of the ETF Community </p><p>27:13 Advice for New ETF Issuers </p><p>30:13 Where to Learn More about VettaFi and Todd Rosenbluth</p>",
    "slug": "todd-rosenbluth"
  },
  {
    "title": "Matt Barry - Touchstone Funds",
    "date": "2023-12-01",
    "guest": "Matt Barry",
    "company": "Touchstone Funds",
    "duration": "25 min",
    "youtubeId": "4NqfSuXRWnU",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>The guest on this episode of the &quot;Behind the Ticker&quot; podcast was Matt Barry, head of product management and ETF capital markets at Touchstone Investments. Touchstone is a $25 billion mutual fund manager that has historically focused on active management strategies. As Matt explained, Touchstone aims to beat benchmarks by looking meaningfully different than the benchmarks, using high conviction best ideas from 15 different subadvisors across various strategies.</p><p><br/></p><p>Seeing the continued growth in active ETFs, Touchstone has been building out an ETF platform over the last few years. They launched their first four active ETFs around a year and a half ago. Matt discussed how investor demand is driving the growth due to the structural benefits ETFs offer like tax efficiency, liquidity, and transparency while also providing exposure to active management strategies. Regulatory changes have also made it easier for active managers to launch ETFs.</p><p><br/></p><p>Matt highlighted a few of Touchstone&apos;s newer active ETF strategies including HEAT, their climate transition fund, which is managed by Swiss firm Lombard Odier and invests in companies benefiting from the transition to a cleaner economy. Their ultra short income (TUC) and securitized income (TSEC) ETFs focus on securitized fixed income assets and are managed by the experienced structured credit team at Fort Washington. TSEC aims for a higher yield with the ability to allocate to some non-investment grade securitized debt.</p><p><br/></p><p>In terms of distribution, Matt explained how Touchstone is leveraging their existing mutual fund distribution network and relationships with advisors. However, they have also worked on developing internal ETF expertise to ensure their wholesalers are fluent in discussing the ETF structure and considerations when speaking with advisors.</p><p><br/></p><p>To learn more about Touchstone Investments please visit touchstoneinvestments.com </p>",
    "slug": "matt-barry"
  },
  {
    "title": "Andrew Chanin - ProcureAM / UFO & FIXT",
    "date": "2023-11-17",
    "guest": "Andrew Chanin",
    "company": "ProcureAM / UFO & FIXT",
    "duration": "38 min",
    "youtubeId": "eZYonNq2_kw",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In this episode, we are joined joined by Andrew Chanin, Co-Founder and CEO of ProcureAM. They discuss Andrew&apos;s background in financial services and how he came to found Procure, focusing on their decision to build their own ETF infrastructure and unique suite of product.</p><p>Andrew provides an overview of Procure&apos;s two flagship ETFs - UFO, which offers exposure to the global space industry, and FIXT, which provides exposure to disaster recovery stocks. He explains the methodology behind the construction of each ETF&apos;s index, highlighting the diversified mix of space and disaster recovery related companies.</p><p>They delve into the investment case for the space industry, examining key innovations like reusable rockets that are bringing down launch costs and opening up opportunities. Andrew outlines the growing government and defense interest in space given its strategic importance. He also discusses where a niche thematic ETF like UFO can fit in an investment portfolio.</p><p>Overall, Andrew provides insightful perspective on bringing differentiated ETF products to market and the process behind developing focused thematic exposures. Tune in to learn more about ProcureAM&apos;s unique offerings in the evolving ETF landscape. For more information on ProcureAM visit Procureetfs.com </p>",
    "slug": "andrew-chanin"
  },
  {
    "title": "Yuri Khodjamirian - Tema ETFs / TOLL",
    "date": "2023-11-10",
    "guest": "Yuri Khodjamirian",
    "company": "Tema ETFs / TOLL",
    "duration": "34 min",
    "youtubeId": "87ysF0gk3OU",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In this episode of Behind the Ticker, Brad invites Yuri Khodjamirian, CIO at Temma Capital Management, to discuss their actively managed ETF focused on monopolies and oligopolies. (TICKER: TOLL).</p><p><br/></p><p>Yuri shares his background in finance and how he eventually became CIO at Temma. He talks about his interests outside of work, like exercising and reading widely across different topics.</p><p><br/></p><p>They discuss the key sources of competitive advantage for monopolies, including non-replicable physical assets, network effects, high switching costs, regulation, and economies of scale. Yuri explains why good monopolies arise by providing mission critical products and immense customer value over time.</p><p><br/></p><p>Yuri outlines Temma&apos;s investment process for selecting securities in the Toll portfolio. It starts with creating a pure thematic universe of monopolies, then applying fundamental equity analysis to identify the best companies. He mentions targeting 30-35 holdings in the portfolio.</p><p><br/></p><p>They dive into Temma&apos;s rigorous risk management, using multiple layers like security selection, portfolio construction tiers, and continuous monitoring. Yuri explains their active but systematic rebalancing approach. On portfolio construction, Yuri details their conviction tier system for position sizing between high, medium and low conviction names. He explains how this takes advantage of managers&apos; stock picking skills while controlling for risks.</p><p><br/></p><p>Yuri discusses how Toll can fit into an investor&apos;s portfolio, arguing it essentially high grades on quality and durability versus a typical core allocation. He suggests investors look beyond just tech and growth stocks. For more information about TEMA ETF visit: <a href='http://temaetfs.com'>temaetfs.com</a></p>",
    "slug": "yuri-khodjamirian"
  },
  {
    "title": "Ragen Stienke - Ballast Asset Management / MGMT",
    "date": "2023-11-03",
    "guest": "Ragen Stienke",
    "company": "Ballast Asset Management / MGMT",
    "duration": "25 min",
    "youtubeId": "DCPYXAtsTBg",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>Ragen Stienke, founder of Ballast Asset Management, joined the Behind the Ticker podcast to discuss his 30+ years of experience in small and mid-cap investing. Ragen got his start in the 1990s at Arthur Anderson&apos;s business valuation group before working at UBS and later founding a SMID strategy at Westwood. In 2015, he started Ballast focused on small and mid-caps, offering both SMAs and their Small/Mid Cap ETF called MGMT. Ragen aims to turn alpha generation into a process focused on quantifying downside risk rather than relying on conviction. He sees opportunity in the small and mid-cap space as coverage by analysts has declined, believing this segment will outperform large caps in the coming years. </p><p>Ragen evaluates management teams for alignment, capital deployment history, and strategic fit. Ragen positions MGMT as a replacement for passive ETFs or to balance large cap growth tilts in models, focusing distribution on RIAs and advisors rather than consultants. He summarizes Ballast&apos;s approach as “looking both ways when crossing a one-way street.”</p><p>To learn more about Ballast and Ragen please visit <a href='http://ballastam.com'>ballastam.com <br/></a><br/></p>",
    "slug": "ragen-stienke"
  },
  {
    "title": "Steve Cook - Harbor Funds",
    "date": "2023-10-27",
    "guest": "Steve Cook",
    "company": "Harbor Funds",
    "duration": "34 min",
    "youtubeId": "a17CoLVjDuw",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>Episode 23 of Behind the Ticker features guest Steve Cook, Head of ETFs at Harbor Capital Advisors. Join us as we discuss Harbor&apos;s suite of ETF products and the commodity ETF Hedger (ticker: HGER).</p><p><br/></p><p>In this episode, Steve provides background on his experience in the ETF industry and Harbor Capital&apos;s evolution into the ETF space. He discusses Harbor&apos;s manager vetting process and bringing unique active strategies to the ETF wrapper.</p><p>Steve then dives into the motivation behind launching HGER, explaining how it differs from other commodity ETFs by providing dynamic exposure across 24 commodities based on an active rules-based index. He talks about the current commodity allocations and how the index rebalances based on economic conditions.</p><p>Additional topics include:</p><ul><li>Why Harbor moved its ETFs to the NYSE floor and the benefits seen from human liquidity providers</li><li>Positioning HGER in a portfolio to hedge inflation and add non-correlated assets</li><li>Reaching key AUM milestones and getting advisor distribution</li><li>Harbor&apos;s lineup of equity and international ETFs also worth a look</li></ul><p>Learn more as Steve shares his insights on bringing differentiated active ETFs to market and finding product-market fit. to learn more about Steve and Harbor Capital visit <a href='https://www.harborcapital.com/'>https://www.harborcapital.com/</a></p>",
    "slug": "steve-cook"
  },
  {
    "title": "Katie Stockton - Fairlead Strategies & TACK",
    "date": "2023-10-20",
    "guest": "Katie Stockton",
    "company": "Fairlead Strategies & TACK",
    "duration": "42 min",
    "youtubeId": "Fbm43_gPx4A",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In this episode of Behind the Ticker, we sit down with Katie Stockton, founder and managing partner of Fairlead Strategies, to delve into the philosophy and mechanics behind the TACK investment strategy and explore the offerings of her firm.</p><p>With her vast experience and a unique perspective on market trends, Stockton discusses the foundations of technical analysis that underpin the TACK strategy. She elaborates on the importance of a disciplined, long-term approach, emphasizing how TACK&apos;s method of relying on monthly data helps mitigate risks and navigate the complexities of the financial markets.</p><p>The discussion also sheds light on Fairlead Strategies&apos; commitment to providing robust, research-driven insights and how the firm supports investors through thought leadership, regular market analysis, and educational content. Stockton&apos;s expertise illuminates the pathway for both individual and institutional investors seeking a deeper understanding of technical analysis and its practical implications in portfolio management.</p><p>For more information about CNBC contributor Katie Stockton and her firm Fairlead Strategies visit www.fairleadstrategies.com</p>",
    "slug": "katie-stockton"
  },
  {
    "title": "Will Rhind - Graniteshares",
    "date": "2023-10-14",
    "guest": "Will Rhind",
    "company": "Graniteshares",
    "duration": "27 min",
    "youtubeId": "0afNetbVup8",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>Join us for an insightful episode as we dive into the fascinating world of Exchange-Traded Funds (ETFs) with a true industry veteran, Will Rhind. With over two decades of experience in the ETF arena, Will has carved a unique path by focusing on providing investors with high-conviction stock positions through innovative and disruptive ETF investments.</p><p>GraniteShares, Will&apos;s brainchild, boasts a diverse ETF suite covering everything from commodities to income, equities, and leveraged single stocks. In this episode, we have the privilege of delving into the world of these disruptive single stock ETFs, including red-hot names like Nvidia, Tesla, Meta, and Apple.</p><p>Will expertly articulates the case for single stock ETFs,  and conviction investing. He explores the remarkable demand surge witnessed in recent months, particularly with earnings season on the horizon, and offers insightful glimpses into what the future may hold for these investment vehicles.</p><p>Our guest, Will Rhind, isn&apos;t just a seasoned professional; he&apos;s the Founder &amp; CEO of GraniteShares, managing over $1.7 billion in total assets under management. His impressive journey includes a stint as a Principal at iShares and as a key member of the original European ETF team. Notably, he also spearheaded ETF Securities in the U.S. and helmed the world&apos;s largest commodities fund, the SPDR Gold Shares ETF (GLD). Find more information at graniteshares.com</p>",
    "slug": "will-rhind-2"
  },
  {
    "title": "Paul Weisbruch - GTS",
    "date": "2023-10-09",
    "guest": "Paul Weisbruch",
    "company": "GTS",
    "duration": "36 min",
    "youtubeId": "QvJ-FvB_xMk",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In Episode 20, we feature Paul Weisbruch from GTS, a prominent player in the financial industry. GTS specializes in trading over 30,000 different financial instruments globally, catering to a diverse clientele that includes leading financial institutions and public companies.</p><p>Their approach is built on state-of-the-art proprietary technology and a team of seasoned professionals, which allows them to offer execution and liquidity solutions, even during volatile market conditions. As one of the New York Stock Exchange&apos;s designated market makers (DMM), GTS Securities serves a range of businesses, both domestically and internationally.</p><p>GTS&apos;s DMM division plays a pivotal role in facilitating efficient capital formation, supporting the growth of listed companies. Their extensive portfolio includes 1,116 stock issues with a combined market capitalization of $14 trillion, accounting for 32% of NYSE market share.</p><p>In this episode, we dive into the current state of the ETF industry, explore emerging trends, and examine the positive impact of floor trading on market performance for issuers. To learn more about GTS, you can visit their website at gtsx.com.</p>",
    "slug": "paul-weisbruch"
  },
  {
    "title": "Kyle Wiggs - UX Wealth",
    "date": "2023-09-29",
    "guest": "Kyle Wiggs",
    "company": "UX Wealth",
    "duration": "33 min",
    "youtubeId": "7Nl6gRrs5js",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In Episode 19, we welcome Kyle Wiggs, the founder and CEO of UX Wealth Partners, a platform known for its utilization of Artificial Intelligence and Machine Learning in investment technologies. This episode provides insights into the services and technologies offered by UX Wealth Partners to Registered Investment Advisors (RIAs).</p><p>We explore how UX Wealth Partners employs its technology to offer solutions that go beyond traditional asset management platforms, providing tools and resources aimed at improving operational efficiency, client engagement, and business growth for financial advisors.</p><p>Join us as we discuss the current landscape of investment technologies, share insights on model portfolio best practices, and consider the circumstances under which a model provider might launch an ETF. For more information about UX Wealth Partners and their offerings, visit <a href='http://uxwp.com'>uxwp.com</a>.</p>",
    "slug": "kyle-wiggs"
  },
  {
    "title": "John Davi & Frank Tedesco - ROE",
    "date": "2023-09-22",
    "guest": "John Davi & Frank Tedesco",
    "company": "ROE",
    "duration": "30 min",
    "youtubeId": "y3hg-mj9W6Q",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In Episode 18, we&apos;re joined by John Davi and Frank Tedesco from Astoria Advisors, who have just introduced their second ETF, ROE - US Quality Kings. We delve deep into the current state of the U.S. stock market and explore the intricacies of the ROE strategy.</p><p>Astoria&apos;s US Quality Kings ETF is an actively managed Exchange Traded Fund (ETF) designed to pursue long-term capital growth. It achieves this by investing in a well-diversified portfolio of 100 high-quality U.S. large-cap and mid-cap stocks. What&apos;s unique is that each of these stocks is equally weighted, mitigating the potential challenges associated with market cap-weighted indices.</p><p>Furthermore, the fund optimizes its allocation within sectors, meticulously selecting the highest quality stocks in each sector, mirroring their weight in the S&amp;P 500.</p><p>To gain further insights into Astoria Advisors and their innovative ROE approach, be sure to check out their website at astoriaadvisors.com.</p>",
    "slug": "john-davi-frank-tedesco"
  },
  {
    "title": "Elysabeth Alfano - EATV",
    "date": "2023-09-15",
    "guest": "Elysabeth Alfano",
    "company": "EATV",
    "duration": "42 min",
    "youtubeId": "cnBACvCxPQQ",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>Episode 17 showcases Elysabeth Alfano, an influential figure in the world of food systems transformation. She is the founder and CEO of VegTech™ Invest, advisor to the Plant-based Innovation &amp; Climate ETF, EATV.  Elysabeth’s journey began with invaluable experience at Fortune 500 companies such as IBM-Europe and The Kellogg company, as well as being Chief Investment Officer for a small family office.  Focused on both growth and impact, the EATV ETF invests up and down the food supply chain in companies that are innovating for efficient and sustainable food production, addressing climate change, biodiversity loss and food security.  The ETF also highlights the seismic growth opportunity from the disruption of this $8 trillion sector.  For more information, please visit EATVetf.com.</p>",
    "slug": "elysabeth-alfano"
  },
  {
    "title": "Ryan Pannell - DIP",
    "date": "2023-09-08",
    "guest": "Ryan Pannell",
    "company": "DIP",
    "duration": "46 min",
    "youtubeId": "1Gn-fUmTdOo",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>Introducing Ryan Pannell, CEO of Kaiju ETF Advisors. Ryan Pannell is the focus of Episode 16, where he talks about his journey from pioneering cryptographic web-based messaging technologies to becoming a professional equities trader. With a background in theoretical physics, quantum mechanics, cosmology, film, and television, Ryan has a unique perspective on investment management and the applications of artificial intelligence in scientific trading. <br/><br/>Kaiju Worldwide, founded by Ryan, manages several private funds and an AI-driven ETF, the <a href='https://www.etfcentral.com/fund/DIP'>BTD Capital Fund (ticker DIP)</a>. The &quot;Buy the Dip&quot; strategy uses AI to identify oversold opportunities<em> within the S&amp;P 500</em>. This approach to asset management and allocation is highly innovative and well thought-out. For more information on DIP visit <a href='http://dipetf.com/'>dipetf.com</a></p><p><br/></p>",
    "slug": "ryan-pannell"
  },
  {
    "title": "Alejandro Garza - AZTD",
    "date": "2023-08-25",
    "guest": "Alejandro Garza",
    "company": "AZTD",
    "duration": "33 min",
    "youtubeId": "vz-jpZAdE48",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>Episode 15 of Behind the Ticker features Alejandro Garza, the Founder and Portfolio Manager of Aztlan Equity Management. Alejandro is the portfolio manager behind the Aztlan Global Developed Markets SMID Cap Strategy ticker AZTD. AZTD is Atzlan’s stock selection ETF, a unique rules-based strategy that selects the top 27 stocks based on fundamental factors. AZTD uses a proprietary 6-factor fundamental model to assign stock rankings: cash flow generation, value, growth, capital structure quality, earnings revisions and momentum. The Fund’s stock picks represent companies in developed markets across North America, Western Europe and Developed Asia, with market caps between $500 million and $10 billion. Energy, Real Estate and Pharmaceuticals are excluded. To learn more about Alejandro and AZTD visit <a href='http://www.aztlanetfs.com'>www.aztlanetfs.com</a></p>",
    "slug": "alejandro-garza"
  },
  {
    "title": "David Schulhof - MUSQ",
    "date": "2023-08-18",
    "guest": "David Schulhof",
    "company": "MUSQ",
    "duration": "30 min",
    "youtubeId": "vKbYqWPYYRM",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>Episode 14 features David Schulhof the CEO and Portfolio Manager of MUSQ, The Global Music Industry ETF. </p><p>David is an American music industry executive and investor with 25 years of experience in the field. David’s background in the music industry is extensive, having previously served as President of Music Publishing at LiveOne, a global media company for livestream and on-demand audio, video and podcast content. He is also the former President of Music at AGC Studios and IM Global Studios and was the co-founder and CEO of Evergreen Copyrights, where he pursued a global acquisition strategy of music publishing catalogs and built one of the largest independent music companies worldwide, which eventually was sold to BMG Rights Management.</p><p>Needless to say this is a fun interview. MUSQ aims to invest in the most attractive segments of the global music industry. The music ecosystem is comprised of all things music like streaming, content and distribution, live music events and ticketing, satellite and broadcast radio, and equipment and technology. The segment is growing and evolving quickly and David gives us his views as to where the music industry is headed. To learn more about David and MUSQ please visit, <a href='http://MUSQetf.com'>MUSQetf.com </a></p>",
    "slug": "david-schulhof"
  },
  {
    "title": "Adam Eagleston - Formidable / FORH",
    "date": "2023-08-11",
    "guest": "Adam Eagleston",
    "company": "Formidable / FORH",
    "duration": "40 min",
    "youtubeId": "zZj7Xv0qzQI",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>Episode 13 features Adam Eaglston, the Chief Investment Officer of Formidable Asset Management. Formidable is an active and adaptable financial services company. They employ a disciplined process and build client portfolios and develop financial plans. The Firm also manages a hedge fund the &apos;Formidable Fund&apos; which is a multi-strategy fund. In this episode we discuss their Formidable ETF, ticker FORH. The fund is an active multi-strategy equity portfolio that also deploys a hedging component to help protect during market declines. The fund is rooted in the OODA Loop Framework: Observe, Orient, Decide, Act which allows them to identify attractive investment themes and exploit market inefficiencies via top-down framework. For more information on Adam and the firm please visit <a href='http://formidableam.com'>formidableam.com</a></p>",
    "slug": "adam-eagleston"
  },
  {
    "title": "Neil Azous - Rareview / RSEE",
    "date": "2023-08-04",
    "guest": "Neil Azous",
    "company": "Rareview / RSEE",
    "duration": "44 min",
    "youtubeId": "la1EtDvUshQ",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In this Episode we talk with Neil Azous founder of Rareview Capital. Rareview Capital works with advisors to help develop systematic and differentiated strategies using their goals based approach. Neil heads the firm’s investment team and oversees all portfolio and risk management activities. Neil also serves as a Portfolio Manager for the Rareview ETFs. We focused on the Rareview Systematic Equity (RSEE) and Rareview Dynamic Fixed Income (RDFI). Their unique systematic approach to investing provides investors an alternative lens on how to navigate investment markets. To learn more about the firm and the Rareview ETFs, visit rareviewcapital.com</p>",
    "slug": "neil-azous"
  },
  {
    "title": "John Forlines - Donoghue Forlines / DFRA",
    "date": "2023-07-28",
    "guest": "John Forlines",
    "company": "Donoghue Forlines / DFRA",
    "duration": "42 min",
    "youtubeId": "WAgbumnW6Gg",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>Episode 11, features John Forlines III, the Chief Investment Officer of Donoghue Forlines. Donoghue Forlines is a tactical investment firm that has specialized in risk-managed portfolios since 1986. Donoghue Forlines has a suite of ETFs that utilize technical indicators to recognize shifts in market momentum and uses proprietary tactical signals to help preserve capital in down trending markets and potentially offer strong client-centric risk-adjusted returns over a full market cycle. John speaks mostly about their Yield Enhanced Real Asset ETF (DFRA) which provides exposure to real assets such as REITs, Infrastructure, Oil &amp; Gas, Commodities, and Natural Resources. You can learn more about the firm and the Funds at <a href='http://donoghueforlines.com'>donoghueforlines.com </a></p><p><br/></p>",
    "slug": "john-forlines"
  },
  {
    "title": "John Davi - Astoria Advisors / PPI",
    "date": "2023-07-21",
    "guest": "John Davi",
    "company": "Astoria Advisors / PPI",
    "duration": "41 min",
    "youtubeId": "p4at5Pc3p2c",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In Episode 10, we welcome John Davi, the Founder of Astoria Advisors. Astoria Advisors maintains a variety of strategies for investors to utilize. Among these are Core Risk Based ETF Strategies, Thematic ETF &amp; Stock Strategies, and Factor US Stock Strategies. Astoria also manages an Inflation Protected ETF under the ticker PPI. The portfolio aims to invest in “inflation-sensitive” assets that can help investors limit inflation risk and provide lower correlations to traditional assets, especially stocks and bonds. You can find more information about Astoria Advisors and PPI at <a href='https://www.astoriaadvisors.com/'>www.astoriaadvisors.com</a></p>",
    "slug": "john-davi-2"
  },
  {
    "title": "Michael Gayed - RORO / JOJO",
    "date": "2023-07-14",
    "guest": "Michael Gayed",
    "company": "RORO / JOJO",
    "duration": "40 min",
    "youtubeId": "zupBhEkdcpU",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>Welcome to episode 9 of Behind the Ticker. In this episode, our special guest is Michael Gayed, the portfolio manager of $RORO and $JOJO and Founder of ATAC Funds. We have an in depth conversation about what led him to investing, his career path, and starting his first funds. We also talk about the unique investment thesis behind his ETFs and how he envisions them being utilized in model portfolios. As an industry veteran, we dive into what it&apos;s like to manage money through different cycles and how patience and conviction will ultimately lead to success. Michael has a unique perspective on markets and is one the most consistent providers of market commentary for investors and investment advisors online. To find out more about Michael and his funds, please visit: https://www.atacfunds.com/</p>",
    "slug": "michael-gayed"
  },
  {
    "title": "Michael Venuto - Tidal & BLOK",
    "date": "2023-07-07",
    "guest": "Michael Venuto",
    "company": "Tidal & BLOK",
    "duration": "47 min",
    "youtubeId": "2n_JvKO38qQ",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>Welcome to episode 8 of Behind the Ticker. In this episode, our special guest is Mike Venuto, the portfolio manager of $BLOK and co-founder and CIO at Tidal. $BLOK holds the distinction of being the first-ever blockchain ETF to hit the market. Join us as we delve into the evolving landscape of ETFs, exploring the rise of active ETFs, the conversion of mutual funds to ETFs, and the transformative impact of blockchain on the industry. With Mike&apos;s extensive experience in bringing ETFs to market and facilitating their growth, we gain valuable insights into common mistakes and pitfalls that early issuers often encounter. Our discussion covers crucial topics such as product-market fit, market timing, and how to navigate these challenges successfully. To explore Tidal&apos;s comprehensive range of ETFs and services, please visit their website at <a href='https://www.tidalfinancialgroup.com/'>https://www.tidalfinancialgroup.com/</a></p>",
    "slug": "michael-venuto"
  },
  {
    "title": "Dan Cupkovic - Black SWAN",
    "date": "2023-06-23",
    "guest": "Dan Cupkovic",
    "company": "Black SWAN",
    "duration": "27 min",
    "youtubeId": "p6D7glujB5I",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>Introducing Dan Cupcovic, the Portfolio Manager behind BlackSwan&apos;s strategy. Discover how this partner at Cerity Partners, one of the largest RIAs in the country, is revolutionizing investments with SWAN, ISWN, and QSWN ETFs. Whether you&apos;re looking for a short-term risk-off play or a smart capital allocation for the long haul, this is the podcast you don&apos;t want to miss. To learn more about Dan and BlackSwan, visit <a href='https://ceritypartners.com/team/dan-cupkovic/'>https://amplifyetfs.com/swan/</a></p>",
    "slug": "dan-cupkovic"
  },
  {
    "title": "David Cohen - HANDLS Indexes",
    "date": "2023-06-16",
    "guest": "David Cohen",
    "company": "HANDLS Indexes",
    "duration": "31 min",
    "youtubeId": "Dj6opWJ-w4A",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In episode 6, we speak with David Cohen the Co-Founder of the HANDLS Indexes. David is an industry veteran and has been responsible for the creation of many unique indexes throughout his career. Currently the HANDLS index is the driver of the HNDL ETF, a successful ETF with over a billion dollars of assets. HNDL is a income producing strategy that seeks to provide a target distribution rate to its investors on an annualized basis. For more information on David and the HANDLS Indexes go to <a href='http://handlsindexes.com'>handlsindexes.com</a></p><p><br/></p>",
    "slug": "david-cohen"
  },
  {
    "title": "Dave Mazza - CHAT ETF",
    "date": "2023-06-09",
    "guest": "Dave Mazza",
    "company": "CHAT ETF",
    "duration": "31 min",
    "youtubeId": "oZFMDbAVy78",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>Welcome to episode 5, where we hear from Dave Mazza, the Chief Strategy Officer for Roundhill Investments. Dave talks about the newest ETF offering from Roundhill, CHAT. CHAT is an active ETF which will rank the top generative Ai companies and identify the best opportunities in the space. He also talks about Roundhill’s approach to launching products, how they go about marketing, and what’s coming next from the firm. More on Roundhill Investments and the CHAT ETF is available at <a href='http://www.roundhillinvestments.com'>www.roundhillinvestments.com</a></p>",
    "slug": "dave-mazza"
  },
  {
    "title": "Garrett Stevens - Exchange Traded Concepts",
    "date": "2023-06-02",
    "guest": "Garrett Stevens",
    "company": "Exchange Traded Concepts",
    "duration": "40 min",
    "youtubeId": "DmlYHKszqfY",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>Episode 4 of Behind the Ticker features a conversation with Garrett Stevens, founder of Exchange Traded Concepts (ETC). Garrett built his company to support ETF providers and issuers, providing listeners with a look at what it takes to start and run an ETF. His passion is flying but the conversation is grounded in the realities and challenges faced in launching a family of ETFs. These challenges became his catalyst to become a white label ETF issuer, offering infrastructure and exemptive relief to other market participants. ETC now helps clients launch funds in as little as 100 days, significantly reducing costs and time-to-market. Stevens emphasizes the importance of having a solid plan, patience, and an effective distribution strategy to succeed in the ETF business. To learn more about ETC, please visit <a href='https://www.exchangetradedconcepts.com/'>https://www.exchangetradedconcepts.com/</a></p>",
    "slug": "garrett-stevens"
  },
  {
    "title": "Daniel Snover - ARP ETF",
    "date": "2023-05-26",
    "guest": "Daniel Snover",
    "company": "ARP ETF",
    "duration": "37 min",
    "youtubeId": "Vuh-pEo-fDg",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>Welcome to episode 3, where we hear from Daniel Snover, the founder of PMV Capital and portfolio manager of the ARP ETF (Adaptive Risk Parity), about his desire to pursue a proprietary approach to managing market risk. Brad and Daniel take a look at the systematic approach taken by PMV Capital, highlighting the importance of macroeconomic factors in portfolio allocation and risk management. PMV recognized the need for an ETF structure to compete effectively and launched the ARP ETF in December. More on PMV Capital and the ARP ETF is available at <a href='http://www.PMVcapital.com'>www.PMVcapital.com</a>.</p><p> </p>",
    "slug": "daniel-snover"
  },
  {
    "title": "Patricia Lizarraga - WCEO ETF",
    "date": "2023-05-19",
    "guest": "Patricia Lizarraga",
    "company": "WCEO ETF",
    "duration": "38 min",
    "youtubeId": "ajugynVdaLU",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>In this episode, host Brad Roth interviews Patricia Lizarraga, CEO of Hypatia Capital and portfolio manager for WCEO, an ETF that invests solely in women-led companies. Patricia discusses how her experience in investment banking and private equity led her to create the ETF. She also explains how Hypatia Capital started as an advisory shop serving senior women executives and the meaning behind the name.</p><p> Hear from Patricia as she explains her strategies outperformance and process for bringing the ETF to market, including the lack of a historical database of female CEOs. She also explains why she chose to partner with established service providers rather than creating her own trust, allowing Patricia to focus on her expertise in promoting gender diversity in investment portfolios. Brad and Patricia close out with the challenges of distributing a new ETF, including getting listed on major distribution platforms and marketing strategies. To learn more about Patricia and her mission, please visit <a href='https://www.wceoetf.com/'>https://www.wceoetf.com/</a></p>",
    "slug": "patricia-lizarraga"
  },
  {
    "title": "Tommy Mancuso - The BAD ETF",
    "date": "2023-05-11",
    "guest": "Tommy Mancuso",
    "company": "The BAD ETF",
    "duration": "45 min",
    "youtubeId": "_XJJF4rPQ_A",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>The Behind the Ticker podcast premiere episode features a dynamic conversation between host Brad Roth, and Tommy Mancuso, founder of the BAD ETF. In episode one, Mancuso discusses the challenges of launching a unique investment product that appeals to investors seeking counterculture opportunities while providing long-term sustainable growth, including how he came up with the idea for BAD ETF (Betting, Alcohol, and Drugs).</p><p>Hear from Mancuso as he discusses his anti-ESG ETF, which he believes focuses on making money rather than social stigmas. He argues that ESG scores lack transparency and could be manipulated, leading to biased investment decisions. Mancuso believes his ETF could be valuable in a recession-proof portfolio, with industries like alcohol and tobacco offering stability. Tune in for a behind the scenes look into <em>why </em>Mancuso launched The Bad Investment Company and the challenges of being a single ETF issuer. To learn more about Bad ETF, please visit <a href='https://badinvestmentco.com/'>https://badinvestmentco.com/</a></p>",
    "slug": "tommy-mancuso"
  },
  {
    "title": "Introduction to Behind the Ticker",
    "date": "2023-04-14",
    "guest": "Introduction to Behind the Ticker",
    "company": "",
    "duration": "1 min",
    "youtubeId": "wgroXeUvMr0",
    "audioUrl": "https://open.spotify.com/show/1TJpgOAqctOCnjij9KTxNS",
    "description": "<p>Welcome to Behind the Ticker. This show will uncover the inter-workings of the ETF industry. We will interview Portfolio Managers and ETF Service Providers to dive deep into their work lives and their business.  Many of these individuals are entrepreneurs and will have unique and compelling insights to share, as much goes on, Behind the Ticker.</p>",
    "slug": "introduction-to-behind-the-ticker"
  }
]